// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Pathfinding.ClipperLib.ClipperBase
#include "Pathfinding/ClipperLib/ClipperBase.hpp"
// Including type: Pathfinding.ClipperLib.ClipType
#include "Pathfinding/ClipperLib/ClipType.hpp"
// Including type: Pathfinding.ClipperLib.PolyFillType
#include "Pathfinding/ClipperLib/PolyFillType.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: Pathfinding::ClipperLib
namespace Pathfinding::ClipperLib {
  // Forward declaring type: OutRec
  class OutRec;
  // Forward declaring type: Scanbeam
  class Scanbeam;
  // Forward declaring type: TEdge
  class TEdge;
  // Forward declaring type: IntersectNode
  class IntersectNode;
  // Forward declaring type: Join
  class Join;
  // Forward declaring type: PolyTree
  class PolyTree;
  // Forward declaring type: OutPt
  class OutPt;
  // Forward declaring type: Direction
  struct Direction;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Completed forward declares
// Type namespace: Pathfinding.ClipperLib
namespace Pathfinding::ClipperLib {
  // Forward declaring type: Clipper
  class Clipper;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Pathfinding::ClipperLib::Clipper);
DEFINE_IL2CPP_ARG_TYPE(::Pathfinding::ClipperLib::Clipper*, "Pathfinding.ClipperLib", "Clipper");
// Type namespace: Pathfinding.ClipperLib
namespace Pathfinding::ClipperLib {
  // Size: 0x83
  #pragma pack(push, 1)
  // Autogenerated type: Pathfinding.ClipperLib.Clipper
  // [TokenAttribute] Offset: FFFFFFFF
  class Clipper : public ::Pathfinding::ClipperLib::ClipperBase {
    public:
    // Writing base type padding for base size: 0x2B to desired offset: 0x30
    char ___base_padding[0x5] = {};
    public:
    // private System.Collections.Generic.List`1<Pathfinding.ClipperLib.OutRec> m_PolyOuts
    // Size: 0x8
    // Offset: 0x30
    ::System::Collections::Generic::List_1<::Pathfinding::ClipperLib::OutRec*>* m_PolyOuts;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Pathfinding::ClipperLib::OutRec*>*) == 0x8);
    // private Pathfinding.ClipperLib.ClipType m_ClipType
    // Size: 0x4
    // Offset: 0x38
    ::Pathfinding::ClipperLib::ClipType m_ClipType;
    // Field size check
    static_assert(sizeof(::Pathfinding::ClipperLib::ClipType) == 0x4);
    // Padding between fields: m_ClipType and: m_Scanbeam
    char __padding1[0x4] = {};
    // private Pathfinding.ClipperLib.Scanbeam m_Scanbeam
    // Size: 0x8
    // Offset: 0x40
    ::Pathfinding::ClipperLib::Scanbeam* m_Scanbeam;
    // Field size check
    static_assert(sizeof(::Pathfinding::ClipperLib::Scanbeam*) == 0x8);
    // private Pathfinding.ClipperLib.TEdge m_ActiveEdges
    // Size: 0x8
    // Offset: 0x48
    ::Pathfinding::ClipperLib::TEdge* m_ActiveEdges;
    // Field size check
    static_assert(sizeof(::Pathfinding::ClipperLib::TEdge*) == 0x8);
    // private Pathfinding.ClipperLib.TEdge m_SortedEdges
    // Size: 0x8
    // Offset: 0x50
    ::Pathfinding::ClipperLib::TEdge* m_SortedEdges;
    // Field size check
    static_assert(sizeof(::Pathfinding::ClipperLib::TEdge*) == 0x8);
    // private Pathfinding.ClipperLib.IntersectNode m_IntersectNodes
    // Size: 0x8
    // Offset: 0x58
    ::Pathfinding::ClipperLib::IntersectNode* m_IntersectNodes;
    // Field size check
    static_assert(sizeof(::Pathfinding::ClipperLib::IntersectNode*) == 0x8);
    // private System.Boolean m_ExecuteLocked
    // Size: 0x1
    // Offset: 0x60
    bool m_ExecuteLocked;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_ExecuteLocked and: m_ClipFillType
    char __padding6[0x3] = {};
    // private Pathfinding.ClipperLib.PolyFillType m_ClipFillType
    // Size: 0x4
    // Offset: 0x64
    ::Pathfinding::ClipperLib::PolyFillType m_ClipFillType;
    // Field size check
    static_assert(sizeof(::Pathfinding::ClipperLib::PolyFillType) == 0x4);
    // private Pathfinding.ClipperLib.PolyFillType m_SubjFillType
    // Size: 0x4
    // Offset: 0x68
    ::Pathfinding::ClipperLib::PolyFillType m_SubjFillType;
    // Field size check
    static_assert(sizeof(::Pathfinding::ClipperLib::PolyFillType) == 0x4);
    // Padding between fields: m_SubjFillType and: m_Joins
    char __padding8[0x4] = {};
    // private System.Collections.Generic.List`1<Pathfinding.ClipperLib.Join> m_Joins
    // Size: 0x8
    // Offset: 0x70
    ::System::Collections::Generic::List_1<::Pathfinding::ClipperLib::Join*>* m_Joins;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Pathfinding::ClipperLib::Join*>*) == 0x8);
    // private System.Collections.Generic.List`1<Pathfinding.ClipperLib.Join> m_GhostJoins
    // Size: 0x8
    // Offset: 0x78
    ::System::Collections::Generic::List_1<::Pathfinding::ClipperLib::Join*>* m_GhostJoins;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Pathfinding::ClipperLib::Join*>*) == 0x8);
    // private System.Boolean m_UsingPolyTree
    // Size: 0x1
    // Offset: 0x80
    bool m_UsingPolyTree;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <ReverseSolution>k__BackingField
    // Size: 0x1
    // Offset: 0x81
    bool ReverseSolution;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <StrictlySimple>k__BackingField
    // Size: 0x1
    // Offset: 0x82
    bool StrictlySimple;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // static field const value: static public System.Int32 ioReverseSolution
    static constexpr const int ioReverseSolution = 1;
    // Get static field: static public System.Int32 ioReverseSolution
    static int _get_ioReverseSolution();
    // Set static field: static public System.Int32 ioReverseSolution
    static void _set_ioReverseSolution(int value);
    // static field const value: static public System.Int32 ioStrictlySimple
    static constexpr const int ioStrictlySimple = 2;
    // Get static field: static public System.Int32 ioStrictlySimple
    static int _get_ioStrictlySimple();
    // Set static field: static public System.Int32 ioStrictlySimple
    static void _set_ioStrictlySimple(int value);
    // static field const value: static public System.Int32 ioPreserveCollinear
    static constexpr const int ioPreserveCollinear = 4;
