// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Pathfinding::ClipperLib
namespace Pathfinding::ClipperLib {
  // Forward declaring type: TEdge
  class TEdge;
}
// Completed forward declares
// Type namespace: Pathfinding.ClipperLib
namespace Pathfinding::ClipperLib {
  // Forward declaring type: LocalMinima
  class LocalMinima;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Pathfinding::ClipperLib::LocalMinima);
DEFINE_IL2CPP_ARG_TYPE(::Pathfinding::ClipperLib::LocalMinima*, "Pathfinding.ClipperLib", "LocalMinima");
// Type namespace: Pathfinding.ClipperLib
namespace Pathfinding::ClipperLib {
  // Size: 0x30
  #pragma pack(push, 1)
  // Autogenerated type: Pathfinding.ClipperLib.LocalMinima
  // [TokenAttribute] Offset: FFFFFFFF
  class LocalMinima : public ::Il2CppObject {
    public:
    public:
    // public System.Int64 Y
    // Size: 0x8
    // Offset: 0x10
    int64_t Y;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // public Pathfinding.ClipperLib.TEdge LeftBound
    // Size: 0x8
    // Offset: 0x18
    ::Pathfinding::ClipperLib::TEdge* LeftBound;
    // Field size check
    static_assert(sizeof(::Pathfinding::ClipperLib::TEdge*) == 0x8);
    // public Pathfinding.ClipperLib.TEdge RightBound
    // Size: 0x8
    // Offset: 0x20
    ::Pathfinding::ClipperLib::TEdge* RightBound;
    // Field size check
    static_assert(sizeof(::Pathfinding::ClipperLib::TEdge*) == 0x8);
    // public Pathfinding.ClipperLib.LocalMinima Next
    // Size: 0x8
    // Offset: 0x28
    ::Pathfinding::ClipperLib::LocalMinima* Next;
    // Field size check
    static_assert(sizeof(::Pathfinding::ClipperLib::LocalMinima*) == 0x8);
    public:
    // Get instance field reference: public System.Int64 Y
    [[deprecated("Use field access instead!")]] int64_t& dyn_Y();
    // Get instance field reference: public Pathfinding.ClipperLib.TEdge LeftBound
    [[deprecated("Use field access instead!")]] ::Pathfinding::ClipperLib::TEdge*& dyn_LeftBound();
    // Get instance field reference: public Pathfinding.ClipperLib.TEdge RightBound
    [[deprecated("Use field access instead!")]] ::Pathfinding::ClipperLib::TEdge*& dyn_RightBound();
    // Get instance field reference: public Pathfinding.ClipperLib.LocalMinima Next
    [[deprecated("Use field access instead!")]] ::Pathfinding::ClipperLib::LocalMinima*& dyn_Next();
    // public System.Void .ctor()
    // Offset: 0x4994BB8
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static LocalMinima* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::Pathfinding::ClipperLib::LocalMinima::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<LocalMinima*, creationType>()));
    }
  }; // Pathfinding.ClipperLib.LocalMinima
  #pragma pack(pop)
  static check_size<sizeof(LocalMinima), 40 + sizeof(::Pathfinding::ClipperLib::LocalMinima*)> __Pathfinding_ClipperLib_LocalMinimaSizeCheck;
  static_assert(sizeof(LocalMinima) == 0x30);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Pathfinding::ClipperLib::LocalMinima::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
