// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Pathfinding::ClipperLib
namespace Pathfinding::ClipperLib {
  // Forward declaring type: OutPt
  class OutPt;
  // Forward declaring type: PolyNode
  class PolyNode;
}
// Completed forward declares
// Type namespace: Pathfinding.ClipperLib
namespace Pathfinding::ClipperLib {
  // Forward declaring type: OutRec
  class OutRec;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Pathfinding::ClipperLib::OutRec);
DEFINE_IL2CPP_ARG_TYPE(::Pathfinding::ClipperLib::OutRec*, "Pathfinding.ClipperLib", "OutRec");
// Type namespace: Pathfinding.ClipperLib
namespace Pathfinding::ClipperLib {
  // Size: 0x38
  #pragma pack(push, 1)
  // Autogenerated type: Pathfinding.ClipperLib.OutRec
  // [TokenAttribute] Offset: FFFFFFFF
  class OutRec : public ::Il2CppObject {
    public:
    public:
    // public System.Int32 Idx
    // Size: 0x4
    // Offset: 0x10
    int Idx;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Boolean IsHole
    // Size: 0x1
    // Offset: 0x14
    bool IsHole;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean IsOpen
    // Size: 0x1
    // Offset: 0x15
    bool IsOpen;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: IsOpen and: FirstLeft
    char __padding2[0x2] = {};
    // public Pathfinding.ClipperLib.OutRec FirstLeft
    // Size: 0x8
    // Offset: 0x18
    ::Pathfinding::ClipperLib::OutRec* FirstLeft;
    // Field size check
    static_assert(sizeof(::Pathfinding::ClipperLib::OutRec*) == 0x8);
    // public Pathfinding.ClipperLib.OutPt Pts
    // Size: 0x8
    // Offset: 0x20
    ::Pathfinding::ClipperLib::OutPt* Pts;
    // Field size check
    static_assert(sizeof(::Pathfinding::ClipperLib::OutPt*) == 0x8);
    // public Pathfinding.ClipperLib.OutPt BottomPt
    // Size: 0x8
    // Offset: 0x28
    ::Pathfinding::ClipperLib::OutPt* BottomPt;
    // Field size check
    static_assert(sizeof(::Pathfinding::ClipperLib::OutPt*) == 0x8);
    // public Pathfinding.ClipperLib.PolyNode PolyNode
    // Size: 0x8
    // Offset: 0x30
    ::Pathfinding::ClipperLib::PolyNode* PolyNode;
    // Field size check
    static_assert(sizeof(::Pathfinding::ClipperLib::PolyNode*) == 0x8);
    public:
    // Get instance field reference: public System.Int32 Idx
    [[deprecated("Use field access instead!")]] int& dyn_Idx();
    // Get instance field reference: public System.Boolean IsHole
    [[deprecated("Use field access instead!")]] bool& dyn_IsHole();
    // Get instance field reference: public System.Boolean IsOpen
    [[deprecated("Use field access instead!")]] bool& dyn_IsOpen();
    // Get instance field reference: public Pathfinding.ClipperLib.OutRec FirstLeft
    [[deprecated("Use field access instead!")]] ::Pathfinding::ClipperLib::OutRec*& dyn_FirstLeft();
    // Get instance field reference: public Pathfinding.ClipperLib.OutPt Pts
    [[deprecated("Use field access instead!")]] ::Pathfinding::ClipperLib::OutPt*& dyn_Pts();
    // Get instance field reference: public Pathfinding.ClipperLib.OutPt BottomPt
    [[deprecated("Use field access instead!")]] ::Pathfinding::ClipperLib::OutPt*& dyn_BottomPt();
    // Get instance field reference: public Pathfinding.ClipperLib.PolyNode PolyNode
    [[deprecated("Use field access instead!")]] ::Pathfinding::ClipperLib::PolyNode*& dyn_PolyNode();
    // public System.Void .ctor()
    // Offset: 0x4994BC8
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static OutRec* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::Pathfinding::ClipperLib::OutRec::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<OutRec*, creationType>()));
    }
  }; // Pathfinding.ClipperLib.OutRec
  #pragma pack(pop)
  static check_size<sizeof(OutRec), 48 + sizeof(::Pathfinding::ClipperLib::PolyNode*)> __Pathfinding_ClipperLib_OutRecSizeCheck;
  static_assert(sizeof(OutRec) == 0x38);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Pathfinding::ClipperLib::OutRec::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
