// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: System.Nullable`1
#include "System/Nullable_1.hpp"
// Including type: System.Guid
#include "System/Guid.hpp"
// Including type: System.DateTime
#include "System/DateTime.hpp"
// Including type: GorillaNetworking.CosmeticsController
#include "GorillaNetworking/CosmeticsController.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Forward declaring namespace: FXP
namespace FXP {
  // Skipping declaration: EDisplayMode because it is already included!
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: Mesh
  class Mesh;
  // Forward declaring type: AudioClip
  class AudioClip;
  // Forward declaring type: ParticleSystem
  class ParticleSystem;
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: AudioSource
  class AudioSource;
  // Forward declaring type: TextMesh
  class TextMesh;
  // Forward declaring type: Coroutine
  class Coroutine;
}
// Forward declaring namespace: GorillaNetworking::Store
namespace GorillaNetworking::Store {
  // Forward declaring type: StoreUpdateEvent
  class StoreUpdateEvent;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: CosmeticStand
  class CosmeticStand;
}
// Completed forward declares
// Type namespace: FXP
namespace FXP {
  // Forward declaring type: CosmeticItemPrefab
  class CosmeticItemPrefab;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::FXP::CosmeticItemPrefab);
DEFINE_IL2CPP_ARG_TYPE(::FXP::CosmeticItemPrefab*, "FXP", "CosmeticItemPrefab");
// Type namespace: FXP
namespace FXP {
  // WARNING Size may be invalid!
  // Autogenerated type: FXP.CosmeticItemPrefab
  // [TokenAttribute] Offset: FFFFFFFF
  class CosmeticItemPrefab : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::FXP::CosmeticItemPrefab::EDisplayMode
    struct EDisplayMode;
    // Nested type: ::FXP::CosmeticItemPrefab::$DoAttractTimer$d__78
    class $DoAttractTimer$d__78;
    // Nested type: ::FXP::CosmeticItemPrefab::$DoPreviewTimer$d__75
    class $DoPreviewTimer$d__75;
    // Nested type: ::FXP::CosmeticItemPrefab::$PlayCountdownTimer$d__69
    class $PlayCountdownTimer$d__69;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: FXP.CosmeticItemPrefab/EDisplayMode
    // [TokenAttribute] Offset: FFFFFFFF
    // [SerializeField] Offset: FFFFFFFF
    struct EDisplayMode/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: EDisplayMode
      constexpr EDisplayMode(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public FXP.CosmeticItemPrefab/EDisplayMode NULL
      static constexpr const int _NULL = 0;
      // Get static field: static public FXP.CosmeticItemPrefab/EDisplayMode NULL
      static ::FXP::CosmeticItemPrefab::EDisplayMode _get_NULL();
      // Set static field: static public FXP.CosmeticItemPrefab/EDisplayMode NULL
      static void _set_NULL(::FXP::CosmeticItemPrefab::EDisplayMode value);
      // static field const value: static public FXP.CosmeticItemPrefab/EDisplayMode HIDDEN
      static constexpr const int HIDDEN = 1;
      // Get static field: static public FXP.CosmeticItemPrefab/EDisplayMode HIDDEN
      static ::FXP::CosmeticItemPrefab::EDisplayMode _get_HIDDEN();
      // Set static field: static public FXP.CosmeticItemPrefab/EDisplayMode HIDDEN
      static void _set_HIDDEN(::FXP::CosmeticItemPrefab::EDisplayMode value);
      // static field const value: static public FXP.CosmeticItemPrefab/EDisplayMode PREVIEW
      static constexpr const int PREVIEW = 2;
      // Get static field: static public FXP.CosmeticItemPrefab/EDisplayMode PREVIEW
      static ::FXP::CosmeticItemPrefab::EDisplayMode _get_PREVIEW();
      // Set static field: static public FXP.CosmeticItemPrefab/EDisplayMode PREVIEW
      static void _set_PREVIEW(::FXP::CosmeticItemPrefab::EDisplayMode value);
      // static field const value: static public FXP.CosmeticItemPrefab/EDisplayMode ATTRACT
      static constexpr const int ATTRACT = 3;
      // Get static field: static public FXP.CosmeticItemPrefab/EDisplayMode ATTRACT
      static ::FXP::CosmeticItemPrefab::EDisplayMode _get_ATTRACT();
      // Set static field: static public FXP.CosmeticItemPrefab/EDisplayMode ATTRACT
      static void _set_ATTRACT(::FXP::CosmeticItemPrefab::EDisplayMode value);
      // static field const value: static public FXP.CosmeticItemPrefab/EDisplayMode PURCHASE
      static constexpr const int PURCHASE = 4;
      // Get static field: static public FXP.CosmeticItemPrefab/EDisplayMode PURCHASE
      static ::FXP::CosmeticItemPrefab::EDisplayMode _get_PURCHASE();
      // Set static field: static public FXP.CosmeticItemPrefab/EDisplayMode PURCHASE
      static void _set_PURCHASE(::FXP::CosmeticItemPrefab::EDisplayMode value);
      // static field const value: static public FXP.CosmeticItemPrefab/EDisplayMode POSTPURCHASE
      static constexpr const int POSTPURCHASE = 5;
      // Get static field: static public FXP.CosmeticItemPrefab/EDisplayMode POSTPURCHASE
      static ::FXP::CosmeticItemPrefab::EDisplayMode _get_POSTPURCHASE();
      // Set static field: static public FXP.CosmeticItemPrefab/EDisplayMode POSTPURCHASE
      static void _set_POSTPURCHASE(::FXP::CosmeticItemPrefab::EDisplayMode value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // FXP.CosmeticItemPrefab/EDisplayMode
    #pragma pack(pop)
    static check_size<sizeof(CosmeticItemPrefab::EDisplayMode), 0 + sizeof(int)> __FXP_CosmeticItemPrefab_EDisplayModeSizeCheck;
    static_assert(sizeof(CosmeticItemPrefab::EDisplayMode) == 0x4);
    public:
    // public System.String PedestalID
    // Size: 0x8
    // Offset: 0x20
    ::StringW PedestalID;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Nullable`1<System.Guid> itemGUID
    // Size: 0xFFFFFFFF
    // Offset: 0x28
    ::System::Nullable_1<::System::Guid> itemGUID;
    // private System.String itemName
    // Size: 0x8
    // Offset: 0x40
    ::StringW itemName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.Transform> sockets
    // Size: 0x8
    // Offset: 0x48
    ::System::Collections::Generic::List_1<::UnityEngine::Transform*>* sockets;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Transform*>*) == 0x8);
    // private System.Int32 itemSocket
    // Size: 0x4
    // Offset: 0x50
    int itemSocket;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Nullable`1<System.Int32> hoursInPreviewMode
    // Size: 0xFFFFFFFF
    // Offset: 0x54
    ::System::Nullable_1<int> hoursInPreviewMode;
    // private System.Nullable`1<System.Int32> hoursInAttractMode
    // Size: 0xFFFFFFFF
    // Offset: 0x5C
    ::System::Nullable_1<int> hoursInAttractMode;
    // private UnityEngine.Mesh pedestalMesh
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::Mesh* pedestalMesh;
    // Field size check
    static_assert(sizeof(::UnityEngine::Mesh*) == 0x8);
    // private UnityEngine.Mesh mannequinMesh
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::Mesh* mannequinMesh;
    // Field size check
    static_assert(sizeof(::UnityEngine::Mesh*) == 0x8);
    // private UnityEngine.Mesh cosmeticMesh
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::Mesh* cosmeticMesh;
    // Field size check
    static_assert(sizeof(::UnityEngine::Mesh*) == 0x8);
    // private UnityEngine.AudioClip sfxPreviewMode
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::AudioClip* sfxPreviewMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // private UnityEngine.AudioClip sfxAttractMode
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::AudioClip* sfxAttractMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // private UnityEngine.AudioClip sfxPurchaseMode
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::AudioClip* sfxPurchaseMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // private UnityEngine.ParticleSystem vfxPreviewMode
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::ParticleSystem* vfxPreviewMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::ParticleSystem*) == 0x8);
    // private UnityEngine.ParticleSystem vfxAttractMode
    // Size: 0x8
    // Offset: 0xA0
    ::UnityEngine::ParticleSystem* vfxAttractMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::ParticleSystem*) == 0x8);
    // private UnityEngine.ParticleSystem vfxPurchaseMode
    // Size: 0x8
    // Offset: 0xA8
    ::UnityEngine::ParticleSystem* vfxPurchaseMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::ParticleSystem*) == 0x8);
    // private UnityEngine.GameObject goPedestal
    // Size: 0x8
    // Offset: 0xB0
    ::UnityEngine::GameObject* goPedestal;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject goMannequin
    // Size: 0x8
    // Offset: 0xB8
    ::UnityEngine::GameObject* goMannequin;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject goCosmeticItem
    // Size: 0x8
    // Offset: 0xC0
    ::UnityEngine::GameObject* goCosmeticItem;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject goCosmeticItemGameObject
    // Size: 0x8
    // Offset: 0xC8
    ::UnityEngine::GameObject* goCosmeticItemGameObject;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject goCosmeticItemNameplate
    // Size: 0x8
    // Offset: 0xD0
    ::UnityEngine::GameObject* goCosmeticItemNameplate;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject goClock
    // Size: 0x8
    // Offset: 0xD8
    ::UnityEngine::GameObject* goClock;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject goPreviewMode
    // Size: 0x8
    // Offset: 0xE0
    ::UnityEngine::GameObject* goPreviewMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject goAttractMode
    // Size: 0x8
    // Offset: 0xE8
    ::UnityEngine::GameObject* goAttractMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject goPurchaseMode
    // Size: 0x8
    // Offset: 0xF0
    ::UnityEngine::GameObject* goPurchaseMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.Mesh defaultPedestalMesh
    // Size: 0x8
    // Offset: 0xF8
    ::UnityEngine::Mesh* defaultPedestalMesh;
    // Field size check
    static_assert(sizeof(::UnityEngine::Mesh*) == 0x8);
    // private UnityEngine.Material defaultPedestalMaterial
    // Size: 0x8
    // Offset: 0x100
    ::UnityEngine::Material* defaultPedestalMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private UnityEngine.Mesh defaultMannequinMesh
    // Size: 0x8
    // Offset: 0x108
    ::UnityEngine::Mesh* defaultMannequinMesh;
    // Field size check
    static_assert(sizeof(::UnityEngine::Mesh*) == 0x8);
    // private UnityEngine.Material defaultMannequinMaterial
    // Size: 0x8
    // Offset: 0x110
    ::UnityEngine::Material* defaultMannequinMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private UnityEngine.Mesh defaultCosmeticMesh
    // Size: 0x8
    // Offset: 0x118
    ::UnityEngine::Mesh* defaultCosmeticMesh;
    // Field size check
    static_assert(sizeof(::UnityEngine::Mesh*) == 0x8);
    // private UnityEngine.Material defaultCosmeticMaterial
    // Size: 0x8
    // Offset: 0x120
    ::UnityEngine::Material* defaultCosmeticMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private System.String defaultItemText
    // Size: 0x8
    // Offset: 0x128
    ::StringW defaultItemText;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Int32 defaultHoursInPreviewMode
    // Size: 0x4
    // Offset: 0x130
    int defaultHoursInPreviewMode;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 defaultHoursInAttractMode
    // Size: 0x4
    // Offset: 0x134
    int defaultHoursInAttractMode;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.AudioClip defaultSFXPreviewMode
    // Size: 0x8
    // Offset: 0x138
    ::UnityEngine::AudioClip* defaultSFXPreviewMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // private UnityEngine.AudioClip defaultSFXAttractMode
    // Size: 0x8
    // Offset: 0x140
    ::UnityEngine::AudioClip* defaultSFXAttractMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // private UnityEngine.AudioClip defaultSFXPurchaseMode
    // Size: 0x8
    // Offset: 0x148
    ::UnityEngine::AudioClip* defaultSFXPurchaseMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // private UnityEngine.GameObject goCosmeticItemMeshAtlas
    // Size: 0x8
    // Offset: 0x150
    ::UnityEngine::GameObject* goCosmeticItemMeshAtlas;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.AudioSource CountdownSFX
    // Size: 0x8
    // Offset: 0x158
    ::UnityEngine::AudioSource* CountdownSFX;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // private FXP.CosmeticItemPrefab/EDisplayMode currentDisplayMode
    // Size: 0x4
    // Offset: 0x160
    ::FXP::CosmeticItemPrefab::EDisplayMode currentDisplayMode;
    // Field size check
    static_assert(sizeof(::FXP::CosmeticItemPrefab::EDisplayMode) == 0x4);
    // private System.Boolean isValid
    // Size: 0x1
    // Offset: 0x164
    bool isValid;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private UnityEngine.AudioSource goPreviewModeSFX
    // Size: 0x8
    // Offset: 0x168
    ::UnityEngine::AudioSource* goPreviewModeSFX;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // private UnityEngine.AudioSource goAttractModeSFX
    // Size: 0x8
    // Offset: 0x170
    ::UnityEngine::AudioSource* goAttractModeSFX;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // private UnityEngine.AudioSource goPurchaseModeSFX
    // Size: 0x8
    // Offset: 0x178
    ::UnityEngine::AudioSource* goPurchaseModeSFX;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // private UnityEngine.ParticleSystem goAttractModeVFX
    // Size: 0x8
    // Offset: 0x180
    ::UnityEngine::ParticleSystem* goAttractModeVFX;
    // Field size check
    static_assert(sizeof(::UnityEngine::ParticleSystem*) == 0x8);
    // private UnityEngine.ParticleSystem goPurchaseModeVFX
    // Size: 0x8
    // Offset: 0x188
    ::UnityEngine::ParticleSystem* goPurchaseModeVFX;
    // Field size check
    static_assert(sizeof(::UnityEngine::ParticleSystem*) == 0x8);
    // private System.Collections.IEnumerator coroutinePreviewTimer
    // Size: 0x8
    // Offset: 0x190
    ::System::Collections::IEnumerator* coroutinePreviewTimer;
    // Field size check
    static_assert(sizeof(::System::Collections::IEnumerator*) == 0x8);
    // private System.Collections.IEnumerator coroutineAttractTimer
    // Size: 0x8
    // Offset: 0x198
    ::System::Collections::IEnumerator* coroutineAttractTimer;
    // Field size check
    static_assert(sizeof(::System::Collections::IEnumerator*) == 0x8);
    // private System.DateTime startTime
    // Size: 0x8
    // Offset: 0x1A0
    ::System::DateTime startTime;
    // Field size check
    static_assert(sizeof(::System::DateTime) == 0x8);
    // private UnityEngine.TextMesh clockTextMesh
    // Size: 0x8
    // Offset: 0x1A8
    ::UnityEngine::TextMesh* clockTextMesh;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextMesh*) == 0x8);
    // private GorillaNetworking.Store.StoreUpdateEvent currentUpdateEvent
    // Size: 0x8
    // Offset: 0x1B0
    ::GorillaNetworking::Store::StoreUpdateEvent* currentUpdateEvent;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::Store::StoreUpdateEvent*) == 0x8);
    // public CosmeticStand cosmeticStand
    // Size: 0x8
    // Offset: 0x1B8
    ::GlobalNamespace::CosmeticStand* cosmeticStand;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::CosmeticStand*) == 0x8);
    // public System.String itemID
    // Size: 0x8
    // Offset: 0x1C0
    ::StringW itemID;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String oldItemID
    // Size: 0x8
    // Offset: 0x1C8
    ::StringW oldItemID;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private UnityEngine.Coroutine countdownTimerCoRoutine
    // Size: 0x8
    // Offset: 0x1D0
    ::UnityEngine::Coroutine* countdownTimerCoRoutine;
    // Field size check
    static_assert(sizeof(::UnityEngine::Coroutine*) == 0x8);
    public:
    // Get instance field reference: public System.String PedestalID
    [[deprecated("Use field access instead!")]] ::StringW& dyn_PedestalID();
    // Get instance field reference: private System.Nullable`1<System.Guid> itemGUID
    [[deprecated("Use field access instead!")]] ::System::Nullable_1<::System::Guid>& dyn_itemGUID();
    // Get instance field reference: private System.String itemName
    [[deprecated("Use field access instead!")]] ::StringW& dyn_itemName();
    // Get instance field reference: private System.Collections.Generic.List`1<UnityEngine.Transform> sockets
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::UnityEngine::Transform*>*& dyn_sockets();
    // Get instance field reference: private System.Int32 itemSocket
