// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Meta.WitAi.CoroutineUtility
#include "Meta/WitAi/CoroutineUtility.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Meta::WitAi::Requests
namespace Meta::WitAi::Requests {
}
// Forward declaring namespace: UnityEngine::Networking
namespace UnityEngine::Networking {
  // Forward declaring type: UnityWebRequest
  class UnityWebRequest;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Uri
  class Uri;
}
// Forward declaring namespace: Meta::Voice::Audio
namespace Meta::Voice::Audio {
  // Forward declaring type: IAudioClipStream
  class IAudioClipStream;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: AudioType
  struct AudioType;
}
// Completed forward declares
// Type namespace: Meta.WitAi.Requests
namespace Meta::WitAi::Requests {
  // Forward declaring type: VRequest
  class VRequest;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Meta::WitAi::Requests::VRequest);
DEFINE_IL2CPP_ARG_TYPE(::Meta::WitAi::Requests::VRequest*, "Meta.WitAi.Requests", "VRequest");
// Type namespace: Meta.WitAi.Requests
namespace Meta::WitAi::Requests {
  // Size: 0x50
  #pragma pack(push, 1)
  // Autogenerated type: Meta.WitAi.Requests.VRequest
  // [TokenAttribute] Offset: FFFFFFFF
  class VRequest : public ::Il2CppObject {
    public:
    // Nested type: ::Meta::WitAi::Requests::VRequest::RequestProgressDelegate
    class RequestProgressDelegate;
    // Nested type: ::Meta::WitAi::Requests::VRequest::RequestFirstResponseDelegate
    class RequestFirstResponseDelegate;
    // Nested type: ::Meta::WitAi::Requests::VRequest::RequestCompleteDelegate_1<TResult>
    template<typename TResult>
    class RequestCompleteDelegate_1;
    // Nested type: ::Meta::WitAi::Requests::VRequest::$$c__DisplayClass45_0
    class $$c__DisplayClass45_0;
    // Nested type: ::Meta::WitAi::Requests::VRequest::$$c__DisplayClass46_0
    class $$c__DisplayClass46_0;
    // Nested type: ::Meta::WitAi::Requests::VRequest::$$c__DisplayClass47_0
    class $$c__DisplayClass47_0;
    // Nested type: ::Meta::WitAi::Requests::VRequest::$$c__DisplayClass48_0
    class $$c__DisplayClass48_0;
    // Nested type: ::Meta::WitAi::Requests::VRequest::$$c__DisplayClass49_0
    class $$c__DisplayClass49_0;
    // Nested type: ::Meta::WitAi::Requests::VRequest::$$c__DisplayClass50_0_1<TData>
    template<typename TData>
    class $$c__DisplayClass50_0_1;
    // Nested type: ::Meta::WitAi::Requests::VRequest::$$c__DisplayClass50_1_1<TData>
    template<typename TData>
    class $$c__DisplayClass50_1_1;
    // Nested type: ::Meta::WitAi::Requests::VRequest::$$c__DisplayClass56_0
    class $$c__DisplayClass56_0;
    // Nested type: ::Meta::WitAi::Requests::VRequest::$PerformUpdate$d__38
    class $PerformUpdate$d__38;
    public:
    // private System.Int32 <Timeout>k__BackingField
    // Size: 0x4
    // Offset: 0x10
    int Timeout;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean <IsPerforming>k__BackingField
    // Size: 0x1
    // Offset: 0x14
    bool IsPerforming;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <IsComplete>k__BackingField
    // Size: 0x1
    // Offset: 0x15
    bool IsComplete;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: IsComplete and: ResponseCode
    char __padding2[0x2] = {};
    // private System.Int32 <ResponseCode>k__BackingField
    // Size: 0x4
    // Offset: 0x18
    int ResponseCode;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single <UploadProgress>k__BackingField
    // Size: 0x4
    // Offset: 0x1C
    float UploadProgress;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <DownloadProgress>k__BackingField
    // Size: 0x4
    // Offset: 0x20
    float DownloadProgress;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: DownloadProgress and: request
    char __padding5[0x4] = {};
    // private UnityEngine.Networking.UnityWebRequest _request
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::Networking::UnityWebRequest* request;
    // Field size check
    static_assert(sizeof(::UnityEngine::Networking::UnityWebRequest*) == 0x8);
    // private Meta.WitAi.Requests.VRequest/RequestProgressDelegate _onDownloadProgress
    // Size: 0x8
    // Offset: 0x30
    ::Meta::WitAi::Requests::VRequest::RequestProgressDelegate* onDownloadProgress;
    // Field size check
    static_assert(sizeof(::Meta::WitAi::Requests::VRequest::RequestProgressDelegate*) == 0x8);
    // private Meta.WitAi.Requests.VRequest/RequestFirstResponseDelegate _onFirstResponse
    // Size: 0x8
    // Offset: 0x38
    ::Meta::WitAi::Requests::VRequest::RequestFirstResponseDelegate* onFirstResponse;
    // Field size check
    static_assert(sizeof(::Meta::WitAi::Requests::VRequest::RequestFirstResponseDelegate*) == 0x8);
    // private Meta.WitAi.Requests.VRequest/RequestCompleteDelegate`1<UnityEngine.Networking.UnityWebRequest> _onComplete
    // Size: 0x8
    // Offset: 0x40
    ::Meta::WitAi::Requests::VRequest::RequestCompleteDelegate_1<::UnityEngine::Networking::UnityWebRequest*>* onComplete;
    // Field size check
    static_assert(sizeof(::Meta::WitAi::Requests::VRequest::RequestCompleteDelegate_1<::UnityEngine::Networking::UnityWebRequest*>*) == 0x8);
    // private Meta.WitAi.CoroutineUtility/CoroutinePerformer _coroutine
    // Size: 0x8
    // Offset: 0x48
    ::Meta::WitAi::CoroutineUtility::CoroutinePerformer* coroutine;
    // Field size check
    static_assert(sizeof(::Meta::WitAi::CoroutineUtility::CoroutinePerformer*) == 0x8);
    public:
    // Get static field: static public System.Int32 MaxConcurrentRequests
    static int _get_MaxConcurrentRequests();
    // Set static field: static public System.Int32 MaxConcurrentRequests
    static void _set_MaxConcurrentRequests(int value);
    // Get static field: static private System.Int32 _requestCount
    static int _get__requestCount();
    // Set static field: static private System.Int32 _requestCount
    static void _set__requestCount(int value);
    // Get instance field reference: private System.Int32 <Timeout>k__BackingField
    [[deprecated("Use field access instead!")]] int& dyn_$Timeout$k__BackingField();
    // Get instance field reference: private System.Boolean <IsPerforming>k__BackingField
