// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: Meta.WitAi.Interfaces.IAudioInputSource
#include "Meta/WitAi/Interfaces/IAudioInputSource.hpp"
// Including type: System.Boolean
#include "System/Boolean.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Meta::WitAi::Lib
namespace Meta::WitAi::Lib {
}
// Forward declaring namespace: Meta::WitAi::Data
namespace Meta::WitAi::Data {
  // Forward declaring type: AudioEncoding
  class AudioEncoding;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: AudioClip
  class AudioClip;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Action`3<T1, T2, T3>
  template<typename T1, typename T2, typename T3>
  class Action_3;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: Meta.WitAi.Lib
namespace Meta::WitAi::Lib {
  // Forward declaring type: Mic
  class Mic;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Meta::WitAi::Lib::Mic);
DEFINE_IL2CPP_ARG_TYPE(::Meta::WitAi::Lib::Mic*, "Meta.WitAi.Lib", "Mic");
// Type namespace: Meta.WitAi.Lib
namespace Meta::WitAi::Lib {
  // Size: 0x80
  #pragma pack(push, 1)
  // Autogenerated type: Meta.WitAi.Lib.Mic
  // [TokenAttribute] Offset: FFFFFFFF
  class Mic : public ::UnityEngine::MonoBehaviour/*, public ::Meta::WitAi::Interfaces::IAudioInputSource*/ {
    public:
    // Nested type: ::Meta::WitAi::Lib::Mic::$ReadRawAudio$d__70
    class $ReadRawAudio$d__70;
    public:
    // private System.Boolean <IsRecording>k__BackingField
    // Size: 0x1
    // Offset: 0x20
    bool IsRecording;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: IsRecording and: AudioEncoding
    char __padding0[0x7] = {};
    // private readonly Meta.WitAi.Data.AudioEncoding <AudioEncoding>k__BackingField
    // Size: 0x8
    // Offset: 0x28
    ::Meta::WitAi::Data::AudioEncoding* AudioEncoding;
    // Field size check
    static_assert(sizeof(::Meta::WitAi::Data::AudioEncoding*) == 0x8);
    // private System.Single[] <Sample>k__BackingField
    // Size: 0x8
    // Offset: 0x30
    ::ArrayW<float> Sample;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    // private System.Int32 <SampleDurationMS>k__BackingField
    // Size: 0x4
    // Offset: 0x38
    int SampleDurationMS;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: SampleDurationMS and: AudioClip
    char __padding3[0x4] = {};
    // private UnityEngine.AudioClip <AudioClip>k__BackingField
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::AudioClip* AudioClip;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // private System.Int32 _audioClipSampleRate
    // Size: 0x4
    // Offset: 0x48
    int audioClipSampleRate;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: audioClipSampleRate and: devices
    char __padding5[0x4] = {};
    // private System.Collections.Generic.List`1<System.String> _devices
    // Size: 0x8
    // Offset: 0x50
    ::System::Collections::Generic::List_1<::StringW>* devices;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::StringW>*) == 0x8);
    // private System.Int32 <CurrentDeviceIndex>k__BackingField
    // Size: 0x4
    // Offset: 0x58
    int CurrentDeviceIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_SampleCount
    // Size: 0x4
    // Offset: 0x5C
    int m_SampleCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Action OnStartRecording
    // Size: 0x8
    // Offset: 0x60
    ::System::Action* OnStartRecording;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private System.Action OnStartRecordingFailed
    // Size: 0x8
    // Offset: 0x68
    ::System::Action* OnStartRecordingFailed;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private System.Action`3<System.Int32,System.Single[],System.Single> OnSampleReady
    // Size: 0x8
    // Offset: 0x70
    ::System::Action_3<int, ::ArrayW<float>, float>* OnSampleReady;
    // Field size check
    static_assert(sizeof(::System::Action_3<int, ::ArrayW<float>, float>*) == 0x8);
    // private System.Action OnStopRecording
    // Size: 0x8
    // Offset: 0x78
    ::System::Action* OnStopRecording;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::Meta::WitAi::Interfaces::IAudioInputSource
    operator ::Meta::WitAi::Interfaces::IAudioInputSource() noexcept {
      return *reinterpret_cast<::Meta::WitAi::Interfaces::IAudioInputSource*>(this);
    }
    // static field const value: static private System.Boolean MIC_CLIP_LOOP
    static constexpr const bool MIC_CLIP_LOOP = true;
    // Get static field: static private System.Boolean MIC_CLIP_LOOP
    static bool _get_MIC_CLIP_LOOP();
    // Set static field: static private System.Boolean MIC_CLIP_LOOP
    static void _set_MIC_CLIP_LOOP(bool value);
    // static field const value: static private System.Int32 MIC_CLIP_CHANNELS
    static constexpr const int MIC_CLIP_CHANNELS = 1;
    // Get static field: static private System.Int32 MIC_CLIP_CHANNELS
