// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: System.Buffers.SequenceReader`1
#include "System/Buffers/SequenceReader_1.hpp"
// Including type: VYaml.Parser.Marker
#include "VYaml/Parser/Marker.hpp"
// Including type: VYaml.Parser.Token
#include "VYaml/Parser/Token.hpp"
// Including type: VYaml.Parser.SimpleKeyState
#include "VYaml/Parser/SimpleKeyState.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: VYaml::Internal
namespace VYaml::Internal {
  // Forward declaring type: InsertionQueue`1<T>
  template<typename T>
  class InsertionQueue_1;
  // Forward declaring type: ExpandBuffer`1<T>
  template<typename T>
  class ExpandBuffer_1;
  // Forward declaring type: LineBreakState
  struct LineBreakState;
}
// Forward declaring namespace: VYaml::Parser
namespace VYaml::Parser {
  // Skipping declaration: TokenType because it is already included!
  // Forward declaring type: ITokenContent
  class ITokenContent;
  // Forward declaring type: Scalar
  class Scalar;
}
// Forward declaring namespace: System::Buffers
namespace System::Buffers {
  // Skipping declaration: ReadOnlySequence`1 because it is already included!
}
// Completed forward declares
// Type namespace: VYaml.Parser
namespace VYaml::Parser {
  // Forward declaring type: Utf8YamlTokenizer
  struct Utf8YamlTokenizer;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::VYaml::Parser::Utf8YamlTokenizer, "VYaml.Parser", "Utf8YamlTokenizer");
// Type namespace: VYaml.Parser
namespace VYaml::Parser {
  // WARNING Size may be invalid!
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: VYaml.Parser.Utf8YamlTokenizer
  // [TokenAttribute] Offset: FFFFFFFF
  // [NullableContextAttribute] Offset: FFFFFFFF
  // [NullableAttribute] Offset: FFFFFFFF
  // [IsByRefLikeAttribute] Offset: FFFFFFFF
  // [ObsoleteAttribute] Offset: FFFFFFFF
  struct Utf8YamlTokenizer/*, public ::System::ValueType*/ {
    public:
    public:
    // private System.Buffers.SequenceReader`1<System.Byte> reader
    // Size: 0xFFFFFFFF
    // Offset: 0x0
    ::System::Buffers::SequenceReader_1<uint8_t> reader;
    // private VYaml.Parser.Marker mark
    // Size: 0xC
    // Offset: 0x68
    ::VYaml::Parser::Marker mark;
    // Field size check
    static_assert(sizeof(::VYaml::Parser::Marker) == 0xC);
    // private VYaml.Parser.Token currentToken
    // Size: 0x10
    // Offset: 0x78
    ::VYaml::Parser::Token currentToken;
    // Field size check
    static_assert(sizeof(::VYaml::Parser::Token) == 0x10);
    // private System.Boolean streamStartProduced
    // Size: 0x1
    // Offset: 0x88
    bool streamStartProduced;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean streamEndProduced
    // Size: 0x1
    // Offset: 0x89
    bool streamEndProduced;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Byte currentCode
    // Size: 0x1
    // Offset: 0x8A
    uint8_t currentCode;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Int32 indent
    // Size: 0x4
    // Offset: 0x8C
    int indent;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean simpleKeyAllowed
    // Size: 0x1
    // Offset: 0x90
    bool simpleKeyAllowed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Int32 adjacentValueAllowedAt
    // Size: 0x4
    // Offset: 0x94
    int adjacentValueAllowedAt;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 flowLevel
    // Size: 0x4
    // Offset: 0x98
    int flowLevel;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 tokensParsed
    // Size: 0x4
    // Offset: 0x9C
    int tokensParsed;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean tokenAvailable
    // Size: 0x1
    // Offset: 0xA0
    bool tokenAvailable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private readonly VYaml.Internal.InsertionQueue`1<VYaml.Parser.Token> tokens
    // Size: 0x8
    // Offset: 0xA8
    ::VYaml::Internal::InsertionQueue_1<::VYaml::Parser::Token>* tokens;
    // Field size check
    static_assert(sizeof(::VYaml::Internal::InsertionQueue_1<::VYaml::Parser::Token>*) == 0x8);
    // private readonly VYaml.Internal.ExpandBuffer`1<VYaml.Parser.SimpleKeyState> simpleKeyCandidates
    // Size: 0x8
    // Offset: 0xB0
    ::VYaml::Internal::ExpandBuffer_1<::VYaml::Parser::SimpleKeyState>* simpleKeyCandidates;
    // Field size check
    static_assert(sizeof(::VYaml::Internal::ExpandBuffer_1<::VYaml::Parser::SimpleKeyState>*) == 0x8);
    // private readonly VYaml.Internal.ExpandBuffer`1<System.Int32> indents
    // Size: 0x8
    // Offset: 0xB8
    ::VYaml::Internal::ExpandBuffer_1<int>* indents;
    // Field size check
    static_assert(sizeof(::VYaml::Internal::ExpandBuffer_1<int>*) == 0x8);
    public:
    // Creating value type constructor for type: Utf8YamlTokenizer
