// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: VYaml.Parser.ParseEventType
#include "VYaml/Parser/ParseEventType.hpp"
// Including type: VYaml.Parser.Utf8YamlTokenizer
#include "VYaml/Parser/Utf8YamlTokenizer.hpp"
// Including type: VYaml.Parser.ParseState
#include "VYaml/Parser/ParseState.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: VYaml::Parser
namespace VYaml::Parser {
  // Forward declaring type: Scalar
  class Scalar;
  // Forward declaring type: Tag
  class Tag;
  // Forward declaring type: Anchor
  class Anchor;
  // Skipping declaration: Marker because it is already included!
  // Skipping declaration: TokenType because it is already included!
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: VYaml::Internal
namespace VYaml::Internal {
  // Forward declaring type: ExpandBuffer`1<T>
  template<typename T>
  class ExpandBuffer_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Memory`1<T>
  template<typename T>
  struct Memory_1;
  // Skipping declaration: ReadOnlySpan`1 because it is already included!
}
// Forward declaring namespace: System::Buffers
namespace System::Buffers {
  // Skipping declaration: ReadOnlySequence`1 because it is already included!
}
// Completed forward declares
// Type namespace: VYaml.Parser
namespace VYaml::Parser {
  // Forward declaring type: YamlParser
  struct YamlParser;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::VYaml::Parser::YamlParser, "VYaml.Parser", "YamlParser");
// Type namespace: VYaml.Parser
namespace VYaml::Parser {
  // WARNING Size may be invalid!
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: VYaml.Parser.YamlParser
  // [TokenAttribute] Offset: FFFFFFFF
  // [IsByRefLikeAttribute] Offset: FFFFFFFF
  // [NullableAttribute] Offset: FFFFFFFF
  // [NullableContextAttribute] Offset: FFFFFFFF
  // [ObsoleteAttribute] Offset: FFFFFFFF
  struct YamlParser/*, public ::System::ValueType*/ {
    public:
    public:
    // private VYaml.Parser.ParseEventType <CurrentEventType>k__BackingField
    // Size: 0x1
    // Offset: 0x0
    ::VYaml::Parser::ParseEventType CurrentEventType;
    // Field size check
    static_assert(sizeof(::VYaml::Parser::ParseEventType) == 0x1);
    // private System.Boolean <UnityStrippedMark>k__BackingField
    // Size: 0x1
    // Offset: 0x1
    bool UnityStrippedMark;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private VYaml.Parser.Utf8YamlTokenizer tokenizer
    // Size: 0xFFFFFFFF
    // Offset: 0x8
    ::VYaml::Parser::Utf8YamlTokenizer tokenizer;
    // private VYaml.Parser.ParseState currentState
    // Size: 0x4
    // Offset: 0xC8
    ::VYaml::Parser::ParseState currentState;
    // Field size check
    static_assert(sizeof(::VYaml::Parser::ParseState) == 0x4);
    // private VYaml.Parser.Scalar currentScalar
    // Size: 0x8
    // Offset: 0xD0
    ::VYaml::Parser::Scalar* currentScalar;
    // Field size check
    static_assert(sizeof(::VYaml::Parser::Scalar*) == 0x8);
    // private VYaml.Parser.Tag currentTag
    // Size: 0x8
    // Offset: 0xD8
    ::VYaml::Parser::Tag* currentTag;
    // Field size check
    static_assert(sizeof(::VYaml::Parser::Tag*) == 0x8);
    // private VYaml.Parser.Anchor currentAnchor
    // Size: 0x8
    // Offset: 0xE0
    ::VYaml::Parser::Anchor* currentAnchor;
    // Field size check
    static_assert(sizeof(::VYaml::Parser::Anchor*) == 0x8);
    // private System.Int32 lastAnchorId
    // Size: 0x4
    // Offset: 0xE8
    int lastAnchorId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private readonly System.Collections.Generic.Dictionary`2<System.String,System.Int32> anchors
    // Size: 0x8
    // Offset: 0xF0
    ::System::Collections::Generic::Dictionary_2<::StringW, int>* anchors;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, int>*) == 0x8);
    // private readonly VYaml.Internal.ExpandBuffer`1<VYaml.Parser.ParseState> stateStack
    // Size: 0x8
    // Offset: 0xF8
    ::VYaml::Internal::ExpandBuffer_1<::VYaml::Parser::ParseState>* stateStack;
    // Field size check
    static_assert(sizeof(::VYaml::Internal::ExpandBuffer_1<::VYaml::Parser::ParseState>*) == 0x8);
    public:
    // Creating value type constructor for type: YamlParser
