// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Pathfinding.Path
#include "Pathfinding/Path.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Pathfinding
namespace Pathfinding {
  // Forward declaring type: GraphNode
  class GraphNode;
  // Forward declaring type: PathNode
  class PathNode;
  // Forward declaring type: GridNode
  class GridNode;
  // Forward declaring type: NNConstraint
  class NNConstraint;
  // Forward declaring type: OnPathDelegate
  class OnPathDelegate;
  // Forward declaring type: PathLog
  struct PathLog;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: Pathfinding
namespace Pathfinding {
  // Forward declaring type: ABPath
  class ABPath;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Pathfinding::ABPath);
DEFINE_IL2CPP_ARG_TYPE(::Pathfinding::ABPath*, "Pathfinding", "ABPath");
// Type namespace: Pathfinding
namespace Pathfinding {
  // Size: 0x138
  #pragma pack(push, 1)
  // Autogenerated type: Pathfinding.ABPath
  // [TokenAttribute] Offset: FFFFFFFF
  class ABPath : public ::Pathfinding::Path {
    public:
    // Writing base type padding for base size: 0xC9 to desired offset: 0xD0
    char ___base_padding[0x7] = {};
    public:
    // public Pathfinding.GraphNode startNode
    // Size: 0x8
    // Offset: 0xD0
    ::Pathfinding::GraphNode* startNode;
    // Field size check
    static_assert(sizeof(::Pathfinding::GraphNode*) == 0x8);
    // public Pathfinding.GraphNode endNode
    // Size: 0x8
    // Offset: 0xD8
    ::Pathfinding::GraphNode* endNode;
    // Field size check
    static_assert(sizeof(::Pathfinding::GraphNode*) == 0x8);
    // public UnityEngine.Vector3 originalStartPoint
    // Size: 0xC
    // Offset: 0xE0
    ::UnityEngine::Vector3 originalStartPoint;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 originalEndPoint
    // Size: 0xC
    // Offset: 0xEC
    ::UnityEngine::Vector3 originalEndPoint;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 startPoint
    // Size: 0xC
    // Offset: 0xF8
    ::UnityEngine::Vector3 startPoint;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 endPoint
    // Size: 0xC
    // Offset: 0x104
    ::UnityEngine::Vector3 endPoint;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public Pathfinding.Int3 startIntPoint
    // Size: 0xC
    // Offset: 0x110
    ::Pathfinding::Int3 startIntPoint;
    // Field size check
    static_assert(sizeof(::Pathfinding::Int3) == 0xC);
    // public System.Boolean calculatePartial
    // Size: 0x1
    // Offset: 0x11C
    bool calculatePartial;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: calculatePartial and: partialBestTarget
    char __padding7[0x3] = {};
    // protected Pathfinding.PathNode partialBestTarget
    // Size: 0x8
    // Offset: 0x120
    ::Pathfinding::PathNode* partialBestTarget;
    // Field size check
    static_assert(sizeof(::Pathfinding::PathNode*) == 0x8);
    // protected System.Int32[] endNodeCosts
    // Size: 0x8
    // Offset: 0x128
    ::ArrayW<int> endNodeCosts;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // private Pathfinding.GridNode gridSpecialCaseNode
    // Size: 0x8
    // Offset: 0x130
    ::Pathfinding::GridNode* gridSpecialCaseNode;
    // Field size check
    static_assert(sizeof(::Pathfinding::GridNode*) == 0x8);
    public:
    // Get static field: static private readonly Pathfinding.NNConstraint NNConstraintNone
    static ::Pathfinding::NNConstraint* _get_NNConstraintNone();
    // Set static field: static private readonly Pathfinding.NNConstraint NNConstraintNone
    static void _set_NNConstraintNone(::Pathfinding::NNConstraint* value);
    // Get instance field reference: public Pathfinding.GraphNode startNode
    [[deprecated("Use field access instead!")]] ::Pathfinding::GraphNode*& dyn_startNode();
    // Get instance field reference: public Pathfinding.GraphNode endNode
    [[deprecated("Use field access instead!")]] ::Pathfinding::GraphNode*& dyn_endNode();
    // Get instance field reference: public UnityEngine.Vector3 originalStartPoint
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_originalStartPoint();
    // Get instance field reference: public UnityEngine.Vector3 originalEndPoint
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_originalEndPoint();
    // Get instance field reference: public UnityEngine.Vector3 startPoint
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_startPoint();
    // Get instance field reference: public UnityEngine.Vector3 endPoint
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_endPoint();
    // Get instance field reference: public Pathfinding.Int3 startIntPoint
    [[deprecated("Use field access instead!")]] ::Pathfinding::Int3& dyn_startIntPoint();
    // Get instance field reference: public System.Boolean calculatePartial
    [[deprecated("Use field access instead!")]] bool& dyn_calculatePartial();
    // Get instance field reference: protected Pathfinding.PathNode partialBestTarget
    [[deprecated("Use field access instead!")]] ::Pathfinding::PathNode*& dyn_partialBestTarget();
    // Get instance field reference: protected System.Int32[] endNodeCosts
    [[deprecated("Use field access instead!")]] ::ArrayW<int>& dyn_endNodeCosts();
    // Get instance field reference: private Pathfinding.GridNode gridSpecialCaseNode
    [[deprecated("Use field access instead!")]] ::Pathfinding::GridNode*& dyn_gridSpecialCaseNode();
    // protected System.Boolean get_hasEndPoint()
    // Offset: 0x29FCF58
    bool get_hasEndPoint();
    // static public Pathfinding.ABPath Construct(UnityEngine.Vector3 start, UnityEngine.Vector3 end, Pathfinding.OnPathDelegate callback)
    // Offset: 0x29FCFB8
    static ::Pathfinding::ABPath* Construct(::UnityEngine::Vector3 start, ::UnityEngine::Vector3 end, ::Pathfinding::OnPathDelegate* callback);
    // protected System.Void Setup(UnityEngine.Vector3 start, UnityEngine.Vector3 end, Pathfinding.OnPathDelegate callbackDelegate)
    // Offset: 0x29FD090
    void Setup(::UnityEngine::Vector3 start, ::UnityEngine::Vector3 end, ::Pathfinding::OnPathDelegate* callbackDelegate);
    // static public Pathfinding.ABPath FakePath(System.Collections.Generic.List`1<UnityEngine.Vector3> vectorPath, System.Collections.Generic.List`1<Pathfinding.GraphNode> nodePath)
    // Offset: 0x29FD16C
    static ::Pathfinding::ABPath* FakePath(::System::Collections::Generic::List_1<::UnityEngine::Vector3>* vectorPath, ::System::Collections::Generic::List_1<::Pathfinding::GraphNode*>* nodePath);
    // protected System.Void UpdateStartEnd(UnityEngine.Vector3 start, UnityEngine.Vector3 end)
    // Offset: 0x29FD0F4
    void UpdateStartEnd(::UnityEngine::Vector3 start, ::UnityEngine::Vector3 end);
    // protected System.Boolean EndPointGridGraphSpecialCase(Pathfinding.GraphNode closestWalkableEndNode)
    // Offset: 0x29FD7AC
    bool EndPointGridGraphSpecialCase(::Pathfinding::GraphNode* closestWalkableEndNode);
    // private System.Void SetFlagOnSurroundingGridNodes(Pathfinding.GridNode gridNode, System.Int32 flag, System.Boolean flagState)
    // Offset: 0x29FDC30
    void SetFlagOnSurroundingGridNodes(::Pathfinding::GridNode* gridNode, int flag, bool flagState);
    // protected System.Void CompletePathIfStartIsValidTarget()
    // Offset: 0x29FE218
    void CompletePathIfStartIsValidTarget();
    // private System.Void CompletePartial(Pathfinding.PathNode node)
    // Offset: 0x29FE59C
    void CompletePartial(::Pathfinding::PathNode* node);
    // private System.Void CompleteWith(Pathfinding.GraphNode node)
    // Offset: 0x29FE2A0
    void CompleteWith(::Pathfinding::GraphNode* node);
    // public UnityEngine.Vector3 GetMovementVector(UnityEngine.Vector3 point)
    // Offset: 0x29FECF8
    ::UnityEngine::Vector3 GetMovementVector(::UnityEngine::Vector3 point);
    // public System.Void .ctor()
    // Offset: 0x29FCF60
    // Implemented from: Pathfinding.Path
    // Base method: System.Void Path::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static ABPath* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::Pathfinding::ABPath::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<ABPath*, creationType>()));
    }
    // public override System.UInt32 GetConnectionSpecialCost(Pathfinding.GraphNode a, Pathfinding.GraphNode b, System.UInt32 currentCost)
    // Offset: 0x29FD4C8
    // Implemented from: Pathfinding.Path
    // Base method: System.UInt32 Path::GetConnectionSpecialCost(Pathfinding.GraphNode a, Pathfinding.GraphNode b, System.UInt32 currentCost)
    uint GetConnectionSpecialCost(::Pathfinding::GraphNode* a, ::Pathfinding::GraphNode* b, uint currentCost);
    // protected override System.Void Reset()
    // Offset: 0x29FD6AC
    // Implemented from: Pathfinding.Path
    // Base method: System.Void Path::Reset()
    void Reset();
    // protected override System.Void Prepare()
    // Offset: 0x29FDED4
    // Implemented from: Pathfinding.Path
    // Base method: System.Void Path::Prepare()
    void Prepare();
    // protected override System.Void Initialize()
    // Offset: 0x29FE3AC
    // Implemented from: Pathfinding.Path
    // Base method: System.Void Path::Initialize()
    void Initialize();
    // protected override System.Void Cleanup()
    // Offset: 0x29FE620
    // Implemented from: Pathfinding.Path
    // Base method: System.Void Path::Cleanup()
    void Cleanup();
    // protected override System.Void CalculateStep(System.Int64 targetTick)
    // Offset: 0x29FE720
    // Implemented from: Pathfinding.Path
    // Base method: System.Void Path::CalculateStep(System.Int64 targetTick)
    void CalculateStep(int64_t targetTick);
    // protected override System.String DebugString(Pathfinding.PathLog logMode)
    // Offset: 0x29FE984
    // Implemented from: Pathfinding.Path
    // Base method: System.String Path::DebugString(Pathfinding.PathLog logMode)
    ::StringW DebugString(::Pathfinding::PathLog logMode);
    // static private System.Void .cctor()
    // Offset: 0x29FEEC8
    // Implemented from: Pathfinding.Path
    // Base method: System.Void Path::.cctor()
    static void _cctor();
  }; // Pathfinding.ABPath
  #pragma pack(pop)
  static check_size<sizeof(ABPath), 304 + sizeof(::Pathfinding::GridNode*)> __Pathfinding_ABPathSizeCheck;
  static_assert(sizeof(ABPath) == 0x138);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Pathfinding::ABPath::get_hasEndPoint
// Il2CppName: get_hasEndPoint
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (Pathfinding::ABPath::*)()>(&Pathfinding::ABPath::get_hasEndPoint)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Pathfinding::ABPath*), "get_hasEndPoint", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Pathfinding::ABPath::Construct
// Il2CppName: Construct
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::Pathfinding::ABPath* (*)(::UnityEngine::Vector3, ::UnityEngine::Vector3, ::Pathfinding::OnPathDelegate*)>(&Pathfinding::ABPath::Construct)> {
  static const MethodInfo* get() {
    static auto* start = &::il2cpp_utils::GetClassFromName("UnityEngine", "Vector3")->byval_arg;
    static auto* end = &::il2cpp_utils::GetClassFromName("UnityEngine", "Vector3")->byval_arg;
    static auto* callback = &::il2cpp_utils::GetClassFromName("Pathfinding", "OnPathDelegate")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Pathfinding::ABPath*), "Construct", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{start, end, callback});
  }
};
// Writing MetadataGetter for method: Pathfinding::ABPath::Setup
// Il2CppName: Setup
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Pathfinding::ABPath::*)(::UnityEngine::Vector3, ::UnityEngine::Vector3, ::Pathfinding::OnPathDelegate*)>(&Pathfinding::ABPath::Setup)> {
  static const MethodInfo* get() {
    static auto* start = &::il2cpp_utils::GetClassFromName("UnityEngine", "Vector3")->byval_arg;
    static auto* end = &::il2cpp_utils::GetClassFromName("UnityEngine", "Vector3")->byval_arg;
    static auto* callbackDelegate = &::il2cpp_utils::GetClassFromName("Pathfinding", "OnPathDelegate")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Pathfinding::ABPath*), "Setup", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{start, end, callbackDelegate});
  }
};
// Writing MetadataGetter for method: Pathfinding::ABPath::FakePath
// Il2CppName: FakePath
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::Pathfinding::ABPath* (*)(::System::Collections::Generic::List_1<::UnityEngine::Vector3>*, ::System::Collections::Generic::List_1<::Pathfinding::GraphNode*>*)>(&Pathfinding::ABPath::FakePath)> {
  static const MethodInfo* get() {
    static auto* vectorPath = &::il2cpp_utils::MakeGeneric(::il2cpp_utils::GetClassFromName("System.Collections.Generic", "List`1"), ::std::vector<const Il2CppClass*>{::il2cpp_utils::GetClassFromName("UnityEngine", "Vector3")})->byval_arg;
    static auto* nodePath = &::il2cpp_utils::MakeGeneric(::il2cpp_utils::GetClassFromName("System.Collections.Generic", "List`1"), ::std::vector<const Il2CppClass*>{::il2cpp_utils::GetClassFromName("Pathfinding", "GraphNode")})->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Pathfinding::ABPath*), "FakePath", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{vectorPath, nodePath});
  }
};
// Writing MetadataGetter for method: Pathfinding::ABPath::UpdateStartEnd
// Il2CppName: UpdateStartEnd
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Pathfinding::ABPath::*)(::UnityEngine::Vector3, ::UnityEngine::Vector3)>(&Pathfinding::ABPath::UpdateStartEnd)> {
  static const MethodInfo* get() {
    static auto* start = &::il2cpp_utils::GetClassFromName("UnityEngine", "Vector3")->byval_arg;
    static auto* end = &::il2cpp_utils::GetClassFromName("UnityEngine", "Vector3")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Pathfinding::ABPath*), "UpdateStartEnd", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{start, end});
  }
};
// Writing MetadataGetter for method: Pathfinding::ABPath::EndPointGridGraphSpecialCase
// Il2CppName: EndPointGridGraphSpecialCase
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (Pathfinding::ABPath::*)(::Pathfinding::GraphNode*)>(&Pathfinding::ABPath::EndPointGridGraphSpecialCase)> {
  static const MethodInfo* get() {
    static auto* closestWalkableEndNode = &::il2cpp_utils::GetClassFromName("Pathfinding", "GraphNode")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Pathfinding::ABPath*), "EndPointGridGraphSpecialCase", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{closestWalkableEndNode});
  }
};
// Writing MetadataGetter for method: Pathfinding::ABPath::SetFlagOnSurroundingGridNodes
// Il2CppName: SetFlagOnSurroundingGridNodes
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Pathfinding::ABPath::*)(::Pathfinding::GridNode*, int, bool)>(&Pathfinding::ABPath::SetFlagOnSurroundingGridNodes)> {
  static const MethodInfo* get() {
    static auto* gridNode = &::il2cpp_utils::GetClassFromName("Pathfinding", "GridNode")->byval_arg;
    static auto* flag = &::il2cpp_utils::GetClassFromName("System", "Int32")->byval_arg;
    static auto* flagState = &::il2cpp_utils::GetClassFromName("System", "Boolean")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Pathfinding::ABPath*), "SetFlagOnSurroundingGridNodes", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{gridNode, flag, flagState});
  }
};
// Writing MetadataGetter for method: Pathfinding::ABPath::CompletePathIfStartIsValidTarget
// Il2CppName: CompletePathIfStartIsValidTarget
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Pathfinding::ABPath::*)()>(&Pathfinding::ABPath::CompletePathIfStartIsValidTarget)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Pathfinding::ABPath*), "CompletePathIfStartIsValidTarget", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Pathfinding::ABPath::CompletePartial
// Il2CppName: CompletePartial
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Pathfinding::ABPath::*)(::Pathfinding::PathNode*)>(&Pathfinding::ABPath::CompletePartial)> {
  static const MethodInfo* get() {
    static auto* node = &::il2cpp_utils::GetClassFromName("Pathfinding", "PathNode")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Pathfinding::ABPath*), "CompletePartial", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{node});
  }
};
// Writing MetadataGetter for method: Pathfinding::ABPath::CompleteWith
// Il2CppName: CompleteWith
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Pathfinding::ABPath::*)(::Pathfinding::GraphNode*)>(&Pathfinding::ABPath::CompleteWith)> {
  static const MethodInfo* get() {
    static auto* node = &::il2cpp_utils::GetClassFromName("Pathfinding", "GraphNode")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Pathfinding::ABPath*), "CompleteWith", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{node});
  }
};
// Writing MetadataGetter for method: Pathfinding::ABPath::GetMovementVector
// Il2CppName: GetMovementVector
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::Vector3 (Pathfinding::ABPath::*)(::UnityEngine::Vector3)>(&Pathfinding::ABPath::GetMovementVector)> {
  static const MethodInfo* get() {
    static auto* point = &::il2cpp_utils::GetClassFromName("UnityEngine", "Vector3")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Pathfinding::ABPath*), "GetMovementVector", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{point});
  }
};
// Writing MetadataGetter for method: Pathfinding::ABPath::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: Pathfinding::ABPath::GetConnectionSpecialCost
// Il2CppName: GetConnectionSpecialCost
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<uint (Pathfinding::ABPath::*)(::Pathfinding::GraphNode*, ::Pathfinding::GraphNode*, uint)>(&Pathfinding::ABPath::GetConnectionSpecialCost)> {
  static const MethodInfo* get() {
    static auto* a = &::il2cpp_utils::GetClassFromName("Pathfinding", "GraphNode")->byval_arg;
    static auto* b = &::il2cpp_utils::GetClassFromName("Pathfinding", "GraphNode")->byval_arg;
    static auto* currentCost = &::il2cpp_utils::GetClassFromName("System", "UInt32")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Pathfinding::ABPath*), "GetConnectionSpecialCost", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{a, b, currentCost});
  }
};
// Writing MetadataGetter for method: Pathfinding::ABPath::Reset
// Il2CppName: Reset
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Pathfinding::ABPath::*)()>(&Pathfinding::ABPath::Reset)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Pathfinding::ABPath*), "Reset", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Pathfinding::ABPath::Prepare
// Il2CppName: Prepare
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Pathfinding::ABPath::*)()>(&Pathfinding::ABPath::Prepare)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Pathfinding::ABPath*), "Prepare", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Pathfinding::ABPath::Initialize
// Il2CppName: Initialize
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Pathfinding::ABPath::*)()>(&Pathfinding::ABPath::Initialize)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Pathfinding::ABPath*), "Initialize", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Pathfinding::ABPath::Cleanup
// Il2CppName: Cleanup
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Pathfinding::ABPath::*)()>(&Pathfinding::ABPath::Cleanup)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Pathfinding::ABPath*), "Cleanup", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Pathfinding::ABPath::CalculateStep
// Il2CppName: CalculateStep
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Pathfinding::ABPath::*)(int64_t)>(&Pathfinding::ABPath::CalculateStep)> {
  static const MethodInfo* get() {
    static auto* targetTick = &::il2cpp_utils::GetClassFromName("System", "Int64")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Pathfinding::ABPath*), "CalculateStep", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{targetTick});
  }
};
// Writing MetadataGetter for method: Pathfinding::ABPath::DebugString
// Il2CppName: DebugString
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::StringW (Pathfinding::ABPath::*)(::Pathfinding::PathLog)>(&Pathfinding::ABPath::DebugString)> {
  static const MethodInfo* get() {
    static auto* logMode = &::il2cpp_utils::GetClassFromName("Pathfinding", "PathLog")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Pathfinding::ABPath*), "DebugString", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{logMode});
  }
};
// Writing MetadataGetter for method: Pathfinding::ABPath::_cctor
// Il2CppName: .cctor
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (*)()>(&Pathfinding::ABPath::_cctor)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Pathfinding::ABPath*), ".cctor", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
