// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Pathfinding.VersionedMonoBehaviour
#include "Pathfinding/VersionedMonoBehaviour.hpp"
// Including type: UnityEngine.LayerMask
#include "UnityEngine/LayerMask.hpp"
// Including type: Pathfinding.OrientationMode
#include "Pathfinding/OrientationMode.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Pathfinding
namespace Pathfinding {
  // Forward declaring type: Seeker
  class Seeker;
  // Forward declaring type: AutoRepathPolicy
  class AutoRepathPolicy;
  // Forward declaring type: Path
  class Path;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: Rigidbody
  class Rigidbody;
  // Forward declaring type: Rigidbody2D
  class Rigidbody2D;
  // Forward declaring type: CharacterController
  class CharacterController;
}
// Forward declaring namespace: Pathfinding::RVO
namespace Pathfinding::RVO {
  // Forward declaring type: RVOController
  class RVOController;
}
// Forward declaring namespace: Pathfinding::Util
namespace Pathfinding::Util {
  // Forward declaring type: IMovementPlane
  class IMovementPlane;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
}
// Completed forward declares
// Type namespace: Pathfinding
namespace Pathfinding {
  // Forward declaring type: AIBase
  class AIBase;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Pathfinding::AIBase);
DEFINE_IL2CPP_ARG_TYPE(::Pathfinding::AIBase*, "Pathfinding", "AIBase");
// Type namespace: Pathfinding
namespace Pathfinding {
  // Size: 0x130
  #pragma pack(push, 1)
  // Autogenerated type: Pathfinding.AIBase
  // [TokenAttribute] Offset: FFFFFFFF
  // [RequireComponent] Offset: FFFFFFFF
  class AIBase : public ::Pathfinding::VersionedMonoBehaviour {
    public:
    public:
    // public System.Single radius
    // Size: 0x4
    // Offset: 0x24
    float radius;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single height
    // Size: 0x4
    // Offset: 0x28
    float height;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean canMove
    // Size: 0x1
    // Offset: 0x2C
    bool canMove;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: canMove and: maxSpeed
    char __padding2[0x3] = {};
    // public System.Single maxSpeed
    // Size: 0x4
    // Offset: 0x30
    float maxSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.Vector3 gravity
    // Size: 0xC
    // Offset: 0x34
    ::UnityEngine::Vector3 gravity;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.LayerMask groundMask
    // Size: 0x4
    // Offset: 0x40
    ::UnityEngine::LayerMask groundMask;
    // Field size check
    static_assert(sizeof(::UnityEngine::LayerMask) == 0x4);
    // private System.Single centerOffsetCompatibility
    // Size: 0x4
    // Offset: 0x44
    float centerOffsetCompatibility;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single repathRateCompatibility
    // Size: 0x4
    // Offset: 0x48
    float repathRateCompatibility;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean canSearchCompability
    // Size: 0x1
    // Offset: 0x4C
    bool canSearchCompability;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: canSearchCompability and: orientation
    char __padding8[0x3] = {};
    // public Pathfinding.OrientationMode orientation
    // Size: 0x4
    // Offset: 0x50
    ::Pathfinding::OrientationMode orientation;
    // Field size check
    static_assert(sizeof(::Pathfinding::OrientationMode) == 0x4);
    // public System.Boolean enableRotation
    // Size: 0x1
    // Offset: 0x54
    bool enableRotation;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: enableRotation and: simulatedPosition
    char __padding10[0x3] = {};
    // protected UnityEngine.Vector3 simulatedPosition
    // Size: 0xC
    // Offset: 0x58
    ::UnityEngine::Vector3 simulatedPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // protected UnityEngine.Quaternion simulatedRotation
    // Size: 0x10
    // Offset: 0x64
    ::UnityEngine::Quaternion simulatedRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.Vector3 accumulatedMovementDelta
    // Size: 0xC
    // Offset: 0x74
    ::UnityEngine::Vector3 accumulatedMovementDelta;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // protected UnityEngine.Vector2 velocity2D
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::Vector2 velocity2D;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // protected System.Single verticalVelocity
    // Size: 0x4
    // Offset: 0x88
    float verticalVelocity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: verticalVelocity and: seeker
    char __padding15[0x4] = {};
    // protected Pathfinding.Seeker seeker
    // Size: 0x8
    // Offset: 0x90
    ::Pathfinding::Seeker* seeker;
    // Field size check
    static_assert(sizeof(::Pathfinding::Seeker*) == 0x8);
    // protected UnityEngine.Transform tr
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::Transform* tr;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // protected UnityEngine.Rigidbody rigid
    // Size: 0x8
    // Offset: 0xA0
    ::UnityEngine::Rigidbody* rigid;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rigidbody*) == 0x8);
    // protected UnityEngine.Rigidbody2D rigid2D
    // Size: 0x8
    // Offset: 0xA8
    ::UnityEngine::Rigidbody2D* rigid2D;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rigidbody2D*) == 0x8);
    // protected UnityEngine.CharacterController controller
    // Size: 0x8
    // Offset: 0xB0
    ::UnityEngine::CharacterController* controller;
    // Field size check
    static_assert(sizeof(::UnityEngine::CharacterController*) == 0x8);
    // protected Pathfinding.RVO.RVOController rvoController
    // Size: 0x8
    // Offset: 0xB8
    ::Pathfinding::RVO::RVOController* rvoController;
    // Field size check
    static_assert(sizeof(::Pathfinding::RVO::RVOController*) == 0x8);
    // public Pathfinding.Util.IMovementPlane movementPlane
    // Size: 0x8
    // Offset: 0xC0
    ::Pathfinding::Util::IMovementPlane* movementPlane;
    // Field size check
    static_assert(sizeof(::Pathfinding::Util::IMovementPlane*) == 0x8);
    // public System.Boolean updatePosition
    // Size: 0x1
    // Offset: 0xC8
    bool updatePosition;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean updateRotation
    // Size: 0x1
    // Offset: 0xC9
    bool updateRotation;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: updateRotation and: autoRepath
    char __padding24[0x6] = {};
    // public Pathfinding.AutoRepathPolicy autoRepath
    // Size: 0x8
    // Offset: 0xD0
    ::Pathfinding::AutoRepathPolicy* autoRepath;
    // Field size check
    static_assert(sizeof(::Pathfinding::AutoRepathPolicy*) == 0x8);
    // private System.Boolean <usingGravity>k__BackingField
    // Size: 0x1
    // Offset: 0xD8
    bool usingGravity;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: usingGravity and: lastDeltaTime
    char __padding26[0x3] = {};
    // protected System.Single lastDeltaTime
    // Size: 0x4
    // Offset: 0xDC
    float lastDeltaTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Int32 prevFrame
    // Size: 0x4
    // Offset: 0xE0
    int prevFrame;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected UnityEngine.Vector3 prevPosition1
    // Size: 0xC
    // Offset: 0xE4
    ::UnityEngine::Vector3 prevPosition1;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // protected UnityEngine.Vector3 prevPosition2
    // Size: 0xC
    // Offset: 0xF0
    ::UnityEngine::Vector3 prevPosition2;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // protected UnityEngine.Vector2 lastDeltaPosition
    // Size: 0x8
    // Offset: 0xFC
    ::UnityEngine::Vector2 lastDeltaPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // protected System.Boolean waitingForPathCalculation
    // Size: 0x1
    // Offset: 0x104
    bool waitingForPathCalculation;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: waitingForPathCalculation and: targetCompatibility
    char __padding32[0x3] = {};
    // private UnityEngine.Transform targetCompatibility
    // Size: 0x8
    // Offset: 0x108
    ::UnityEngine::Transform* targetCompatibility;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private System.Boolean startHasRun
    // Size: 0x1
    // Offset: 0x110
    bool startHasRun;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: startHasRun and: destination
    char __padding34[0x3] = {};
    // private UnityEngine.Vector3 <destination>k__BackingField
    // Size: 0xC
    // Offset: 0x114
    ::UnityEngine::Vector3 destination;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Boolean <isStopped>k__BackingField
    // Size: 0x1
    // Offset: 0x120
    bool isStopped;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isStopped and: onSearchPath
    char __padding36[0x7] = {};
    // private System.Action <onSearchPath>k__BackingField
    // Size: 0x8
    // Offset: 0x128
    ::System::Action* onSearchPath;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    public:
    // Get static field: static public readonly UnityEngine.Color ShapeGizmoColor
    static ::UnityEngine::Color _get_ShapeGizmoColor();
    // Set static field: static public readonly UnityEngine.Color ShapeGizmoColor
    static void _set_ShapeGizmoColor(::UnityEngine::Color value);
    // Get instance field reference: public System.Single radius
    [[deprecated("Use field access instead!")]] float& dyn_radius();
    // Get instance field reference: public System.Single height
    [[deprecated("Use field access instead!")]] float& dyn_height();
    // Get instance field reference: public System.Boolean canMove
    [[deprecated("Use field access instead!")]] bool& dyn_canMove();
    // Get instance field reference: public System.Single maxSpeed
    [[deprecated("Use field access instead!")]] float& dyn_maxSpeed();
