// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Pathfinding.VersionedMonoBehaviour
#include "Pathfinding/VersionedMonoBehaviour.hpp"
// Including type: Pathfinding.IAstarAI
#include "Pathfinding/IAstarAI.hpp"
// Including type: Pathfinding.OrientationMode
#include "Pathfinding/OrientationMode.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Pathfinding
namespace Pathfinding {
  // Forward declaring type: AutoRepathPolicy
  class AutoRepathPolicy;
  // Forward declaring type: Seeker
  class Seeker;
  // Forward declaring type: ABPath
  class ABPath;
  // Forward declaring type: Path
  class Path;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
}
// Forward declaring namespace: Pathfinding::Util
namespace Pathfinding::Util {
  // Forward declaring type: PathInterpolator
  class PathInterpolator;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: Pathfinding
namespace Pathfinding {
  // Forward declaring type: AILerp
  class AILerp;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Pathfinding::AILerp);
DEFINE_IL2CPP_ARG_TYPE(::Pathfinding::AILerp*, "Pathfinding", "AILerp");
// Type namespace: Pathfinding
namespace Pathfinding {
  // Size: 0xED
  #pragma pack(push, 1)
  // Autogenerated type: Pathfinding.AILerp
  // [TokenAttribute] Offset: FFFFFFFF
  // [HelpURLAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: FFFFFFFF
  // [RequireComponent] Offset: FFFFFFFF
  class AILerp : public ::Pathfinding::VersionedMonoBehaviour/*, public ::Pathfinding::IAstarAI*/ {
    public:
    // Writing base type padding for base size: 0x24 to desired offset: 0x28
    char ___base_padding[0x4] = {};
    public:
    // public Pathfinding.AutoRepathPolicy autoRepath
    // Size: 0x8
    // Offset: 0x28
    ::Pathfinding::AutoRepathPolicy* autoRepath;
    // Field size check
    static_assert(sizeof(::Pathfinding::AutoRepathPolicy*) == 0x8);
    // public System.Boolean canMove
    // Size: 0x1
    // Offset: 0x30
    bool canMove;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: canMove and: speed
    char __padding1[0x3] = {};
    // public System.Single speed
    // Size: 0x4
    // Offset: 0x34
    float speed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public Pathfinding.OrientationMode orientation
    // Size: 0x4
    // Offset: 0x38
    ::Pathfinding::OrientationMode orientation;
    // Field size check
    static_assert(sizeof(::Pathfinding::OrientationMode) == 0x4);
    // public System.Boolean enableRotation
    // Size: 0x1
    // Offset: 0x3C
    bool enableRotation;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: enableRotation and: rotationSpeed
    char __padding4[0x3] = {};
    // public System.Single rotationSpeed
    // Size: 0x4
    // Offset: 0x40
    float rotationSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean interpolatePathSwitches
    // Size: 0x1
    // Offset: 0x44
    bool interpolatePathSwitches;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: interpolatePathSwitches and: switchPathInterpolationSpeed
    char __padding6[0x3] = {};
    // public System.Single switchPathInterpolationSpeed
    // Size: 0x4
    // Offset: 0x48
    float switchPathInterpolationSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean <reachedEndOfPath>k__BackingField
    // Size: 0x1
    // Offset: 0x4C
    bool reachedEndOfPath;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: reachedEndOfPath and: destination
    char __padding8[0x3] = {};
    // private UnityEngine.Vector3 <destination>k__BackingField
    // Size: 0xC
    // Offset: 0x50
    ::UnityEngine::Vector3 destination;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public System.Boolean updatePosition
    // Size: 0x1
    // Offset: 0x5C
    bool updatePosition;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean updateRotation
    // Size: 0x1
    // Offset: 0x5D
    bool updateRotation;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <isStopped>k__BackingField
    // Size: 0x1
    // Offset: 0x5E
    bool isStopped;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isStopped and: onSearchPath
    char __padding12[0x1] = {};
    // private System.Action <onSearchPath>k__BackingField
    // Size: 0x8
    // Offset: 0x60
    ::System::Action* onSearchPath;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // protected Pathfinding.Seeker seeker
    // Size: 0x8
    // Offset: 0x68
    ::Pathfinding::Seeker* seeker;
    // Field size check
    static_assert(sizeof(::Pathfinding::Seeker*) == 0x8);
    // protected UnityEngine.Transform tr
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::Transform* tr;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // protected Pathfinding.ABPath path
    // Size: 0x8
    // Offset: 0x78
    ::Pathfinding::ABPath* path;
    // Field size check
    static_assert(sizeof(::Pathfinding::ABPath*) == 0x8);
    // protected System.Boolean canSearchAgain
    // Size: 0x1
    // Offset: 0x80
    bool canSearchAgain;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: canSearchAgain and: previousMovementOrigin
    char __padding17[0x3] = {};
    // protected UnityEngine.Vector3 previousMovementOrigin
    // Size: 0xC
    // Offset: 0x84
    ::UnityEngine::Vector3 previousMovementOrigin;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // protected UnityEngine.Vector3 previousMovementDirection
    // Size: 0xC
    // Offset: 0x90
    ::UnityEngine::Vector3 previousMovementDirection;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // protected System.Single pathSwitchInterpolationTime
    // Size: 0x4
    // Offset: 0x9C
    float pathSwitchInterpolationTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected Pathfinding.Util.PathInterpolator interpolator
    // Size: 0x8
    // Offset: 0xA0
    ::Pathfinding::Util::PathInterpolator* interpolator;
    // Field size check
    static_assert(sizeof(::Pathfinding::Util::PathInterpolator*) == 0x8);
    // private System.Boolean startHasRun
    // Size: 0x1
    // Offset: 0xA8
    bool startHasRun;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: startHasRun and: previousPosition1
    char __padding22[0x3] = {};
    // private UnityEngine.Vector3 previousPosition1
    // Size: 0xC
    // Offset: 0xAC
    ::UnityEngine::Vector3 previousPosition1;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 previousPosition2
    // Size: 0xC
    // Offset: 0xB8
    ::UnityEngine::Vector3 previousPosition2;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 simulatedPosition
    // Size: 0xC
    // Offset: 0xC4
    ::UnityEngine::Vector3 simulatedPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Quaternion simulatedRotation
    // Size: 0x10
    // Offset: 0xD0
    ::UnityEngine::Quaternion simulatedRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.Transform targetCompatibility
    // Size: 0x8
    // Offset: 0xE0
    ::UnityEngine::Transform* targetCompatibility;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private System.Single repathRateCompatibility
    // Size: 0x4
    // Offset: 0xE8
    float repathRateCompatibility;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean canSearchCompability
    // Size: 0x1
    // Offset: 0xEC
    bool canSearchCompability;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating interface conversion operator: operator ::Pathfinding::IAstarAI
    operator ::Pathfinding::IAstarAI() noexcept {
      return *reinterpret_cast<::Pathfinding::IAstarAI*>(this);
    }
    // Get instance field reference: public Pathfinding.AutoRepathPolicy autoRepath
    [[deprecated("Use field access instead!")]] ::Pathfinding::AutoRepathPolicy*& dyn_autoRepath();
    // Get instance field reference: public System.Boolean canMove
    [[deprecated("Use field access instead!")]] bool& dyn_canMove();
    // Get instance field reference: public System.Single speed
    [[deprecated("Use field access instead!")]] float& dyn_speed();
    // Get instance field reference: public Pathfinding.OrientationMode orientation
    [[deprecated("Use field access instead!")]] ::Pathfinding::OrientationMode& dyn_orientation();
