// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Pathfinding.AIBase
#include "Pathfinding/AIBase.hpp"
// Including type: Pathfinding.IAstarAI
#include "Pathfinding/IAstarAI.hpp"
// Including type: Pathfinding.CloseToDestinationMode
#include "Pathfinding/CloseToDestinationMode.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Pathfinding
namespace Pathfinding {
  // Forward declaring type: Path
  class Path;
  // Forward declaring type: NNConstraint
  class NNConstraint;
}
// Forward declaring namespace: Pathfinding::Util
namespace Pathfinding::Util {
  // Forward declaring type: PathInterpolator
  class PathInterpolator;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Skipping declaration: Quaternion because it is already included!
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: Pathfinding
namespace Pathfinding {
  // Forward declaring type: AIPath
  class AIPath;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Pathfinding::AIPath);
DEFINE_IL2CPP_ARG_TYPE(::Pathfinding::AIPath*, "Pathfinding", "AIPath");
// Type namespace: Pathfinding
namespace Pathfinding {
  // Size: 0x161
  #pragma pack(push, 1)
  // Autogenerated type: Pathfinding.AIPath
  // [TokenAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: FFFFFFFF
  class AIPath : public ::Pathfinding::AIBase/*, public ::Pathfinding::IAstarAI*/ {
    public:
    public:
    // public System.Single maxAcceleration
    // Size: 0x4
    // Offset: 0x130
    float maxAcceleration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single rotationSpeed
    // Size: 0x4
    // Offset: 0x134
    float rotationSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single slowdownDistance
    // Size: 0x4
    // Offset: 0x138
    float slowdownDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single pickNextWaypointDist
    // Size: 0x4
    // Offset: 0x13C
    float pickNextWaypointDist;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single endReachedDistance
    // Size: 0x4
    // Offset: 0x140
    float endReachedDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean alwaysDrawGizmos
    // Size: 0x1
    // Offset: 0x144
    bool alwaysDrawGizmos;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean slowWhenNotFacingTarget
    // Size: 0x1
    // Offset: 0x145
    bool slowWhenNotFacingTarget;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: slowWhenNotFacingTarget and: whenCloseToDestination
    char __padding6[0x2] = {};
    // public Pathfinding.CloseToDestinationMode whenCloseToDestination
    // Size: 0x4
    // Offset: 0x148
    ::Pathfinding::CloseToDestinationMode whenCloseToDestination;
    // Field size check
    static_assert(sizeof(::Pathfinding::CloseToDestinationMode) == 0x4);
    // public System.Boolean constrainInsideGraph
    // Size: 0x1
    // Offset: 0x14C
    bool constrainInsideGraph;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: constrainInsideGraph and: path
    char __padding8[0x3] = {};
    // protected Pathfinding.Path path
    // Size: 0x8
    // Offset: 0x150
    ::Pathfinding::Path* path;
    // Field size check
    static_assert(sizeof(::Pathfinding::Path*) == 0x8);
    // protected Pathfinding.Util.PathInterpolator interpolator
    // Size: 0x8
    // Offset: 0x158
    ::Pathfinding::Util::PathInterpolator* interpolator;
    // Field size check
    static_assert(sizeof(::Pathfinding::Util::PathInterpolator*) == 0x8);
    // private System.Boolean <reachedEndOfPath>k__BackingField
    // Size: 0x1
    // Offset: 0x160
    bool reachedEndOfPath;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating interface conversion operator: operator ::Pathfinding::IAstarAI
    operator ::Pathfinding::IAstarAI() noexcept {
      return *reinterpret_cast<::Pathfinding::IAstarAI*>(this);
    }
    // Get static field: static private Pathfinding.NNConstraint cachedNNConstraint
    static ::Pathfinding::NNConstraint* _get_cachedNNConstraint();
    // Set static field: static private Pathfinding.NNConstraint cachedNNConstraint
    static void _set_cachedNNConstraint(::Pathfinding::NNConstraint* value);
    // Get instance field reference: public System.Single maxAcceleration
    [[deprecated("Use field access instead!")]] float& dyn_maxAcceleration();
    // Get instance field reference: public System.Single rotationSpeed
    [[deprecated("Use field access instead!")]] float& dyn_rotationSpeed();
