// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Pathfinding.MonoModifier
#include "Pathfinding/MonoModifier.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: Pathfinding
namespace Pathfinding {
  // Forward declaring type: GraphNode
  class GraphNode;
  // Forward declaring type: Path
  class Path;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Random
  class Random;
}
// Completed forward declares
// Type namespace: Pathfinding
namespace Pathfinding {
  // Forward declaring type: AlternativePath
  class AlternativePath;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Pathfinding::AlternativePath);
DEFINE_IL2CPP_ARG_TYPE(::Pathfinding::AlternativePath*, "Pathfinding", "AlternativePath");
// Type namespace: Pathfinding
namespace Pathfinding {
  // Size: 0x51
  #pragma pack(push, 1)
  // Autogenerated type: Pathfinding.AlternativePath
  // [TokenAttribute] Offset: FFFFFFFF
  // [HelpURLAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: FFFFFFFF
  class AlternativePath : public ::Pathfinding::MonoModifier {
    public:
    public:
    // public System.Int32 penalty
    // Size: 0x4
    // Offset: 0x30
    int penalty;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 randomStep
    // Size: 0x4
    // Offset: 0x34
    int randomStep;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Collections.Generic.List`1<Pathfinding.GraphNode> prevNodes
    // Size: 0x8
    // Offset: 0x38
    ::System::Collections::Generic::List_1<::Pathfinding::GraphNode*>* prevNodes;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Pathfinding::GraphNode*>*) == 0x8);
    // private System.Int32 prevPenalty
    // Size: 0x4
    // Offset: 0x40
    int prevPenalty;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: prevPenalty and: rnd
    char __padding3[0x4] = {};
    // private readonly System.Random rnd
    // Size: 0x8
    // Offset: 0x48
    ::System::Random* rnd;
    // Field size check
    static_assert(sizeof(::System::Random*) == 0x8);
    // private System.Boolean destroyed
    // Size: 0x1
    // Offset: 0x50
    bool destroyed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get instance field reference: public System.Int32 penalty
    [[deprecated("Use field access instead!")]] int& dyn_penalty();
    // Get instance field reference: public System.Int32 randomStep
    [[deprecated("Use field access instead!")]] int& dyn_randomStep();
    // Get instance field reference: private System.Collections.Generic.List`1<Pathfinding.GraphNode> prevNodes
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::Pathfinding::GraphNode*>*& dyn_prevNodes();
    // Get instance field reference: private System.Int32 prevPenalty
    [[deprecated("Use field access instead!")]] int& dyn_prevPenalty();
    // Get instance field reference: private readonly System.Random rnd
    [[deprecated("Use field access instead!")]] ::System::Random*& dyn_rnd();
    // Get instance field reference: private System.Boolean destroyed
    [[deprecated("Use field access instead!")]] bool& dyn_destroyed();
    // protected System.Void OnDestroy()
    // Offset: 0x29F23D0
    void OnDestroy();
    // private System.Void ClearOnDestroy()
    // Offset: 0x29F23DC
    void ClearOnDestroy();
    // private System.Void InversePrevious()
    // Offset: 0x29F23E0
    void InversePrevious();
    // private System.Void ApplyNow(System.Collections.Generic.List`1<Pathfinding.GraphNode> nodes)
    // Offset: 0x29F21FC
    void ApplyNow(::System::Collections::Generic::List_1<::Pathfinding::GraphNode*>* nodes);
    // public override System.Int32 get_Order()
    // Offset: 0x29F2164
    // Implemented from: Pathfinding.MonoModifier
    // Base method: System.Int32 MonoModifier::get_Order()
    int get_Order();
    // public override System.Void Apply(Pathfinding.Path p)
    // Offset: 0x29F216C
    // Implemented from: Pathfinding.MonoModifier
    // Base method: System.Void MonoModifier::Apply(Pathfinding.Path p)
    void Apply(::Pathfinding::Path* p);
    // public System.Void .ctor()
    // Offset: 0x29F2540
    // Implemented from: Pathfinding.MonoModifier
    // Base method: System.Void MonoModifier::.ctor()
    // Base method: System.Void VersionedMonoBehaviour::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static AlternativePath* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::Pathfinding::AlternativePath::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<AlternativePath*, creationType>()));
    }
  }; // Pathfinding.AlternativePath
  #pragma pack(pop)
  static check_size<sizeof(AlternativePath), 80 + sizeof(bool)> __Pathfinding_AlternativePathSizeCheck;
  static_assert(sizeof(AlternativePath) == 0x51);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Pathfinding::AlternativePath::OnDestroy
// Il2CppName: OnDestroy
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Pathfinding::AlternativePath::*)()>(&Pathfinding::AlternativePath::OnDestroy)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Pathfinding::AlternativePath*), "OnDestroy", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Pathfinding::AlternativePath::ClearOnDestroy
// Il2CppName: ClearOnDestroy
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Pathfinding::AlternativePath::*)()>(&Pathfinding::AlternativePath::ClearOnDestroy)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Pathfinding::AlternativePath*), "ClearOnDestroy", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Pathfinding::AlternativePath::InversePrevious
// Il2CppName: InversePrevious
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Pathfinding::AlternativePath::*)()>(&Pathfinding::AlternativePath::InversePrevious)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Pathfinding::AlternativePath*), "InversePrevious", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Pathfinding::AlternativePath::ApplyNow
// Il2CppName: ApplyNow
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Pathfinding::AlternativePath::*)(::System::Collections::Generic::List_1<::Pathfinding::GraphNode*>*)>(&Pathfinding::AlternativePath::ApplyNow)> {
  static const MethodInfo* get() {
    static auto* nodes = &::il2cpp_utils::MakeGeneric(::il2cpp_utils::GetClassFromName("System.Collections.Generic", "List`1"), ::std::vector<const Il2CppClass*>{::il2cpp_utils::GetClassFromName("Pathfinding", "GraphNode")})->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Pathfinding::AlternativePath*), "ApplyNow", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{nodes});
  }
};
// Writing MetadataGetter for method: Pathfinding::AlternativePath::get_Order
// Il2CppName: get_Order
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<int (Pathfinding::AlternativePath::*)()>(&Pathfinding::AlternativePath::get_Order)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Pathfinding::AlternativePath*), "get_Order", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Pathfinding::AlternativePath::Apply
// Il2CppName: Apply
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Pathfinding::AlternativePath::*)(::Pathfinding::Path*)>(&Pathfinding::AlternativePath::Apply)> {
  static const MethodInfo* get() {
    static auto* p = &::il2cpp_utils::GetClassFromName("Pathfinding", "Path")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Pathfinding::AlternativePath*), "Apply", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{p});
  }
};
// Writing MetadataGetter for method: Pathfinding::AlternativePath::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
