// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Pathfinding.PathProcessor
#include "Pathfinding/PathProcessor.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Pathfinding
namespace Pathfinding {
  // Forward declaring type: NavMeshGraph
  class NavMeshGraph;
  // Forward declaring type: GridGraph
  class GridGraph;
  // Forward declaring type: LayerGridGraph
  class LayerGridGraph;
  // Forward declaring type: PointGraph
  class PointGraph;
  // Forward declaring type: RecastGraph
  class RecastGraph;
  // Forward declaring type: NavGraph
  class NavGraph;
  // Forward declaring type: GraphNode
  class GraphNode;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Type
  class Type;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Func`2<T, TResult>
  template<typename T, typename TResult>
  class Func_2;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: TextAsset
  class TextAsset;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: AstarPath
  class AstarPath;
}
// Forward declaring namespace: Pathfinding::Serialization
namespace Pathfinding::Serialization {
  // Forward declaring type: SerializeSettings
  class SerializeSettings;
  // Forward declaring type: AstarSerializer
  class AstarSerializer;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerable
  class IEnumerable;
}
// Completed forward declares
// Type namespace: Pathfinding
namespace Pathfinding {
  // Forward declaring type: AstarData
  class AstarData;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Pathfinding::AstarData);
DEFINE_IL2CPP_ARG_TYPE(::Pathfinding::AstarData*, "Pathfinding", "AstarData");
// Type namespace: Pathfinding
namespace Pathfinding {
  // Size: 0x78
  #pragma pack(push, 1)
  // Autogenerated type: Pathfinding.AstarData
  // [TokenAttribute] Offset: FFFFFFFF
  class AstarData : public ::Il2CppObject {
    public:
    // Nested type: ::Pathfinding::AstarData::$$c__DisplayClass53_0
    class $$c__DisplayClass53_0;
    // Nested type: ::Pathfinding::AstarData::$$c__DisplayClass64_0
    class $$c__DisplayClass64_0;
    // Nested type: ::Pathfinding::AstarData::$$c__DisplayClass65_0
    class $$c__DisplayClass65_0;
    // Nested type: ::Pathfinding::AstarData::$FindGraphsOfType$d__66
    class $FindGraphsOfType$d__66;
    // Nested type: ::Pathfinding::AstarData::$GetRaycastableGraphs$d__68
    class $GetRaycastableGraphs$d__68;
    // Nested type: ::Pathfinding::AstarData::$GetUpdateableGraphs$d__67
    class $GetUpdateableGraphs$d__67;
    public:
    // private Pathfinding.NavMeshGraph <navmesh>k__BackingField
    // Size: 0x8
    // Offset: 0x10
    ::Pathfinding::NavMeshGraph* navmesh;
    // Field size check
    static_assert(sizeof(::Pathfinding::NavMeshGraph*) == 0x8);
    // private Pathfinding.GridGraph <gridGraph>k__BackingField
    // Size: 0x8
    // Offset: 0x18
    ::Pathfinding::GridGraph* gridGraph;
    // Field size check
    static_assert(sizeof(::Pathfinding::GridGraph*) == 0x8);
    // private Pathfinding.LayerGridGraph <layerGridGraph>k__BackingField
    // Size: 0x8
    // Offset: 0x20
    ::Pathfinding::LayerGridGraph* layerGridGraph;
    // Field size check
    static_assert(sizeof(::Pathfinding::LayerGridGraph*) == 0x8);
    // private Pathfinding.PointGraph <pointGraph>k__BackingField
    // Size: 0x8
    // Offset: 0x28
    ::Pathfinding::PointGraph* pointGraph;
    // Field size check
    static_assert(sizeof(::Pathfinding::PointGraph*) == 0x8);
    // private Pathfinding.RecastGraph <recastGraph>k__BackingField
    // Size: 0x8
    // Offset: 0x30
    ::Pathfinding::RecastGraph* recastGraph;
    // Field size check
    static_assert(sizeof(::Pathfinding::RecastGraph*) == 0x8);
    // private System.Type[] <graphTypes>k__BackingField
    // Size: 0x8
    // Offset: 0x38
    ::ArrayW<::System::Type*> graphTypes;
    // Field size check
    static_assert(sizeof(::ArrayW<::System::Type*>) == 0x8);
    // public Pathfinding.NavGraph[] graphs
    // Size: 0x8
    // Offset: 0x40
    ::ArrayW<::Pathfinding::NavGraph*> graphs;
    // Field size check
    static_assert(sizeof(::ArrayW<::Pathfinding::NavGraph*>) == 0x8);
    // private System.String dataString
    // Size: 0x8
    // Offset: 0x48
    ::StringW dataString;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Byte[] upgradeData
    // Size: 0x8
    // Offset: 0x50
    ::ArrayW<uint8_t> upgradeData;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // public UnityEngine.TextAsset file_cachedStartup
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::TextAsset* file_cachedStartup;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextAsset*) == 0x8);
    // public System.Byte[] data_cachedStartup
    // Size: 0x8
    // Offset: 0x60
    ::ArrayW<uint8_t> data_cachedStartup;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // public System.Boolean cacheStartup
    // Size: 0x1
    // Offset: 0x68
    bool cacheStartup;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: cacheStartup and: graphStructureLocked
    char __padding11[0x7] = {};
    // private System.Collections.Generic.List`1<System.Boolean> graphStructureLocked
    // Size: 0x8
    // Offset: 0x70
    ::System::Collections::Generic::List_1<bool>* graphStructureLocked;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<bool>*) == 0x8);
    public:
    // Get instance field reference: private Pathfinding.NavMeshGraph <navmesh>k__BackingField
    [[deprecated("Use field access instead!")]] ::Pathfinding::NavMeshGraph*& dyn_$navmesh$k__BackingField();
    // Get instance field reference: private Pathfinding.GridGraph <gridGraph>k__BackingField
    [[deprecated("Use field access instead!")]] ::Pathfinding::GridGraph*& dyn_$gridGraph$k__BackingField();
    // Get instance field reference: private Pathfinding.LayerGridGraph <layerGridGraph>k__BackingField
    [[deprecated("Use field access instead!")]] ::Pathfinding::LayerGridGraph*& dyn_$layerGridGraph$k__BackingField();
    // Get instance field reference: private Pathfinding.PointGraph <pointGraph>k__BackingField
