// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Pathfinding.Util.IAstarPooledObject
#include "Pathfinding/Util/IAstarPooledObject.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
// Including type: Pathfinding.IntRect
#include "Pathfinding/IntRect.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Pathfinding
namespace Pathfinding {
  // Forward declaring type: TriangleMeshNode
  class TriangleMeshNode;
  // Forward declaring type: NNInfoInternal
  struct NNInfoInternal;
  // Forward declaring type: NNConstraint
  class NNConstraint;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Rect
  struct Rect;
  // Forward declaring type: Color
  struct Color;
  // Forward declaring type: Vector3
  struct Vector3;
}
// Completed forward declares
// Type namespace: Pathfinding
namespace Pathfinding {
  // Forward declaring type: BBTree
  class BBTree;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Pathfinding::BBTree);
DEFINE_IL2CPP_ARG_TYPE(::Pathfinding::BBTree*, "Pathfinding", "BBTree");
// Type namespace: Pathfinding
namespace Pathfinding {
  // Size: 0x28
  #pragma pack(push, 1)
  // Autogenerated type: Pathfinding.BBTree
  // [TokenAttribute] Offset: FFFFFFFF
  class BBTree : public ::Il2CppObject/*, public ::Pathfinding::Util::IAstarPooledObject*/ {
    public:
    // Nested type: ::Pathfinding::BBTree::BBTreeBox
    struct BBTreeBox;
    // Size: 0x1C
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: Pathfinding.BBTree/BBTreeBox
    // [TokenAttribute] Offset: FFFFFFFF
    struct BBTreeBox/*, public ::System::ValueType*/ {
      public:
      public:
      // public Pathfinding.IntRect rect
      // Size: 0x10
      // Offset: 0x0
      ::Pathfinding::IntRect rect;
      // Field size check
      static_assert(sizeof(::Pathfinding::IntRect) == 0x10);
      // public System.Int32 nodeOffset
      // Size: 0x4
      // Offset: 0x10
      int nodeOffset;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Int32 left
      // Size: 0x4
      // Offset: 0x14
      int left;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Int32 right
      // Size: 0x4
      // Offset: 0x18
      int right;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: BBTreeBox
      constexpr BBTreeBox(::Pathfinding::IntRect rect_ = {}, int nodeOffset_ = {}, int left_ = {}, int right_ = {}) noexcept : rect{rect_}, nodeOffset{nodeOffset_}, left{left_}, right{right_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public Pathfinding.IntRect rect
      [[deprecated("Use field access instead!")]] ::Pathfinding::IntRect& dyn_rect();
      // Get instance field reference: public System.Int32 nodeOffset
      [[deprecated("Use field access instead!")]] int& dyn_nodeOffset();
      // Get instance field reference: public System.Int32 left
      [[deprecated("Use field access instead!")]] int& dyn_left();
      // Get instance field reference: public System.Int32 right
      [[deprecated("Use field access instead!")]] int& dyn_right();
      // public System.Boolean get_IsLeaf()
      // Offset: 0x29E70E8
      bool get_IsLeaf();
      // public System.Void .ctor(Pathfinding.IntRect rect)
      // Offset: 0x29E606C
      BBTreeBox(::Pathfinding::IntRect rect);
      // public System.Void .ctor(System.Int32 nodeOffset, Pathfinding.IntRect rect)
      // Offset: 0x29E79FC
      BBTreeBox(int nodeOffset, ::Pathfinding::IntRect rect);
      // public System.Boolean Contains(UnityEngine.Vector3 point)
      // Offset: 0x29E7490
      bool Contains(::UnityEngine::Vector3 point);
    }; // Pathfinding.BBTree/BBTreeBox
    #pragma pack(pop)
    static check_size<sizeof(BBTree::BBTreeBox), 24 + sizeof(int)> __Pathfinding_BBTree_BBTreeBoxSizeCheck;
    static_assert(sizeof(BBTree::BBTreeBox) == 0x1C);
    public:
    // private Pathfinding.BBTree/BBTreeBox[] tree
    // Size: 0x8
    // Offset: 0x10
    ::ArrayW<::Pathfinding::BBTree::BBTreeBox> tree;
    // Field size check
    static_assert(sizeof(::ArrayW<::Pathfinding::BBTree::BBTreeBox>) == 0x8);
    // private Pathfinding.TriangleMeshNode[] nodeLookup
    // Size: 0x8
    // Offset: 0x18
    ::ArrayW<::Pathfinding::TriangleMeshNode*> nodeLookup;
    // Field size check
    static_assert(sizeof(::ArrayW<::Pathfinding::TriangleMeshNode*>) == 0x8);
    // private System.Int32 count
    // Size: 0x4
    // Offset: 0x20
    int count;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 leafNodes
    // Size: 0x4
    // Offset: 0x24
    int leafNodes;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Creating interface conversion operator: operator ::Pathfinding::Util::IAstarPooledObject
    operator ::Pathfinding::Util::IAstarPooledObject() noexcept {
      return *reinterpret_cast<::Pathfinding::Util::IAstarPooledObject*>(this);
    }
    // static field const value: static private System.Int32 MaximumLeafSize
    static constexpr const int MaximumLeafSize = 4;
    // Get static field: static private System.Int32 MaximumLeafSize
    static int _get_MaximumLeafSize();
    // Set static field: static private System.Int32 MaximumLeafSize
    static void _set_MaximumLeafSize(int value);
    // Get instance field reference: private Pathfinding.BBTree/BBTreeBox[] tree
    [[deprecated("Use field access instead!")]] ::ArrayW<::Pathfinding::BBTree::BBTreeBox>& dyn_tree();
    // Get instance field reference: private Pathfinding.TriangleMeshNode[] nodeLookup
