// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Pathfinding.GraphUtilities
#include "Pathfinding/GraphUtilities.hpp"
// Including type: Pathfinding.Int3
#include "Pathfinding/Int3.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: HashSet`1<T>
  template<typename T>
  class HashSet_1;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
}
// Forward declaring namespace: Pathfinding
namespace Pathfinding {
  // Forward declaring type: GraphNode
  class GraphNode;
}
// Completed forward declares
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Pathfinding::GraphUtilities::$$c__DisplayClass1_0);
DEFINE_IL2CPP_ARG_TYPE(::Pathfinding::GraphUtilities::$$c__DisplayClass1_0*, "Pathfinding", "GraphUtilities/<>c__DisplayClass1_0");
// Type namespace: Pathfinding
namespace Pathfinding {
  // Size: 0x38
  #pragma pack(push, 1)
  // Autogenerated type: Pathfinding.GraphUtilities/<>c__DisplayClass1_0
  // [TokenAttribute] Offset: FFFFFFFF
  // [CompilerGeneratedAttribute] Offset: FFFFFFFF
  class GraphUtilities::$$c__DisplayClass1_0 : public ::Il2CppObject {
    public:
    public:
    // public System.Boolean[] uses
    // Size: 0x8
    // Offset: 0x10
    ::ArrayW<bool> uses;
    // Field size check
    static_assert(sizeof(::ArrayW<bool>) == 0x8);
    // public System.Collections.Generic.Dictionary`2<System.Int32,System.Int32> outline
    // Size: 0x8
    // Offset: 0x18
    ::System::Collections::Generic::Dictionary_2<int, int>* outline;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<int, int>*) == 0x8);
    // public System.Collections.Generic.HashSet`1<System.Int32> hasInEdge
    // Size: 0x8
    // Offset: 0x20
    ::System::Collections::Generic::HashSet_1<int>* hasInEdge;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::HashSet_1<int>*) == 0x8);
    // public System.Collections.Generic.Dictionary`2<System.Int32,Pathfinding.Int3> vertexPositions
    // Size: 0x8
    // Offset: 0x28
    ::System::Collections::Generic::Dictionary_2<int, ::Pathfinding::Int3>* vertexPositions;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<int, ::Pathfinding::Int3>*) == 0x8);
    // public System.Action`2<System.Collections.Generic.List`1<Pathfinding.Int3>,System.Boolean> results
    // Size: 0x8
    // Offset: 0x30
    ::System::Action_2<::System::Collections::Generic::List_1<::Pathfinding::Int3>*, bool>* results;
    // Field size check
    static_assert(sizeof(::System::Action_2<::System::Collections::Generic::List_1<::Pathfinding::Int3>*, bool>*) == 0x8);
    public:
    // Get instance field reference: public System.Boolean[] uses
    [[deprecated("Use field access instead!")]] ::ArrayW<bool>& dyn_uses();
    // Get instance field reference: public System.Collections.Generic.Dictionary`2<System.Int32,System.Int32> outline
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::Dictionary_2<int, int>*& dyn_outline();
    // Get instance field reference: public System.Collections.Generic.HashSet`1<System.Int32> hasInEdge
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::HashSet_1<int>*& dyn_hasInEdge();
    // Get instance field reference: public System.Collections.Generic.Dictionary`2<System.Int32,Pathfinding.Int3> vertexPositions
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::Dictionary_2<int, ::Pathfinding::Int3>*& dyn_vertexPositions();
    // Get instance field reference: public System.Action`2<System.Collections.Generic.List`1<Pathfinding.Int3>,System.Boolean> results
    [[deprecated("Use field access instead!")]] ::System::Action_2<::System::Collections::Generic::List_1<::Pathfinding::Int3>*, bool>*& dyn_results();
    // public System.Void .ctor()
    // Offset: 0x29AB650
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static GraphUtilities::$$c__DisplayClass1_0* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::Pathfinding::GraphUtilities::$$c__DisplayClass1_0::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<GraphUtilities::$$c__DisplayClass1_0*, creationType>()));
    }
    // System.Void <GetContours>b__0(Pathfinding.GraphNode _node)
    // Offset: 0x29AB9E8
    void $GetContours$b__0(::Pathfinding::GraphNode* _node);
    // System.Void <GetContours>b__1(System.Collections.Generic.List`1<System.Int32> chain, System.Boolean cycle)
    // Offset: 0x29ABCA4
    void $GetContours$b__1(::System::Collections::Generic::List_1<int>* chain, bool cycle);
  }; // Pathfinding.GraphUtilities/<>c__DisplayClass1_0
  #pragma pack(pop)
  static check_size<sizeof(GraphUtilities::$$c__DisplayClass1_0), 48 + sizeof(::System::Action_2<::System::Collections::Generic::List_1<::Pathfinding::Int3>*, bool>*)> __Pathfinding_GraphUtilities_$$c__DisplayClass1_0SizeCheck;
  static_assert(sizeof(GraphUtilities::$$c__DisplayClass1_0) == 0x38);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Pathfinding::GraphUtilities::$$c__DisplayClass1_0::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: Pathfinding::GraphUtilities::$$c__DisplayClass1_0::$GetContours$b__0
// Il2CppName: <GetContours>b__0
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Pathfinding::GraphUtilities::$$c__DisplayClass1_0::*)(::Pathfinding::GraphNode*)>(&Pathfinding::GraphUtilities::$$c__DisplayClass1_0::$GetContours$b__0)> {
  static const MethodInfo* get() {
    static auto* _node = &::il2cpp_utils::GetClassFromName("Pathfinding", "GraphNode")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Pathfinding::GraphUtilities::$$c__DisplayClass1_0*), "<GetContours>b__0", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{_node});
  }
};
// Writing MetadataGetter for method: Pathfinding::GraphUtilities::$$c__DisplayClass1_0::$GetContours$b__1
// Il2CppName: <GetContours>b__1
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Pathfinding::GraphUtilities::$$c__DisplayClass1_0::*)(::System::Collections::Generic::List_1<int>*, bool)>(&Pathfinding::GraphUtilities::$$c__DisplayClass1_0::$GetContours$b__1)> {
  static const MethodInfo* get() {
    static auto* chain = &::il2cpp_utils::MakeGeneric(::il2cpp_utils::GetClassFromName("System.Collections.Generic", "List`1"), ::std::vector<const Il2CppClass*>{::il2cpp_utils::GetClassFromName("System", "Int32")})->byval_arg;
    static auto* cycle = &::il2cpp_utils::GetClassFromName("System", "Boolean")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Pathfinding::GraphUtilities::$$c__DisplayClass1_0*), "<GetContours>b__1", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{chain, cycle});
  }
};
