// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Pathfinding.GridGraph
#include "Pathfinding/GridGraph.hpp"
// Including type: UnityEngine.RaycastHit
#include "UnityEngine/RaycastHit.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Pathfinding
namespace Pathfinding {
  // Forward declaring type: GridNodeBase
  class GridNodeBase;
  // Forward declaring type: GraphUpdateObject
  class GraphUpdateObject;
  // Forward declaring type: GraphCollision
  class GraphCollision;
  // Forward declaring type: LevelGridNode
  class LevelGridNode;
  // Forward declaring type: NNConstraint
  class NNConstraint;
  // Forward declaring type: GraphNode
  class GraphNode;
  // Forward declaring type: GraphUpdateShape
  class GraphUpdateShape;
  // Forward declaring type: IntRect
  struct IntRect;
  // Forward declaring type: NNInfoInternal
  struct NNInfoInternal;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: IEnumerable`1<T>
  template<typename T>
  class IEnumerable_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Bounds
  struct Bounds;
}
// Forward declaring namespace: Pathfinding::Serialization
namespace Pathfinding::Serialization {
  // Forward declaring type: GraphSerializationContext
  class GraphSerializationContext;
}
// Completed forward declares
// Type namespace: Pathfinding
namespace Pathfinding {
  // Forward declaring type: LayerGridGraph
  class LayerGridGraph;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Pathfinding::LayerGridGraph);
DEFINE_IL2CPP_ARG_TYPE(::Pathfinding::LayerGridGraph*, "Pathfinding", "LayerGridGraph");
// Type namespace: Pathfinding
namespace Pathfinding {
  // Size: 0x1A4
  #pragma pack(push, 1)
  // Autogenerated type: Pathfinding.LayerGridGraph
  // [TokenAttribute] Offset: FFFFFFFF
  // [PreserveAttribute] Offset: FFFFFFFF
  class LayerGridGraph : public ::Pathfinding::GridGraph {
    public:
    // Nested type: ::Pathfinding::LayerGridGraph::HeightSample
    struct HeightSample;
    // Nested type: ::Pathfinding::LayerGridGraph::HitComparer
    class HitComparer;
    // Nested type: ::Pathfinding::LayerGridGraph::$ScanInternal$d__19
    class $ScanInternal$d__19;
    // Size: 0x3D
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: Pathfinding.LayerGridGraph/HeightSample
    // [TokenAttribute] Offset: FFFFFFFF
    struct HeightSample/*, public ::System::ValueType*/ {
      public:
      public:
      // public UnityEngine.Vector3 position
      // Size: 0xC
      // Offset: 0x0
      ::UnityEngine::Vector3 position;
      // Field size check
      static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
      // public UnityEngine.RaycastHit hit
      // Size: 0x2C
      // Offset: 0xC
      ::UnityEngine::RaycastHit hit;
      // Field size check
      static_assert(sizeof(::UnityEngine::RaycastHit) == 0x2C);
      // public System.Single height
      // Size: 0x4
      // Offset: 0x38
      float height;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Boolean walkable
      // Size: 0x1
      // Offset: 0x3C
      bool walkable;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      public:
      // Creating value type constructor for type: HeightSample
      constexpr HeightSample(::UnityEngine::Vector3 position_ = {}, ::UnityEngine::RaycastHit hit_ = {}, float height_ = {}, bool walkable_ = {}) noexcept : position{position_}, hit{hit_}, height{height_}, walkable{walkable_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public UnityEngine.Vector3 position
      [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_position();
      // Get instance field reference: public UnityEngine.RaycastHit hit
      [[deprecated("Use field access instead!")]] ::UnityEngine::RaycastHit& dyn_hit();
      // Get instance field reference: public System.Single height
      [[deprecated("Use field access instead!")]] float& dyn_height();
      // Get instance field reference: public System.Boolean walkable
      [[deprecated("Use field access instead!")]] bool& dyn_walkable();
    }; // Pathfinding.LayerGridGraph/HeightSample
    #pragma pack(pop)
    static check_size<sizeof(LayerGridGraph::HeightSample), 60 + sizeof(bool)> __Pathfinding_LayerGridGraph_HeightSampleSizeCheck;
    static_assert(sizeof(LayerGridGraph::HeightSample) == 0x3D);
    public:
    // System.Int32 layerCount
    // Size: 0x4
    // Offset: 0x190
    int layerCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Single mergeSpanRange
    // Size: 0x4
    // Offset: 0x194
    float mergeSpanRange;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single characterHeight
    // Size: 0x4
    // Offset: 0x198
    float characterHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // System.Int32 lastScannedWidth
    // Size: 0x4
    // Offset: 0x19C
    int lastScannedWidth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 lastScannedDepth
    // Size: 0x4
    // Offset: 0x1A0
    int lastScannedDepth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Get static field: static private readonly Pathfinding.LayerGridGraph/HitComparer comparer
    static ::Pathfinding::LayerGridGraph::HitComparer* _get_comparer();
    // Set static field: static private readonly Pathfinding.LayerGridGraph/HitComparer comparer
    static void _set_comparer(::Pathfinding::LayerGridGraph::HitComparer* value);
    // Get static field: static private Pathfinding.LayerGridGraph/HeightSample[] heightSampleBuffer
    static ::ArrayW<::Pathfinding::LayerGridGraph::HeightSample> _get_heightSampleBuffer();
    // Set static field: static private Pathfinding.LayerGridGraph/HeightSample[] heightSampleBuffer
    static void _set_heightSampleBuffer(::ArrayW<::Pathfinding::LayerGridGraph::HeightSample> value);
    // Get instance field reference: System.Int32 layerCount
    [[deprecated("Use field access instead!")]] int& dyn_layerCount();
