// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Pathfinding.IGraphInternals
#include "Pathfinding/IGraphInternals.hpp"
// Including type: Pathfinding.Util.Guid
#include "Pathfinding/Util/Guid.hpp"
// Including type: UnityEngine.Matrix4x4
#include "UnityEngine/Matrix4x4.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Pathfinding
namespace Pathfinding {
  // Forward declaring type: GraphNode
  class GraphNode;
  // Forward declaring type: NNInfoInternal
  struct NNInfoInternal;
  // Forward declaring type: NNConstraint
  class NNConstraint;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: AstarPath
  class AstarPath;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Func`2<T, TResult>
  template<typename T, typename TResult>
  class Func_2;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Vector3
  struct Vector3;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: IEnumerable`1<T>
  template<typename T>
  class IEnumerable_1;
}
// Forward declaring namespace: Pathfinding::Serialization
namespace Pathfinding::Serialization {
  // Forward declaring type: GraphSerializationContext
  class GraphSerializationContext;
}
// Forward declaring namespace: Pathfinding::Util
namespace Pathfinding::Util {
  // Forward declaring type: RetainedGizmos
  class RetainedGizmos;
}
// Completed forward declares
// Type namespace: Pathfinding
namespace Pathfinding {
  // Forward declaring type: NavGraph
  class NavGraph;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Pathfinding::NavGraph);
DEFINE_IL2CPP_ARG_TYPE(::Pathfinding::NavGraph*, "Pathfinding", "NavGraph");
// Type namespace: Pathfinding
namespace Pathfinding {
  // Size: 0xD0
  #pragma pack(push, 1)
  // Autogenerated type: Pathfinding.NavGraph
  // [TokenAttribute] Offset: FFFFFFFF
  class NavGraph : public ::Il2CppObject/*, public ::Pathfinding::IGraphInternals*/ {
    public:
    // Nested type: ::Pathfinding::NavGraph::$$c
    class $$c;
    // Nested type: ::Pathfinding::NavGraph::$$c__DisplayClass11_0
    class $$c__DisplayClass11_0;
    // Nested type: ::Pathfinding::NavGraph::$$c__DisplayClass12_0
    class $$c__DisplayClass12_0;
    // Nested type: ::Pathfinding::NavGraph::$$c__DisplayClass19_0
    class $$c__DisplayClass19_0;
    // Nested type: ::Pathfinding::NavGraph::$$c__DisplayClass22_0
    class $$c__DisplayClass22_0;
    // Nested type: ::Pathfinding::NavGraph::$$c__DisplayClass33_0
    class $$c__DisplayClass33_0;
    // Nested type: ::Pathfinding::NavGraph::$$c__DisplayClass34_0
    class $$c__DisplayClass34_0;
    public:
    // public AstarPath active
    // Size: 0x8
    // Offset: 0x10
    ::GlobalNamespace::AstarPath* active;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::AstarPath*) == 0x8);
    // public Pathfinding.Util.Guid guid
    // Size: 0x10
    // Offset: 0x18
    ::Pathfinding::Util::Guid guid;
    // Field size check
    static_assert(sizeof(::Pathfinding::Util::Guid) == 0x10);
    // public System.UInt32 initialPenalty
    // Size: 0x4
    // Offset: 0x28
    uint initialPenalty;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // public System.Boolean open
    // Size: 0x1
    // Offset: 0x2C
    bool open;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: open and: graphIndex
    char __padding3[0x3] = {};
    // public System.UInt32 graphIndex
    // Size: 0x4
    // Offset: 0x30
    uint graphIndex;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // Padding between fields: graphIndex and: name
    char __padding4[0x4] = {};
    // public System.String name
    // Size: 0x8
    // Offset: 0x38
    ::StringW name;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Boolean drawGizmos
    // Size: 0x1
    // Offset: 0x40
    bool drawGizmos;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean infoScreenOpen
    // Size: 0x1
    // Offset: 0x41
    bool infoScreenOpen;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: infoScreenOpen and: serializedEditorSettings
    char __padding7[0x6] = {};
    // private System.String serializedEditorSettings
    // Size: 0x8
    // Offset: 0x48
    ::StringW serializedEditorSettings;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public UnityEngine.Matrix4x4 matrix
    // Size: 0x40
    // Offset: 0x50
    ::UnityEngine::Matrix4x4 matrix;
    // Field size check
    static_assert(sizeof(::UnityEngine::Matrix4x4) == 0x40);
    // public UnityEngine.Matrix4x4 inverseMatrix
    // Size: 0x40
    // Offset: 0x90
    ::UnityEngine::Matrix4x4 inverseMatrix;
    // Field size check
    static_assert(sizeof(::UnityEngine::Matrix4x4) == 0x40);
    public:
    // Creating interface conversion operator: operator ::Pathfinding::IGraphInternals
    operator ::Pathfinding::IGraphInternals() noexcept {
      return *reinterpret_cast<::Pathfinding::IGraphInternals*>(this);
    }
    // Get instance field reference: public AstarPath active
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::AstarPath*& dyn_active();
    // Get instance field reference: public Pathfinding.Util.Guid guid
    [[deprecated("Use field access instead!")]] ::Pathfinding::Util::Guid& dyn_guid();
    // Get instance field reference: public System.UInt32 initialPenalty
    [[deprecated("Use field access instead!")]] uint& dyn_initialPenalty();
    // Get instance field reference: public System.Boolean open
    [[deprecated("Use field access instead!")]] bool& dyn_open();
