// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Pathfinding.IPathInternals
#include "Pathfinding/IPathInternals.hpp"
// Including type: Pathfinding.PathState
#include "Pathfinding/PathState.hpp"
// Including type: Pathfinding.PathCompleteState
#include "Pathfinding/PathCompleteState.hpp"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
// Including type: Pathfinding.Heuristic
#include "Pathfinding/Heuristic.hpp"
// Including type: Pathfinding.Int3
#include "Pathfinding/Int3.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Pathfinding
namespace Pathfinding {
  // Forward declaring type: PathHandler
  class PathHandler;
  // Forward declaring type: OnPathDelegate
  class OnPathDelegate;
  // Forward declaring type: ITraversalProvider
  class ITraversalProvider;
  // Forward declaring type: GraphNode
  class GraphNode;
  // Forward declaring type: PathNode
  class PathNode;
  // Forward declaring type: NNConstraint
  class NNConstraint;
  // Forward declaring type: PathLog
  struct PathLog;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: StringBuilder
  class StringBuilder;
}
// Completed forward declares
// Type namespace: Pathfinding
namespace Pathfinding {
  // Forward declaring type: Path
  class Path;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Pathfinding::Path);
DEFINE_IL2CPP_ARG_TYPE(::Pathfinding::Path*, "Pathfinding", "Path");
// Type namespace: Pathfinding
namespace Pathfinding {
  // Size: 0xC9
  #pragma pack(push, 1)
  // Autogenerated type: Pathfinding.Path
  // [TokenAttribute] Offset: FFFFFFFF
  class Path : public ::Il2CppObject/*, public ::Pathfinding::IPathInternals*/ {
    public:
    // Nested type: ::Pathfinding::Path::$WaitForPath$d__54
    class $WaitForPath$d__54;
    public:
    // protected Pathfinding.PathHandler pathHandler
    // Size: 0x8
    // Offset: 0x10
    ::Pathfinding::PathHandler* pathHandler;
    // Field size check
    static_assert(sizeof(::Pathfinding::PathHandler*) == 0x8);
    // public Pathfinding.OnPathDelegate callback
    // Size: 0x8
    // Offset: 0x18
    ::Pathfinding::OnPathDelegate* callback;
    // Field size check
    static_assert(sizeof(::Pathfinding::OnPathDelegate*) == 0x8);
    // public Pathfinding.OnPathDelegate immediateCallback
    // Size: 0x8
    // Offset: 0x20
    ::Pathfinding::OnPathDelegate* immediateCallback;
    // Field size check
    static_assert(sizeof(::Pathfinding::OnPathDelegate*) == 0x8);
    // private Pathfinding.PathState <PipelineState>k__BackingField
    // Size: 0x4
    // Offset: 0x28
    ::Pathfinding::PathState PipelineState;
    // Field size check
    static_assert(sizeof(::Pathfinding::PathState) == 0x4);
    // Padding between fields: PipelineState and: stateLock
    char __padding3[0x4] = {};
    // private System.Object stateLock
    // Size: 0x8
    // Offset: 0x30
    ::Il2CppObject* stateLock;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // public Pathfinding.ITraversalProvider traversalProvider
    // Size: 0x8
    // Offset: 0x38
    ::Pathfinding::ITraversalProvider* traversalProvider;
    // Field size check
    static_assert(sizeof(::Pathfinding::ITraversalProvider*) == 0x8);
    // protected Pathfinding.PathCompleteState completeState
    // Size: 0x4
    // Offset: 0x40
    ::Pathfinding::PathCompleteState completeState;
    // Field size check
    static_assert(sizeof(::Pathfinding::PathCompleteState) == 0x4);
    // Padding between fields: completeState and: errorLog
    char __padding6[0x4] = {};
    // private System.String <errorLog>k__BackingField
    // Size: 0x8
    // Offset: 0x48
    ::StringW errorLog;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Collections.Generic.List`1<Pathfinding.GraphNode> path
    // Size: 0x8
    // Offset: 0x50
    ::System::Collections::Generic::List_1<::Pathfinding::GraphNode*>* path;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Pathfinding::GraphNode*>*) == 0x8);
    // public System.Collections.Generic.List`1<UnityEngine.Vector3> vectorPath
    // Size: 0x8
    // Offset: 0x58
    ::System::Collections::Generic::List_1<::UnityEngine::Vector3>* vectorPath;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Vector3>*) == 0x8);
    // protected Pathfinding.PathNode currentR
    // Size: 0x8
    // Offset: 0x60
    ::Pathfinding::PathNode* currentR;
    // Field size check
    static_assert(sizeof(::Pathfinding::PathNode*) == 0x8);
    // public System.Single duration
    // Size: 0x4
    // Offset: 0x68
    float duration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 <searchedNodes>k__BackingField
    // Size: 0x4
    // Offset: 0x6C
    int searchedNodes;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean <Pathfinding.IPathInternals.Pooled>k__BackingField
    // Size: 0x1
    // Offset: 0x70
    bool Pooled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean hasBeenReset
    // Size: 0x1
    // Offset: 0x71
    bool hasBeenReset;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: hasBeenReset and: nnConstraint
    char __padding14[0x6] = {};
    // public Pathfinding.NNConstraint nnConstraint
    // Size: 0x8
    // Offset: 0x78
    ::Pathfinding::NNConstraint* nnConstraint;
    // Field size check
    static_assert(sizeof(::Pathfinding::NNConstraint*) == 0x8);
    // Pathfinding.Path next
    // Size: 0x8
    // Offset: 0x80
    ::Pathfinding::Path* next;
    // Field size check
    static_assert(sizeof(::Pathfinding::Path*) == 0x8);
    // public Pathfinding.Heuristic heuristic
    // Size: 0x4
    // Offset: 0x88
    ::Pathfinding::Heuristic heuristic;
    // Field size check
    static_assert(sizeof(::Pathfinding::Heuristic) == 0x4);
    // public System.Single heuristicScale
    // Size: 0x4
    // Offset: 0x8C
    float heuristicScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.UInt16 <pathID>k__BackingField
    // Size: 0x2
    // Offset: 0x90
    uint16_t pathID;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // Padding between fields: pathID and: hTargetNode
    char __padding19[0x6] = {};
    // protected Pathfinding.GraphNode hTargetNode
    // Size: 0x8
    // Offset: 0x98
    ::Pathfinding::GraphNode* hTargetNode;
    // Field size check
    static_assert(sizeof(::Pathfinding::GraphNode*) == 0x8);
    // protected Pathfinding.Int3 hTarget
    // Size: 0xC
    // Offset: 0xA0
    ::Pathfinding::Int3 hTarget;
    // Field size check
    static_assert(sizeof(::Pathfinding::Int3) == 0xC);
    // public System.Int32 enabledTags
    // Size: 0x4
    // Offset: 0xAC
    int enabledTags;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Int32[] internalTagPenalties
    // Size: 0x8
    // Offset: 0xB0
    ::ArrayW<int> internalTagPenalties;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // protected System.Int32[] manualTagPenalties
    // Size: 0x8
    // Offset: 0xB8
    ::ArrayW<int> manualTagPenalties;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // private System.Collections.Generic.List`1<System.Object> claimed
    // Size: 0x8
    // Offset: 0xC0
    ::System::Collections::Generic::List_1<::Il2CppObject*>* claimed;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Il2CppObject*>*) == 0x8);
    // private System.Boolean releasedNotSilent
    // Size: 0x1
    // Offset: 0xC8
    bool releasedNotSilent;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating interface conversion operator: operator ::Pathfinding::IPathInternals
    operator ::Pathfinding::IPathInternals() noexcept {
      return *reinterpret_cast<::Pathfinding::IPathInternals*>(this);
    }
    // Get static field: static private readonly System.Int32[] ZeroTagPenalties
    static ::ArrayW<int> _get_ZeroTagPenalties();
    // Set static field: static private readonly System.Int32[] ZeroTagPenalties
    static void _set_ZeroTagPenalties(::ArrayW<int> value);
    // Get instance field reference: protected Pathfinding.PathHandler pathHandler
    [[deprecated("Use field access instead!")]] ::Pathfinding::PathHandler*& dyn_pathHandler();
    // Get instance field reference: public Pathfinding.OnPathDelegate callback
    [[deprecated("Use field access instead!")]] ::Pathfinding::OnPathDelegate*& dyn_callback();
