// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Pathfinding.NavGraph
#include "Pathfinding/NavGraph.hpp"
// Including type: Pathfinding.IUpdatableGraph
#include "Pathfinding/IUpdatableGraph.hpp"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
// Including type: UnityEngine.LayerMask
#include "UnityEngine/LayerMask.hpp"
// Including type: Pathfinding.Int3
#include "Pathfinding/Int3.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Pathfinding
namespace Pathfinding {
  // Forward declaring type: NNInfoInternal
  struct NNInfoInternal;
  // Forward declaring type: PointKDTree
  class PointKDTree;
  // Forward declaring type: PointNode
  class PointNode;
  // Forward declaring type: NNConstraint
  class NNConstraint;
  // Forward declaring type: GraphNode
  class GraphNode;
  // Forward declaring type: GraphUpdateThreading
  struct GraphUpdateThreading;
  // Forward declaring type: GraphUpdateObject
  class GraphUpdateObject;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Skipping declaration: Matrix4x4 because it is already included!
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: IEnumerable`1<T>
  template<typename T>
  class IEnumerable_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: Pathfinding::Serialization
namespace Pathfinding::Serialization {
  // Forward declaring type: GraphSerializationContext
  class GraphSerializationContext;
}
// Completed forward declares
// Type namespace: Pathfinding
namespace Pathfinding {
  // Forward declaring type: PointGraph
  class PointGraph;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Pathfinding::PointGraph);
DEFINE_IL2CPP_ARG_TYPE(::Pathfinding::PointGraph*, "Pathfinding", "PointGraph");
// Type namespace: Pathfinding
namespace Pathfinding {
  // Size: 0x128
  #pragma pack(push, 1)
  // Autogenerated type: Pathfinding.PointGraph
  // [TokenAttribute] Offset: FFFFFFFF
  // [JsonOptInAttribute] Offset: FFFFFFFF
  // [PreserveAttribute] Offset: FFFFFFFF
  class PointGraph : public ::Pathfinding::NavGraph/*, public ::Pathfinding::IUpdatableGraph*/ {
    public:
    // Nested type: ::Pathfinding::PointGraph::NodeDistanceMode
    struct NodeDistanceMode;
    // Nested type: ::Pathfinding::PointGraph::$ConnectNodesAsync$d__37
    class $ConnectNodesAsync$d__37;
    // Nested type: ::Pathfinding::PointGraph::$ScanInternal$d__35
    class $ScanInternal$d__35;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: Pathfinding.PointGraph/NodeDistanceMode
    // [TokenAttribute] Offset: FFFFFFFF
    struct NodeDistanceMode/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: NodeDistanceMode
      constexpr NodeDistanceMode(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public Pathfinding.PointGraph/NodeDistanceMode Node
      static constexpr const int Node = 0;
      // Get static field: static public Pathfinding.PointGraph/NodeDistanceMode Node
      static ::Pathfinding::PointGraph::NodeDistanceMode _get_Node();
      // Set static field: static public Pathfinding.PointGraph/NodeDistanceMode Node
      static void _set_Node(::Pathfinding::PointGraph::NodeDistanceMode value);
      // static field const value: static public Pathfinding.PointGraph/NodeDistanceMode Connection
      static constexpr const int Connection = 1;
      // Get static field: static public Pathfinding.PointGraph/NodeDistanceMode Connection
      static ::Pathfinding::PointGraph::NodeDistanceMode _get_Connection();
      // Set static field: static public Pathfinding.PointGraph/NodeDistanceMode Connection
      static void _set_Connection(::Pathfinding::PointGraph::NodeDistanceMode value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // Pathfinding.PointGraph/NodeDistanceMode
    #pragma pack(pop)
    static check_size<sizeof(PointGraph::NodeDistanceMode), 0 + sizeof(int)> __Pathfinding_PointGraph_NodeDistanceModeSizeCheck;
    static_assert(sizeof(PointGraph::NodeDistanceMode) == 0x4);
    public:
    // public UnityEngine.Transform root
    // Size: 0x8
    // Offset: 0xD0
    ::UnityEngine::Transform* root;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public System.String searchTag
    // Size: 0x8
    // Offset: 0xD8
    ::StringW searchTag;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Single maxDistance
    // Size: 0x4
    // Offset: 0xE0
    float maxDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.Vector3 limits
    // Size: 0xC
    // Offset: 0xE4
    ::UnityEngine::Vector3 limits;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public System.Boolean raycast
    // Size: 0x1
    // Offset: 0xF0
    bool raycast;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean use2DPhysics
    // Size: 0x1
    // Offset: 0xF1
    bool use2DPhysics;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean thickRaycast
    // Size: 0x1
    // Offset: 0xF2
    bool thickRaycast;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: thickRaycast and: thickRaycastRadius
    char __padding6[0x1] = {};
    // public System.Single thickRaycastRadius
    // Size: 0x4
    // Offset: 0xF4
    float thickRaycastRadius;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean recursive
    // Size: 0x1
    // Offset: 0xF8
    bool recursive;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: recursive and: mask
    char __padding8[0x3] = {};
    // public UnityEngine.LayerMask mask
    // Size: 0x4
    // Offset: 0xFC
    ::UnityEngine::LayerMask mask;
    // Field size check
    static_assert(sizeof(::UnityEngine::LayerMask) == 0x4);
    // public System.Boolean optimizeForSparseGraph
    // Size: 0x1
    // Offset: 0x100
    bool optimizeForSparseGraph;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: optimizeForSparseGraph and: lookupTree
    char __padding10[0x7] = {};
    // private Pathfinding.PointKDTree lookupTree
    // Size: 0x8
    // Offset: 0x108
    ::Pathfinding::PointKDTree* lookupTree;
    // Field size check
    static_assert(sizeof(::Pathfinding::PointKDTree*) == 0x8);
    // private System.Int64 maximumConnectionLength
    // Size: 0x8
    // Offset: 0x110
    int64_t maximumConnectionLength;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // public Pathfinding.PointNode[] nodes
    // Size: 0x8
    // Offset: 0x118
    ::ArrayW<::Pathfinding::PointNode*> nodes;
    // Field size check
    static_assert(sizeof(::ArrayW<::Pathfinding::PointNode*>) == 0x8);
    // public Pathfinding.PointGraph/NodeDistanceMode nearestNodeDistanceMode
    // Size: 0x4
    // Offset: 0x120
    ::Pathfinding::PointGraph::NodeDistanceMode nearestNodeDistanceMode;
    // Field size check
    static_assert(sizeof(::Pathfinding::PointGraph::NodeDistanceMode) == 0x4);
    // private System.Int32 <nodeCount>k__BackingField
    // Size: 0x4
    // Offset: 0x124
    int nodeCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Creating interface conversion operator: operator ::Pathfinding::IUpdatableGraph
    operator ::Pathfinding::IUpdatableGraph() noexcept {
      return *reinterpret_cast<::Pathfinding::IUpdatableGraph*>(this);
    }
    // Get instance field reference: public UnityEngine.Transform root
    [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_root();
    // Get instance field reference: public System.String searchTag
    [[deprecated("Use field access instead!")]] ::StringW& dyn_searchTag();
    // Get instance field reference: public System.Single maxDistance
    [[deprecated("Use field access instead!")]] float& dyn_maxDistance();
    // Get instance field reference: public UnityEngine.Vector3 limits
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_limits();
