// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Pathfinding.NavmeshBase
#include "Pathfinding/NavmeshBase.hpp"
// Including type: Pathfinding.IUpdatableGraph
#include "Pathfinding/IUpdatableGraph.hpp"
// Including type: UnityEngine.LayerMask
#include "UnityEngine/LayerMask.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: IEnumerable`1<T>
  template<typename T>
  class IEnumerable_1;
}
// Forward declaring namespace: Pathfinding
namespace Pathfinding {
  // Forward declaring type: NavmeshTile
  class NavmeshTile;
  // Forward declaring type: TriangleMeshNode
  class TriangleMeshNode;
  // Forward declaring type: GraphUpdateThreading
  struct GraphUpdateThreading;
  // Forward declaring type: GraphUpdateObject
  class GraphUpdateObject;
}
// Forward declaring namespace: Pathfinding::Voxels
namespace Pathfinding::Voxels {
  // Forward declaring type: Voxelize
  class Voxelize;
  // Forward declaring type: RasterizationMesh
  class RasterizationMesh;
  // Forward declaring type: VoxelMesh
  struct VoxelMesh;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Bounds
  struct Bounds;
}
// Forward declaring namespace: Pathfinding::Util
namespace Pathfinding::Util {
  // Forward declaring type: GraphTransform
  class GraphTransform;
}
// Forward declaring namespace: Pathfinding::Serialization
namespace Pathfinding::Serialization {
  // Forward declaring type: GraphSerializationContext
  class GraphSerializationContext;
}
// Completed forward declares
// Type namespace: Pathfinding
namespace Pathfinding {
  // Forward declaring type: RecastGraph
  class RecastGraph;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Pathfinding::RecastGraph);
DEFINE_IL2CPP_ARG_TYPE(::Pathfinding::RecastGraph*, "Pathfinding", "RecastGraph");
// Type namespace: Pathfinding
namespace Pathfinding {
  // Size: 0x1A8
  #pragma pack(push, 1)
  // Autogenerated type: Pathfinding.RecastGraph
  // [TokenAttribute] Offset: FFFFFFFF
  // [PreserveAttribute] Offset: FFFFFFFF
  // [JsonOptInAttribute] Offset: FFFFFFFF
  class RecastGraph : public ::Pathfinding::NavmeshBase/*, public ::Pathfinding::IUpdatableGraph*/ {
    public:
    // Nested type: ::Pathfinding::RecastGraph::RelevantGraphSurfaceMode
    struct RelevantGraphSurfaceMode;
    // Nested type: ::Pathfinding::RecastGraph::$$c__DisplayClass50_0
    class $$c__DisplayClass50_0;
    // Nested type: ::Pathfinding::RecastGraph::$$c__DisplayClass50_1
    class $$c__DisplayClass50_1;
    // Nested type: ::Pathfinding::RecastGraph::$ScanAllTiles$d__50
    class $ScanAllTiles$d__50;
    // Nested type: ::Pathfinding::RecastGraph::$ScanInternal$d__46
    class $ScanInternal$d__46;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: Pathfinding.RecastGraph/RelevantGraphSurfaceMode
    // [TokenAttribute] Offset: FFFFFFFF
    struct RelevantGraphSurfaceMode/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: RelevantGraphSurfaceMode
      constexpr RelevantGraphSurfaceMode(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public Pathfinding.RecastGraph/RelevantGraphSurfaceMode DoNotRequire
      static constexpr const int DoNotRequire = 0;
      // Get static field: static public Pathfinding.RecastGraph/RelevantGraphSurfaceMode DoNotRequire
      static ::Pathfinding::RecastGraph::RelevantGraphSurfaceMode _get_DoNotRequire();
      // Set static field: static public Pathfinding.RecastGraph/RelevantGraphSurfaceMode DoNotRequire
      static void _set_DoNotRequire(::Pathfinding::RecastGraph::RelevantGraphSurfaceMode value);
      // static field const value: static public Pathfinding.RecastGraph/RelevantGraphSurfaceMode OnlyForCompletelyInsideTile
      static constexpr const int OnlyForCompletelyInsideTile = 1;
      // Get static field: static public Pathfinding.RecastGraph/RelevantGraphSurfaceMode OnlyForCompletelyInsideTile
      static ::Pathfinding::RecastGraph::RelevantGraphSurfaceMode _get_OnlyForCompletelyInsideTile();
      // Set static field: static public Pathfinding.RecastGraph/RelevantGraphSurfaceMode OnlyForCompletelyInsideTile
      static void _set_OnlyForCompletelyInsideTile(::Pathfinding::RecastGraph::RelevantGraphSurfaceMode value);
      // static field const value: static public Pathfinding.RecastGraph/RelevantGraphSurfaceMode RequireForAll
      static constexpr const int RequireForAll = 2;
      // Get static field: static public Pathfinding.RecastGraph/RelevantGraphSurfaceMode RequireForAll
      static ::Pathfinding::RecastGraph::RelevantGraphSurfaceMode _get_RequireForAll();
      // Set static field: static public Pathfinding.RecastGraph/RelevantGraphSurfaceMode RequireForAll
      static void _set_RequireForAll(::Pathfinding::RecastGraph::RelevantGraphSurfaceMode value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // Pathfinding.RecastGraph/RelevantGraphSurfaceMode
    #pragma pack(pop)
    static check_size<sizeof(RecastGraph::RelevantGraphSurfaceMode), 0 + sizeof(int)> __Pathfinding_RecastGraph_RelevantGraphSurfaceModeSizeCheck;
    static_assert(sizeof(RecastGraph::RelevantGraphSurfaceMode) == 0x4);
    public:
    // public System.Single characterRadius
    // Size: 0x4
    // Offset: 0x130
    float characterRadius;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single contourMaxError
    // Size: 0x4
    // Offset: 0x134
    float contourMaxError;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single cellSize
    // Size: 0x4
    // Offset: 0x138
    float cellSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single walkableHeight
    // Size: 0x4
    // Offset: 0x13C
    float walkableHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single walkableClimb
    // Size: 0x4
    // Offset: 0x140
    float walkableClimb;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single maxSlope
    // Size: 0x4
    // Offset: 0x144
    float maxSlope;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single maxEdgeLength
    // Size: 0x4
    // Offset: 0x148
    float maxEdgeLength;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single minRegionSize
    // Size: 0x4
    // Offset: 0x14C
    float minRegionSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Int32 editorTileSize
    // Size: 0x4
    // Offset: 0x150
    int editorTileSize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 tileSizeX
    // Size: 0x4
    // Offset: 0x154
    int tileSizeX;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 tileSizeZ
    // Size: 0x4
    // Offset: 0x158
    int tileSizeZ;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Boolean useTiles
    // Size: 0x1
    // Offset: 0x15C
    bool useTiles;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean scanEmptyGraph
    // Size: 0x1
    // Offset: 0x15D
    bool scanEmptyGraph;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: scanEmptyGraph and: relevantGraphSurfaceMode
    char __padding12[0x2] = {};
    // public Pathfinding.RecastGraph/RelevantGraphSurfaceMode relevantGraphSurfaceMode
    // Size: 0x4
    // Offset: 0x160
    ::Pathfinding::RecastGraph::RelevantGraphSurfaceMode relevantGraphSurfaceMode;
    // Field size check
    static_assert(sizeof(::Pathfinding::RecastGraph::RelevantGraphSurfaceMode) == 0x4);
    // public System.Boolean rasterizeColliders
    // Size: 0x1
    // Offset: 0x164
    bool rasterizeColliders;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean rasterizeMeshes
    // Size: 0x1
    // Offset: 0x165
    bool rasterizeMeshes;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean rasterizeTerrain
    // Size: 0x1
    // Offset: 0x166
    bool rasterizeTerrain;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean rasterizeTrees
    // Size: 0x1
    // Offset: 0x167
    bool rasterizeTrees;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Single colliderRasterizeDetail
    // Size: 0x4
    // Offset: 0x168
    float colliderRasterizeDetail;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.LayerMask mask
    // Size: 0x4
    // Offset: 0x16C
    ::UnityEngine::LayerMask mask;
    // Field size check
    static_assert(sizeof(::UnityEngine::LayerMask) == 0x4);
    // public System.Collections.Generic.List`1<System.String> tagMask
    // Size: 0x8
    // Offset: 0x170
    ::System::Collections::Generic::List_1<::StringW>* tagMask;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::StringW>*) == 0x8);
    // public System.Int32 terrainSampleSize
    // Size: 0x4
    // Offset: 0x178
    int terrainSampleSize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public UnityEngine.Vector3 rotation
    // Size: 0xC
    // Offset: 0x17C
    ::UnityEngine::Vector3 rotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 forcedBoundsCenter
    // Size: 0xC
    // Offset: 0x188
    ::UnityEngine::Vector3 forcedBoundsCenter;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // Padding between fields: forcedBoundsCenter and: globalVox
    char __padding23[0x4] = {};
    // private Pathfinding.Voxels.Voxelize globalVox
    // Size: 0x8
    // Offset: 0x198
    ::Pathfinding::Voxels::Voxelize* globalVox;
    // Field size check
    static_assert(sizeof(::Pathfinding::Voxels::Voxelize*) == 0x8);
    // private System.Collections.Generic.List`1<Pathfinding.NavmeshTile> stagingTiles
    // Size: 0x8
    // Offset: 0x1A0
    ::System::Collections::Generic::List_1<::Pathfinding::NavmeshTile*>* stagingTiles;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Pathfinding::NavmeshTile*>*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::Pathfinding::IUpdatableGraph
    operator ::Pathfinding::IUpdatableGraph() noexcept {
      return *reinterpret_cast<::Pathfinding::IUpdatableGraph*>(this);
    }
    // static field const value: static public System.Int32 BorderVertexMask
    static constexpr const int BorderVertexMask = 1;
    // Get static field: static public System.Int32 BorderVertexMask
    static int _get_BorderVertexMask();
    // Set static field: static public System.Int32 BorderVertexMask
    static void _set_BorderVertexMask(int value);
    // static field const value: static public System.Int32 BorderVertexOffset
    static constexpr const int BorderVertexOffset = 31;
