// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Pathfinding.AIBase
#include "Pathfinding/AIBase.hpp"
// Including type: Pathfinding.IAstarAI
#include "Pathfinding/IAstarAI.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Pathfinding
namespace Pathfinding {
  // Forward declaring type: RichSpecial
  class RichSpecial;
  // Forward declaring type: RichPath
  class RichPath;
  // Forward declaring type: RichFunnel
  class RichFunnel;
  // Forward declaring type: Path
  class Path;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Func`2<T, TResult>
  template<typename T, typename TResult>
  class Func_2;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Animation
  class Animation;
  // Skipping declaration: Quaternion because it is already included!
  // Skipping declaration: Vector2 because it is already included!
}
// Completed forward declares
// Type namespace: Pathfinding
namespace Pathfinding {
  // Forward declaring type: RichAI
  class RichAI;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Pathfinding::RichAI);
DEFINE_IL2CPP_ARG_TYPE(::Pathfinding::RichAI*, "Pathfinding", "RichAI");
// Type namespace: Pathfinding
namespace Pathfinding {
  // Size: 0x190
  #pragma pack(push, 1)
  // Autogenerated type: Pathfinding.RichAI
  // [TokenAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: FFFFFFFF
  class RichAI : public ::Pathfinding::AIBase/*, public ::Pathfinding::IAstarAI*/ {
    public:
    // Nested type: ::Pathfinding::RichAI::$TraverseOffMeshLinkFallback$d__69
    class $TraverseOffMeshLinkFallback$d__69;
    // Nested type: ::Pathfinding::RichAI::$TraverseSpecial$d__68
    class $TraverseSpecial$d__68;
    public:
    // public System.Single acceleration
    // Size: 0x4
    // Offset: 0x130
    float acceleration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single rotationSpeed
    // Size: 0x4
    // Offset: 0x134
    float rotationSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single slowdownTime
    // Size: 0x4
    // Offset: 0x138
    float slowdownTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single endReachedDistance
    // Size: 0x4
    // Offset: 0x13C
    float endReachedDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single wallForce
    // Size: 0x4
    // Offset: 0x140
    float wallForce;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single wallDist
    // Size: 0x4
    // Offset: 0x144
    float wallDist;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean funnelSimplification
    // Size: 0x1
    // Offset: 0x148
    bool funnelSimplification;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean slowWhenNotFacingTarget
    // Size: 0x1
    // Offset: 0x149
    bool slowWhenNotFacingTarget;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: slowWhenNotFacingTarget and: onTraverseOffMeshLink
    char __padding7[0x6] = {};
    // public System.Func`2<Pathfinding.RichSpecial,System.Collections.IEnumerator> onTraverseOffMeshLink
    // Size: 0x8
    // Offset: 0x150
    ::System::Func_2<::Pathfinding::RichSpecial*, ::System::Collections::IEnumerator*>* onTraverseOffMeshLink;
    // Field size check
    static_assert(sizeof(::System::Func_2<::Pathfinding::RichSpecial*, ::System::Collections::IEnumerator*>*) == 0x8);
    // protected readonly Pathfinding.RichPath richPath
    // Size: 0x8
    // Offset: 0x158
    ::Pathfinding::RichPath* richPath;
    // Field size check
    static_assert(sizeof(::Pathfinding::RichPath*) == 0x8);
    // protected System.Boolean delayUpdatePath
    // Size: 0x1
    // Offset: 0x160
    bool delayUpdatePath;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean lastCorner
    // Size: 0x1
    // Offset: 0x161
    bool lastCorner;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: lastCorner and: distanceToSteeringTarget
    char __padding11[0x2] = {};
    // protected System.Single distanceToSteeringTarget
    // Size: 0x4
    // Offset: 0x164
    float distanceToSteeringTarget;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected readonly System.Collections.Generic.List`1<UnityEngine.Vector3> nextCorners
    // Size: 0x8
    // Offset: 0x168
    ::System::Collections::Generic::List_1<::UnityEngine::Vector3>* nextCorners;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Vector3>*) == 0x8);
    // protected readonly System.Collections.Generic.List`1<UnityEngine.Vector3> wallBuffer
    // Size: 0x8
    // Offset: 0x170
    ::System::Collections::Generic::List_1<::UnityEngine::Vector3>* wallBuffer;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Vector3>*) == 0x8);
    // private System.Boolean <traversingOffMeshLink>k__BackingField
    // Size: 0x1
    // Offset: 0x178
    bool traversingOffMeshLink;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: traversingOffMeshLink and: steeringTarget
    char __padding15[0x3] = {};
    // private UnityEngine.Vector3 <steeringTarget>k__BackingField
    // Size: 0xC
    // Offset: 0x17C
    ::UnityEngine::Vector3 steeringTarget;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Animation animCompatibility
    // Size: 0x8
    // Offset: 0x188
    ::UnityEngine::Animation* animCompatibility;
    // Field size check
    static_assert(sizeof(::UnityEngine::Animation*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::Pathfinding::IAstarAI
    operator ::Pathfinding::IAstarAI() noexcept {
      return *reinterpret_cast<::Pathfinding::IAstarAI*>(this);
    }
    // Get static field: static protected readonly UnityEngine.Color GizmoColorPath
    static ::UnityEngine::Color _get_GizmoColorPath();
    // Set static field: static protected readonly UnityEngine.Color GizmoColorPath
    static void _set_GizmoColorPath(::UnityEngine::Color value);
    // Get instance field reference: public System.Single acceleration
    [[deprecated("Use field access instead!")]] float& dyn_acceleration();
    // Get instance field reference: public System.Single rotationSpeed
    [[deprecated("Use field access instead!")]] float& dyn_rotationSpeed();
