// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Pathfinding.VersionedMonoBehaviour
#include "Pathfinding/VersionedMonoBehaviour.hpp"
// Including type: Pathfinding.GraphMask
#include "Pathfinding/GraphMask.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Pathfinding
namespace Pathfinding {
  // Forward declaring type: StartEndModifier
  class StartEndModifier;
  // Forward declaring type: OnPathDelegate
  class OnPathDelegate;
  // Forward declaring type: GraphNode
  class GraphNode;
  // Forward declaring type: Path
  class Path;
  // Forward declaring type: IPathModifier
  class IPathModifier;
  // Forward declaring type: ABPath
  class ABPath;
  // Forward declaring type: MultiTargetPath
  class MultiTargetPath;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: Pathfinding
namespace Pathfinding {
  // Forward declaring type: Seeker
  class Seeker;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Pathfinding::Seeker);
DEFINE_IL2CPP_ARG_TYPE(::Pathfinding::Seeker*, "Pathfinding", "Seeker");
// Type namespace: Pathfinding
namespace Pathfinding {
  // Size: 0xA8
  #pragma pack(push, 1)
  // Autogenerated type: Pathfinding.Seeker
  // [TokenAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: FFFFFFFF
  // [HelpURLAttribute] Offset: FFFFFFFF
  class Seeker : public ::Pathfinding::VersionedMonoBehaviour {
    public:
    // Nested type: ::Pathfinding::Seeker::ModifierPass
    struct ModifierPass;
    // Nested type: ::Pathfinding::Seeker::$$c
    class $$c;
    public:
    // public System.Boolean drawGizmos
    // Size: 0x1
    // Offset: 0x24
    bool drawGizmos;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean detailedGizmos
    // Size: 0x1
    // Offset: 0x25
    bool detailedGizmos;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: detailedGizmos and: startEndModifier
    char __padding1[0x2] = {};
    // public Pathfinding.StartEndModifier startEndModifier
    // Size: 0x8
    // Offset: 0x28
    ::Pathfinding::StartEndModifier* startEndModifier;
    // Field size check
    static_assert(sizeof(::Pathfinding::StartEndModifier*) == 0x8);
    // public System.Int32 traversableTags
    // Size: 0x4
    // Offset: 0x30
    int traversableTags;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: traversableTags and: tagPenalties
    char __padding3[0x4] = {};
    // public System.Int32[] tagPenalties
    // Size: 0x8
    // Offset: 0x38
    ::ArrayW<int> tagPenalties;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // public Pathfinding.GraphMask graphMask
    // Size: 0x4
    // Offset: 0x40
    ::Pathfinding::GraphMask graphMask;
    // Field size check
    static_assert(sizeof(::Pathfinding::GraphMask) == 0x4);
    // private System.Int32 graphMaskCompatibility
    // Size: 0x4
    // Offset: 0x44
    int graphMaskCompatibility;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public Pathfinding.OnPathDelegate pathCallback
    // Size: 0x8
    // Offset: 0x48
    ::Pathfinding::OnPathDelegate* pathCallback;
    // Field size check
    static_assert(sizeof(::Pathfinding::OnPathDelegate*) == 0x8);
    // public Pathfinding.OnPathDelegate preProcessPath
    // Size: 0x8
    // Offset: 0x50
    ::Pathfinding::OnPathDelegate* preProcessPath;
    // Field size check
    static_assert(sizeof(::Pathfinding::OnPathDelegate*) == 0x8);
    // public Pathfinding.OnPathDelegate postProcessPath
    // Size: 0x8
    // Offset: 0x58
    ::Pathfinding::OnPathDelegate* postProcessPath;
    // Field size check
    static_assert(sizeof(::Pathfinding::OnPathDelegate*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.Vector3> lastCompletedVectorPath
    // Size: 0x8
    // Offset: 0x60
    ::System::Collections::Generic::List_1<::UnityEngine::Vector3>* lastCompletedVectorPath;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Vector3>*) == 0x8);
    // private System.Collections.Generic.List`1<Pathfinding.GraphNode> lastCompletedNodePath
    // Size: 0x8
    // Offset: 0x68
    ::System::Collections::Generic::List_1<::Pathfinding::GraphNode*>* lastCompletedNodePath;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Pathfinding::GraphNode*>*) == 0x8);
    // protected Pathfinding.Path path
    // Size: 0x8
    // Offset: 0x70
    ::Pathfinding::Path* path;
    // Field size check
    static_assert(sizeof(::Pathfinding::Path*) == 0x8);
    // private Pathfinding.Path prevPath
    // Size: 0x8
    // Offset: 0x78
    ::Pathfinding::Path* prevPath;
    // Field size check
    static_assert(sizeof(::Pathfinding::Path*) == 0x8);
    // private readonly Pathfinding.OnPathDelegate onPathDelegate
    // Size: 0x8
    // Offset: 0x80
    ::Pathfinding::OnPathDelegate* onPathDelegate;
    // Field size check
    static_assert(sizeof(::Pathfinding::OnPathDelegate*) == 0x8);
    // private readonly Pathfinding.OnPathDelegate onPartialPathDelegate
    // Size: 0x8
    // Offset: 0x88
    ::Pathfinding::OnPathDelegate* onPartialPathDelegate;
    // Field size check
    static_assert(sizeof(::Pathfinding::OnPathDelegate*) == 0x8);
    // private Pathfinding.OnPathDelegate tmpPathCallback
    // Size: 0x8
    // Offset: 0x90
    ::Pathfinding::OnPathDelegate* tmpPathCallback;
    // Field size check
    static_assert(sizeof(::Pathfinding::OnPathDelegate*) == 0x8);
    // protected System.UInt32 lastPathID
    // Size: 0x4
    // Offset: 0x98
    uint lastPathID;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // Padding between fields: lastPathID and: modifiers
    char __padding17[0x4] = {};
    // private readonly System.Collections.Generic.List`1<Pathfinding.IPathModifier> modifiers
    // Size: 0x8
    // Offset: 0xA0
    ::System::Collections::Generic::List_1<::Pathfinding::IPathModifier*>* modifiers;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Pathfinding::IPathModifier*>*) == 0x8);
    public:
    // Get instance field reference: public System.Boolean drawGizmos
    [[deprecated("Use field access instead!")]] bool& dyn_drawGizmos();
    // Get instance field reference: public System.Boolean detailedGizmos
    [[deprecated("Use field access instead!")]] bool& dyn_detailedGizmos();
    // Get instance field reference: public Pathfinding.StartEndModifier startEndModifier
    [[deprecated("Use field access instead!")]] ::Pathfinding::StartEndModifier*& dyn_startEndModifier();
    // Get instance field reference: public System.Int32 traversableTags
    [[deprecated("Use field access instead!")]] int& dyn_traversableTags();
    // Get instance field reference: public System.Int32[] tagPenalties
