// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: GorillaTag.GuidedRefs.GRef/EResolveModes
#include "GorillaTag/GuidedRefs/GRef_EResolveModes.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GorillaTag::GuidedRefs
namespace GorillaTag::GuidedRefs {
  // Forward declaring type: GuidedRefTargetIdSO
  class GuidedRefTargetIdSO;
  // Forward declaring type: GuidedRefHubIdSO
  class GuidedRefHubIdSO;
}
// Completed forward declares
// Type namespace: GorillaTag.GuidedRefs
namespace GorillaTag::GuidedRefs {
  // Forward declaring type: GuidedRefReceiverFieldInfo
  struct GuidedRefReceiverFieldInfo;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::GorillaTag::GuidedRefs::GuidedRefReceiverFieldInfo, "GorillaTag.GuidedRefs", "GuidedRefReceiverFieldInfo");
// Type namespace: GorillaTag.GuidedRefs
namespace GorillaTag::GuidedRefs {
  // Size: 0x1C
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: GorillaTag.GuidedRefs.GuidedRefReceiverFieldInfo
  // [TokenAttribute] Offset: FFFFFFFF
  struct GuidedRefReceiverFieldInfo/*, public ::System::ValueType*/ {
    public:
    public:
    // public GorillaTag.GuidedRefs.GRef/EResolveModes resolveModes
    // Size: 0x4
    // Offset: 0x0
    ::GorillaTag::GuidedRefs::GRef::EResolveModes resolveModes;
    // Field size check
    static_assert(sizeof(::GorillaTag::GuidedRefs::GRef::EResolveModes) == 0x4);
    // Padding between fields: resolveModes and: targetId
    char __padding0[0x4] = {};
    // public GorillaTag.GuidedRefs.GuidedRefTargetIdSO targetId
    // Size: 0x8
    // Offset: 0x8
    ::GorillaTag::GuidedRefs::GuidedRefTargetIdSO* targetId;
    // Field size check
    static_assert(sizeof(::GorillaTag::GuidedRefs::GuidedRefTargetIdSO*) == 0x8);
    // public GorillaTag.GuidedRefs.GuidedRefHubIdSO hubId
    // Size: 0x8
    // Offset: 0x10
    ::GorillaTag::GuidedRefs::GuidedRefHubIdSO* hubId;
    // Field size check
    static_assert(sizeof(::GorillaTag::GuidedRefs::GuidedRefHubIdSO*) == 0x8);
    // public System.Int32 fieldId
    // Size: 0x4
    // Offset: 0x18
    int fieldId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Creating value type constructor for type: GuidedRefReceiverFieldInfo
    constexpr GuidedRefReceiverFieldInfo(::GorillaTag::GuidedRefs::GRef::EResolveModes resolveModes_ = {}, ::GorillaTag::GuidedRefs::GuidedRefTargetIdSO* targetId_ = {}, ::GorillaTag::GuidedRefs::GuidedRefHubIdSO* hubId_ = {}, int fieldId_ = {}) noexcept : resolveModes{resolveModes_}, targetId{targetId_}, hubId{hubId_}, fieldId{fieldId_} {}
    // Creating interface conversion operator: operator ::System::ValueType
    operator ::System::ValueType() noexcept {
      return *reinterpret_cast<::System::ValueType*>(this);
    }
    // Get instance field reference: public GorillaTag.GuidedRefs.GRef/EResolveModes resolveModes
    [[deprecated("Use field access instead!")]] ::GorillaTag::GuidedRefs::GRef::EResolveModes& dyn_resolveModes();
    // Get instance field reference: public GorillaTag.GuidedRefs.GuidedRefTargetIdSO targetId
    [[deprecated("Use field access instead!")]] ::GorillaTag::GuidedRefs::GuidedRefTargetIdSO*& dyn_targetId();
    // Get instance field reference: public GorillaTag.GuidedRefs.GuidedRefHubIdSO hubId
    [[deprecated("Use field access instead!")]] ::GorillaTag::GuidedRefs::GuidedRefHubIdSO*& dyn_hubId();
    // Get instance field reference: public System.Int32 fieldId
    [[deprecated("Use field access instead!")]] int& dyn_fieldId();
    // public System.Void .ctor(System.Boolean useRecommendedDefaults)
    // Offset: 0x28A8B44
    GuidedRefReceiverFieldInfo(bool useRecommendedDefaults);
  }; // GorillaTag.GuidedRefs.GuidedRefReceiverFieldInfo
  #pragma pack(pop)
  static check_size<sizeof(GuidedRefReceiverFieldInfo), 24 + sizeof(int)> __GorillaTag_GuidedRefs_GuidedRefReceiverFieldInfoSizeCheck;
  static_assert(sizeof(GuidedRefReceiverFieldInfo) == 0x1C);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: GorillaTag::GuidedRefs::GuidedRefReceiverFieldInfo::GuidedRefReceiverFieldInfo
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
