// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Oculus.Interaction.UnityCanvas.CanvasMesh
#include "Oculus/Interaction/UnityCanvas/CanvasMesh.hpp"
// Including type: Oculus.Interaction.ICurvedPlane
#include "Oculus/Interaction/ICurvedPlane.hpp"
// Including type: Oculus.Interaction.Surfaces.ICylinderClipper
#include "Oculus/Interaction/Surfaces/ICylinderClipper.hpp"
// Including type: Oculus.Interaction.CylinderOrientation
#include "Oculus/Interaction/CylinderOrientation.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Oculus::Interaction::Surfaces
namespace Oculus::Interaction::Surfaces {
  // Forward declaring type: CylinderSegment
  struct CylinderSegment;
}
// Forward declaring namespace: Oculus::Interaction::UnityCanvas
namespace Oculus::Interaction::UnityCanvas {
  // Forward declaring type: CanvasRenderTexture
  class CanvasRenderTexture;
}
// Forward declaring namespace: Oculus::Interaction
namespace Oculus::Interaction {
  // Forward declaring type: Cylinder
  class Cylinder;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: MeshFilter
  class MeshFilter;
  // Forward declaring type: Vector2Int
  struct Vector2Int;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: Oculus.Interaction.UnityCanvas
namespace Oculus::Interaction::UnityCanvas {
  // Forward declaring type: CanvasCylinder
  class CanvasCylinder;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Oculus::Interaction::UnityCanvas::CanvasCylinder);
DEFINE_IL2CPP_ARG_TYPE(::Oculus::Interaction::UnityCanvas::CanvasCylinder*, "Oculus.Interaction.UnityCanvas", "CanvasCylinder");
// Type namespace: Oculus.Interaction.UnityCanvas
namespace Oculus::Interaction::UnityCanvas {
  // Size: 0x68
  #pragma pack(push, 1)
  // Autogenerated type: Oculus.Interaction.UnityCanvas.CanvasCylinder
  // [TokenAttribute] Offset: FFFFFFFF
  class CanvasCylinder : public ::Oculus::Interaction::UnityCanvas::CanvasMesh/*, public ::Oculus::Interaction::ICurvedPlane, public ::Oculus::Interaction::Surfaces::ICylinderClipper*/ {
    public:
    // Writing base type padding for base size: 0x39 to desired offset: 0x40
    char ___base_padding[0x7] = {};
    // Nested type: ::Oculus::Interaction::UnityCanvas::CanvasCylinder::MeshGenerationSettings
    struct MeshGenerationSettings;
    // Nested type: ::Oculus::Interaction::UnityCanvas::CanvasCylinder::$$c__DisplayClass31_0
    struct $$c__DisplayClass31_0;
    // Size: 0xC
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: Oculus.Interaction.UnityCanvas.CanvasCylinder/MeshGenerationSettings
    // [TokenAttribute] Offset: FFFFFFFF
    struct MeshGenerationSettings/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.Single VerticesPerDegree
      // Size: 0x4
      // Offset: 0x0
      float VerticesPerDegree;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Int32 MaxHorizontalResolution
      // Size: 0x4
      // Offset: 0x4
      int MaxHorizontalResolution;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Int32 MaxVerticalResolution
      // Size: 0x4
      // Offset: 0x8
      int MaxVerticalResolution;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: MeshGenerationSettings
      constexpr MeshGenerationSettings(float VerticesPerDegree_ = {}, int MaxHorizontalResolution_ = {}, int MaxVerticalResolution_ = {}) noexcept : VerticesPerDegree{VerticesPerDegree_}, MaxHorizontalResolution{MaxHorizontalResolution_}, MaxVerticalResolution{MaxVerticalResolution_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public System.Single VerticesPerDegree
      [[deprecated("Use field access instead!")]] float& dyn_VerticesPerDegree();
      // Get instance field reference: public System.Int32 MaxHorizontalResolution
      [[deprecated("Use field access instead!")]] int& dyn_MaxHorizontalResolution();
      // Get instance field reference: public System.Int32 MaxVerticalResolution
      [[deprecated("Use field access instead!")]] int& dyn_MaxVerticalResolution();
    }; // Oculus.Interaction.UnityCanvas.CanvasCylinder/MeshGenerationSettings
    #pragma pack(pop)
    static check_size<sizeof(CanvasCylinder::MeshGenerationSettings), 8 + sizeof(int)> __Oculus_Interaction_UnityCanvas_CanvasCylinder_MeshGenerationSettingsSizeCheck;
    static_assert(sizeof(CanvasCylinder::MeshGenerationSettings) == 0xC);
    public:
    // private Oculus.Interaction.Cylinder _cylinder
    // Size: 0x8
    // Offset: 0x40
    ::Oculus::Interaction::Cylinder* cylinder;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::Cylinder*) == 0x8);
    // private Oculus.Interaction.CylinderOrientation _orientation
    // Size: 0x4
    // Offset: 0x48
    ::Oculus::Interaction::CylinderOrientation orientation;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::CylinderOrientation) == 0x4);
    // private Oculus.Interaction.UnityCanvas.CanvasCylinder/MeshGenerationSettings _meshGeneration
    // Size: 0xC
    // Offset: 0x4C
    ::Oculus::Interaction::UnityCanvas::CanvasCylinder::MeshGenerationSettings meshGeneration;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::UnityCanvas::CanvasCylinder::MeshGenerationSettings) == 0xC);
    // private System.Single <ArcDegrees>k__BackingField
    // Size: 0x4
    // Offset: 0x58
    float ArcDegrees;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <Rotation>k__BackingField
    // Size: 0x4
    // Offset: 0x5C
    float Rotation;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <Bottom>k__BackingField
    // Size: 0x4
    // Offset: 0x60
    float Bottom;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <Top>k__BackingField
    // Size: 0x4
    // Offset: 0x64
    float Top;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Creating interface conversion operator: operator ::Oculus::Interaction::ICurvedPlane
    operator ::Oculus::Interaction::ICurvedPlane() noexcept {
      return *reinterpret_cast<::Oculus::Interaction::ICurvedPlane*>(this);
    }
    // Creating interface conversion operator: operator ::Oculus::Interaction::Surfaces::ICylinderClipper
    operator ::Oculus::Interaction::Surfaces::ICylinderClipper() noexcept {
      return *reinterpret_cast<::Oculus::Interaction::Surfaces::ICylinderClipper*>(this);
    }
    // static field const value: static public System.Int32 MIN_RESOLUTION
    static constexpr const int MIN_RESOLUTION = 2;
    // Get static field: static public System.Int32 MIN_RESOLUTION
    static int _get_MIN_RESOLUTION();
    // Set static field: static public System.Int32 MIN_RESOLUTION
    static void _set_MIN_RESOLUTION(int value);
