// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Vector2Int
#include "UnityEngine/Vector2Int.hpp"
// Including type: UnityEngine.LayerMask
#include "UnityEngine/LayerMask.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Oculus::Interaction::UnityCanvas
namespace Oculus::Interaction::UnityCanvas {
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Canvas
  class Canvas;
  // Forward declaring type: Texture
  class Texture;
  // Forward declaring type: RenderTexture
  class RenderTexture;
  // Forward declaring type: Camera
  class Camera;
  // Forward declaring type: GameObject
  class GameObject;
}
// Completed forward declares
// Type namespace: Oculus.Interaction.UnityCanvas
namespace Oculus::Interaction::UnityCanvas {
  // Forward declaring type: CanvasRenderTexture
  class CanvasRenderTexture;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Oculus::Interaction::UnityCanvas::CanvasRenderTexture);
DEFINE_IL2CPP_ARG_TYPE(::Oculus::Interaction::UnityCanvas::CanvasRenderTexture*, "Oculus.Interaction.UnityCanvas", "CanvasRenderTexture");
// Type namespace: Oculus.Interaction.UnityCanvas
namespace Oculus::Interaction::UnityCanvas {
  // Size: 0x69
  #pragma pack(push, 1)
  // Autogenerated type: Oculus.Interaction.UnityCanvas.CanvasRenderTexture
  // [TokenAttribute] Offset: FFFFFFFF
  // [DisallowMultipleComponent] Offset: FFFFFFFF
  class CanvasRenderTexture : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::Oculus::Interaction::UnityCanvas::CanvasRenderTexture::TransformChangeListener
    class TransformChangeListener;
    // Nested type: ::Oculus::Interaction::UnityCanvas::CanvasRenderTexture::DriveMode
    struct DriveMode;
    // Nested type: ::Oculus::Interaction::UnityCanvas::CanvasRenderTexture::Properties
    class Properties;
    // Nested type: ::Oculus::Interaction::UnityCanvas::CanvasRenderTexture::$$c
    class $$c;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: Oculus.Interaction.UnityCanvas.CanvasRenderTexture/DriveMode
    // [TokenAttribute] Offset: FFFFFFFF
    struct DriveMode/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: DriveMode
      constexpr DriveMode(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public Oculus.Interaction.UnityCanvas.CanvasRenderTexture/DriveMode Auto
      static constexpr const int Auto = 0;
      // Get static field: static public Oculus.Interaction.UnityCanvas.CanvasRenderTexture/DriveMode Auto
      static ::Oculus::Interaction::UnityCanvas::CanvasRenderTexture::DriveMode _get_Auto();
      // Set static field: static public Oculus.Interaction.UnityCanvas.CanvasRenderTexture/DriveMode Auto
      static void _set_Auto(::Oculus::Interaction::UnityCanvas::CanvasRenderTexture::DriveMode value);
      // static field const value: static public Oculus.Interaction.UnityCanvas.CanvasRenderTexture/DriveMode Manual
      static constexpr const int Manual = 1;
      // Get static field: static public Oculus.Interaction.UnityCanvas.CanvasRenderTexture/DriveMode Manual
      static ::Oculus::Interaction::UnityCanvas::CanvasRenderTexture::DriveMode _get_Manual();
      // Set static field: static public Oculus.Interaction.UnityCanvas.CanvasRenderTexture/DriveMode Manual
      static void _set_Manual(::Oculus::Interaction::UnityCanvas::CanvasRenderTexture::DriveMode value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // Oculus.Interaction.UnityCanvas.CanvasRenderTexture/DriveMode
    #pragma pack(pop)
    static check_size<sizeof(CanvasRenderTexture::DriveMode), 0 + sizeof(int)> __Oculus_Interaction_UnityCanvas_CanvasRenderTexture_DriveModeSizeCheck;
    static_assert(sizeof(CanvasRenderTexture::DriveMode) == 0x4);
    public:
    // private UnityEngine.Canvas _canvas
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::Canvas* canvas;
    // Field size check
    static_assert(sizeof(::UnityEngine::Canvas*) == 0x8);
    // private System.Int32 _renderScale
    // Size: 0x4
    // Offset: 0x28
    int renderScale;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private Oculus.Interaction.UnityCanvas.CanvasRenderTexture/DriveMode _dimensionsDriveMode
    // Size: 0x4
    // Offset: 0x2C
    ::Oculus::Interaction::UnityCanvas::CanvasRenderTexture::DriveMode dimensionsDriveMode;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::UnityCanvas::CanvasRenderTexture::DriveMode) == 0x4);
    // private UnityEngine.Vector2Int _resolution
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Vector2Int resolution;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2Int) == 0x8);
    // private System.Boolean _generateMipMaps
    // Size: 0x1
    // Offset: 0x38
    bool generateMipMaps;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: generateMipMaps and: pixelsPerUnit
    char __padding4[0x3] = {};
    // private System.Int32 _pixelsPerUnit
    // Size: 0x4
    // Offset: 0x3C
    int pixelsPerUnit;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.LayerMask _renderingLayers
    // Size: 0x4
    // Offset: 0x40
    ::UnityEngine::LayerMask renderingLayers;
    // Field size check
    static_assert(sizeof(::UnityEngine::LayerMask) == 0x4);
    // Padding between fields: renderingLayers and: OnUpdateRenderTexture
    char __padding6[0x4] = {};
    // public System.Action`1<UnityEngine.Texture> OnUpdateRenderTexture
    // Size: 0x8
    // Offset: 0x48
    ::System::Action_1<::UnityEngine::Texture*>* OnUpdateRenderTexture;
    // Field size check
    static_assert(sizeof(::System::Action_1<::UnityEngine::Texture*>*) == 0x8);
    // private Oculus.Interaction.UnityCanvas.CanvasRenderTexture/TransformChangeListener _listener
    // Size: 0x8
    // Offset: 0x50
    ::Oculus::Interaction::UnityCanvas::CanvasRenderTexture::TransformChangeListener* listener;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::UnityCanvas::CanvasRenderTexture::TransformChangeListener*) == 0x8);
    // private UnityEngine.RenderTexture _tex
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::RenderTexture* tex;
    // Field size check
    static_assert(sizeof(::UnityEngine::RenderTexture*) == 0x8);
    // private UnityEngine.Camera _camera
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::Camera* camera;
    // Field size check
    static_assert(sizeof(::UnityEngine::Camera*) == 0x8);
    // protected System.Boolean _started
    // Size: 0x1
    // Offset: 0x68
    bool started;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // static field const value: static public System.Int32 DEFAULT_UI_LAYERMASK
    static constexpr const int DEFAULT_UI_LAYERMASK = 32;
    // Get static field: static public System.Int32 DEFAULT_UI_LAYERMASK
    static int _get_DEFAULT_UI_LAYERMASK();
    // Set static field: static public System.Int32 DEFAULT_UI_LAYERMASK
    static void _set_DEFAULT_UI_LAYERMASK(int value);
    // Get static field: static private readonly UnityEngine.Vector2Int DEFAULT_TEXTURE_RES
    static ::UnityEngine::Vector2Int _get_DEFAULT_TEXTURE_RES();
    // Set static field: static private readonly UnityEngine.Vector2Int DEFAULT_TEXTURE_RES
    static void _set_DEFAULT_TEXTURE_RES(::UnityEngine::Vector2Int value);
    // Get instance field reference: private UnityEngine.Canvas _canvas
    [[deprecated("Use field access instead!")]] ::UnityEngine::Canvas*& dyn__canvas();
