// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Pathfinding.RecastGraph/RelevantGraphSurfaceMode
#include "Pathfinding/RecastGraph.hpp"
// Including type: UnityEngine.Bounds
#include "UnityEngine/Bounds.hpp"
// Including type: System.UInt32
#include "System/UInt32.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
// Including type: System.UInt16
#include "System/UInt16.hpp"
// Including type: Pathfinding.Int3
#include "Pathfinding/Int3.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: Pathfinding::Voxels
namespace Pathfinding::Voxels {
  // Forward declaring type: RasterizationMesh
  class RasterizationMesh;
  // Forward declaring type: VoxelArea
  class VoxelArea;
  // Forward declaring type: VoxelContourSet
  class VoxelContourSet;
  // Forward declaring type: VoxelContour
  struct VoxelContour;
  // Forward declaring type: VoxelMesh
  struct VoxelMesh;
}
// Forward declaring namespace: Pathfinding::Util
namespace Pathfinding::Util {
  // Forward declaring type: GraphTransform
  class GraphTransform;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Color
  struct Color;
}
// Completed forward declares
// Type namespace: Pathfinding.Voxels
namespace Pathfinding::Voxels {
  // Forward declaring type: Voxelize
  class Voxelize;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Pathfinding::Voxels::Voxelize);
DEFINE_IL2CPP_ARG_TYPE(::Pathfinding::Voxels::Voxelize*, "Pathfinding.Voxels", "Voxelize");
// Type namespace: Pathfinding.Voxels
namespace Pathfinding::Voxels {
  // Size: 0x98
  #pragma pack(push, 1)
  // Autogenerated type: Pathfinding.Voxels.Voxelize
  // [TokenAttribute] Offset: FFFFFFFF
  class Voxelize : public ::Il2CppObject {
    public:
    public:
    // public System.Collections.Generic.List`1<Pathfinding.Voxels.RasterizationMesh> inputMeshes
    // Size: 0x8
    // Offset: 0x10
    ::System::Collections::Generic::List_1<::Pathfinding::Voxels::RasterizationMesh*>* inputMeshes;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Pathfinding::Voxels::RasterizationMesh*>*) == 0x8);
    // public readonly System.Int32 voxelWalkableClimb
    // Size: 0x4
    // Offset: 0x18
    int voxelWalkableClimb;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public readonly System.UInt32 voxelWalkableHeight
    // Size: 0x4
    // Offset: 0x1C
    uint voxelWalkableHeight;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // public readonly System.Single cellSize
    // Size: 0x4
    // Offset: 0x20
    float cellSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public readonly System.Single cellHeight
    // Size: 0x4
    // Offset: 0x24
    float cellHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Int32 minRegionSize
    // Size: 0x4
    // Offset: 0x28
    int minRegionSize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 borderSize
    // Size: 0x4
    // Offset: 0x2C
    int borderSize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Single maxEdgeLength
    // Size: 0x4
    // Offset: 0x30
    float maxEdgeLength;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single maxSlope
    // Size: 0x4
    // Offset: 0x34
    float maxSlope;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public Pathfinding.RecastGraph/RelevantGraphSurfaceMode relevantGraphSurfaceMode
    // Size: 0x4
    // Offset: 0x38
    ::Pathfinding::RecastGraph::RelevantGraphSurfaceMode relevantGraphSurfaceMode;
    // Field size check
    static_assert(sizeof(::Pathfinding::RecastGraph::RelevantGraphSurfaceMode) == 0x4);
    // public UnityEngine.Bounds forcedBounds
    // Size: 0x18
    // Offset: 0x3C
    ::UnityEngine::Bounds forcedBounds;
    // Field size check
    static_assert(sizeof(::UnityEngine::Bounds) == 0x18);
    // Padding between fields: forcedBounds and: voxelArea
    char __padding10[0x4] = {};
    // public Pathfinding.Voxels.VoxelArea voxelArea
    // Size: 0x8
    // Offset: 0x58
    ::Pathfinding::Voxels::VoxelArea* voxelArea;
    // Field size check
    static_assert(sizeof(::Pathfinding::Voxels::VoxelArea*) == 0x8);
    // public Pathfinding.Voxels.VoxelContourSet countourSet
    // Size: 0x8
    // Offset: 0x60
    ::Pathfinding::Voxels::VoxelContourSet* countourSet;
    // Field size check
    static_assert(sizeof(::Pathfinding::Voxels::VoxelContourSet*) == 0x8);
    // private Pathfinding.Util.GraphTransform transform
    // Size: 0x8
    // Offset: 0x68
    ::Pathfinding::Util::GraphTransform* transform;
    // Field size check
    static_assert(sizeof(::Pathfinding::Util::GraphTransform*) == 0x8);
    // private Pathfinding.Util.GraphTransform <transformVoxel2Graph>k__BackingField
    // Size: 0x8
    // Offset: 0x70
    ::Pathfinding::Util::GraphTransform* transformVoxel2Graph;
    // Field size check
    static_assert(sizeof(::Pathfinding::Util::GraphTransform*) == 0x8);
    // public System.Int32 width
    // Size: 0x4
    // Offset: 0x78
    int width;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 depth
    // Size: 0x4
    // Offset: 0x7C
    int depth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.Vector3 voxelOffset
    // Size: 0xC
    // Offset: 0x80
    ::UnityEngine::Vector3 voxelOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private readonly UnityEngine.Vector3 cellScale
    // Size: 0xC
    // Offset: 0x8C
    ::UnityEngine::Vector3 cellScale;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    public:
    // static field const value: static public System.UInt32 NotConnected
    static constexpr const uint NotConnected = 63u;
    // Get static field: static public System.UInt32 NotConnected
    static uint _get_NotConnected();
    // Set static field: static public System.UInt32 NotConnected
    static void _set_NotConnected(uint value);
    // static field const value: static private System.Int32 MaxLayers
    static constexpr const int MaxLayers = 65535;
    // Get static field: static private System.Int32 MaxLayers
    static int _get_MaxLayers();
    // Set static field: static private System.Int32 MaxLayers
    static void _set_MaxLayers(int value);
    // static field const value: static private System.Int32 MaxRegions
    static constexpr const int MaxRegions = 500;
