// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: System.Net.NetworkInformation.AixStructs.sockaddr
#include "System/Net/NetworkInformation/AixStructs/sockaddr.hpp"
// Completed includes
// Type namespace: System.Net.NetworkInformation.AixStructs
namespace System::Net::NetworkInformation::AixStructs {
  // Forward declaring type: ifreq
  struct ifreq;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::System::Net::NetworkInformation::AixStructs::ifreq, "System.Net.NetworkInformation.AixStructs", "ifreq");
// Type namespace: System.Net.NetworkInformation.AixStructs
namespace System::Net::NetworkInformation::AixStructs {
  // Size: 0x12
  #pragma pack(push, 1)
  // WARNING Layout: Explicit may not be correctly taken into account!
  // Autogenerated type: System.Net.NetworkInformation.AixStructs.ifreq
  // [TokenAttribute] Offset: FFFFFFFF
  struct ifreq/*, public ::System::ValueType*/ {
    public:
    // Nested type: ::System::Net::NetworkInformation::AixStructs::ifreq::$ifr_name$e__FixedBuffer
    struct $ifr_name$e__FixedBuffer;
    // Size: 0x1
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: System.Net.NetworkInformation.AixStructs.ifreq/<ifr_name>e__FixedBuffer
    // [TokenAttribute] Offset: FFFFFFFF
    // [UnsafeValueTypeAttribute] Offset: FFFFFFFF
    // [CompilerGeneratedAttribute] Offset: FFFFFFFF
    struct $ifr_name$e__FixedBuffer/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.Byte FixedElementField
      // Size: 0x1
      // Offset: 0x0
      uint8_t FixedElementField;
      // Field size check
      static_assert(sizeof(uint8_t) == 0x1);
      public:
      // Creating value type constructor for type: $ifr_name$e__FixedBuffer
      constexpr $ifr_name$e__FixedBuffer(uint8_t FixedElementField_ = {}) noexcept : FixedElementField{FixedElementField_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Creating conversion operator: operator uint8_t
      constexpr operator uint8_t() const noexcept {
        return FixedElementField;
      }
      // Get instance field reference: public System.Byte FixedElementField
      [[deprecated("Use field access instead!")]] uint8_t& dyn_FixedElementField();
    }; // System.Net.NetworkInformation.AixStructs.ifreq/<ifr_name>e__FixedBuffer
    #pragma pack(pop)
    static check_size<sizeof(ifreq::$ifr_name$e__FixedBuffer), 0 + sizeof(uint8_t)> __System_Net_NetworkInformation_AixStructs_ifreq_$ifr_name$e__FixedBufferSizeCheck;
    static_assert(sizeof(ifreq::$ifr_name$e__FixedBuffer) == 0x1);
    public:
    // public System.Net.NetworkInformation.AixStructs.ifreq/<ifr_name>e__FixedBuffer ifr_name
    // Size: 0x1
    // Offset: 0x0
    ::System::Net::NetworkInformation::AixStructs::ifreq::$ifr_name$e__FixedBuffer ifr_name;
    // Field size check
    static_assert(sizeof(::System::Net::NetworkInformation::AixStructs::ifreq::$ifr_name$e__FixedBuffer) == 0x1);
    // Padding between fields: ifr_name and: ifru_addr
    char __padding0[0xF] = {};
    // public System.Net.NetworkInformation.AixStructs.sockaddr ifru_addr
    // Size: 0x2
    // Offset: 0x10
    ::System::Net::NetworkInformation::AixStructs::sockaddr ifru_addr;
    // Field size check
    static_assert(sizeof(::System::Net::NetworkInformation::AixStructs::sockaddr) == 0x2);
    public:
    // Creating value type constructor for type: ifreq
    constexpr ifreq(::System::Net::NetworkInformation::AixStructs::ifreq::$ifr_name$e__FixedBuffer ifr_name_ = {}, ::System::Net::NetworkInformation::AixStructs::sockaddr ifru_addr_ = {}) noexcept : ifr_name{ifr_name_}, ifru_addr{ifru_addr_} {}
    // Creating interface conversion operator: operator ::System::ValueType
    operator ::System::ValueType() noexcept {
      return *reinterpret_cast<::System::ValueType*>(this);
    }
    // Get instance field reference: public System.Net.NetworkInformation.AixStructs.ifreq/<ifr_name>e__FixedBuffer ifr_name
    [[deprecated("Use field access instead!")]] ::System::Net::NetworkInformation::AixStructs::ifreq::$ifr_name$e__FixedBuffer& dyn_ifr_name();
    // Get instance field reference: public System.Net.NetworkInformation.AixStructs.sockaddr ifru_addr
    [[deprecated("Use field access instead!")]] ::System::Net::NetworkInformation::AixStructs::sockaddr& dyn_ifru_addr();
  }; // System.Net.NetworkInformation.AixStructs.ifreq
  #pragma pack(pop)
  static check_size<sizeof(ifreq), 16 + sizeof(::System::Net::NetworkInformation::AixStructs::sockaddr)> __System_Net_NetworkInformation_AixStructs_ifreqSizeCheck;
  static_assert(sizeof(ifreq) == 0x12);
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::System::Net::NetworkInformation::AixStructs::ifreq::$ifr_name$e__FixedBuffer, "System.Net.NetworkInformation.AixStructs", "ifreq/<ifr_name>e__FixedBuffer");
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
