// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: Oculus.Interaction.PoseDetection.IFingerFeatureStateProvider
#include "Oculus/Interaction/PoseDetection/IFingerFeatureStateProvider.hpp"
// Including type: Oculus.Interaction.Input.HandFinger
#include "Oculus/Interaction/Input/HandFinger.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Oculus::Interaction::PoseDetection
namespace Oculus::Interaction::PoseDetection {
  // Forward declaring type: FingerFeatureStateDictionary
  class FingerFeatureStateDictionary;
  // Forward declaring type: FingerShapes
  class FingerShapes;
  // Forward declaring type: FingerFeature
  struct FingerFeature;
  // Forward declaring type: FeatureStateActiveMode
  struct FeatureStateActiveMode;
  // Forward declaring type: FingerFeatureStateThresholds
  class FingerFeatureStateThresholds;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Skipping declaration: Object because it is already included!
}
// Forward declaring namespace: Oculus::Interaction::Input
namespace Oculus::Interaction::Input {
  // Forward declaring type: IHand
  class IHand;
  // Forward declaring type: ReadOnlyHandJointPoses
  class ReadOnlyHandJointPoses;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Func`1<TResult>
  template<typename TResult>
  class Func_1;
  // Forward declaring type: Nullable`1<T>
  template<typename T>
  struct Nullable_1;
}
// Completed forward declares
// Type namespace: Oculus.Interaction.PoseDetection
namespace Oculus::Interaction::PoseDetection {
  // Forward declaring type: FingerFeatureStateProvider
  class FingerFeatureStateProvider;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Oculus::Interaction::PoseDetection::FingerFeatureStateProvider);
DEFINE_IL2CPP_ARG_TYPE(::Oculus::Interaction::PoseDetection::FingerFeatureStateProvider*, "Oculus.Interaction.PoseDetection", "FingerFeatureStateProvider");
// Type namespace: Oculus.Interaction.PoseDetection
namespace Oculus::Interaction::PoseDetection {
  // Size: 0x60
  #pragma pack(push, 1)
  // Autogenerated type: Oculus.Interaction.PoseDetection.FingerFeatureStateProvider
  // [TokenAttribute] Offset: FFFFFFFF
  class FingerFeatureStateProvider : public ::UnityEngine::MonoBehaviour/*, public ::Oculus::Interaction::PoseDetection::IFingerFeatureStateProvider*/ {
    public:
    // Nested type: ::Oculus::Interaction::PoseDetection::FingerFeatureStateProvider::FingerStateThresholds
    struct FingerStateThresholds;
    // Nested type: ::Oculus::Interaction::PoseDetection::FingerFeatureStateProvider::$$c
    class $$c;
    // Nested type: ::Oculus::Interaction::PoseDetection::FingerFeatureStateProvider::$$c__DisplayClass20_0
    class $$c__DisplayClass20_0;
    // Size: 0x10
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: Oculus.Interaction.PoseDetection.FingerFeatureStateProvider/FingerStateThresholds
    // [TokenAttribute] Offset: FFFFFFFF
    struct FingerStateThresholds/*, public ::System::ValueType*/ {
      public:
      public:
      // public Oculus.Interaction.Input.HandFinger Finger
      // Size: 0x4
      // Offset: 0x0
      ::Oculus::Interaction::Input::HandFinger Finger;
      // Field size check
      static_assert(sizeof(::Oculus::Interaction::Input::HandFinger) == 0x4);
      // Padding between fields: Finger and: StateThresholds
      char __padding0[0x4] = {};
      // public Oculus.Interaction.PoseDetection.FingerFeatureStateThresholds StateThresholds
      // Size: 0x8
      // Offset: 0x8
      ::Oculus::Interaction::PoseDetection::FingerFeatureStateThresholds* StateThresholds;
      // Field size check
      static_assert(sizeof(::Oculus::Interaction::PoseDetection::FingerFeatureStateThresholds*) == 0x8);
      public:
      // Creating value type constructor for type: FingerStateThresholds
      constexpr FingerStateThresholds(::Oculus::Interaction::Input::HandFinger Finger_ = {}, ::Oculus::Interaction::PoseDetection::FingerFeatureStateThresholds* StateThresholds_ = {}) noexcept : Finger{Finger_}, StateThresholds{StateThresholds_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public Oculus.Interaction.Input.HandFinger Finger
      [[deprecated("Use field access instead!")]] ::Oculus::Interaction::Input::HandFinger& dyn_Finger();
      // Get instance field reference: public Oculus.Interaction.PoseDetection.FingerFeatureStateThresholds StateThresholds
      [[deprecated("Use field access instead!")]] ::Oculus::Interaction::PoseDetection::FingerFeatureStateThresholds*& dyn_StateThresholds();
    }; // Oculus.Interaction.PoseDetection.FingerFeatureStateProvider/FingerStateThresholds
    #pragma pack(pop)
    static check_size<sizeof(FingerFeatureStateProvider::FingerStateThresholds), 8 + sizeof(::Oculus::Interaction::PoseDetection::FingerFeatureStateThresholds*)> __Oculus_Interaction_PoseDetection_FingerFeatureStateProvider_FingerStateThresholdsSizeCheck;
    static_assert(sizeof(FingerFeatureStateProvider::FingerStateThresholds) == 0x10);
    public:
    // private UnityEngine.Object _hand
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::Object* hand;
    // Field size check
    static_assert(sizeof(::UnityEngine::Object*) == 0x8);
    // private Oculus.Interaction.Input.IHand <Hand>k__BackingField
    // Size: 0x8
    // Offset: 0x28
    ::Oculus::Interaction::Input::IHand* Hand;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::Input::IHand*) == 0x8);
    // private System.Collections.Generic.List`1<Oculus.Interaction.PoseDetection.FingerFeatureStateProvider/FingerStateThresholds> _fingerStateThresholds
    // Size: 0x8
    // Offset: 0x30
    ::System::Collections::Generic::List_1<::Oculus::Interaction::PoseDetection::FingerFeatureStateProvider::FingerStateThresholds>* fingerStateThresholds;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Oculus::Interaction::PoseDetection::FingerFeatureStateProvider::FingerStateThresholds>*) == 0x8);
    // private System.Boolean _disableProactiveEvaluation
    // Size: 0x1
    // Offset: 0x38
    bool disableProactiveEvaluation;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean _started
    // Size: 0x1
    // Offset: 0x39
    bool started;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: started and: state
    char __padding4[0x6] = {};
    // private Oculus.Interaction.PoseDetection.FingerFeatureStateDictionary _state
    // Size: 0x8
    // Offset: 0x40
    ::Oculus::Interaction::PoseDetection::FingerFeatureStateDictionary* state;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::PoseDetection::FingerFeatureStateDictionary*) == 0x8);
    // private System.Func`1<System.Single> _timeProvider
    // Size: 0x8
    // Offset: 0x48
    ::System::Func_1<float>* timeProvider;
    // Field size check
    static_assert(sizeof(::System::Func_1<float>*) == 0x8);
    // private Oculus.Interaction.PoseDetection.FingerShapes _fingerShapes
    // Size: 0x8
    // Offset: 0x50
    ::Oculus::Interaction::PoseDetection::FingerShapes* fingerShapes;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::PoseDetection::FingerShapes*) == 0x8);
    // private Oculus.Interaction.Input.ReadOnlyHandJointPoses _handJointPoses
    // Size: 0x8
    // Offset: 0x58
    ::Oculus::Interaction::Input::ReadOnlyHandJointPoses* handJointPoses;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::Input::ReadOnlyHandJointPoses*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::Oculus::Interaction::PoseDetection::IFingerFeatureStateProvider
    operator ::Oculus::Interaction::PoseDetection::IFingerFeatureStateProvider() noexcept {
      return *reinterpret_cast<::Oculus::Interaction::PoseDetection::IFingerFeatureStateProvider*>(this);
    }
    // Get static field: static private readonly Oculus.Interaction.PoseDetection.FingerShapes <DefaultFingerShapes>k__BackingField
    static ::Oculus::Interaction::PoseDetection::FingerShapes* _get_$DefaultFingerShapes$k__BackingField();
    // Set static field: static private readonly Oculus.Interaction.PoseDetection.FingerShapes <DefaultFingerShapes>k__BackingField
