// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: Oculus.Interaction.IActiveState
#include "Oculus/Interaction/IActiveState.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Oculus::Interaction::PoseDetection
namespace Oculus::Interaction::PoseDetection {
  // Forward declaring type: JointDeltaConfig
  class JointDeltaConfig;
  // Forward declaring type: IJointDeltaProvider
  class IJointDeltaProvider;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Skipping declaration: Object because it is already included!
  // Forward declaring type: Pose
  struct Pose;
}
// Forward declaring namespace: Oculus::Interaction::Input
namespace Oculus::Interaction::Input {
  // Forward declaring type: IHand
  class IHand;
  // Forward declaring type: IHmd
  class IHmd;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: IReadOnlyList`1<T>
  template<typename T>
  class IReadOnlyList_1;
  // Forward declaring type: IReadOnlyDictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class IReadOnlyDictionary_2;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Func`1<TResult>
  template<typename TResult>
  class Func_1;
}
// Completed forward declares
// Type namespace: Oculus.Interaction.PoseDetection
namespace Oculus::Interaction::PoseDetection {
  // Forward declaring type: JointVelocityActiveState
  class JointVelocityActiveState;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Oculus::Interaction::PoseDetection::JointVelocityActiveState);
DEFINE_IL2CPP_ARG_TYPE(::Oculus::Interaction::PoseDetection::JointVelocityActiveState*, "Oculus.Interaction.PoseDetection", "JointVelocityActiveState");
// Type namespace: Oculus.Interaction.PoseDetection
namespace Oculus::Interaction::PoseDetection {
  // Size: 0x8F
  #pragma pack(push, 1)
  // Autogenerated type: Oculus.Interaction.PoseDetection.JointVelocityActiveState
  // [TokenAttribute] Offset: FFFFFFFF
  class JointVelocityActiveState : public ::UnityEngine::MonoBehaviour/*, public ::Oculus::Interaction::IActiveState*/ {
    public:
    // Nested type: ::Oculus::Interaction::PoseDetection::JointVelocityActiveState::RelativeTo
    struct RelativeTo;
    // Nested type: ::Oculus::Interaction::PoseDetection::JointVelocityActiveState::WorldAxis
    struct WorldAxis;
    // Nested type: ::Oculus::Interaction::PoseDetection::JointVelocityActiveState::HeadAxis
    struct HeadAxis;
    // Nested type: ::Oculus::Interaction::PoseDetection::JointVelocityActiveState::HandAxis
    struct HandAxis;
    // Nested type: ::Oculus::Interaction::PoseDetection::JointVelocityActiveState::JointVelocityFeatureState
    struct JointVelocityFeatureState;
    // Nested type: ::Oculus::Interaction::PoseDetection::JointVelocityActiveState::JointVelocityFeatureConfigList
    class JointVelocityFeatureConfigList;
    // Nested type: ::Oculus::Interaction::PoseDetection::JointVelocityActiveState::JointVelocityFeatureConfig
    class JointVelocityFeatureConfig;
    // Nested type: ::Oculus::Interaction::PoseDetection::JointVelocityActiveState::$$c
    class $$c;
    // Size: 0x10
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: Oculus.Interaction.PoseDetection.JointVelocityActiveState/JointVelocityFeatureState
    // [TokenAttribute] Offset: FFFFFFFF
    struct JointVelocityFeatureState/*, public ::System::ValueType*/ {
      public:
      public:
      // public readonly UnityEngine.Vector3 TargetVector
      // Size: 0xC
      // Offset: 0x0
      ::UnityEngine::Vector3 TargetVector;
      // Field size check
      static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
      // public readonly System.Single Amount
      // Size: 0x4
      // Offset: 0xC
      float Amount;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      public:
      // Creating value type constructor for type: JointVelocityFeatureState
      constexpr JointVelocityFeatureState(::UnityEngine::Vector3 TargetVector_ = {}, float Amount_ = {}) noexcept : TargetVector{TargetVector_}, Amount{Amount_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public readonly UnityEngine.Vector3 TargetVector
      [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_TargetVector();
      // Get instance field reference: public readonly System.Single Amount
      [[deprecated("Use field access instead!")]] float& dyn_Amount();
      // public System.Void .ctor(UnityEngine.Vector3 targetVector, System.Single velocity)
      // Offset: 0x47F10AC
      // ABORTED: conflicts with another method.  JointVelocityFeatureState(::UnityEngine::Vector3 targetVector, float velocity);
    }; // Oculus.Interaction.PoseDetection.JointVelocityActiveState/JointVelocityFeatureState
    #pragma pack(pop)
    static check_size<sizeof(JointVelocityActiveState::JointVelocityFeatureState), 12 + sizeof(float)> __Oculus_Interaction_PoseDetection_JointVelocityActiveState_JointVelocityFeatureStateSizeCheck;
    static_assert(sizeof(JointVelocityActiveState::JointVelocityFeatureState) == 0x10);
    public:
    // private UnityEngine.Object _hand
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::Object* hand;
    // Field size check
    static_assert(sizeof(::UnityEngine::Object*) == 0x8);
    // private Oculus.Interaction.Input.IHand <Hand>k__BackingField
    // Size: 0x8
    // Offset: 0x28
    ::Oculus::Interaction::Input::IHand* Hand;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::Input::IHand*) == 0x8);
    // private UnityEngine.Object _jointDeltaProvider
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Object* jointDeltaProvider;
    // Field size check
    static_assert(sizeof(::UnityEngine::Object*) == 0x8);
    // private Oculus.Interaction.PoseDetection.IJointDeltaProvider <JointDeltaProvider>k__BackingField
    // Size: 0x8
    // Offset: 0x38
    ::Oculus::Interaction::PoseDetection::IJointDeltaProvider* JointDeltaProvider;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::PoseDetection::IJointDeltaProvider*) == 0x8);
    // private UnityEngine.Object _hmd
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::Object* hmd;
    // Field size check
    static_assert(sizeof(::UnityEngine::Object*) == 0x8);
    // private Oculus.Interaction.Input.IHmd <Hmd>k__BackingField
    // Size: 0x8
    // Offset: 0x48
    ::Oculus::Interaction::Input::IHmd* Hmd;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::Input::IHmd*) == 0x8);
    // private Oculus.Interaction.PoseDetection.JointVelocityActiveState/JointVelocityFeatureConfigList _featureConfigs
    // Size: 0x8
    // Offset: 0x50
    ::Oculus::Interaction::PoseDetection::JointVelocityActiveState::JointVelocityFeatureConfigList* featureConfigs;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::PoseDetection::JointVelocityActiveState::JointVelocityFeatureConfigList*) == 0x8);
    // private System.Single _minVelocity
    // Size: 0x4
    // Offset: 0x58
    float minVelocity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _thresholdWidth
    // Size: 0x4
    // Offset: 0x5C
    float thresholdWidth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _minTimeInState
    // Size: 0x4
    // Offset: 0x60
    float minTimeInState;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: minTimeInState and: featureStates
    char __padding9[0x4] = {};
    // private System.Collections.Generic.Dictionary`2<Oculus.Interaction.PoseDetection.JointVelocityActiveState/JointVelocityFeatureConfig,Oculus.Interaction.PoseDetection.JointVelocityActiveState/JointVelocityFeatureState> _featureStates
    // Size: 0x8
    // Offset: 0x68
    ::System::Collections::Generic::Dictionary_2<::Oculus::Interaction::PoseDetection::JointVelocityActiveState::JointVelocityFeatureConfig*, ::Oculus::Interaction::PoseDetection::JointVelocityActiveState::JointVelocityFeatureState>* featureStates;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::Oculus::Interaction::PoseDetection::JointVelocityActiveState::JointVelocityFeatureConfig*, ::Oculus::Interaction::PoseDetection::JointVelocityActiveState::JointVelocityFeatureState>*) == 0x8);
    // private Oculus.Interaction.PoseDetection.JointDeltaConfig _jointDeltaConfig
    // Size: 0x8
    // Offset: 0x70
    ::Oculus::Interaction::PoseDetection::JointDeltaConfig* jointDeltaConfig;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::PoseDetection::JointDeltaConfig*) == 0x8);
    // private System.Func`1<System.Single> _timeProvider
    // Size: 0x8
    // Offset: 0x78
    ::System::Func_1<float>* timeProvider;
    // Field size check
    static_assert(sizeof(::System::Func_1<float>*) == 0x8);
    // private System.Int32 _lastStateUpdateFrame
    // Size: 0x4
    // Offset: 0x80
    int lastStateUpdateFrame;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single _lastStateChangeTime
    // Size: 0x4
    // Offset: 0x84
    float lastStateChangeTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _lastUpdateTime
    // Size: 0x4
    // Offset: 0x88
    float lastUpdateTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean _internalState
    // Size: 0x1
    // Offset: 0x8C
    bool internalState;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _activeState
    // Size: 0x1
    // Offset: 0x8D
    bool activeState;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean _started
    // Size: 0x1
    // Offset: 0x8E
    bool started;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating interface conversion operator: operator ::Oculus::Interaction::IActiveState
    operator ::Oculus::Interaction::IActiveState() noexcept {
      return *reinterpret_cast<::Oculus::Interaction::IActiveState*>(this);
    }
    // Get instance field reference: private UnityEngine.Object _hand
    [[deprecated("Use field access instead!")]] ::UnityEngine::Object*& dyn__hand();
    // Get instance field reference: private Oculus.Interaction.Input.IHand <Hand>k__BackingField
    [[deprecated("Use field access instead!")]] ::Oculus::Interaction::Input::IHand*& dyn_$Hand$k__BackingField();
    // Get instance field reference: private UnityEngine.Object _jointDeltaProvider
    [[deprecated("Use field access instead!")]] ::UnityEngine::Object*& dyn__jointDeltaProvider();
