// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.InputSystem.OnScreen.OnScreenControl
#include "UnityEngine/InputSystem/OnScreen/OnScreenControl.hpp"
// Including type: UnityEngine.EventSystems.IPointerDownHandler
#include "UnityEngine/EventSystems/IPointerDownHandler.hpp"
// Including type: UnityEngine.EventSystems.IPointerUpHandler
#include "UnityEngine/EventSystems/IPointerUpHandler.hpp"
// Including type: UnityEngine.EventSystems.IDragHandler
#include "UnityEngine/EventSystems/IDragHandler.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
// Including type: UnityEngine.EventSystems.RaycastResult
#include "UnityEngine/EventSystems/RaycastResult.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::InputSystem
namespace UnityEngine::InputSystem {
  // Forward declaring type: InputAction
  class InputAction;
  // Forward declaring type: CallbackContext
  struct InputAction_CallbackContext;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine::EventSystems
namespace UnityEngine::EventSystems {
  // Forward declaring type: PointerEventData
  class PointerEventData;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Camera
  class Camera;
}
// Forward declaring namespace: UnityEngine::InputSystem::OnScreen
namespace UnityEngine::InputSystem::OnScreen {
  // Skipping declaration: Behaviour because it is already included!
}
// Completed forward declares
// Type namespace: UnityEngine.InputSystem.OnScreen
namespace UnityEngine::InputSystem::OnScreen {
  // Forward declaring type: OnScreenStick
  class OnScreenStick;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::InputSystem::OnScreen::OnScreenStick);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::InputSystem::OnScreen::OnScreenStick*, "UnityEngine.InputSystem.OnScreen", "OnScreenStick");
// Type namespace: UnityEngine.InputSystem.OnScreen
namespace UnityEngine::InputSystem::OnScreen {
  // Size: 0x88
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.InputSystem.OnScreen.OnScreenStick
  // [TokenAttribute] Offset: FFFFFFFF
  // [HelpURLAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: FFFFFFFF
  class OnScreenStick : public ::UnityEngine::InputSystem::OnScreen::OnScreenControl/*, public ::UnityEngine::EventSystems::IPointerDownHandler, public ::UnityEngine::EventSystems::IPointerUpHandler, public ::UnityEngine::EventSystems::IDragHandler*/ {
    public:
    // Nested type: ::UnityEngine::InputSystem::OnScreen::OnScreenStick::Behaviour
    struct Behaviour;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.InputSystem.OnScreen.OnScreenStick/Behaviour
    // [TokenAttribute] Offset: FFFFFFFF
    struct Behaviour/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: Behaviour
      constexpr Behaviour(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.InputSystem.OnScreen.OnScreenStick/Behaviour RelativePositionWithStaticOrigin
      static constexpr const int RelativePositionWithStaticOrigin = 0;
      // Get static field: static public UnityEngine.InputSystem.OnScreen.OnScreenStick/Behaviour RelativePositionWithStaticOrigin
      static ::UnityEngine::InputSystem::OnScreen::OnScreenStick::Behaviour _get_RelativePositionWithStaticOrigin();
      // Set static field: static public UnityEngine.InputSystem.OnScreen.OnScreenStick/Behaviour RelativePositionWithStaticOrigin
      static void _set_RelativePositionWithStaticOrigin(::UnityEngine::InputSystem::OnScreen::OnScreenStick::Behaviour value);
      // static field const value: static public UnityEngine.InputSystem.OnScreen.OnScreenStick/Behaviour ExactPositionWithStaticOrigin
      static constexpr const int ExactPositionWithStaticOrigin = 1;
      // Get static field: static public UnityEngine.InputSystem.OnScreen.OnScreenStick/Behaviour ExactPositionWithStaticOrigin
      static ::UnityEngine::InputSystem::OnScreen::OnScreenStick::Behaviour _get_ExactPositionWithStaticOrigin();
      // Set static field: static public UnityEngine.InputSystem.OnScreen.OnScreenStick/Behaviour ExactPositionWithStaticOrigin
      static void _set_ExactPositionWithStaticOrigin(::UnityEngine::InputSystem::OnScreen::OnScreenStick::Behaviour value);
      // static field const value: static public UnityEngine.InputSystem.OnScreen.OnScreenStick/Behaviour ExactPositionWithDynamicOrigin
      static constexpr const int ExactPositionWithDynamicOrigin = 2;
      // Get static field: static public UnityEngine.InputSystem.OnScreen.OnScreenStick/Behaviour ExactPositionWithDynamicOrigin
      static ::UnityEngine::InputSystem::OnScreen::OnScreenStick::Behaviour _get_ExactPositionWithDynamicOrigin();
      // Set static field: static public UnityEngine.InputSystem.OnScreen.OnScreenStick/Behaviour ExactPositionWithDynamicOrigin
      static void _set_ExactPositionWithDynamicOrigin(::UnityEngine::InputSystem::OnScreen::OnScreenStick::Behaviour value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.InputSystem.OnScreen.OnScreenStick/Behaviour
    #pragma pack(pop)
    static check_size<sizeof(OnScreenStick::Behaviour), 0 + sizeof(int)> __UnityEngine_InputSystem_OnScreen_OnScreenStick_BehaviourSizeCheck;
    static_assert(sizeof(OnScreenStick::Behaviour) == 0x4);
    public:
    // private System.Single m_MovementRange
    // Size: 0x4
    // Offset: 0x38
    float m_MovementRange;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_DynamicOriginRange
    // Size: 0x4
    // Offset: 0x3C
    float m_DynamicOriginRange;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.String m_ControlPath
    // Size: 0x8
    // Offset: 0x40
    ::StringW m_ControlPath;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private UnityEngine.InputSystem.OnScreen.OnScreenStick/Behaviour m_Behaviour
    // Size: 0x4
    // Offset: 0x48
    ::UnityEngine::InputSystem::OnScreen::OnScreenStick::Behaviour m_Behaviour;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::OnScreen::OnScreenStick::Behaviour) == 0x4);
    // private System.Boolean m_UseIsolatedInputActions
    // Size: 0x1
    // Offset: 0x4C
    bool m_UseIsolatedInputActions;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_UseIsolatedInputActions and: m_PointerDownAction
    char __padding4[0x3] = {};
    // private UnityEngine.InputSystem.InputAction m_PointerDownAction
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::InputSystem::InputAction* m_PointerDownAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputAction*) == 0x8);
    // private UnityEngine.InputSystem.InputAction m_PointerMoveAction
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::InputSystem::InputAction* m_PointerMoveAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputAction*) == 0x8);
    // private UnityEngine.Vector3 m_StartPos
    // Size: 0xC
    // Offset: 0x60
    ::UnityEngine::Vector3 m_StartPos;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector2 m_PointerDownPos
    // Size: 0x8
    // Offset: 0x6C
    ::UnityEngine::Vector2 m_PointerDownPos;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // Padding between fields: m_PointerDownPos and: m_RaycastResults
    char __padding8[0x4] = {};
    // private System.Collections.Generic.List`1<UnityEngine.EventSystems.RaycastResult> m_RaycastResults
    // Size: 0x8
    // Offset: 0x78
    ::System::Collections::Generic::List_1<::UnityEngine::EventSystems::RaycastResult>* m_RaycastResults;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::EventSystems::RaycastResult>*) == 0x8);
    // private UnityEngine.EventSystems.PointerEventData m_PointerEventData
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::EventSystems::PointerEventData* m_PointerEventData;
    // Field size check
    static_assert(sizeof(::UnityEngine::EventSystems::PointerEventData*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::UnityEngine::EventSystems::IPointerDownHandler
    operator ::UnityEngine::EventSystems::IPointerDownHandler() noexcept {
      return *reinterpret_cast<::UnityEngine::EventSystems::IPointerDownHandler*>(this);
    }
    // Creating interface conversion operator: operator ::UnityEngine::EventSystems::IPointerUpHandler
    operator ::UnityEngine::EventSystems::IPointerUpHandler() noexcept {
      return *reinterpret_cast<::UnityEngine::EventSystems::IPointerUpHandler*>(this);
    }
    // Creating interface conversion operator: operator ::UnityEngine::EventSystems::IDragHandler
    operator ::UnityEngine::EventSystems::IDragHandler() noexcept {
