// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.UIElements.StyleSheets.StylePropertyValue
#include "UnityEngine/UIElements/StyleSheets/StylePropertyValue.hpp"
// Including type: UnityEngine.UIElements.StyleSheets.StylePropertyId
#include "UnityEngine/UIElements/StyleSheets/StylePropertyId.hpp"
// Including type: UnityEngine.UIElements.EasingFunction
#include "UnityEngine/UIElements/EasingFunction.hpp"
// Including type: UnityEngine.UIElements.TimeValue
#include "UnityEngine/UIElements/TimeValue.hpp"
// Including type: UnityEngine.UIElements.StylePropertyName
#include "UnityEngine/UIElements/StylePropertyName.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UIElements::StyleSheets
namespace UnityEngine::UIElements::StyleSheets {
  // Forward declaring type: StyleEnumType
  struct StyleEnumType;
  // Forward declaring type: ImageSource
  struct ImageSource;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine::UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: StyleVariableResolver
  class StyleVariableResolver;
  // Forward declaring type: StyleSheet
  class StyleSheet;
  // Forward declaring type: StyleProperty
  class StyleProperty;
  // Forward declaring type: StyleComplexSelector
  class StyleComplexSelector;
  // Forward declaring type: StyleVariableContext
  class StyleVariableContext;
  // Skipping declaration: StyleValueType because it is already included!
  // Forward declaring type: StyleValueKeyword
  struct StyleValueKeyword;
  // Forward declaring type: Length
  struct Length;
  // Forward declaring type: Angle
  struct Angle;
  // Forward declaring type: Translate
  struct Translate;
  // Forward declaring type: TransformOrigin
  struct TransformOrigin;
  // Forward declaring type: Rotate
  struct Rotate;
  // Forward declaring type: Scale
  struct Scale;
  // Forward declaring type: FontDefinition
  struct FontDefinition;
  // Forward declaring type: Background
  struct Background;
  // Forward declaring type: Cursor
  struct Cursor;
  // Forward declaring type: TextShadow
  struct TextShadow;
  // Forward declaring type: BackgroundPosition
  struct BackgroundPosition;
  // Forward declaring type: BackgroundPositionKeyword
  struct BackgroundPositionKeyword;
  // Forward declaring type: BackgroundRepeat
  struct BackgroundRepeat;
  // Forward declaring type: BackgroundSize
  struct BackgroundSize;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Color
  struct Color;
  // Forward declaring type: Font
  class Font;
}
// Completed forward declares
// Type namespace: UnityEngine.UIElements.StyleSheets
namespace UnityEngine::UIElements::StyleSheets {
  // Forward declaring type: StylePropertyReader
  class StylePropertyReader;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::UIElements::StyleSheets::StylePropertyReader);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UIElements::StyleSheets::StylePropertyReader*, "UnityEngine.UIElements.StyleSheets", "StylePropertyReader");
// Type namespace: UnityEngine.UIElements.StyleSheets
namespace UnityEngine::UIElements::StyleSheets {
  // Size: 0x5C
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.UIElements.StyleSheets.StylePropertyReader
  // [TokenAttribute] Offset: FFFFFFFF
  class StylePropertyReader : public ::Il2CppObject {
    public:
    // Nested type: ::UnityEngine::UIElements::StyleSheets::StylePropertyReader::GetCursorIdFunction
    class GetCursorIdFunction;
    public:
    // private System.Collections.Generic.List`1<UnityEngine.UIElements.StyleSheets.StylePropertyValue> m_Values
    // Size: 0x8
    // Offset: 0x10
    ::System::Collections::Generic::List_1<::UnityEngine::UIElements::StyleSheets::StylePropertyValue>* m_Values;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::UIElements::StyleSheets::StylePropertyValue>*) == 0x8);
    // private System.Collections.Generic.List`1<System.Int32> m_ValueCount
    // Size: 0x8
    // Offset: 0x18
    ::System::Collections::Generic::List_1<int>* m_ValueCount;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<int>*) == 0x8);
    // private UnityEngine.UIElements.StyleVariableResolver m_Resolver
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::UIElements::StyleVariableResolver* m_Resolver;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::StyleVariableResolver*) == 0x8);
    // private UnityEngine.UIElements.StyleSheet m_Sheet
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::UIElements::StyleSheet* m_Sheet;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::StyleSheet*) == 0x8);
    // private UnityEngine.UIElements.StyleProperty[] m_Properties
    // Size: 0x8
    // Offset: 0x30
    ::ArrayW<::UnityEngine::UIElements::StyleProperty*> m_Properties;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::UIElements::StyleProperty*>) == 0x8);
    // private UnityEngine.UIElements.StyleSheets.StylePropertyId[] m_PropertyIds
    // Size: 0x8
    // Offset: 0x38
    ::ArrayW<::UnityEngine::UIElements::StyleSheets::StylePropertyId> m_PropertyIds;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::UIElements::StyleSheets::StylePropertyId>) == 0x8);
    // private System.Int32 m_CurrentValueIndex
    // Size: 0x4
    // Offset: 0x40
    int m_CurrentValueIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_CurrentPropertyIndex
    // Size: 0x4
    // Offset: 0x44
    int m_CurrentPropertyIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.UIElements.StyleProperty <property>k__BackingField
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::UIElements::StyleProperty* property;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::StyleProperty*) == 0x8);
    // private UnityEngine.UIElements.StyleSheets.StylePropertyId <propertyId>k__BackingField
    // Size: 0x4
    // Offset: 0x50
    ::UnityEngine::UIElements::StyleSheets::StylePropertyId propertyId;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::StyleSheets::StylePropertyId) == 0x4);
    // private System.Int32 <valueCount>k__BackingField
    // Size: 0x4
    // Offset: 0x54
    int valueCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single <dpiScaling>k__BackingField
    // Size: 0x4
    // Offset: 0x58
    float dpiScaling;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Get static field: static UnityEngine.UIElements.StyleSheets.StylePropertyReader/GetCursorIdFunction getCursorIdFunc
    static ::UnityEngine::UIElements::StyleSheets::StylePropertyReader::GetCursorIdFunction* _get_getCursorIdFunc();
    // Set static field: static UnityEngine.UIElements.StyleSheets.StylePropertyReader/GetCursorIdFunction getCursorIdFunc
    static void _set_getCursorIdFunc(::UnityEngine::UIElements::StyleSheets::StylePropertyReader::GetCursorIdFunction* value);
    // Get instance field reference: private System.Collections.Generic.List`1<UnityEngine.UIElements.StyleSheets.StylePropertyValue> m_Values
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::UnityEngine::UIElements::StyleSheets::StylePropertyValue>*& dyn_m_Values();
