// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.ScriptableObject
#include "UnityEngine/ScriptableObject.hpp"
// Including type: Oculus.Interaction.Input.OneEuroFilterPropertyBlock
#include "Oculus/Interaction/Input/OneEuroFilterPropertyBlock.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Type namespace: Oculus.Interaction.Input
namespace Oculus::Interaction::Input {
  // Forward declaring type: HandFilterParameterBlock
  class HandFilterParameterBlock;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Oculus::Interaction::Input::HandFilterParameterBlock);
DEFINE_IL2CPP_ARG_TYPE(::Oculus::Interaction::Input::HandFilterParameterBlock*, "Oculus.Interaction.Input", "HandFilterParameterBlock");
// Type namespace: Oculus.Interaction.Input
namespace Oculus::Interaction::Input {
  // Size: 0x40
  #pragma pack(push, 1)
  // Autogenerated type: Oculus.Interaction.Input.HandFilterParameterBlock
  // [TokenAttribute] Offset: FFFFFFFF
  // [CreateAssetMenuAttribute] Offset: FFFFFFFF
  class HandFilterParameterBlock : public ::UnityEngine::ScriptableObject {
    public:
    public:
    // public Oculus.Interaction.Input.OneEuroFilterPropertyBlock wristPositionParameters
    // Size: 0xC
    // Offset: 0x18
    ::Oculus::Interaction::Input::OneEuroFilterPropertyBlock wristPositionParameters;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::Input::OneEuroFilterPropertyBlock) == 0xC);
    // public Oculus.Interaction.Input.OneEuroFilterPropertyBlock wristRotationParameters
    // Size: 0xC
    // Offset: 0x24
    ::Oculus::Interaction::Input::OneEuroFilterPropertyBlock wristRotationParameters;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::Input::OneEuroFilterPropertyBlock) == 0xC);
    // public Oculus.Interaction.Input.OneEuroFilterPropertyBlock fingerRotationParameters
    // Size: 0xC
    // Offset: 0x30
    ::Oculus::Interaction::Input::OneEuroFilterPropertyBlock fingerRotationParameters;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::Input::OneEuroFilterPropertyBlock) == 0xC);
    // public System.Single frequency
    // Size: 0x4
    // Offset: 0x3C
    float frequency;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public Oculus.Interaction.Input.OneEuroFilterPropertyBlock wristPositionParameters
    [[deprecated("Use field access instead!")]] ::Oculus::Interaction::Input::OneEuroFilterPropertyBlock& dyn_wristPositionParameters();
    // Get instance field reference: public Oculus.Interaction.Input.OneEuroFilterPropertyBlock wristRotationParameters
    [[deprecated("Use field access instead!")]] ::Oculus::Interaction::Input::OneEuroFilterPropertyBlock& dyn_wristRotationParameters();
    // Get instance field reference: public Oculus.Interaction.Input.OneEuroFilterPropertyBlock fingerRotationParameters
    [[deprecated("Use field access instead!")]] ::Oculus::Interaction::Input::OneEuroFilterPropertyBlock& dyn_fingerRotationParameters();
    // Get instance field reference: public System.Single frequency
    [[deprecated("Use field access instead!")]] float& dyn_frequency();
    // public System.Void .ctor()
    // Offset: 0x481EAB4
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static HandFilterParameterBlock* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::Input::HandFilterParameterBlock::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<HandFilterParameterBlock*, creationType>()));
    }
  }; // Oculus.Interaction.Input.HandFilterParameterBlock
  #pragma pack(pop)
  static check_size<sizeof(HandFilterParameterBlock), 60 + sizeof(float)> __Oculus_Interaction_Input_HandFilterParameterBlockSizeCheck;
  static_assert(sizeof(HandFilterParameterBlock) == 0x40);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Oculus::Interaction::Input::HandFilterParameterBlock::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
