// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Oculus.Interaction.Input.Hand
#include "Oculus/Interaction/Input/Hand.hpp"
// Including type: UnityEngine.Pose
#include "UnityEngine/Pose.hpp"
// Including type: Oculus.Interaction.Input.JointFreedom
#include "Oculus/Interaction/Input/JointFreedom.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Oculus::Interaction::Input
namespace Oculus::Interaction::Input {
  // Forward declaring type: HandDataAsset
  class HandDataAsset;
  // Forward declaring type: HandFinger
  struct HandFinger;
  // Forward declaring type: HandJointId
  struct HandJointId;
  // Skipping declaration: IDataSource because it is already included!
}
// Forward declaring namespace: Oculus::Interaction
namespace Oculus::Interaction {
  // Forward declaring type: ProgressCurve
  class ProgressCurve;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Skipping declaration: Vector3 because it is already included!
}
// Completed forward declares
// Type namespace: Oculus.Interaction.Input
namespace Oculus::Interaction::Input {
  // Forward declaring type: SyntheticHand
  class SyntheticHand;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Oculus::Interaction::Input::SyntheticHand);
DEFINE_IL2CPP_ARG_TYPE(::Oculus::Interaction::Input::SyntheticHand*, "Oculus.Interaction.Input", "SyntheticHand");
// Type namespace: Oculus.Interaction.Input
namespace Oculus::Interaction::Input {
  // WARNING Size may be invalid!
  // Autogenerated type: Oculus.Interaction.Input.SyntheticHand
  // [TokenAttribute] Offset: FFFFFFFF
  class SyntheticHand : public ::Oculus::Interaction::Input::Hand {
    public:
    // Nested type: ::Oculus::Interaction::Input::SyntheticHand::WristLockMode
    struct WristLockMode;
    // Nested type: ::Oculus::Interaction::Input::SyntheticHand::$$c
    class $$c;
    public:
    // private Oculus.Interaction.ProgressCurve _wristPositionLockCurve
    // Size: 0x8
    // Offset: 0x80
    ::Oculus::Interaction::ProgressCurve* wristPositionLockCurve;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::ProgressCurve*) == 0x8);
    // private Oculus.Interaction.ProgressCurve _wristPositionUnlockCurve
    // Size: 0x8
    // Offset: 0x88
    ::Oculus::Interaction::ProgressCurve* wristPositionUnlockCurve;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::ProgressCurve*) == 0x8);
    // private Oculus.Interaction.ProgressCurve _wristRotationLockCurve
    // Size: 0x8
    // Offset: 0x90
    ::Oculus::Interaction::ProgressCurve* wristRotationLockCurve;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::ProgressCurve*) == 0x8);
    // private Oculus.Interaction.ProgressCurve _wristRotationUnlockCurve
    // Size: 0x8
    // Offset: 0x98
    ::Oculus::Interaction::ProgressCurve* wristRotationUnlockCurve;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::ProgressCurve*) == 0x8);
    // private Oculus.Interaction.ProgressCurve _jointLockCurve
    // Size: 0x8
    // Offset: 0xA0
    ::Oculus::Interaction::ProgressCurve* jointLockCurve;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::ProgressCurve*) == 0x8);
    // private Oculus.Interaction.ProgressCurve _jointUnlockCurve
    // Size: 0x8
    // Offset: 0xA8
    ::Oculus::Interaction::ProgressCurve* jointUnlockCurve;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::ProgressCurve*) == 0x8);
    // private System.Single _spreadAllowance
    // Size: 0x4
    // Offset: 0xB0
    float spreadAllowance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Action UpdateRequired
    // Size: 0x8
    // Offset: 0xB8
    ::System::Action* UpdateRequired;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private readonly Oculus.Interaction.Input.HandDataAsset _lastStates
    // Size: 0x8
    // Offset: 0xC0
    ::Oculus::Interaction::Input::HandDataAsset* lastStates;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::Input::HandDataAsset*) == 0x8);
    // private System.Single _wristPositionOverrideFactor
    // Size: 0x4
    // Offset: 0xC8
    float wristPositionOverrideFactor;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _wristRotationOverrideFactor
    // Size: 0x4
    // Offset: 0xCC
    float wristRotationOverrideFactor;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single[] _jointsOverrideFactor
    // Size: 0x8
    // Offset: 0xD0
    ::ArrayW<float> jointsOverrideFactor;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    // private Oculus.Interaction.ProgressCurve[] _jointLockProgressCurves
    // Size: 0x8
    // Offset: 0xD8
    ::ArrayW<::Oculus::Interaction::ProgressCurve*> jointLockProgressCurves;
    // Field size check
    static_assert(sizeof(::ArrayW<::Oculus::Interaction::ProgressCurve*>) == 0x8);
    // private Oculus.Interaction.ProgressCurve[] _jointUnlockProgressCurves
    // Size: 0x8
    // Offset: 0xE0
    ::ArrayW<::Oculus::Interaction::ProgressCurve*> jointUnlockProgressCurves;
    // Field size check
    static_assert(sizeof(::ArrayW<::Oculus::Interaction::ProgressCurve*>) == 0x8);
    // private UnityEngine.Pose _desiredWristPose
    // Size: 0x1C
    // Offset: 0xE8
    ::UnityEngine::Pose desiredWristPose;
    // Field size check
    static_assert(sizeof(::UnityEngine::Pose) == 0x1C);
    // private System.Boolean _wristPositionLocked
    // Size: 0x1
    // Offset: 0x104
    bool wristPositionLocked;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _wristRotationLocked
    // Size: 0x1
    // Offset: 0x105
    bool wristRotationLocked;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private UnityEngine.Pose _constrainedWristPose
    // Size: 0x1C
    // Offset: 0x108
    ::UnityEngine::Pose constrainedWristPose;
    // Field size check
    static_assert(sizeof(::UnityEngine::Pose) == 0x1C);
    // private UnityEngine.Pose _lastWristPose
    // Size: 0x1C
    // Offset: 0x124
    ::UnityEngine::Pose lastWristPose;
    // Field size check
    static_assert(sizeof(::UnityEngine::Pose) == 0x1C);
    // private UnityEngine.Quaternion[] _desiredJointsRotation
    // Size: 0x8
    // Offset: 0x140
    ::ArrayW<::UnityEngine::Quaternion> desiredJointsRotation;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Quaternion>) == 0x8);
    // private UnityEngine.Quaternion[] _constrainedJointRotations
    // Size: 0x8
    // Offset: 0x148
    ::ArrayW<::UnityEngine::Quaternion> constrainedJointRotations;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Quaternion>) == 0x8);
    // private UnityEngine.Quaternion[] _lastSyntheticRotation
    // Size: 0x8
    // Offset: 0x150
    ::ArrayW<::UnityEngine::Quaternion> lastSyntheticRotation;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Quaternion>) == 0x8);
    // private Oculus.Interaction.Input.JointFreedom[] _jointsFreedomLevels
    // Size: 0x8
    // Offset: 0x158
    ::ArrayW<::Oculus::Interaction::Input::JointFreedom> jointsFreedomLevels;
    // Field size check
    static_assert(sizeof(::ArrayW<::Oculus::Interaction::Input::JointFreedom>) == 0x8);
    // private System.Boolean _hasConnectedData
    // Size: 0x1
    // Offset: 0x160
    bool hasConnectedData;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get instance field reference: private Oculus.Interaction.ProgressCurve _wristPositionLockCurve
    [[deprecated("Use field access instead!")]] ::Oculus::Interaction::ProgressCurve*& dyn__wristPositionLockCurve();
    // Get instance field reference: private Oculus.Interaction.ProgressCurve _wristPositionUnlockCurve
    [[deprecated("Use field access instead!")]] ::Oculus::Interaction::ProgressCurve*& dyn__wristPositionUnlockCurve();
    // Get instance field reference: private Oculus.Interaction.ProgressCurve _wristRotationLockCurve
    [[deprecated("Use field access instead!")]] ::Oculus::Interaction::ProgressCurve*& dyn__wristRotationLockCurve();
    // Get instance field reference: private Oculus.Interaction.ProgressCurve _wristRotationUnlockCurve
