// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Skipping declaration: Quaternion because it is already included!
}
// Forward declaring namespace: Unity::XR::CoreUtils::Bindings
namespace Unity::XR::CoreUtils::Bindings {
  // Forward declaring type: BindingsGroup
  class BindingsGroup;
}
// Forward declaring namespace: UnityEngine::XR::Interaction::Toolkit::Utilities::Tweenables::Primitives
namespace UnityEngine::XR::Interaction::Toolkit::Utilities::Tweenables::Primitives {
  // Forward declaring type: Vector3TweenableVariable
  class Vector3TweenableVariable;
  // Forward declaring type: QuaternionTweenableVariable
  class QuaternionTweenableVariable;
}
// Forward declaring namespace: Unity::Mathematics
namespace Unity::Mathematics {
  // Forward declaring type: float3
  struct float3;
}
// Completed forward declares
// Type namespace: UnityEngine.XR.Interaction.Toolkit.UI
namespace UnityEngine::XR::Interaction::Toolkit::UI {
  // Forward declaring type: LazyFollow
  class LazyFollow;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::XR::Interaction::Toolkit::UI::LazyFollow);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::XR::Interaction::Toolkit::UI::LazyFollow*, "UnityEngine.XR.Interaction.Toolkit.UI", "LazyFollow");
// Type namespace: UnityEngine.XR.Interaction.Toolkit.UI
namespace UnityEngine::XR::Interaction::Toolkit::UI {
  // Size: 0x84
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.UI.LazyFollow
  // [TokenAttribute] Offset: FFFFFFFF
  // [HelpURLAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: FFFFFFFF
  class LazyFollow : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private UnityEngine.Transform m_Target
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::Transform* m_Target;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Vector3 m_TargetOffset
    // Size: 0xC
    // Offset: 0x28
    ::UnityEngine::Vector3 m_TargetOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Single m_MovementSpeed
    // Size: 0x4
    // Offset: 0x34
    float m_MovementSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_SnapOnEnable
    // Size: 0x1
    // Offset: 0x38
    bool m_SnapOnEnable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_SnapOnEnable and: m_MinDistanceAllowed
    char __padding3[0x3] = {};
    // private System.Single m_MinDistanceAllowed
    // Size: 0x4
    // Offset: 0x3C
    float m_MinDistanceAllowed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_MaxDistanceAllowed
    // Size: 0x4
    // Offset: 0x40
    float m_MaxDistanceAllowed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_MinAngleAllowed
    // Size: 0x4
    // Offset: 0x44
    float m_MinAngleAllowed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_MaxAngleAllowed
    // Size: 0x4
    // Offset: 0x48
    float m_MaxAngleAllowed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_TimeUntilThresholdReachesMaxDistance
    // Size: 0x4
    // Offset: 0x4C
    float m_TimeUntilThresholdReachesMaxDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_TimeUntilThresholdReachesMaxAngle
    // Size: 0x4
    // Offset: 0x50
    float m_TimeUntilThresholdReachesMaxAngle;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: m_TimeUntilThresholdReachesMaxAngle and: m_BindingsGroup
    char __padding9[0x4] = {};
    // private readonly Unity.XR.CoreUtils.Bindings.BindingsGroup m_BindingsGroup
    // Size: 0x8
    // Offset: 0x58
    ::Unity::XR::CoreUtils::Bindings::BindingsGroup* m_BindingsGroup;
    // Field size check
    static_assert(sizeof(::Unity::XR::CoreUtils::Bindings::BindingsGroup*) == 0x8);
    // private UnityEngine.Vector3 m_LastTargetPosition
    // Size: 0xC
    // Offset: 0x60
    ::UnityEngine::Vector3 m_LastTargetPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // Padding between fields: m_LastTargetPosition and: m_Vector3TweenableVariable
    char __padding11[0x4] = {};
    // private UnityEngine.XR.Interaction.Toolkit.Utilities.Tweenables.Primitives.Vector3TweenableVariable m_Vector3TweenableVariable
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::XR::Interaction::Toolkit::Utilities::Tweenables::Primitives::Vector3TweenableVariable* m_Vector3TweenableVariable;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::Utilities::Tweenables::Primitives::Vector3TweenableVariable*) == 0x8);
    // private UnityEngine.XR.Interaction.Toolkit.Utilities.Tweenables.Primitives.QuaternionTweenableVariable m_QuaternionTweenableVariable
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::XR::Interaction::Toolkit::Utilities::Tweenables::Primitives::QuaternionTweenableVariable* m_QuaternionTweenableVariable;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::Utilities::Tweenables::Primitives::QuaternionTweenableVariable*) == 0x8);
    // private System.Single m_LastUpdateTime
    // Size: 0x4
    // Offset: 0x80
    float m_LastUpdateTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Get instance field reference: private UnityEngine.Transform m_Target
    [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_m_Target();
    // Get instance field reference: private UnityEngine.Vector3 m_TargetOffset
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_m_TargetOffset();
    // Get instance field reference: private System.Single m_MovementSpeed
    [[deprecated("Use field access instead!")]] float& dyn_m_MovementSpeed();
    // Get instance field reference: private System.Boolean m_SnapOnEnable
    [[deprecated("Use field access instead!")]] bool& dyn_m_SnapOnEnable();
    // Get instance field reference: private System.Single m_MinDistanceAllowed
    [[deprecated("Use field access instead!")]] float& dyn_m_MinDistanceAllowed();
