// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: UnityEngine.XR.Interaction.Toolkit.UI.ButtonDeltaState
#include "UnityEngine/XR/Interaction/Toolkit/UI/ButtonDeltaState.hpp"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
// Including type: UnityEngine.Quaternion
#include "UnityEngine/Quaternion.hpp"
// Including type: UnityEngine.EventSystems.RaycastResult
#include "UnityEngine/EventSystems/RaycastResult.hpp"
// Including type: UnityEngine.LayerMask
#include "UnityEngine/LayerMask.hpp"
// Including type: UnityEngine.XR.Interaction.Toolkit.UI.UIInteractionType
#include "UnityEngine/XR/Interaction/Toolkit/UI/UIInteractionType.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Func`1<TResult>
  template<typename TResult>
  class Func_1;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine::XR::Interaction::Toolkit::UI
namespace UnityEngine::XR::Interaction::Toolkit::UI {
  // Skipping declaration: ImplementationData because it is already included!
  // Forward declaring type: TrackedDeviceEventData
  class TrackedDeviceEventData;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Completed forward declares
// Type namespace: UnityEngine.XR.Interaction.Toolkit.UI
namespace UnityEngine::XR::Interaction::Toolkit::UI {
  // Forward declaring type: TrackedDeviceModel
  struct TrackedDeviceModel;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::XR::Interaction::Toolkit::UI::TrackedDeviceModel, "UnityEngine.XR.Interaction.Toolkit.UI", "TrackedDeviceModel");
// Type namespace: UnityEngine.XR.Interaction.Toolkit.UI
namespace UnityEngine::XR::Interaction::Toolkit::UI {
  // Size: 0x13C
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.UI.TrackedDeviceModel
  // [TokenAttribute] Offset: FFFFFFFF
  struct TrackedDeviceModel/*, public ::System::ValueType*/ {
    public:
    // Nested type: ::UnityEngine::XR::Interaction::Toolkit::UI::TrackedDeviceModel::ImplementationData
    struct ImplementationData;
    // Size: 0x90
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.UI.TrackedDeviceModel/ImplementationData
    // [TokenAttribute] Offset: FFFFFFFF
    struct ImplementationData/*, public ::System::ValueType*/ {
      public:
      public:
      // private System.Collections.Generic.List`1<UnityEngine.GameObject> <hoverTargets>k__BackingField
      // Size: 0x8
      // Offset: 0x0
      ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>* hoverTargets;
      // Field size check
      static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*) == 0x8);
      // private UnityEngine.GameObject <pointerTarget>k__BackingField
      // Size: 0x8
      // Offset: 0x8
      ::UnityEngine::GameObject* pointerTarget;
      // Field size check
      static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
      // private System.Boolean <isDragging>k__BackingField
      // Size: 0x1
      // Offset: 0x10
      bool isDragging;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // Padding between fields: isDragging and: pressedTime
      char __padding2[0x3] = {};
      // private System.Single <pressedTime>k__BackingField
      // Size: 0x4
      // Offset: 0x14
      float pressedTime;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // private UnityEngine.Vector2 <position>k__BackingField
      // Size: 0x8
      // Offset: 0x18
      ::UnityEngine::Vector2 position;
      // Field size check
      static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
      // private UnityEngine.Vector2 <pressedPosition>k__BackingField
      // Size: 0x8
      // Offset: 0x20
      ::UnityEngine::Vector2 pressedPosition;
      // Field size check
      static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
      // private UnityEngine.EventSystems.RaycastResult <pressedRaycast>k__BackingField
      // Size: 0x50
      // Offset: 0x28
      ::UnityEngine::EventSystems::RaycastResult pressedRaycast;
      // Field size check
      static_assert(sizeof(::UnityEngine::EventSystems::RaycastResult) == 0x50);
      // private UnityEngine.GameObject <pressedGameObject>k__BackingField
      // Size: 0x8
      // Offset: 0x78
      ::UnityEngine::GameObject* pressedGameObject;
      // Field size check
      static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
      // private UnityEngine.GameObject <pressedGameObjectRaw>k__BackingField
      // Size: 0x8
      // Offset: 0x80
      ::UnityEngine::GameObject* pressedGameObjectRaw;
      // Field size check
      static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
      // private UnityEngine.GameObject <draggedGameObject>k__BackingField
      // Size: 0x8
      // Offset: 0x88
      ::UnityEngine::GameObject* draggedGameObject;
      // Field size check
      static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
      public:
      // Creating value type constructor for type: ImplementationData
      constexpr ImplementationData(::System::Collections::Generic::List_1<::UnityEngine::GameObject*>* hoverTargets_ = {}, ::UnityEngine::GameObject* pointerTarget_ = {}, bool isDragging_ = {}, float pressedTime_ = {}, ::UnityEngine::Vector2 position_ = {}, ::UnityEngine::Vector2 pressedPosition_ = {}, ::UnityEngine::EventSystems::RaycastResult pressedRaycast_ = {}, ::UnityEngine::GameObject* pressedGameObject_ = {}, ::UnityEngine::GameObject* pressedGameObjectRaw_ = {}, ::UnityEngine::GameObject* draggedGameObject_ = {}) noexcept : hoverTargets{hoverTargets_}, pointerTarget{pointerTarget_}, isDragging{isDragging_}, pressedTime{pressedTime_}, position{position_}, pressedPosition{pressedPosition_}, pressedRaycast{pressedRaycast_}, pressedGameObject{pressedGameObject_}, pressedGameObjectRaw{pressedGameObjectRaw_}, draggedGameObject{draggedGameObject_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: private System.Collections.Generic.List`1<UnityEngine.GameObject> <hoverTargets>k__BackingField
      [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*& dyn_$hoverTargets$k__BackingField();
      // Get instance field reference: private UnityEngine.GameObject <pointerTarget>k__BackingField
      [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_$pointerTarget$k__BackingField();
      // Get instance field reference: private System.Boolean <isDragging>k__BackingField
      [[deprecated("Use field access instead!")]] bool& dyn_$isDragging$k__BackingField();
      // Get instance field reference: private System.Single <pressedTime>k__BackingField
      [[deprecated("Use field access instead!")]] float& dyn_$pressedTime$k__BackingField();
      // Get instance field reference: private UnityEngine.Vector2 <position>k__BackingField
      [[deprecated("Use field access instead!")]] ::UnityEngine::Vector2& dyn_$position$k__BackingField();
      // Get instance field reference: private UnityEngine.Vector2 <pressedPosition>k__BackingField
      [[deprecated("Use field access instead!")]] ::UnityEngine::Vector2& dyn_$pressedPosition$k__BackingField();
      // Get instance field reference: private UnityEngine.EventSystems.RaycastResult <pressedRaycast>k__BackingField
      [[deprecated("Use field access instead!")]] ::UnityEngine::EventSystems::RaycastResult& dyn_$pressedRaycast$k__BackingField();
      // Get instance field reference: private UnityEngine.GameObject <pressedGameObject>k__BackingField
      [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_$pressedGameObject$k__BackingField();
      // Get instance field reference: private UnityEngine.GameObject <pressedGameObjectRaw>k__BackingField
      [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_$pressedGameObjectRaw$k__BackingField();
      // Get instance field reference: private UnityEngine.GameObject <draggedGameObject>k__BackingField
      [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_$draggedGameObject$k__BackingField();
      // public System.Collections.Generic.List`1<UnityEngine.GameObject> get_hoverTargets()
      // Offset: 0x5420490
      ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>* get_hoverTargets();
      // public System.Void set_hoverTargets(System.Collections.Generic.List`1<UnityEngine.GameObject> value)
      // Offset: 0x5420498
      void set_hoverTargets(::System::Collections::Generic::List_1<::UnityEngine::GameObject*>* value);
      // public UnityEngine.GameObject get_pointerTarget()
      // Offset: 0x54204A0
      ::UnityEngine::GameObject* get_pointerTarget();
      // public System.Void set_pointerTarget(UnityEngine.GameObject value)
      // Offset: 0x54204A8
      void set_pointerTarget(::UnityEngine::GameObject* value);
      // public System.Boolean get_isDragging()
      // Offset: 0x54204B0
      bool get_isDragging();
      // public System.Void set_isDragging(System.Boolean value)
      // Offset: 0x54204B8
      void set_isDragging(bool value);
      // public System.Single get_pressedTime()
      // Offset: 0x54204C4
      float get_pressedTime();
      // public System.Void set_pressedTime(System.Single value)
      // Offset: 0x54204CC
      void set_pressedTime(float value);
      // public UnityEngine.Vector2 get_position()
      // Offset: 0x54204D4
      ::UnityEngine::Vector2 get_position();
      // public System.Void set_position(UnityEngine.Vector2 value)
      // Offset: 0x54204DC
      void set_position(::UnityEngine::Vector2 value);
      // public UnityEngine.Vector2 get_pressedPosition()
      // Offset: 0x54204E4
      ::UnityEngine::Vector2 get_pressedPosition();
      // public System.Void set_pressedPosition(UnityEngine.Vector2 value)
      // Offset: 0x54204EC
      void set_pressedPosition(::UnityEngine::Vector2 value);
      // public UnityEngine.EventSystems.RaycastResult get_pressedRaycast()
      // Offset: 0x54204F4
      ::UnityEngine::EventSystems::RaycastResult get_pressedRaycast();
      // public System.Void set_pressedRaycast(UnityEngine.EventSystems.RaycastResult value)
      // Offset: 0x5420504
      void set_pressedRaycast(::UnityEngine::EventSystems::RaycastResult value);
      // public UnityEngine.GameObject get_pressedGameObject()
      // Offset: 0x5420528
      ::UnityEngine::GameObject* get_pressedGameObject();
      // public System.Void set_pressedGameObject(UnityEngine.GameObject value)
      // Offset: 0x5420530
      void set_pressedGameObject(::UnityEngine::GameObject* value);
      // public UnityEngine.GameObject get_pressedGameObjectRaw()
      // Offset: 0x5420538
      ::UnityEngine::GameObject* get_pressedGameObjectRaw();
      // public System.Void set_pressedGameObjectRaw(UnityEngine.GameObject value)
      // Offset: 0x5420540
      void set_pressedGameObjectRaw(::UnityEngine::GameObject* value);
      // public UnityEngine.GameObject get_draggedGameObject()
      // Offset: 0x5420548
      ::UnityEngine::GameObject* get_draggedGameObject();
      // public System.Void set_draggedGameObject(UnityEngine.GameObject value)
      // Offset: 0x5420550
      void set_draggedGameObject(::UnityEngine::GameObject* value);
      // public System.Void Reset()
      // Offset: 0x541FF5C
      void Reset();
    }; // UnityEngine.XR.Interaction.Toolkit.UI.TrackedDeviceModel/ImplementationData
    #pragma pack(pop)
    static check_size<sizeof(TrackedDeviceModel::ImplementationData), 136 + sizeof(::UnityEngine::GameObject*)> __UnityEngine_XR_Interaction_Toolkit_UI_TrackedDeviceModel_ImplementationDataSizeCheck;
    static_assert(sizeof(TrackedDeviceModel::ImplementationData) == 0x90);
    public:
    // private UnityEngine.XR.Interaction.Toolkit.UI.TrackedDeviceModel/ImplementationData m_ImplementationData
    // Size: 0x90
    // Offset: 0x0
    ::UnityEngine::XR::Interaction::Toolkit::UI::TrackedDeviceModel::ImplementationData m_ImplementationData;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::UI::TrackedDeviceModel::ImplementationData) == 0x90);
    // private readonly System.Int32 <pointerId>k__BackingField
    // Size: 0x4
    // Offset: 0x90
    int pointerId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean m_SelectDown
    // Size: 0x1
    // Offset: 0x94
    bool m_SelectDown;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_SelectDown and: selectDelta
    char __padding2[0x3] = {};
    // private UnityEngine.XR.Interaction.Toolkit.UI.ButtonDeltaState <selectDelta>k__BackingField
    // Size: 0x4
    // Offset: 0x98
    ::UnityEngine::XR::Interaction::Toolkit::UI::ButtonDeltaState selectDelta;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::UI::ButtonDeltaState) == 0x4);
    // private System.Boolean <changedThisFrame>k__BackingField
    // Size: 0x1
    // Offset: 0x9C
    bool changedThisFrame;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: changedThisFrame and: m_Position
    char __padding4[0x3] = {};
    // private UnityEngine.Vector3 m_Position
    // Size: 0xC
    // Offset: 0xA0
    ::UnityEngine::Vector3 m_Position;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // Padding between fields: m_Position and: positionGetter
    char __padding5[0x4] = {};
    // private System.Func`1<UnityEngine.Vector3> <positionGetter>k__BackingField
    // Size: 0x8
    // Offset: 0xB0
    ::System::Func_1<::UnityEngine::Vector3>* positionGetter;
    // Field size check
    static_assert(sizeof(::System::Func_1<::UnityEngine::Vector3>*) == 0x8);
    // private UnityEngine.Quaternion m_Orientation
    // Size: 0x10
    // Offset: 0xB8
    ::UnityEngine::Quaternion m_Orientation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private System.Collections.Generic.List`1<UnityEngine.Vector3> m_RaycastPoints
    // Size: 0x8
    // Offset: 0xC8
    ::System::Collections::Generic::List_1<::UnityEngine::Vector3>* m_RaycastPoints;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Vector3>*) == 0x8);
    // private UnityEngine.EventSystems.RaycastResult <currentRaycast>k__BackingField
    // Size: 0x50
    // Offset: 0xD0
    ::UnityEngine::EventSystems::RaycastResult currentRaycast;
    // Field size check
    static_assert(sizeof(::UnityEngine::EventSystems::RaycastResult) == 0x50);
    // private System.Int32 <currentRaycastEndpointIndex>k__BackingField
    // Size: 0x4
    // Offset: 0x120
    int currentRaycastEndpointIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.LayerMask m_RaycastLayerMask
    // Size: 0x4
    // Offset: 0x124
    ::UnityEngine::LayerMask m_RaycastLayerMask;
    // Field size check
    static_assert(sizeof(::UnityEngine::LayerMask) == 0x4);
    // private UnityEngine.Vector2 m_ScrollDelta
    // Size: 0x8
    // Offset: 0x128
    ::UnityEngine::Vector2 m_ScrollDelta;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private System.Single m_PokeDepth
    // Size: 0x4
    // Offset: 0x130
    float m_PokeDepth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.XR.Interaction.Toolkit.UI.UIInteractionType m_InteractionType
    // Size: 0x4
    // Offset: 0x134
    ::UnityEngine::XR::Interaction::Toolkit::UI::UIInteractionType m_InteractionType;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::UI::UIInteractionType) == 0x4);
    // private System.Single m_MaxRaycastDistance
    // Size: 0x4
    // Offset: 0x138
    float m_MaxRaycastDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Creating value type constructor for type: TrackedDeviceModel
