// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.EventSystems.BaseRaycaster
#include "UnityEngine/EventSystems/BaseRaycaster.hpp"
// Including type: UnityEngine.XR.Interaction.Toolkit.AffordanceSystem.State.IPokeStateDataProvider
#include "UnityEngine/XR/Interaction/Toolkit/AffordanceSystem/State/IPokeStateDataProvider.hpp"
// Including type: UnityEngine.LayerMask
#include "UnityEngine/LayerMask.hpp"
// Including type: UnityEngine.QueryTriggerInteraction
#include "UnityEngine/QueryTriggerInteraction.hpp"
// Including type: UnityEngine.RaycastHit
#include "UnityEngine/RaycastHit.hpp"
// Including type: UnityEngine.RaycastHit2D
#include "UnityEngine/RaycastHit2D.hpp"
// Including type: UnityEngine.PhysicsScene
#include "UnityEngine/PhysicsScene.hpp"
// Including type: UnityEngine.PhysicsScene2D
#include "UnityEngine/PhysicsScene2D.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes

  // Forward declaring type: Canvas
  class Canvas;
  // Forward declaring type: Camera
  class Camera;
  // Forward declaring type: Ray
  struct Ray;
  // Forward declaring type: RectTransform
  class RectTransform;
  // Forward declaring type: Vector4
  struct Vector4;
  // Forward declaring type: Plane
  struct Plane;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: HashSet`1<T>
  template<typename T>
  class HashSet_1;
}
// Forward declaring namespace: Unity::XR::CoreUtils::Bindings::Variables
namespace Unity::XR::CoreUtils::Bindings::Variables {
  // Forward declaring type: IReadOnlyBindableVariable`1<T>
  template<typename T>
  class IReadOnlyBindableVariable_1;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Graphic
  class Graphic;
}
// Forward declaring namespace: UnityEngine::EventSystems
namespace UnityEngine::EventSystems {
  // Forward declaring type: PointerEventData
  class PointerEventData;
}
// Completed forward declares
// Type namespace: UnityEngine.XR.Interaction.Toolkit.UI
namespace UnityEngine::XR::Interaction::Toolkit::UI {
  // Forward declaring type: TrackedDeviceGraphicRaycaster
  class TrackedDeviceGraphicRaycaster;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::XR::Interaction::Toolkit::UI::TrackedDeviceGraphicRaycaster);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::XR::Interaction::Toolkit::UI::TrackedDeviceGraphicRaycaster*, "UnityEngine.XR.Interaction.Toolkit.UI", "TrackedDeviceGraphicRaycaster");
// Type namespace: UnityEngine.XR.Interaction.Toolkit.UI
namespace UnityEngine::XR::Interaction::Toolkit::UI {
  // Size: 0x70
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.UI.TrackedDeviceGraphicRaycaster
  // [TokenAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: FFFFFFFF
  // [HelpURLAttribute] Offset: FFFFFFFF
  class TrackedDeviceGraphicRaycaster : public ::UnityEngine::EventSystems::BaseRaycaster/*, public ::UnityEngine::XR::Interaction::Toolkit::AffordanceSystem::State::IPokeStateDataProvider*/ {
    public:
    // Nested type: ::UnityEngine::XR::Interaction::Toolkit::UI::TrackedDeviceGraphicRaycaster::RaycastHitData
    struct RaycastHitData;
    // Nested type: ::UnityEngine::XR::Interaction::Toolkit::UI::TrackedDeviceGraphicRaycaster::RaycastHitComparer
    class RaycastHitComparer;
    // Size: 0x24
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.UI.TrackedDeviceGraphicRaycaster/RaycastHitData
    // [TokenAttribute] Offset: FFFFFFFF
    // [IsReadOnlyAttribute] Offset: FFFFFFFF
    struct RaycastHitData/*, public ::System::ValueType*/ {
      public:
      public:
      // private readonly UnityEngine.UI.Graphic <graphic>k__BackingField
      // Size: 0x8
      // Offset: 0x0
      ::UnityEngine::UI::Graphic* graphic;
      // Field size check
      static_assert(sizeof(::UnityEngine::UI::Graphic*) == 0x8);
      // private readonly UnityEngine.Vector3 <worldHitPosition>k__BackingField
      // Size: 0xC
      // Offset: 0x8
      ::UnityEngine::Vector3 worldHitPosition;
      // Field size check
      static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
      // private readonly UnityEngine.Vector2 <screenPosition>k__BackingField
      // Size: 0x8
      // Offset: 0x14
      ::UnityEngine::Vector2 screenPosition;
      // Field size check
      static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
      // private readonly System.Single <distance>k__BackingField
      // Size: 0x4
      // Offset: 0x1C
      float distance;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // private readonly System.Int32 <displayIndex>k__BackingField
      // Size: 0x4
      // Offset: 0x20
      int displayIndex;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: RaycastHitData
      constexpr RaycastHitData(::UnityEngine::UI::Graphic* graphic_ = {}, ::UnityEngine::Vector3 worldHitPosition_ = {}, ::UnityEngine::Vector2 screenPosition_ = {}, float distance_ = {}, int displayIndex_ = {}) noexcept : graphic{graphic_}, worldHitPosition{worldHitPosition_}, screenPosition{screenPosition_}, distance{distance_}, displayIndex{displayIndex_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: private readonly UnityEngine.UI.Graphic <graphic>k__BackingField
      [[deprecated("Use field access instead!")]] ::UnityEngine::UI::Graphic*& dyn_$graphic$k__BackingField();
      // Get instance field reference: private readonly UnityEngine.Vector3 <worldHitPosition>k__BackingField
      [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_$worldHitPosition$k__BackingField();
      // Get instance field reference: private readonly UnityEngine.Vector2 <screenPosition>k__BackingField
      [[deprecated("Use field access instead!")]] ::UnityEngine::Vector2& dyn_$screenPosition$k__BackingField();
      // Get instance field reference: private readonly System.Single <distance>k__BackingField
      [[deprecated("Use field access instead!")]] float& dyn_$distance$k__BackingField();
      // Get instance field reference: private readonly System.Int32 <displayIndex>k__BackingField
      [[deprecated("Use field access instead!")]] int& dyn_$displayIndex$k__BackingField();
      // public System.Void .ctor(UnityEngine.UI.Graphic graphic, UnityEngine.Vector3 worldHitPosition, UnityEngine.Vector2 screenPosition, System.Single distance, System.Int32 displayIndex)
      // Offset: 0x541F970
      // ABORTED: conflicts with another method.  RaycastHitData(::UnityEngine::UI::Graphic* graphic, ::UnityEngine::Vector3 worldHitPosition, ::UnityEngine::Vector2 screenPosition, float distance, int displayIndex);
      // public UnityEngine.UI.Graphic get_graphic()
      // Offset: 0x541F9D4
      ::UnityEngine::UI::Graphic* get_graphic();
      // public UnityEngine.Vector3 get_worldHitPosition()
      // Offset: 0x541F9DC
      ::UnityEngine::Vector3 get_worldHitPosition();
      // public UnityEngine.Vector2 get_screenPosition()
      // Offset: 0x541F9E8
      ::UnityEngine::Vector2 get_screenPosition();
      // public System.Single get_distance()
      // Offset: 0x541F9F0
      float get_distance();
      // public System.Int32 get_displayIndex()
      // Offset: 0x541F9F8
      int get_displayIndex();
    }; // UnityEngine.XR.Interaction.Toolkit.UI.TrackedDeviceGraphicRaycaster/RaycastHitData
    #pragma pack(pop)
    static check_size<sizeof(TrackedDeviceGraphicRaycaster::RaycastHitData), 32 + sizeof(int)> __UnityEngine_XR_Interaction_Toolkit_UI_TrackedDeviceGraphicRaycaster_RaycastHitDataSizeCheck;
    static_assert(sizeof(TrackedDeviceGraphicRaycaster::RaycastHitData) == 0x24);
    public:
    // private System.Boolean m_IgnoreReversedGraphics
    // Size: 0x1
    // Offset: 0x28
    bool m_IgnoreReversedGraphics;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_CheckFor2DOcclusion
    // Size: 0x1
    // Offset: 0x29
    bool m_CheckFor2DOcclusion;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_CheckFor3DOcclusion
    // Size: 0x1
    // Offset: 0x2A
    bool m_CheckFor3DOcclusion;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_CheckFor3DOcclusion and: m_BlockingMask
    char __padding2[0x1] = {};
    // private UnityEngine.LayerMask m_BlockingMask
    // Size: 0x4
    // Offset: 0x2C
    ::UnityEngine::LayerMask m_BlockingMask;
    // Field size check
    static_assert(sizeof(::UnityEngine::LayerMask) == 0x4);
    // private UnityEngine.QueryTriggerInteraction m_RaycastTriggerInteraction
    // Size: 0x4
    // Offset: 0x30
    ::UnityEngine::QueryTriggerInteraction m_RaycastTriggerInteraction;
    // Field size check
    static_assert(sizeof(::UnityEngine::QueryTriggerInteraction) == 0x4);
    // Padding between fields: m_RaycastTriggerInteraction and: m_Canvas
    char __padding4[0x4] = {};
    // private UnityEngine.Canvas m_Canvas
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::Canvas* m_Canvas;
    // Field size check
    static_assert(sizeof(::UnityEngine::Canvas*) == 0x8);
    // private System.Boolean m_HasWarnedEventCameraNull
    // Size: 0x1
    // Offset: 0x40
    bool m_HasWarnedEventCameraNull;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_HasWarnedEventCameraNull and: m_OcclusionHits3D
    char __padding6[0x7] = {};
    // private readonly UnityEngine.RaycastHit[] m_OcclusionHits3D
    // Size: 0x8
    // Offset: 0x48
    ::ArrayW<::UnityEngine::RaycastHit> m_OcclusionHits3D;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::RaycastHit>) == 0x8);
    // private readonly UnityEngine.RaycastHit2D[] m_OcclusionHits2D
    // Size: 0x8
    // Offset: 0x50
    ::ArrayW<::UnityEngine::RaycastHit2D> m_OcclusionHits2D;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::RaycastHit2D>) == 0x8);
    // private readonly System.Collections.Generic.List`1<UnityEngine.XR.Interaction.Toolkit.UI.TrackedDeviceGraphicRaycaster/RaycastHitData> m_RaycastResultsCache
    // Size: 0x8
    // Offset: 0x58
    ::System::Collections::Generic::List_1<::UnityEngine::XR::Interaction::Toolkit::UI::TrackedDeviceGraphicRaycaster::RaycastHitData>* m_RaycastResultsCache;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::XR::Interaction::Toolkit::UI::TrackedDeviceGraphicRaycaster::RaycastHitData>*) == 0x8);
    // private UnityEngine.XR.Interaction.Toolkit.Filtering.XRPokeLogic m_PokeLogic
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::XR::Interaction::Toolkit::Filtering::XRPokeLogic* m_PokeLogic;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::Filtering::XRPokeLogic*) == 0x8);
    // private UnityEngine.PhysicsScene m_LocalPhysicsScene
    // Size: 0x4
    // Offset: 0x68
    ::UnityEngine::PhysicsScene m_LocalPhysicsScene;
    // Field size check
    static_assert(sizeof(::UnityEngine::PhysicsScene) == 0x4);
    // private UnityEngine.PhysicsScene2D m_LocalPhysicsScene2D
    // Size: 0x4
    // Offset: 0x6C
    ::UnityEngine::PhysicsScene2D m_LocalPhysicsScene2D;
    // Field size check
    static_assert(sizeof(::UnityEngine::PhysicsScene2D) == 0x4);
    public:
    // Creating interface conversion operator: operator ::UnityEngine::XR::Interaction::Toolkit::AffordanceSystem::State::IPokeStateDataProvider
    operator ::UnityEngine::XR::Interaction::Toolkit::AffordanceSystem::State::IPokeStateDataProvider() noexcept {
      return *reinterpret_cast<::UnityEngine::XR::Interaction::Toolkit::AffordanceSystem::State::IPokeStateDataProvider*>(this);
    }
    // static field const value: static private System.Int32 k_MaxRaycastHits
    static constexpr const int k_MaxRaycastHits = 10;
    // Get static field: static private System.Int32 k_MaxRaycastHits
    static int _get_k_MaxRaycastHits();
    // Set static field: static private System.Int32 k_MaxRaycastHits
    static void _set_k_MaxRaycastHits(int value);
