// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.EventSystems.BaseInputModule
#include "UnityEngine/EventSystems/BaseInputModule.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Camera
  class Camera;
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: UnityEngine::EventSystems
namespace UnityEngine::EventSystems {
  // Forward declaring type: AxisEventData
  class AxisEventData;
  // Forward declaring type: PointerEventData
  class PointerEventData;
  // Forward declaring type: BaseEventData
  class BaseEventData;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine::XR::Interaction::Toolkit::UI
namespace UnityEngine::XR::Interaction::Toolkit::UI {
  // Forward declaring type: TrackedDeviceEventData
  class TrackedDeviceEventData;
  // Forward declaring type: MouseModel
  struct MouseModel;
  // Forward declaring type: ButtonDeltaState
  struct ButtonDeltaState;
  // Forward declaring type: TouchModel
  struct TouchModel;
  // Forward declaring type: TrackedDeviceModel
  struct TrackedDeviceModel;
  // Forward declaring type: NavigationModel
  struct NavigationModel;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
}
// Forward declaring namespace: UnityEngine::InputSystem::UI
namespace UnityEngine::InputSystem::UI {
  // Forward declaring type: UIPointerType
  struct UIPointerType;
}
// Completed forward declares
// Type namespace: UnityEngine.XR.Interaction.Toolkit.UI
namespace UnityEngine::XR::Interaction::Toolkit::UI {
  // Forward declaring type: UIInputModule
  class UIInputModule;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::XR::Interaction::Toolkit::UI::UIInputModule);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::XR::Interaction::Toolkit::UI::UIInputModule*, "UnityEngine.XR.Interaction.Toolkit.UI", "UIInputModule");
// Type namespace: UnityEngine.XR.Interaction.Toolkit.UI
namespace UnityEngine::XR::Interaction::Toolkit::UI {
  // Size: 0x120
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.UI.UIInputModule
  // [TokenAttribute] Offset: FFFFFFFF
  // [DefaultExecutionOrder] Offset: FFFFFFFF
  class UIInputModule : public ::UnityEngine::EventSystems::BaseInputModule {
    public:
    public:
    // private System.Single m_ClickSpeed
    // Size: 0x4
    // Offset: 0x58
    float m_ClickSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_MoveDeadzone
    // Size: 0x4
    // Offset: 0x5C
    float m_MoveDeadzone;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_RepeatDelay
    // Size: 0x4
    // Offset: 0x60
    float m_RepeatDelay;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_RepeatRate
    // Size: 0x4
    // Offset: 0x64
    float m_RepeatRate;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_TrackedDeviceDragThresholdMultiplier
    // Size: 0x4
    // Offset: 0x68
    float m_TrackedDeviceDragThresholdMultiplier;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: m_TrackedDeviceDragThresholdMultiplier and: m_UICamera
    char __padding4[0x4] = {};
    // private UnityEngine.Camera m_UICamera
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::Camera* m_UICamera;
    // Field size check
    static_assert(sizeof(::UnityEngine::Camera*) == 0x8);
    // private UnityEngine.Camera m_MainCameraCache
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::Camera* m_MainCameraCache;
    // Field size check
    static_assert(sizeof(::UnityEngine::Camera*) == 0x8);
    // private UnityEngine.EventSystems.AxisEventData m_CachedAxisEvent
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::EventSystems::AxisEventData* m_CachedAxisEvent;
    // Field size check
    static_assert(sizeof(::UnityEngine::EventSystems::AxisEventData*) == 0x8);
    // private readonly System.Collections.Generic.Dictionary`2<System.Int32,UnityEngine.EventSystems.PointerEventData> m_PointerEventByPointerId
    // Size: 0x8
    // Offset: 0x88
    ::System::Collections::Generic::Dictionary_2<int, ::UnityEngine::EventSystems::PointerEventData*>* m_PointerEventByPointerId;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<int, ::UnityEngine::EventSystems::PointerEventData*>*) == 0x8);
    // private readonly System.Collections.Generic.Dictionary`2<System.Int32,UnityEngine.XR.Interaction.Toolkit.UI.TrackedDeviceEventData> m_TrackedDeviceEventByPointerId
    // Size: 0x8
    // Offset: 0x90
    ::System::Collections::Generic::Dictionary_2<int, ::UnityEngine::XR::Interaction::Toolkit::UI::TrackedDeviceEventData*>* m_TrackedDeviceEventByPointerId;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<int, ::UnityEngine::XR::Interaction::Toolkit::UI::TrackedDeviceEventData*>*) == 0x8);
    // private System.Action`2<UnityEngine.EventSystems.PointerEventData,System.Collections.Generic.List`1<UnityEngine.EventSystems.RaycastResult>> finalizeRaycastResults
    // Size: 0x8
    // Offset: 0x98
    ::System::Action_2<::UnityEngine::EventSystems::PointerEventData*, ::System::Collections::Generic::List_1<::UnityEngine::EventSystems::RaycastResult>*>* finalizeRaycastResults;
    // Field size check
    static_assert(sizeof(::System::Action_2<::UnityEngine::EventSystems::PointerEventData*, ::System::Collections::Generic::List_1<::UnityEngine::EventSystems::RaycastResult>*>*) == 0x8);
    // private System.Action`2<UnityEngine.GameObject,UnityEngine.EventSystems.PointerEventData> pointerEnter
    // Size: 0x8
    // Offset: 0xA0
    ::System::Action_2<::UnityEngine::GameObject*, ::UnityEngine::EventSystems::PointerEventData*>* pointerEnter;
    // Field size check
    static_assert(sizeof(::System::Action_2<::UnityEngine::GameObject*, ::UnityEngine::EventSystems::PointerEventData*>*) == 0x8);
    // private System.Action`2<UnityEngine.GameObject,UnityEngine.EventSystems.PointerEventData> pointerExit
    // Size: 0x8
    // Offset: 0xA8
    ::System::Action_2<::UnityEngine::GameObject*, ::UnityEngine::EventSystems::PointerEventData*>* pointerExit;
    // Field size check
    static_assert(sizeof(::System::Action_2<::UnityEngine::GameObject*, ::UnityEngine::EventSystems::PointerEventData*>*) == 0x8);
    // private System.Action`2<UnityEngine.GameObject,UnityEngine.EventSystems.PointerEventData> pointerDown
    // Size: 0x8
    // Offset: 0xB0
    ::System::Action_2<::UnityEngine::GameObject*, ::UnityEngine::EventSystems::PointerEventData*>* pointerDown;
    // Field size check
    static_assert(sizeof(::System::Action_2<::UnityEngine::GameObject*, ::UnityEngine::EventSystems::PointerEventData*>*) == 0x8);
    // private System.Action`2<UnityEngine.GameObject,UnityEngine.EventSystems.PointerEventData> pointerUp
    // Size: 0x8
    // Offset: 0xB8
    ::System::Action_2<::UnityEngine::GameObject*, ::UnityEngine::EventSystems::PointerEventData*>* pointerUp;
    // Field size check
    static_assert(sizeof(::System::Action_2<::UnityEngine::GameObject*, ::UnityEngine::EventSystems::PointerEventData*>*) == 0x8);
    // private System.Action`2<UnityEngine.GameObject,UnityEngine.EventSystems.PointerEventData> pointerClick
    // Size: 0x8
    // Offset: 0xC0
    ::System::Action_2<::UnityEngine::GameObject*, ::UnityEngine::EventSystems::PointerEventData*>* pointerClick;
    // Field size check
    static_assert(sizeof(::System::Action_2<::UnityEngine::GameObject*, ::UnityEngine::EventSystems::PointerEventData*>*) == 0x8);
    // private System.Action`2<UnityEngine.GameObject,UnityEngine.EventSystems.PointerEventData> pointerMove
    // Size: 0x8
    // Offset: 0xC8
    ::System::Action_2<::UnityEngine::GameObject*, ::UnityEngine::EventSystems::PointerEventData*>* pointerMove;
    // Field size check
    static_assert(sizeof(::System::Action_2<::UnityEngine::GameObject*, ::UnityEngine::EventSystems::PointerEventData*>*) == 0x8);
    // private System.Action`2<UnityEngine.GameObject,UnityEngine.EventSystems.PointerEventData> initializePotentialDrag
    // Size: 0x8
    // Offset: 0xD0
    ::System::Action_2<::UnityEngine::GameObject*, ::UnityEngine::EventSystems::PointerEventData*>* initializePotentialDrag;
    // Field size check
    static_assert(sizeof(::System::Action_2<::UnityEngine::GameObject*, ::UnityEngine::EventSystems::PointerEventData*>*) == 0x8);
    // private System.Action`2<UnityEngine.GameObject,UnityEngine.EventSystems.PointerEventData> beginDrag
    // Size: 0x8
    // Offset: 0xD8
    ::System::Action_2<::UnityEngine::GameObject*, ::UnityEngine::EventSystems::PointerEventData*>* beginDrag;
    // Field size check
    static_assert(sizeof(::System::Action_2<::UnityEngine::GameObject*, ::UnityEngine::EventSystems::PointerEventData*>*) == 0x8);
    // private System.Action`2<UnityEngine.GameObject,UnityEngine.EventSystems.PointerEventData> drag
    // Size: 0x8
    // Offset: 0xE0
    ::System::Action_2<::UnityEngine::GameObject*, ::UnityEngine::EventSystems::PointerEventData*>* drag;
    // Field size check
    static_assert(sizeof(::System::Action_2<::UnityEngine::GameObject*, ::UnityEngine::EventSystems::PointerEventData*>*) == 0x8);
    // private System.Action`2<UnityEngine.GameObject,UnityEngine.EventSystems.PointerEventData> endDrag
    // Size: 0x8
    // Offset: 0xE8
    ::System::Action_2<::UnityEngine::GameObject*, ::UnityEngine::EventSystems::PointerEventData*>* endDrag;
    // Field size check
    static_assert(sizeof(::System::Action_2<::UnityEngine::GameObject*, ::UnityEngine::EventSystems::PointerEventData*>*) == 0x8);
    // private System.Action`2<UnityEngine.GameObject,UnityEngine.EventSystems.PointerEventData> drop
    // Size: 0x8
    // Offset: 0xF0
    ::System::Action_2<::UnityEngine::GameObject*, ::UnityEngine::EventSystems::PointerEventData*>* drop;
    // Field size check
    static_assert(sizeof(::System::Action_2<::UnityEngine::GameObject*, ::UnityEngine::EventSystems::PointerEventData*>*) == 0x8);
    // private System.Action`2<UnityEngine.GameObject,UnityEngine.EventSystems.PointerEventData> scroll
    // Size: 0x8
    // Offset: 0xF8
    ::System::Action_2<::UnityEngine::GameObject*, ::UnityEngine::EventSystems::PointerEventData*>* scroll;
    // Field size check
    static_assert(sizeof(::System::Action_2<::UnityEngine::GameObject*, ::UnityEngine::EventSystems::PointerEventData*>*) == 0x8);
    // private System.Action`2<UnityEngine.GameObject,UnityEngine.EventSystems.BaseEventData> updateSelected
    // Size: 0x8
    // Offset: 0x100
    ::System::Action_2<::UnityEngine::GameObject*, ::UnityEngine::EventSystems::BaseEventData*>* updateSelected;
    // Field size check
    static_assert(sizeof(::System::Action_2<::UnityEngine::GameObject*, ::UnityEngine::EventSystems::BaseEventData*>*) == 0x8);
    // private System.Action`2<UnityEngine.GameObject,UnityEngine.EventSystems.AxisEventData> move
    // Size: 0x8
    // Offset: 0x108
    ::System::Action_2<::UnityEngine::GameObject*, ::UnityEngine::EventSystems::AxisEventData*>* move;
    // Field size check
    static_assert(sizeof(::System::Action_2<::UnityEngine::GameObject*, ::UnityEngine::EventSystems::AxisEventData*>*) == 0x8);
    // private System.Action`2<UnityEngine.GameObject,UnityEngine.EventSystems.BaseEventData> submit
    // Size: 0x8
    // Offset: 0x110
    ::System::Action_2<::UnityEngine::GameObject*, ::UnityEngine::EventSystems::BaseEventData*>* submit;
    // Field size check
    static_assert(sizeof(::System::Action_2<::UnityEngine::GameObject*, ::UnityEngine::EventSystems::BaseEventData*>*) == 0x8);
    // private System.Action`2<UnityEngine.GameObject,UnityEngine.EventSystems.BaseEventData> cancel
    // Size: 0x8
    // Offset: 0x118
    ::System::Action_2<::UnityEngine::GameObject*, ::UnityEngine::EventSystems::BaseEventData*>* cancel;
    // Field size check
    static_assert(sizeof(::System::Action_2<::UnityEngine::GameObject*, ::UnityEngine::EventSystems::BaseEventData*>*) == 0x8);
    public:
    // Get instance field reference: private System.Single m_ClickSpeed
    [[deprecated("Use field access instead!")]] float& dyn_m_ClickSpeed();
    // Get instance field reference: private System.Single m_MoveDeadzone
    [[deprecated("Use field access instead!")]] float& dyn_m_MoveDeadzone();
    // Get instance field reference: private System.Single m_RepeatDelay
    [[deprecated("Use field access instead!")]] float& dyn_m_RepeatDelay();
    // Get instance field reference: private System.Single m_RepeatRate
    [[deprecated("Use field access instead!")]] float& dyn_m_RepeatRate();
    // Get instance field reference: private System.Single m_TrackedDeviceDragThresholdMultiplier
