// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.XR.Interaction.Toolkit.UI.UIInputModule
#include "UnityEngine/XR/Interaction/Toolkit/UI/UIInputModule.hpp"
// Including type: UnityEngine.XR.Interaction.Toolkit.UI.MouseModel
#include "UnityEngine/XR/Interaction/Toolkit/UI/MouseModel.hpp"
// Including type: UnityEngine.XR.Interaction.Toolkit.UI.NavigationModel
#include "UnityEngine/XR/Interaction/Toolkit/UI/NavigationModel.hpp"
// Including type: UnityEngine.XR.Interaction.Toolkit.UI.TrackedDeviceModel
#include "UnityEngine/XR/Interaction/Toolkit/UI/TrackedDeviceModel.hpp"
// Including type: UnityEngine.XR.Interaction.Toolkit.UI.TouchModel
#include "UnityEngine/XR/Interaction/Toolkit/UI/TouchModel.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::XR::Interaction::Toolkit::UI
namespace UnityEngine::XR::Interaction::Toolkit::UI {
  // Skipping declaration: ActiveInputMode because it is already included!
  // Forward declaring type: IUIInteractor
  class IUIInteractor;
}
// Forward declaring namespace: UnityEngine::InputSystem
namespace UnityEngine::InputSystem {
  // Forward declaring type: InputActionReference
  class InputActionReference;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Touch
  struct Touch;
}
// Completed forward declares
// Type namespace: UnityEngine.XR.Interaction.Toolkit.UI
namespace UnityEngine::XR::Interaction::Toolkit::UI {
  // Forward declaring type: XRUIInputModule
  class XRUIInputModule;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule*, "UnityEngine.XR.Interaction.Toolkit.UI", "XRUIInputModule");
// Type namespace: UnityEngine.XR.Interaction.Toolkit.UI
namespace UnityEngine::XR::Interaction::Toolkit::UI {
  // Size: 0x380
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.UI.XRUIInputModule
  // [TokenAttribute] Offset: FFFFFFFF
  // [HelpURLAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: FFFFFFFF
  class XRUIInputModule : public ::UnityEngine::XR::Interaction::Toolkit::UI::UIInputModule {
    public:
    // Nested type: ::UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::RegisteredInteractor
    struct RegisteredInteractor;
    // Nested type: ::UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::RegisteredTouch
    struct RegisteredTouch;
    // Nested type: ::UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::ActiveInputMode
    struct ActiveInputMode;
    // Size: 0x144
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.UI.XRUIInputModule/RegisteredInteractor
    // [TokenAttribute] Offset: FFFFFFFF
    struct RegisteredInteractor/*, public ::System::ValueType*/ {
      public:
      public:
      // public UnityEngine.XR.Interaction.Toolkit.UI.IUIInteractor interactor
      // Size: 0x8
      // Offset: 0x0
      ::UnityEngine::XR::Interaction::Toolkit::UI::IUIInteractor* interactor;
      // Field size check
      static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::UI::IUIInteractor*) == 0x8);
      // public UnityEngine.XR.Interaction.Toolkit.UI.TrackedDeviceModel model
      // Size: 0x13C
      // Offset: 0x8
      ::UnityEngine::XR::Interaction::Toolkit::UI::TrackedDeviceModel model;
      // Field size check
      static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::UI::TrackedDeviceModel) == 0x13C);
      public:
      // Creating value type constructor for type: RegisteredInteractor
      constexpr RegisteredInteractor(::UnityEngine::XR::Interaction::Toolkit::UI::IUIInteractor* interactor_ = {}, ::UnityEngine::XR::Interaction::Toolkit::UI::TrackedDeviceModel model_ = {}) noexcept : interactor{interactor_}, model{model_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public UnityEngine.XR.Interaction.Toolkit.UI.IUIInteractor interactor
      [[deprecated("Use field access instead!")]] ::UnityEngine::XR::Interaction::Toolkit::UI::IUIInteractor*& dyn_interactor();
      // Get instance field reference: public UnityEngine.XR.Interaction.Toolkit.UI.TrackedDeviceModel model
      [[deprecated("Use field access instead!")]] ::UnityEngine::XR::Interaction::Toolkit::UI::TrackedDeviceModel& dyn_model();
      // public System.Void .ctor(UnityEngine.XR.Interaction.Toolkit.UI.IUIInteractor interactor, System.Int32 deviceIndex)
      // Offset: 0x5426010
      RegisteredInteractor(::UnityEngine::XR::Interaction::Toolkit::UI::IUIInteractor* interactor, int deviceIndex);
    }; // UnityEngine.XR.Interaction.Toolkit.UI.XRUIInputModule/RegisteredInteractor
    #pragma pack(pop)
    static check_size<sizeof(XRUIInputModule::RegisteredInteractor), 8 + sizeof(::UnityEngine::XR::Interaction::Toolkit::UI::TrackedDeviceModel)> __UnityEngine_XR_Interaction_Toolkit_UI_XRUIInputModule_RegisteredInteractorSizeCheck;
    static_assert(sizeof(XRUIInputModule::RegisteredInteractor) == 0x144);
    // Size: 0xB0
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.UI.XRUIInputModule/RegisteredTouch
    // [TokenAttribute] Offset: FFFFFFFF
    struct RegisteredTouch/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.Boolean isValid
      // Size: 0x1
      // Offset: 0x0
      bool isValid;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // Padding between fields: isValid and: touchId
      char __padding0[0x3] = {};
      // public System.Int32 touchId
      // Size: 0x4
      // Offset: 0x4
      int touchId;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public UnityEngine.XR.Interaction.Toolkit.UI.TouchModel model
      // Size: 0xA8
      // Offset: 0x8
      ::UnityEngine::XR::Interaction::Toolkit::UI::TouchModel model;
      // Field size check
      static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::UI::TouchModel) == 0xA8);
      public:
      // Creating value type constructor for type: RegisteredTouch
      constexpr RegisteredTouch(bool isValid_ = {}, int touchId_ = {}, ::UnityEngine::XR::Interaction::Toolkit::UI::TouchModel model_ = {}) noexcept : isValid{isValid_}, touchId{touchId_}, model{model_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public System.Boolean isValid
      [[deprecated("Use field access instead!")]] bool& dyn_isValid();
      // Get instance field reference: public System.Int32 touchId
      [[deprecated("Use field access instead!")]] int& dyn_touchId();
      // Get instance field reference: public UnityEngine.XR.Interaction.Toolkit.UI.TouchModel model
      [[deprecated("Use field access instead!")]] ::UnityEngine::XR::Interaction::Toolkit::UI::TouchModel& dyn_model();
      // public System.Void .ctor(UnityEngine.Touch touch, System.Int32 deviceIndex)
      // Offset: 0x5427328
      RegisteredTouch(::UnityEngine::Touch touch, int deviceIndex);
    }; // UnityEngine.XR.Interaction.Toolkit.UI.XRUIInputModule/RegisteredTouch
    #pragma pack(pop)
    static check_size<sizeof(XRUIInputModule::RegisteredTouch), 8 + sizeof(::UnityEngine::XR::Interaction::Toolkit::UI::TouchModel)> __UnityEngine_XR_Interaction_Toolkit_UI_XRUIInputModule_RegisteredTouchSizeCheck;
    static_assert(sizeof(XRUIInputModule::RegisteredTouch) == 0xB0);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.UI.XRUIInputModule/ActiveInputMode
    // [TokenAttribute] Offset: FFFFFFFF
    struct ActiveInputMode/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: ActiveInputMode
      constexpr ActiveInputMode(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.UI.XRUIInputModule/ActiveInputMode InputManagerBindings
      static constexpr const int InputManagerBindings = 0;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.UI.XRUIInputModule/ActiveInputMode InputManagerBindings
      static ::UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::ActiveInputMode _get_InputManagerBindings();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.UI.XRUIInputModule/ActiveInputMode InputManagerBindings
      static void _set_InputManagerBindings(::UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::ActiveInputMode value);
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.UI.XRUIInputModule/ActiveInputMode InputSystemActions
      static constexpr const int InputSystemActions = 1;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.UI.XRUIInputModule/ActiveInputMode InputSystemActions
      static ::UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::ActiveInputMode _get_InputSystemActions();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.UI.XRUIInputModule/ActiveInputMode InputSystemActions
      static void _set_InputSystemActions(::UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::ActiveInputMode value);
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.UI.XRUIInputModule/ActiveInputMode Both
      static constexpr const int Both = 2;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.UI.XRUIInputModule/ActiveInputMode Both
      static ::UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::ActiveInputMode _get_Both();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.UI.XRUIInputModule/ActiveInputMode Both
      static void _set_Both(::UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::ActiveInputMode value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.XR.Interaction.Toolkit.UI.XRUIInputModule/ActiveInputMode
    #pragma pack(pop)
    static check_size<sizeof(XRUIInputModule::ActiveInputMode), 0 + sizeof(int)> __UnityEngine_XR_Interaction_Toolkit_UI_XRUIInputModule_ActiveInputModeSizeCheck;
    static_assert(sizeof(XRUIInputModule::ActiveInputMode) == 0x4);
    public:
    // private UnityEngine.XR.Interaction.Toolkit.UI.XRUIInputModule/ActiveInputMode m_ActiveInputMode
    // Size: 0x4
    // Offset: 0x120
    ::UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::ActiveInputMode m_ActiveInputMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::ActiveInputMode) == 0x4);
    // private System.Single m_MaxTrackedDeviceRaycastDistance
    // Size: 0x4
    // Offset: 0x124
    float m_MaxTrackedDeviceRaycastDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_EnableXRInput
    // Size: 0x1
    // Offset: 0x128
    bool m_EnableXRInput;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_EnableMouseInput
    // Size: 0x1
    // Offset: 0x129
    bool m_EnableMouseInput;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_EnableTouchInput
    // Size: 0x1
    // Offset: 0x12A
    bool m_EnableTouchInput;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_EnableTouchInput and: m_PointAction
    char __padding4[0x5] = {};
    // private UnityEngine.InputSystem.InputActionReference m_PointAction
    // Size: 0x8
    // Offset: 0x130
    ::UnityEngine::InputSystem::InputActionReference* m_PointAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // private UnityEngine.InputSystem.InputActionReference m_LeftClickAction
    // Size: 0x8
    // Offset: 0x138
    ::UnityEngine::InputSystem::InputActionReference* m_LeftClickAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // private UnityEngine.InputSystem.InputActionReference m_MiddleClickAction
    // Size: 0x8
    // Offset: 0x140
    ::UnityEngine::InputSystem::InputActionReference* m_MiddleClickAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // private UnityEngine.InputSystem.InputActionReference m_RightClickAction
    // Size: 0x8
    // Offset: 0x148
    ::UnityEngine::InputSystem::InputActionReference* m_RightClickAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // private UnityEngine.InputSystem.InputActionReference m_ScrollWheelAction
    // Size: 0x8
    // Offset: 0x150
    ::UnityEngine::InputSystem::InputActionReference* m_ScrollWheelAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // private UnityEngine.InputSystem.InputActionReference m_NavigateAction
    // Size: 0x8
    // Offset: 0x158
    ::UnityEngine::InputSystem::InputActionReference* m_NavigateAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // private UnityEngine.InputSystem.InputActionReference m_SubmitAction
    // Size: 0x8
    // Offset: 0x160
    ::UnityEngine::InputSystem::InputActionReference* m_SubmitAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // private UnityEngine.InputSystem.InputActionReference m_CancelAction
    // Size: 0x8
    // Offset: 0x168
    ::UnityEngine::InputSystem::InputActionReference* m_CancelAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // private System.Boolean m_EnableBuiltinActionsAsFallback
    // Size: 0x1
    // Offset: 0x170
    bool m_EnableBuiltinActionsAsFallback;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_EnableGamepadInput
    // Size: 0x1
    // Offset: 0x171
    bool m_EnableGamepadInput;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_EnableJoystickInput
    // Size: 0x1
    // Offset: 0x172
    bool m_EnableJoystickInput;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_EnableJoystickInput and: m_HorizontalAxis
    char __padding15[0x5] = {};
    // private System.String m_HorizontalAxis
    // Size: 0x8
    // Offset: 0x178
    ::StringW m_HorizontalAxis;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String m_VerticalAxis
    // Size: 0x8
    // Offset: 0x180
    ::StringW m_VerticalAxis;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String m_SubmitButton
    // Size: 0x8
    // Offset: 0x188
    ::StringW m_SubmitButton;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String m_CancelButton
    // Size: 0x8
    // Offset: 0x190
    ::StringW m_CancelButton;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Int32 m_RollingPointerId
    // Size: 0x4
    // Offset: 0x198
    int m_RollingPointerId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean m_UseBuiltInInputSystemActions
    // Size: 0x1
    // Offset: 0x19C
    bool m_UseBuiltInInputSystemActions;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_UseBuiltInInputSystemActions and: m_MouseState
    char __padding21[0x3] = {};
    // private UnityEngine.XR.Interaction.Toolkit.UI.MouseModel m_MouseState
    // Size: 0x1B0
    // Offset: 0x1A0
    ::UnityEngine::XR::Interaction::Toolkit::UI::MouseModel m_MouseState;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::UI::MouseModel) == 0x1B0);
    // private UnityEngine.XR.Interaction.Toolkit.UI.NavigationModel m_NavigationState
    // Size: 0x1E
    // Offset: 0x350
    ::UnityEngine::XR::Interaction::Toolkit::UI::NavigationModel m_NavigationState;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::UI::NavigationModel) == 0x1E);
    // Padding between fields: m_NavigationState and: m_RegisteredTouches
    char __padding23[0x2] = {};
    // private readonly System.Collections.Generic.List`1<UnityEngine.XR.Interaction.Toolkit.UI.XRUIInputModule/RegisteredTouch> m_RegisteredTouches
    // Size: 0x8
    // Offset: 0x370
    ::System::Collections::Generic::List_1<::UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::RegisteredTouch>* m_RegisteredTouches;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::RegisteredTouch>*) == 0x8);
    // private readonly System.Collections.Generic.List`1<UnityEngine.XR.Interaction.Toolkit.UI.XRUIInputModule/RegisteredInteractor> m_RegisteredInteractors
    // Size: 0x8
    // Offset: 0x378
    ::System::Collections::Generic::List_1<::UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::RegisteredInteractor>* m_RegisteredInteractors;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::RegisteredInteractor>*) == 0x8);
    public:
    // static field const value: static System.Single kPixelPerLine
    static constexpr const float kPixelPerLine = 20;
    // Get static field: static System.Single kPixelPerLine
    static float _get_kPixelPerLine();
    // Set static field: static System.Single kPixelPerLine
    static void _set_kPixelPerLine(float value);
    // Get instance field reference: private UnityEngine.XR.Interaction.Toolkit.UI.XRUIInputModule/ActiveInputMode m_ActiveInputMode
    [[deprecated("Use field access instead!")]] ::UnityEngine::XR::Interaction::Toolkit::UI::XRUIInputModule::ActiveInputMode& dyn_m_ActiveInputMode();
