// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.ProBuilder.Shapes.Shape
#include "UnityEngine/ProBuilder/Shapes/Shape.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Bounds
  struct Bounds;
  // Forward declaring type: Vector3
  struct Vector3;
  // Forward declaring type: Quaternion
  struct Quaternion;
}
// Forward declaring namespace: UnityEngine::ProBuilder
namespace UnityEngine::ProBuilder {
  // Forward declaring type: ProBuilderMesh
  class ProBuilderMesh;
}
// Completed forward declares
// Type namespace: UnityEngine.ProBuilder.Shapes
namespace UnityEngine::ProBuilder::Shapes {
  // Forward declaring type: Pipe
  class Pipe;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::ProBuilder::Shapes::Pipe);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::ProBuilder::Shapes::Pipe*, "UnityEngine.ProBuilder.Shapes", "Pipe");
// Type namespace: UnityEngine.ProBuilder.Shapes
namespace UnityEngine::ProBuilder::Shapes {
  // Size: 0x1D
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.ProBuilder.Shapes.Pipe
  // [TokenAttribute] Offset: FFFFFFFF
  // [ShapeAttribute] Offset: FFFFFFFF
  class Pipe : public ::UnityEngine::ProBuilder::Shapes::Shape {
    public:
    public:
    // private System.Single m_Thickness
    // Size: 0x4
    // Offset: 0x10
    float m_Thickness;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 m_NumberOfSides
    // Size: 0x4
    // Offset: 0x14
    int m_NumberOfSides;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_HeightCuts
    // Size: 0x4
    // Offset: 0x18
    int m_HeightCuts;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean m_Smooth
    // Size: 0x1
    // Offset: 0x1C
    bool m_Smooth;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get instance field reference: private System.Single m_Thickness
    [[deprecated("Use field access instead!")]] float& dyn_m_Thickness();
    // Get instance field reference: private System.Int32 m_NumberOfSides
    [[deprecated("Use field access instead!")]] int& dyn_m_NumberOfSides();
    // Get instance field reference: private System.Int32 m_HeightCuts
    [[deprecated("Use field access instead!")]] int& dyn_m_HeightCuts();
    // Get instance field reference: private System.Boolean m_Smooth
    [[deprecated("Use field access instead!")]] bool& dyn_m_Smooth();
    // public override System.Void CopyShape(UnityEngine.ProBuilder.Shapes.Shape shape)
    // Offset: 0x51EF3F8
    // Implemented from: UnityEngine.ProBuilder.Shapes.Shape
    // Base method: System.Void Shape::CopyShape(UnityEngine.ProBuilder.Shapes.Shape shape)
    void CopyShape(::UnityEngine::ProBuilder::Shapes::Shape* shape);
    // public override UnityEngine.Bounds UpdateBounds(UnityEngine.ProBuilder.ProBuilderMesh mesh, UnityEngine.Vector3 size, UnityEngine.Quaternion rotation, UnityEngine.Bounds bounds)
    // Offset: 0x51EF484
    // Implemented from: UnityEngine.ProBuilder.Shapes.Shape
    // Base method: UnityEngine.Bounds Shape::UpdateBounds(UnityEngine.ProBuilder.ProBuilderMesh mesh, UnityEngine.Vector3 size, UnityEngine.Quaternion rotation, UnityEngine.Bounds bounds)
    ::UnityEngine::Bounds UpdateBounds(::UnityEngine::ProBuilder::ProBuilderMesh* mesh, ::UnityEngine::Vector3 size, ::UnityEngine::Quaternion rotation, ::UnityEngine::Bounds bounds);
    // public override UnityEngine.Bounds RebuildMesh(UnityEngine.ProBuilder.ProBuilderMesh mesh, UnityEngine.Vector3 size, UnityEngine.Quaternion rotation)
    // Offset: 0x51EF4B0
    // Implemented from: UnityEngine.ProBuilder.Shapes.Shape
    // Base method: UnityEngine.Bounds Shape::RebuildMesh(UnityEngine.ProBuilder.ProBuilderMesh mesh, UnityEngine.Vector3 size, UnityEngine.Quaternion rotation)
    ::UnityEngine::Bounds RebuildMesh(::UnityEngine::ProBuilder::ProBuilderMesh* mesh, ::UnityEngine::Vector3 size, ::UnityEngine::Quaternion rotation);
    // public System.Void .ctor()
    // Offset: 0x51EFE6C
    // Implemented from: UnityEngine.ProBuilder.Shapes.Shape
    // Base method: System.Void Shape::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static Pipe* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::ProBuilder::Shapes::Pipe::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<Pipe*, creationType>()));
    }
  }; // UnityEngine.ProBuilder.Shapes.Pipe
  #pragma pack(pop)
  static check_size<sizeof(Pipe), 28 + sizeof(bool)> __UnityEngine_ProBuilder_Shapes_PipeSizeCheck;
  static_assert(sizeof(Pipe) == 0x1D);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: UnityEngine::ProBuilder::Shapes::Pipe::CopyShape
// Il2CppName: CopyShape
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (UnityEngine::ProBuilder::Shapes::Pipe::*)(::UnityEngine::ProBuilder::Shapes::Shape*)>(&UnityEngine::ProBuilder::Shapes::Pipe::CopyShape)> {
  static const MethodInfo* get() {
    static auto* shape = &::il2cpp_utils::GetClassFromName("UnityEngine.ProBuilder.Shapes", "Shape")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::ProBuilder::Shapes::Pipe*), "CopyShape", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{shape});
  }
};
// Writing MetadataGetter for method: UnityEngine::ProBuilder::Shapes::Pipe::UpdateBounds
// Il2CppName: UpdateBounds
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::Bounds (UnityEngine::ProBuilder::Shapes::Pipe::*)(::UnityEngine::ProBuilder::ProBuilderMesh*, ::UnityEngine::Vector3, ::UnityEngine::Quaternion, ::UnityEngine::Bounds)>(&UnityEngine::ProBuilder::Shapes::Pipe::UpdateBounds)> {
  static const MethodInfo* get() {
    static auto* mesh = &::il2cpp_utils::GetClassFromName("UnityEngine.ProBuilder", "ProBuilderMesh")->byval_arg;
    static auto* size = &::il2cpp_utils::GetClassFromName("UnityEngine", "Vector3")->byval_arg;
    static auto* rotation = &::il2cpp_utils::GetClassFromName("UnityEngine", "Quaternion")->byval_arg;
    static auto* bounds = &::il2cpp_utils::GetClassFromName("UnityEngine", "Bounds")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::ProBuilder::Shapes::Pipe*), "UpdateBounds", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{mesh, size, rotation, bounds});
  }
};
// Writing MetadataGetter for method: UnityEngine::ProBuilder::Shapes::Pipe::RebuildMesh
// Il2CppName: RebuildMesh
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::Bounds (UnityEngine::ProBuilder::Shapes::Pipe::*)(::UnityEngine::ProBuilder::ProBuilderMesh*, ::UnityEngine::Vector3, ::UnityEngine::Quaternion)>(&UnityEngine::ProBuilder::Shapes::Pipe::RebuildMesh)> {
  static const MethodInfo* get() {
    static auto* mesh = &::il2cpp_utils::GetClassFromName("UnityEngine.ProBuilder", "ProBuilderMesh")->byval_arg;
    static auto* size = &::il2cpp_utils::GetClassFromName("UnityEngine", "Vector3")->byval_arg;
    static auto* rotation = &::il2cpp_utils::GetClassFromName("UnityEngine", "Quaternion")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::ProBuilder::Shapes::Pipe*), "RebuildMesh", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{mesh, size, rotation});
  }
};
// Writing MetadataGetter for method: UnityEngine::ProBuilder::Shapes::Pipe::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
