// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: Photon.Pun.IPunObservable
#include "Photon/Pun/IPunObservable.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Photon::Pun
namespace Photon::Pun {
  // Forward declaring type: PhotonStream
  class PhotonStream;
  // Forward declaring type: PhotonMessageInfo
  struct PhotonMessageInfo;
}
// Completed forward declares
// Type namespace: GorillaTagScripts
namespace GorillaTagScripts {
  // Forward declaring type: BuilderItemReliableState
  class BuilderItemReliableState;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GorillaTagScripts::BuilderItemReliableState);
DEFINE_IL2CPP_ARG_TYPE(::GorillaTagScripts::BuilderItemReliableState*, "GorillaTagScripts", "BuilderItemReliableState");
// Type namespace: GorillaTagScripts
namespace GorillaTagScripts {
  // Size: 0x59
  #pragma pack(push, 1)
  // Autogenerated type: GorillaTagScripts.BuilderItemReliableState
  // [TokenAttribute] Offset: FFFFFFFF
  class BuilderItemReliableState : public ::UnityEngine::MonoBehaviour/*, public ::Photon::Pun::IPunObservable*/ {
    public:
    public:
    // public UnityEngine.Vector3 rightHandAttachPos
    // Size: 0xC
    // Offset: 0x20
    ::UnityEngine::Vector3 rightHandAttachPos;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Quaternion rightHandAttachRot
    // Size: 0x10
    // Offset: 0x2C
    ::UnityEngine::Quaternion rightHandAttachRot;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // public UnityEngine.Vector3 leftHandAttachPos
    // Size: 0xC
    // Offset: 0x3C
    ::UnityEngine::Vector3 leftHandAttachPos;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Quaternion leftHandAttachRot
    // Size: 0x10
    // Offset: 0x48
    ::UnityEngine::Quaternion leftHandAttachRot;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // public System.Boolean dirty
    // Size: 0x1
    // Offset: 0x58
    bool dirty;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating interface conversion operator: operator ::Photon::Pun::IPunObservable
    operator ::Photon::Pun::IPunObservable() noexcept {
      return *reinterpret_cast<::Photon::Pun::IPunObservable*>(this);
    }
    // Get instance field reference: public UnityEngine.Vector3 rightHandAttachPos
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_rightHandAttachPos();
    // Get instance field reference: public UnityEngine.Quaternion rightHandAttachRot
    [[deprecated("Use field access instead!")]] ::UnityEngine::Quaternion& dyn_rightHandAttachRot();
    // Get instance field reference: public UnityEngine.Vector3 leftHandAttachPos
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_leftHandAttachPos();
    // Get instance field reference: public UnityEngine.Quaternion leftHandAttachRot
    [[deprecated("Use field access instead!")]] ::UnityEngine::Quaternion& dyn_leftHandAttachRot();
    // Get instance field reference: public System.Boolean dirty
    [[deprecated("Use field access instead!")]] bool& dyn_dirty();
    // public System.Void OnPhotonSerializeView(Photon.Pun.PhotonStream stream, Photon.Pun.PhotonMessageInfo info)
    // Offset: 0x27F37C0
    void OnPhotonSerializeView(::Photon::Pun::PhotonStream* stream, ::Photon::Pun::PhotonMessageInfo info);
    // public System.Void .ctor()
    // Offset: 0x27F3CB4
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static BuilderItemReliableState* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::GorillaTagScripts::BuilderItemReliableState::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<BuilderItemReliableState*, creationType>()));
    }
  }; // GorillaTagScripts.BuilderItemReliableState
  #pragma pack(pop)
  static check_size<sizeof(BuilderItemReliableState), 88 + sizeof(bool)> __GorillaTagScripts_BuilderItemReliableStateSizeCheck;
  static_assert(sizeof(BuilderItemReliableState) == 0x59);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: GorillaTagScripts::BuilderItemReliableState::OnPhotonSerializeView
// Il2CppName: OnPhotonSerializeView
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GorillaTagScripts::BuilderItemReliableState::*)(::Photon::Pun::PhotonStream*, ::Photon::Pun::PhotonMessageInfo)>(&GorillaTagScripts::BuilderItemReliableState::OnPhotonSerializeView)> {
  static const MethodInfo* get() {
    static auto* stream = &::il2cpp_utils::GetClassFromName("Photon.Pun", "PhotonStream")->byval_arg;
    static auto* info = &::il2cpp_utils::GetClassFromName("Photon.Pun", "PhotonMessageInfo")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(GorillaTagScripts::BuilderItemReliableState*), "OnPhotonSerializeView", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{stream, info});
  }
};
// Writing MetadataGetter for method: GorillaTagScripts::BuilderItemReliableState::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
