// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: TransferrableObject
#include "GlobalNamespace/TransferrableObject.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: InteractionPoint
  class InteractionPoint;
  // Forward declaring type: BuilderPiece
  class BuilderPiece;
  // Forward declaring type: DropZone
  class DropZone;
}
// Forward declaring namespace: GorillaTagScripts
namespace GorillaTagScripts {
  // Forward declaring type: BuilderItemReliableState
  class BuilderItemReliableState;
  // Forward declaring type: BuilderAttachGridPlane
  class BuilderAttachGridPlane;
  // Forward declaring type: BuilderAttachEdge
  class BuilderAttachEdge;
  // Forward declaring type: BuilderTable
  class BuilderTable;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Skipping declaration: Behaviour because it is already included!
  // Forward declaring type: Collider
  class Collider;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: AudioSource
  class AudioSource;
  // Forward declaring type: AudioClip
  class AudioClip;
  // Skipping declaration: Matrix4x4 because it is already included!
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: GorillaTagScripts
namespace GorillaTagScripts {
  // Forward declaring type: BuilderItem
  class BuilderItem;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GorillaTagScripts::BuilderItem);
DEFINE_IL2CPP_ARG_TYPE(::GorillaTagScripts::BuilderItem*, "GorillaTagScripts", "BuilderItem");
// Type namespace: GorillaTagScripts
namespace GorillaTagScripts {
  // WARNING Size may be invalid!
  // Autogenerated type: GorillaTagScripts.BuilderItem
  // [TokenAttribute] Offset: FFFFFFFF
  class BuilderItem : public ::GlobalNamespace::TransferrableObject {
    public:
    // Nested type: ::GorillaTagScripts::BuilderItem::BuilderItemState
    struct BuilderItemState;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: GorillaTagScripts.BuilderItem/BuilderItemState
    // [TokenAttribute] Offset: FFFFFFFF
    struct BuilderItemState/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: BuilderItemState
      constexpr BuilderItemState(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public GorillaTagScripts.BuilderItem/BuilderItemState isHeld
      static constexpr const int isHeld = 1;
      // Get static field: static public GorillaTagScripts.BuilderItem/BuilderItemState isHeld
      static ::GorillaTagScripts::BuilderItem::BuilderItemState _get_isHeld();
      // Set static field: static public GorillaTagScripts.BuilderItem/BuilderItemState isHeld
      static void _set_isHeld(::GorillaTagScripts::BuilderItem::BuilderItemState value);
      // static field const value: static public GorillaTagScripts.BuilderItem/BuilderItemState dropped
      static constexpr const int dropped = 2;
      // Get static field: static public GorillaTagScripts.BuilderItem/BuilderItemState dropped
      static ::GorillaTagScripts::BuilderItem::BuilderItemState _get_dropped();
      // Set static field: static public GorillaTagScripts.BuilderItem/BuilderItemState dropped
      static void _set_dropped(::GorillaTagScripts::BuilderItem::BuilderItemState value);
      // static field const value: static public GorillaTagScripts.BuilderItem/BuilderItemState placed
      static constexpr const int placed = 4;
      // Get static field: static public GorillaTagScripts.BuilderItem/BuilderItemState placed
      static ::GorillaTagScripts::BuilderItem::BuilderItemState _get_placed();
      // Set static field: static public GorillaTagScripts.BuilderItem/BuilderItemState placed
      static void _set_placed(::GorillaTagScripts::BuilderItem::BuilderItemState value);
      // static field const value: static public GorillaTagScripts.BuilderItem/BuilderItemState unused0
      static constexpr const int unused0 = 8;
      // Get static field: static public GorillaTagScripts.BuilderItem/BuilderItemState unused0
      static ::GorillaTagScripts::BuilderItem::BuilderItemState _get_unused0();
      // Set static field: static public GorillaTagScripts.BuilderItem/BuilderItemState unused0
      static void _set_unused0(::GorillaTagScripts::BuilderItem::BuilderItemState value);
      // static field const value: static public GorillaTagScripts.BuilderItem/BuilderItemState none
      static constexpr const int none = 16;
      // Get static field: static public GorillaTagScripts.BuilderItem/BuilderItemState none
      static ::GorillaTagScripts::BuilderItem::BuilderItemState _get_none();
      // Set static field: static public GorillaTagScripts.BuilderItem/BuilderItemState none
      static void _set_none(::GorillaTagScripts::BuilderItem::BuilderItemState value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // GorillaTagScripts.BuilderItem/BuilderItemState
    #pragma pack(pop)
    static check_size<sizeof(BuilderItem::BuilderItemState), 0 + sizeof(int)> __GorillaTagScripts_BuilderItem_BuilderItemStateSizeCheck;
    static_assert(sizeof(BuilderItem::BuilderItemState) == 0x4);
    public:
    // public GorillaTagScripts.BuilderItemReliableState reliableState
    // Size: 0x8
    // Offset: 0x2D0
    ::GorillaTagScripts::BuilderItemReliableState* reliableState;
    // Field size check
    static_assert(sizeof(::GorillaTagScripts::BuilderItemReliableState*) == 0x8);
    // public System.String builtItemPath
    // Size: 0x8
    // Offset: 0x2D8
    ::StringW builtItemPath;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public UnityEngine.GameObject itemRoot
    // Size: 0x8
    // Offset: 0x2E0
    ::UnityEngine::GameObject* itemRoot;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Boolean enableCollidersWhenReady
    // Size: 0x1
    // Offset: 0x2E8
    bool enableCollidersWhenReady;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Single handsFreeOfCollidersTime
    // Size: 0x4
    // Offset: 0x2EC
    float handsFreeOfCollidersTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public BuilderPiece attachedPiece
    // Size: 0x8
    // Offset: 0x2F0
    ::GlobalNamespace::BuilderPiece* attachedPiece;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BuilderPiece*) == 0x8);
    // public System.Collections.Generic.List`1<UnityEngine.Behaviour> onlyWhenPlacedBehaviours
    // Size: 0x8
    // Offset: 0x2F8
    ::System::Collections::Generic::List_1<::UnityEngine::Behaviour*>* onlyWhenPlacedBehaviours;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Behaviour*>*) == 0x8);
    // public GorillaTagScripts.BuilderItem parentItem
    // Size: 0x8
    // Offset: 0x300
    ::GorillaTagScripts::BuilderItem* parentItem;
    // Field size check
    static_assert(sizeof(::GorillaTagScripts::BuilderItem*) == 0x8);
    // public System.Collections.Generic.List`1<GorillaTagScripts.BuilderAttachGridPlane> gridPlanes
    // Size: 0x8
    // Offset: 0x308
    ::System::Collections::Generic::List_1<::GorillaTagScripts::BuilderAttachGridPlane*>* gridPlanes;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GorillaTagScripts::BuilderAttachGridPlane*>*) == 0x8);
    // public System.Collections.Generic.List`1<GorillaTagScripts.BuilderAttachEdge> edges
    // Size: 0x8
    // Offset: 0x310
    ::System::Collections::Generic::List_1<::GorillaTagScripts::BuilderAttachEdge*>* edges;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GorillaTagScripts::BuilderAttachEdge*>*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.Collider> colliders
    // Size: 0x8
    // Offset: 0x318
    ::System::Collections::Generic::List_1<::UnityEngine::Collider*>* colliders;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Collider*>*) == 0x8);
    // private UnityEngine.Transform parent
    // Size: 0x8
    // Offset: 0x320
    ::UnityEngine::Transform* parent;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Vector3 initialPosition
    // Size: 0xC
    // Offset: 0x328
    ::UnityEngine::Vector3 initialPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Quaternion initialRotation
    // Size: 0x10
    // Offset: 0x334
    ::UnityEngine::Quaternion initialRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.Vector3 initialGrabInteractorScale
    // Size: 0xC
    // Offset: 0x344
    ::UnityEngine::Vector3 initialGrabInteractorScale;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private GorillaTagScripts.BuilderTable currTable
    // Size: 0x8
    // Offset: 0x350
    ::GorillaTagScripts::BuilderTable* currTable;
    // Field size check
    static_assert(sizeof(::GorillaTagScripts::BuilderTable*) == 0x8);
    // private UnityEngine.AudioSource audioSource
    // Size: 0x8
    // Offset: 0x358
    ::UnityEngine::AudioSource* audioSource;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // public UnityEngine.AudioClip snapAudio
    // Size: 0x8
    // Offset: 0x360
    ::UnityEngine::AudioClip* snapAudio;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // public UnityEngine.AudioClip placeAudio
    // Size: 0x8
    // Offset: 0x368
    ::UnityEngine::AudioClip* placeAudio;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // public UnityEngine.GameObject placeVFX
    // Size: 0x8
    // Offset: 0x370
    ::UnityEngine::GameObject* placeVFX;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private GorillaTagScripts.BuilderItem/BuilderItemState previousItemState
    // Size: 0x4
    // Offset: 0x378
    ::GorillaTagScripts::BuilderItem::BuilderItemState previousItemState;
    // Field size check
    static_assert(sizeof(::GorillaTagScripts::BuilderItem::BuilderItemState) == 0x4);
    public:
    // Get instance field reference: public GorillaTagScripts.BuilderItemReliableState reliableState
    [[deprecated("Use field access instead!")]] ::GorillaTagScripts::BuilderItemReliableState*& dyn_reliableState();
    // Get instance field reference: public System.String builtItemPath
    [[deprecated("Use field access instead!")]] ::StringW& dyn_builtItemPath();
    // Get instance field reference: public UnityEngine.GameObject itemRoot
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_itemRoot();
    // Get instance field reference: private System.Boolean enableCollidersWhenReady
    [[deprecated("Use field access instead!")]] bool& dyn_enableCollidersWhenReady();
