// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.LayerMask
#include "UnityEngine/LayerMask.hpp"
// Including type: GorillaTagScripts.BuilderPlacementStyle
#include "GorillaTagScripts/BuilderPlacementStyle.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
// Including type: SnapBounds
#include "GlobalNamespace/SnapBounds.hpp"
// Including type: BuilderPiece
#include "GlobalNamespace/BuilderPiece.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GorillaTagScripts
namespace GorillaTagScripts {
  // Skipping declaration: BuilderCommandType because it is already included!
  // Forward declaring type: BuilderFactory
  class BuilderFactory;
  // Forward declaring type: BuilderTableData
  class BuilderTableData;
  // Forward declaring type: BuilderTableNetworking
  class BuilderTableNetworking;
  // Forward declaring type: BuilderPool
  class BuilderPool;
  // Forward declaring type: BuilderOptionButton
  class BuilderOptionButton;
  // Forward declaring type: BuilderAttachGridPlane
  class BuilderAttachGridPlane;
  // Forward declaring type: BuilderItem
  class BuilderItem;
  // Skipping declaration: TableState because it is already included!
  // Skipping declaration: BuilderCommand because it is already included!
  // Forward declaring type: BuilderPotentialPlacement
  struct BuilderPotentialPlacement;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: HashSet`1<T>
  template<typename T>
  class HashSet_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Collider
  class Collider;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: GameObject
  class GameObject;
  // Skipping declaration: Vector2Int because it is already included!
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: BuilderRenderer
  class BuilderRenderer;
  // Forward declaring type: SizeChanger
  class SizeChanger;
  // Forward declaring type: BuilderShelf
  class BuilderShelf;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: BinaryWriter
  class BinaryWriter;
  // Forward declaring type: BinaryReader
  class BinaryReader;
}
// Forward declaring namespace: PlayFab::ClientModels
namespace PlayFab::ClientModels {
  // Forward declaring type: GetUserDataResult
  class GetUserDataResult;
  // Forward declaring type: GetTitleDataResult
  class GetTitleDataResult;
}
// Forward declaring namespace: PlayFab
namespace PlayFab {
  // Forward declaring type: PlayFabError
  class PlayFabError;
}
// Forward declaring namespace: Photon::Realtime
namespace Photon::Realtime {
  // Forward declaring type: Player
  class Player;
}
// Completed forward declares
// Type namespace: GorillaTagScripts
namespace GorillaTagScripts {
  // Forward declaring type: BuilderTable
  class BuilderTable;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GorillaTagScripts::BuilderTable);
DEFINE_IL2CPP_ARG_TYPE(::GorillaTagScripts::BuilderTable*, "GorillaTagScripts", "BuilderTable");
// Type namespace: GorillaTagScripts
namespace GorillaTagScripts {
  // Size: 0x1B8
  #pragma pack(push, 1)
  // Autogenerated type: GorillaTagScripts.BuilderTable
  // [TokenAttribute] Offset: FFFFFFFF
  class BuilderTable : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::GorillaTagScripts::BuilderTable::BuildPieceSpawn
    class BuildPieceSpawn;
    // Nested type: ::GorillaTagScripts::BuilderTable::BuilderCommandType
    struct BuilderCommandType;
    // Nested type: ::GorillaTagScripts::BuilderTable::TableState
    struct TableState;
    // Nested type: ::GorillaTagScripts::BuilderTable::BuilderCommand
    struct BuilderCommand;
    // Nested type: ::GorillaTagScripts::BuilderTable::SnapParams
    struct SnapParams;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: GorillaTagScripts.BuilderTable/BuilderCommandType
    // [TokenAttribute] Offset: FFFFFFFF
    struct BuilderCommandType/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: BuilderCommandType
      constexpr BuilderCommandType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public GorillaTagScripts.BuilderTable/BuilderCommandType Create
      static constexpr const int Create = 0;
      // Get static field: static public GorillaTagScripts.BuilderTable/BuilderCommandType Create
      static ::GorillaTagScripts::BuilderTable::BuilderCommandType _get_Create();
      // Set static field: static public GorillaTagScripts.BuilderTable/BuilderCommandType Create
      static void _set_Create(::GorillaTagScripts::BuilderTable::BuilderCommandType value);
      // static field const value: static public GorillaTagScripts.BuilderTable/BuilderCommandType Place
      static constexpr const int Place = 1;
      // Get static field: static public GorillaTagScripts.BuilderTable/BuilderCommandType Place
      static ::GorillaTagScripts::BuilderTable::BuilderCommandType _get_Place();
      // Set static field: static public GorillaTagScripts.BuilderTable/BuilderCommandType Place
      static void _set_Place(::GorillaTagScripts::BuilderTable::BuilderCommandType value);
      // static field const value: static public GorillaTagScripts.BuilderTable/BuilderCommandType Grab
      static constexpr const int Grab = 2;
      // Get static field: static public GorillaTagScripts.BuilderTable/BuilderCommandType Grab
      static ::GorillaTagScripts::BuilderTable::BuilderCommandType _get_Grab();
      // Set static field: static public GorillaTagScripts.BuilderTable/BuilderCommandType Grab
      static void _set_Grab(::GorillaTagScripts::BuilderTable::BuilderCommandType value);
      // static field const value: static public GorillaTagScripts.BuilderTable/BuilderCommandType Drop
      static constexpr const int Drop = 3;
      // Get static field: static public GorillaTagScripts.BuilderTable/BuilderCommandType Drop
      static ::GorillaTagScripts::BuilderTable::BuilderCommandType _get_Drop();
      // Set static field: static public GorillaTagScripts.BuilderTable/BuilderCommandType Drop
      static void _set_Drop(::GorillaTagScripts::BuilderTable::BuilderCommandType value);
      // static field const value: static public GorillaTagScripts.BuilderTable/BuilderCommandType Remove
      static constexpr const int Remove = 4;
      // Get static field: static public GorillaTagScripts.BuilderTable/BuilderCommandType Remove
      static ::GorillaTagScripts::BuilderTable::BuilderCommandType _get_Remove();
      // Set static field: static public GorillaTagScripts.BuilderTable/BuilderCommandType Remove
      static void _set_Remove(::GorillaTagScripts::BuilderTable::BuilderCommandType value);
      // static field const value: static public GorillaTagScripts.BuilderTable/BuilderCommandType Sync
      static constexpr const int Sync = 5;
      // Get static field: static public GorillaTagScripts.BuilderTable/BuilderCommandType Sync
      static ::GorillaTagScripts::BuilderTable::BuilderCommandType _get_Sync();
      // Set static field: static public GorillaTagScripts.BuilderTable/BuilderCommandType Sync
      static void _set_Sync(::GorillaTagScripts::BuilderTable::BuilderCommandType value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // GorillaTagScripts.BuilderTable/BuilderCommandType
    #pragma pack(pop)
    static check_size<sizeof(BuilderTable::BuilderCommandType), 0 + sizeof(int)> __GorillaTagScripts_BuilderTable_BuilderCommandTypeSizeCheck;
    static_assert(sizeof(BuilderTable::BuilderCommandType) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: GorillaTagScripts.BuilderTable/TableState
    // [TokenAttribute] Offset: FFFFFFFF
    struct TableState/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: TableState
      constexpr TableState(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public GorillaTagScripts.BuilderTable/TableState WaitingForZoneAndRoom
      static constexpr const int WaitingForZoneAndRoom = 0;
      // Get static field: static public GorillaTagScripts.BuilderTable/TableState WaitingForZoneAndRoom
      static ::GorillaTagScripts::BuilderTable::TableState _get_WaitingForZoneAndRoom();
      // Set static field: static public GorillaTagScripts.BuilderTable/TableState WaitingForZoneAndRoom
      static void _set_WaitingForZoneAndRoom(::GorillaTagScripts::BuilderTable::TableState value);
      // static field const value: static public GorillaTagScripts.BuilderTable/TableState WaitingForInitalBuild
      static constexpr const int WaitingForInitalBuild = 1;
      // Get static field: static public GorillaTagScripts.BuilderTable/TableState WaitingForInitalBuild
      static ::GorillaTagScripts::BuilderTable::TableState _get_WaitingForInitalBuild();
      // Set static field: static public GorillaTagScripts.BuilderTable/TableState WaitingForInitalBuild
      static void _set_WaitingForInitalBuild(::GorillaTagScripts::BuilderTable::TableState value);
      // static field const value: static public GorillaTagScripts.BuilderTable/TableState ReceivingInitialBuild
      static constexpr const int ReceivingInitialBuild = 2;
      // Get static field: static public GorillaTagScripts.BuilderTable/TableState ReceivingInitialBuild
      static ::GorillaTagScripts::BuilderTable::TableState _get_ReceivingInitialBuild();
      // Set static field: static public GorillaTagScripts.BuilderTable/TableState ReceivingInitialBuild
      static void _set_ReceivingInitialBuild(::GorillaTagScripts::BuilderTable::TableState value);
      // static field const value: static public GorillaTagScripts.BuilderTable/TableState WaitForInitialBuildMaster
      static constexpr const int WaitForInitialBuildMaster = 3;
      // Get static field: static public GorillaTagScripts.BuilderTable/TableState WaitForInitialBuildMaster
      static ::GorillaTagScripts::BuilderTable::TableState _get_WaitForInitialBuildMaster();
      // Set static field: static public GorillaTagScripts.BuilderTable/TableState WaitForInitialBuildMaster
      static void _set_WaitForInitialBuildMaster(::GorillaTagScripts::BuilderTable::TableState value);
      // static field const value: static public GorillaTagScripts.BuilderTable/TableState WaitForMasterResync
      static constexpr const int WaitForMasterResync = 4;
      // Get static field: static public GorillaTagScripts.BuilderTable/TableState WaitForMasterResync
      static ::GorillaTagScripts::BuilderTable::TableState _get_WaitForMasterResync();
      // Set static field: static public GorillaTagScripts.BuilderTable/TableState WaitForMasterResync
      static void _set_WaitForMasterResync(::GorillaTagScripts::BuilderTable::TableState value);
      // static field const value: static public GorillaTagScripts.BuilderTable/TableState ReceivingMasterResync
      static constexpr const int ReceivingMasterResync = 5;
      // Get static field: static public GorillaTagScripts.BuilderTable/TableState ReceivingMasterResync
      static ::GorillaTagScripts::BuilderTable::TableState _get_ReceivingMasterResync();
      // Set static field: static public GorillaTagScripts.BuilderTable/TableState ReceivingMasterResync
      static void _set_ReceivingMasterResync(::GorillaTagScripts::BuilderTable::TableState value);
      // static field const value: static public GorillaTagScripts.BuilderTable/TableState InitialBuild
      static constexpr const int InitialBuild = 6;
      // Get static field: static public GorillaTagScripts.BuilderTable/TableState InitialBuild
      static ::GorillaTagScripts::BuilderTable::TableState _get_InitialBuild();
      // Set static field: static public GorillaTagScripts.BuilderTable/TableState InitialBuild
      static void _set_InitialBuild(::GorillaTagScripts::BuilderTable::TableState value);
      // static field const value: static public GorillaTagScripts.BuilderTable/TableState ExecuteQueuedCommands
      static constexpr const int ExecuteQueuedCommands = 7;
      // Get static field: static public GorillaTagScripts.BuilderTable/TableState ExecuteQueuedCommands
      static ::GorillaTagScripts::BuilderTable::TableState _get_ExecuteQueuedCommands();
      // Set static field: static public GorillaTagScripts.BuilderTable/TableState ExecuteQueuedCommands
      static void _set_ExecuteQueuedCommands(::GorillaTagScripts::BuilderTable::TableState value);
      // static field const value: static public GorillaTagScripts.BuilderTable/TableState Ready
      static constexpr const int Ready = 8;
      // Get static field: static public GorillaTagScripts.BuilderTable/TableState Ready
      static ::GorillaTagScripts::BuilderTable::TableState _get_Ready();
      // Set static field: static public GorillaTagScripts.BuilderTable/TableState Ready
      static void _set_Ready(::GorillaTagScripts::BuilderTable::TableState value);
      // static field const value: static public GorillaTagScripts.BuilderTable/TableState BadData
      static constexpr const int BadData = 9;
      // Get static field: static public GorillaTagScripts.BuilderTable/TableState BadData
      static ::GorillaTagScripts::BuilderTable::TableState _get_BadData();
      // Set static field: static public GorillaTagScripts.BuilderTable/TableState BadData
      static void _set_BadData(::GorillaTagScripts::BuilderTable::TableState value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // GorillaTagScripts.BuilderTable/TableState
    #pragma pack(pop)
    static check_size<sizeof(BuilderTable::TableState), 0 + sizeof(int)> __GorillaTagScripts_BuilderTable_TableStateSizeCheck;
    static_assert(sizeof(BuilderTable::TableState) == 0x4);
    // Size: 0x84
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: GorillaTagScripts.BuilderTable/BuilderCommand
    // [TokenAttribute] Offset: FFFFFFFF
    struct BuilderCommand/*, public ::System::ValueType*/ {
      public:
      public:
      // public GorillaTagScripts.BuilderTable/BuilderCommandType type
      // Size: 0x4
      // Offset: 0x0
      ::GorillaTagScripts::BuilderTable::BuilderCommandType type;
      // Field size check
      static_assert(sizeof(::GorillaTagScripts::BuilderTable::BuilderCommandType) == 0x4);
      // public System.Int32 pieceType
      // Size: 0x4
      // Offset: 0x4
      int pieceType;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Int32 pieceId
      // Size: 0x4
      // Offset: 0x8
      int pieceId;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Int32 attachPieceId
      // Size: 0x4
      // Offset: 0xC
      int attachPieceId;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Int32 parentPieceId
      // Size: 0x4
      // Offset: 0x10
      int parentPieceId;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Int32 parentAttachIndex
      // Size: 0x4
      // Offset: 0x14
      int parentAttachIndex;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Int32 attachIndex
      // Size: 0x4
      // Offset: 0x18
      int attachIndex;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public SnapBounds attachBounds
      // Size: 0x10
      // Offset: 0x1C
      ::GlobalNamespace::SnapBounds attachBounds;
      // Field size check
      static_assert(sizeof(::GlobalNamespace::SnapBounds) == 0x10);
      // public SnapBounds parentAttachBounds
      // Size: 0x10
      // Offset: 0x2C
      ::GlobalNamespace::SnapBounds parentAttachBounds;
      // Field size check
      static_assert(sizeof(::GlobalNamespace::SnapBounds) == 0x10);
      // public UnityEngine.Vector3 localPosition
      // Size: 0xC
      // Offset: 0x3C
      ::UnityEngine::Vector3 localPosition;
      // Field size check
      static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
      // public UnityEngine.Quaternion localRotation
      // Size: 0x10
      // Offset: 0x48
      ::UnityEngine::Quaternion localRotation;
      // Field size check
      static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
      // public UnityEngine.Vector3 velocity
      // Size: 0xC
      // Offset: 0x58
      ::UnityEngine::Vector3 velocity;
      // Field size check
      static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
      // public UnityEngine.Vector3 angVelocity
      // Size: 0xC
      // Offset: 0x64
      ::UnityEngine::Vector3 angVelocity;
      // Field size check
      static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
      // public System.Boolean isLeft
      // Size: 0x1
      // Offset: 0x70
      bool isLeft;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // Padding between fields: isLeft and: materialType
      char __padding13[0x3] = {};
      // public System.Int32 materialType
      // Size: 0x4
      // Offset: 0x74
      int materialType;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public Photon.Realtime.Player player
      // Size: 0x8
      // Offset: 0x78
      ::Photon::Realtime::Player* player;
      // Field size check
      static_assert(sizeof(::Photon::Realtime::Player*) == 0x8);
      // public BuilderPiece/State state
      // Size: 0x4
      // Offset: 0x80
      ::GlobalNamespace::BuilderPiece::State state;
      // Field size check
      static_assert(sizeof(::GlobalNamespace::BuilderPiece::State) == 0x4);
      public:
      // Creating value type constructor for type: BuilderCommand
      constexpr BuilderCommand(::GorillaTagScripts::BuilderTable::BuilderCommandType type_ = {}, int pieceType_ = {}, int pieceId_ = {}, int attachPieceId_ = {}, int parentPieceId_ = {}, int parentAttachIndex_ = {}, int attachIndex_ = {}, ::GlobalNamespace::SnapBounds attachBounds_ = {}, ::GlobalNamespace::SnapBounds parentAttachBounds_ = {}, ::UnityEngine::Vector3 localPosition_ = {}, ::UnityEngine::Quaternion localRotation_ = {}, ::UnityEngine::Vector3 velocity_ = {}, ::UnityEngine::Vector3 angVelocity_ = {}, bool isLeft_ = {}, int materialType_ = {}, ::Photon::Realtime::Player* player_ = {}, ::GlobalNamespace::BuilderPiece::State state_ = {}) noexcept : type{type_}, pieceType{pieceType_}, pieceId{pieceId_}, attachPieceId{attachPieceId_}, parentPieceId{parentPieceId_}, parentAttachIndex{parentAttachIndex_}, attachIndex{attachIndex_}, attachBounds{attachBounds_}, parentAttachBounds{parentAttachBounds_}, localPosition{localPosition_}, localRotation{localRotation_}, velocity{velocity_}, angVelocity{angVelocity_}, isLeft{isLeft_}, materialType{materialType_}, player{player_}, state{state_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public GorillaTagScripts.BuilderTable/BuilderCommandType type
      [[deprecated("Use field access instead!")]] ::GorillaTagScripts::BuilderTable::BuilderCommandType& dyn_type();
      // Get instance field reference: public System.Int32 pieceType
      [[deprecated("Use field access instead!")]] int& dyn_pieceType();
      // Get instance field reference: public System.Int32 pieceId
      [[deprecated("Use field access instead!")]] int& dyn_pieceId();
      // Get instance field reference: public System.Int32 attachPieceId
      [[deprecated("Use field access instead!")]] int& dyn_attachPieceId();
      // Get instance field reference: public System.Int32 parentPieceId
      [[deprecated("Use field access instead!")]] int& dyn_parentPieceId();
      // Get instance field reference: public System.Int32 parentAttachIndex
      [[deprecated("Use field access instead!")]] int& dyn_parentAttachIndex();
      // Get instance field reference: public System.Int32 attachIndex
      [[deprecated("Use field access instead!")]] int& dyn_attachIndex();
      // Get instance field reference: public SnapBounds attachBounds
      [[deprecated("Use field access instead!")]] ::GlobalNamespace::SnapBounds& dyn_attachBounds();
      // Get instance field reference: public SnapBounds parentAttachBounds
      [[deprecated("Use field access instead!")]] ::GlobalNamespace::SnapBounds& dyn_parentAttachBounds();
      // Get instance field reference: public UnityEngine.Vector3 localPosition
      [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_localPosition();
      // Get instance field reference: public UnityEngine.Quaternion localRotation
      [[deprecated("Use field access instead!")]] ::UnityEngine::Quaternion& dyn_localRotation();
      // Get instance field reference: public UnityEngine.Vector3 velocity
      [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_velocity();
      // Get instance field reference: public UnityEngine.Vector3 angVelocity
      [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_angVelocity();
      // Get instance field reference: public System.Boolean isLeft
      [[deprecated("Use field access instead!")]] bool& dyn_isLeft();
      // Get instance field reference: public System.Int32 materialType
      [[deprecated("Use field access instead!")]] int& dyn_materialType();
      // Get instance field reference: public Photon.Realtime.Player player
      [[deprecated("Use field access instead!")]] ::Photon::Realtime::Player*& dyn_player();
      // Get instance field reference: public BuilderPiece/State state
      [[deprecated("Use field access instead!")]] ::GlobalNamespace::BuilderPiece::State& dyn_state();
    }; // GorillaTagScripts.BuilderTable/BuilderCommand
    #pragma pack(pop)
    static check_size<sizeof(BuilderTable::BuilderCommand), 128 + sizeof(::GlobalNamespace::BuilderPiece::State)> __GorillaTagScripts_BuilderTable_BuilderCommandSizeCheck;
    static_assert(sizeof(BuilderTable::BuilderCommand) == 0x84);
    // Size: 0x24
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: GorillaTagScripts.BuilderTable/SnapParams
    // [TokenAttribute] Offset: FFFFFFFF
    struct SnapParams/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.Single minOffsetY
      // Size: 0x4
      // Offset: 0x0
      float minOffsetY;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Single maxOffsetY
      // Size: 0x4
      // Offset: 0x4
      float maxOffsetY;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Single maxUpDotProduct
      // Size: 0x4
      // Offset: 0x8
      float maxUpDotProduct;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Single maxTwistDotProduct
      // Size: 0x4
      // Offset: 0xC
      float maxTwistDotProduct;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Single snapAttachDistance
      // Size: 0x4
      // Offset: 0x10
      float snapAttachDistance;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Single snapDelayTime
      // Size: 0x4
      // Offset: 0x14
      float snapDelayTime;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Single snapDelayOffsetDist
      // Size: 0x4
      // Offset: 0x18
      float snapDelayOffsetDist;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Single unSnapDelayTime
      // Size: 0x4
      // Offset: 0x1C
      float unSnapDelayTime;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Single unSnapDelayDist
      // Size: 0x4
      // Offset: 0x20
      float unSnapDelayDist;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      public:
      // Creating value type constructor for type: SnapParams
      constexpr SnapParams(float minOffsetY_ = {}, float maxOffsetY_ = {}, float maxUpDotProduct_ = {}, float maxTwistDotProduct_ = {}, float snapAttachDistance_ = {}, float snapDelayTime_ = {}, float snapDelayOffsetDist_ = {}, float unSnapDelayTime_ = {}, float unSnapDelayDist_ = {}) noexcept : minOffsetY{minOffsetY_}, maxOffsetY{maxOffsetY_}, maxUpDotProduct{maxUpDotProduct_}, maxTwistDotProduct{maxTwistDotProduct_}, snapAttachDistance{snapAttachDistance_}, snapDelayTime{snapDelayTime_}, snapDelayOffsetDist{snapDelayOffsetDist_}, unSnapDelayTime{unSnapDelayTime_}, unSnapDelayDist{unSnapDelayDist_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public System.Single minOffsetY
      [[deprecated("Use field access instead!")]] float& dyn_minOffsetY();
      // Get instance field reference: public System.Single maxOffsetY
      [[deprecated("Use field access instead!")]] float& dyn_maxOffsetY();
      // Get instance field reference: public System.Single maxUpDotProduct
      [[deprecated("Use field access instead!")]] float& dyn_maxUpDotProduct();
      // Get instance field reference: public System.Single maxTwistDotProduct
      [[deprecated("Use field access instead!")]] float& dyn_maxTwistDotProduct();
      // Get instance field reference: public System.Single snapAttachDistance
      [[deprecated("Use field access instead!")]] float& dyn_snapAttachDistance();
      // Get instance field reference: public System.Single snapDelayTime
      [[deprecated("Use field access instead!")]] float& dyn_snapDelayTime();
      // Get instance field reference: public System.Single snapDelayOffsetDist
      [[deprecated("Use field access instead!")]] float& dyn_snapDelayOffsetDist();
      // Get instance field reference: public System.Single unSnapDelayTime
      [[deprecated("Use field access instead!")]] float& dyn_unSnapDelayTime();
      // Get instance field reference: public System.Single unSnapDelayDist
      [[deprecated("Use field access instead!")]] float& dyn_unSnapDelayDist();
    }; // GorillaTagScripts.BuilderTable/SnapParams
    #pragma pack(pop)
    static check_size<sizeof(BuilderTable::SnapParams), 32 + sizeof(float)> __GorillaTagScripts_BuilderTable_SnapParamsSizeCheck;
    static_assert(sizeof(BuilderTable::SnapParams) == 0x24);
    public:
    // public System.Collections.Generic.List`1<BuilderPiece> builderPieces
    // Size: 0x8
    // Offset: 0x20
    ::System::Collections::Generic::List_1<::GlobalNamespace::BuilderPiece*>* builderPieces;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GlobalNamespace::BuilderPiece*>*) == 0x8);
    // public GorillaTagScripts.BuilderTableNetworking builderNetworking
    // Size: 0x8
    // Offset: 0x28
    ::GorillaTagScripts::BuilderTableNetworking* builderNetworking;
    // Field size check
    static_assert(sizeof(::GorillaTagScripts::BuilderTableNetworking*) == 0x8);
    // public BuilderRenderer builderRenderer
    // Size: 0x8
    // Offset: 0x30
    ::GlobalNamespace::BuilderRenderer* builderRenderer;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BuilderRenderer*) == 0x8);
    // public GorillaTagScripts.BuilderPool builderPool
    // Size: 0x8
    // Offset: 0x38
    ::GorillaTagScripts::BuilderPool* builderPool;
    // Field size check
    static_assert(sizeof(::GorillaTagScripts::BuilderPool*) == 0x8);
    // public SizeChanger sizeChanger
    // Size: 0x8
    // Offset: 0x40
    ::GlobalNamespace::SizeChanger* sizeChanger;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SizeChanger*) == 0x8);
    // public System.Single defaultTint
    // Size: 0x4
    // Offset: 0x48
    float defaultTint;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single droppedTint
    // Size: 0x4
    // Offset: 0x4C
    float droppedTint;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single grabbedTint
    // Size: 0x4
    // Offset: 0x50
    float grabbedTint;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single shelfTint
    // Size: 0x4
    // Offset: 0x54
    float shelfTint;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.Transform tableCenter
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::Transform* tableCenter;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Transform worldCenter
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::Transform* worldCenter;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public System.Single tableToWorldScale
    // Size: 0x4
    // Offset: 0x68
    float tableToWorldScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single pieceScale
    // Size: 0x4
    // Offset: 0x6C
    float pieceScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single gridSize
    // Size: 0x4
    // Offset: 0x70
    float gridSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.LayerMask allPiecesMask
    // Size: 0x4
    // Offset: 0x74
    ::UnityEngine::LayerMask allPiecesMask;
    // Field size check
    static_assert(sizeof(::UnityEngine::LayerMask) == 0x4);
    // public System.Boolean useSnapRotation
    // Size: 0x1
    // Offset: 0x78
    bool useSnapRotation;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: useSnapRotation and: usePlacementStyle
    char __padding15[0x3] = {};
    // public GorillaTagScripts.BuilderPlacementStyle usePlacementStyle
    // Size: 0x4
    // Offset: 0x7C
    ::GorillaTagScripts::BuilderPlacementStyle usePlacementStyle;
    // Field size check
    static_assert(sizeof(::GorillaTagScripts::BuilderPlacementStyle) == 0x4);
    // public System.Boolean buildInPlace
    // Size: 0x1
    // Offset: 0x80
    bool buildInPlace;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: buildInPlace and: buttonSnapRotation
    char __padding17[0x7] = {};
    // public GorillaTagScripts.BuilderOptionButton buttonSnapRotation
    // Size: 0x8
    // Offset: 0x88
    ::GorillaTagScripts::BuilderOptionButton* buttonSnapRotation;
    // Field size check
    static_assert(sizeof(::GorillaTagScripts::BuilderOptionButton*) == 0x8);
    // public GorillaTagScripts.BuilderOptionButton buttonSnapPosition
    // Size: 0x8
    // Offset: 0x90
    ::GorillaTagScripts::BuilderOptionButton* buttonSnapPosition;
    // Field size check
    static_assert(sizeof(::GorillaTagScripts::BuilderOptionButton*) == 0x8);
    // public GorillaTagScripts.BuilderOptionButton buttonSaveLayout
    // Size: 0x8
    // Offset: 0x98
    ::GorillaTagScripts::BuilderOptionButton* buttonSaveLayout;
    // Field size check
    static_assert(sizeof(::GorillaTagScripts::BuilderOptionButton*) == 0x8);
    // public GorillaTagScripts.BuilderOptionButton buttonClearLayout
    // Size: 0x8
    // Offset: 0xA0
    ::GorillaTagScripts::BuilderOptionButton* buttonClearLayout;
    // Field size check
    static_assert(sizeof(::GorillaTagScripts::BuilderOptionButton*) == 0x8);
    // public System.Collections.Generic.List`1<GorillaTagScripts.BuilderAttachGridPlane> baseGridPlanes
    // Size: 0x8
    // Offset: 0xA8
    ::System::Collections::Generic::List_1<::GorillaTagScripts::BuilderAttachGridPlane*>* baseGridPlanes;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GorillaTagScripts::BuilderAttachGridPlane*>*) == 0x8);
    // public System.Collections.Generic.List`1<BuilderPiece> basePieces
    // Size: 0x8
    // Offset: 0xB0
    ::System::Collections::Generic::List_1<::GlobalNamespace::BuilderPiece*>* basePieces;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GlobalNamespace::BuilderPiece*>*) == 0x8);
    // private System.Int32 nextPieceId
    // Size: 0x4
    // Offset: 0xB8
    int nextPieceId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: nextPieceId and: shelvesRoot
    char __padding24[0x4] = {};
    // public UnityEngine.GameObject shelvesRoot
    // Size: 0x8
    // Offset: 0xC0
    ::UnityEngine::GameObject* shelvesRoot;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public System.Collections.Generic.List`1<GorillaTagScripts.BuilderTable/BuildPieceSpawn> buildPieceSpawns
    // Size: 0x8
    // Offset: 0xC8
    ::System::Collections::Generic::List_1<::GorillaTagScripts::BuilderTable::BuildPieceSpawn*>* buildPieceSpawns;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GorillaTagScripts::BuilderTable::BuildPieceSpawn*>*) == 0x8);
    // public System.Collections.Generic.List`1<BuilderShelf> shelves
    // Size: 0x8
    // Offset: 0xD0
    ::System::Collections::Generic::List_1<::GlobalNamespace::BuilderShelf*>* shelves;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GlobalNamespace::BuilderShelf*>*) == 0x8);
    // public System.Collections.Generic.List`1<UnityEngine.GameObject> buildItemRoots
    // Size: 0x8
    // Offset: 0xD8
    ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>* buildItemRoots;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*) == 0x8);
    // public System.Collections.Generic.List`1<GorillaTagScripts.BuilderItem> buildItems
    // Size: 0x8
    // Offset: 0xE0
    ::System::Collections::Generic::List_1<::GorillaTagScripts::BuilderItem*>* buildItems;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GorillaTagScripts::BuilderItem*>*) == 0x8);
    // public System.Collections.Generic.List`1<BuilderPiece> pieces
    // Size: 0x8
    // Offset: 0xE8
    ::System::Collections::Generic::List_1<::GlobalNamespace::BuilderPiece*>* pieces;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GlobalNamespace::BuilderPiece*>*) == 0x8);
    // private System.Collections.Generic.HashSet`1<System.Int32> builderPiecesVisited
    // Size: 0x8
    // Offset: 0xF0
    ::System::Collections::Generic::HashSet_1<int>* builderPiecesVisited;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::HashSet_1<int>*) == 0x8);
    // private GorillaTagScripts.BuilderTable/TableState tableState
    // Size: 0x4
    // Offset: 0xF8
    ::GorillaTagScripts::BuilderTable::TableState tableState;
    // Field size check
    static_assert(sizeof(::GorillaTagScripts::BuilderTable::TableState) == 0x4);
    // private System.Boolean inRoom
    // Size: 0x1
    // Offset: 0xFC
    bool inRoom;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean inBuilderZone
    // Size: 0x1
    // Offset: 0xFD
    bool inBuilderZone;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: inBuilderZone and: queuedBuildCommands
    char __padding34[0x2] = {};
    // private System.Collections.Generic.List`1<GorillaTagScripts.BuilderTable/BuilderCommand> queuedBuildCommands
    // Size: 0x8
    // Offset: 0x100
    ::System::Collections::Generic::List_1<::GorillaTagScripts::BuilderTable::BuilderCommand>* queuedBuildCommands;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GorillaTagScripts::BuilderTable::BuilderCommand>*) == 0x8);
    // public System.Collections.Generic.List`1<GorillaTagScripts.BuilderAttachGridPlane> gridPlanes
    // Size: 0x8
    // Offset: 0x108
    ::System::Collections::Generic::List_1<::GorillaTagScripts::BuilderAttachGridPlane*>* gridPlanes;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GorillaTagScripts::BuilderAttachGridPlane*>*) == 0x8);
    // public System.Collections.Generic.List`1<GorillaTagScripts.BuilderFactory> factories
    // Size: 0x8
    // Offset: 0x110
    ::System::Collections::Generic::List_1<::GorillaTagScripts::BuilderFactory*>* factories;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GorillaTagScripts::BuilderFactory*>*) == 0x8);
    // private System.Boolean isSetup
    // Size: 0x1
    // Offset: 0x118
    bool isSetup;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isSetup and: releaseSnapParams
    char __padding38[0x3] = {};
    // public GorillaTagScripts.BuilderTable/SnapParams releaseSnapParams
    // Size: 0x24
    // Offset: 0x11C
    ::GorillaTagScripts::BuilderTable::SnapParams releaseSnapParams;
    // Field size check
    static_assert(sizeof(::GorillaTagScripts::BuilderTable::SnapParams) == 0x24);
    // public GorillaTagScripts.BuilderTable/SnapParams pushSnapParams
    // Size: 0x24
    // Offset: 0x140
    ::GorillaTagScripts::BuilderTable::SnapParams pushSnapParams;
    // Field size check
    static_assert(sizeof(::GorillaTagScripts::BuilderTable::SnapParams) == 0x24);
    // public GorillaTagScripts.BuilderTable/SnapParams pushAndEaseParams
    // Size: 0x24
    // Offset: 0x164
    ::GorillaTagScripts::BuilderTable::SnapParams pushAndEaseParams;
    // Field size check
    static_assert(sizeof(::GorillaTagScripts::BuilderTable::SnapParams) == 0x24);
    // private GorillaTagScripts.BuilderTable/SnapParams currSnapParams
    // Size: 0x24
    // Offset: 0x188
    ::GorillaTagScripts::BuilderTable::SnapParams currSnapParams;
    // Field size check
    static_assert(sizeof(::GorillaTagScripts::BuilderTable::SnapParams) == 0x24);
    // public System.Int32 maxPlacementChildDepth
    // Size: 0x4
    // Offset: 0x1AC
    int maxPlacementChildDepth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private GorillaTagScripts.BuilderTableData tableData
    // Size: 0x8
    // Offset: 0x1B0
    ::GorillaTagScripts::BuilderTableData* tableData;
    // Field size check
    static_assert(sizeof(::GorillaTagScripts::BuilderTableData*) == 0x8);
    public:
    // static field const value: static private System.Int32 INITIAL_BUILTIN_PIECE_ID
    static constexpr const int INITIAL_BUILTIN_PIECE_ID = 60000;
    // Get static field: static private System.Int32 INITIAL_BUILTIN_PIECE_ID
    static int _get_INITIAL_BUILTIN_PIECE_ID();
    // Set static field: static private System.Int32 INITIAL_BUILTIN_PIECE_ID
    static void _set_INITIAL_BUILTIN_PIECE_ID(int value);
    // static field const value: static private System.Int32 INITIAL_CREATED_PIECE_ID
    static constexpr const int INITIAL_CREATED_PIECE_ID = 5;
    // Get static field: static private System.Int32 INITIAL_CREATED_PIECE_ID
    static int _get_INITIAL_CREATED_PIECE_ID();
    // Set static field: static private System.Int32 INITIAL_CREATED_PIECE_ID
