// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Photon.Pun.MonoBehaviourPunCallbacks
#include "Photon/Pun/MonoBehaviourPunCallbacks.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: GroupJoinZone
#include "GlobalNamespace/GroupJoinZone.hpp"
// Including type: GorillaTag.GTColor/HSVRanges
#include "GorillaTag/GTColor_HSVRanges.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: HashSet`1<T>
  template<typename T>
  class HashSet_1;
  // Forward declaring type: Queue`1<T>
  template<typename T>
  class Queue_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: AudioClip
  class AudioClip;
  // Forward declaring type: ParticleSystem
  class ParticleSystem;
  // Forward declaring type: AudioSource
  class AudioSource;
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: StringBuilder
  class StringBuilder;
}
// Forward declaring namespace: Photon::Pun
namespace Photon::Pun {
  // Forward declaring type: PhotonMessageInfo
  struct PhotonMessageInfo;
}
// Forward declaring namespace: Photon::Realtime
namespace Photon::Realtime {
  // Forward declaring type: Player
  class Player;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: GorillaFriendCollider
  class GorillaFriendCollider;
}
// Completed forward declares
// Type namespace: GorillaTagScripts
namespace GorillaTagScripts {
  // Forward declaring type: FriendshipGroupDetection
  class FriendshipGroupDetection;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GorillaTagScripts::FriendshipGroupDetection);
DEFINE_IL2CPP_ARG_TYPE(::GorillaTagScripts::FriendshipGroupDetection*, "GorillaTagScripts", "FriendshipGroupDetection");
// Type namespace: GorillaTagScripts
namespace GorillaTagScripts {
  // Size: 0x10C
  #pragma pack(push, 1)
  // Autogenerated type: GorillaTagScripts.FriendshipGroupDetection
  // [TokenAttribute] Offset: FFFFFFFF
  class FriendshipGroupDetection : public ::Photon::Pun::MonoBehaviourPunCallbacks {
    public:
    // Nested type: ::GorillaTagScripts::FriendshipGroupDetection::PlayerFist
    struct PlayerFist;
    // Size: 0x11
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: GorillaTagScripts.FriendshipGroupDetection/PlayerFist
    // [TokenAttribute] Offset: FFFFFFFF
    struct PlayerFist/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.Int32 actorNumber
      // Size: 0x4
      // Offset: 0x0
      int actorNumber;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public UnityEngine.Vector3 position
      // Size: 0xC
      // Offset: 0x4
      ::UnityEngine::Vector3 position;
      // Field size check
      static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
      // public System.Boolean isLeftHand
      // Size: 0x1
      // Offset: 0x10
      bool isLeftHand;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      public:
      // Creating value type constructor for type: PlayerFist
      constexpr PlayerFist(int actorNumber_ = {}, ::UnityEngine::Vector3 position_ = {}, bool isLeftHand_ = {}) noexcept : actorNumber{actorNumber_}, position{position_}, isLeftHand{isLeftHand_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public System.Int32 actorNumber
      [[deprecated("Use field access instead!")]] int& dyn_actorNumber();
      // Get instance field reference: public UnityEngine.Vector3 position
      [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_position();
      // Get instance field reference: public System.Boolean isLeftHand
      [[deprecated("Use field access instead!")]] bool& dyn_isLeftHand();
    }; // GorillaTagScripts.FriendshipGroupDetection/PlayerFist
    #pragma pack(pop)
    static check_size<sizeof(FriendshipGroupDetection::PlayerFist), 16 + sizeof(bool)> __GorillaTagScripts_FriendshipGroupDetection_PlayerFistSizeCheck;
    static_assert(sizeof(FriendshipGroupDetection::PlayerFist) == 0x11);
    public:
    // private System.Single detectionRadius
    // Size: 0x4
    // Offset: 0x28
    float detectionRadius;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single groupTime
    // Size: 0x4
    // Offset: 0x2C
    float groupTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single cooldownAfterCreatingGroup
    // Size: 0x4
    // Offset: 0x30
    float cooldownAfterCreatingGroup;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single hapticStrength
    // Size: 0x4
    // Offset: 0x34
    float hapticStrength;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single hapticDuration
    // Size: 0x4
    // Offset: 0x38
    float hapticDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean debug
    // Size: 0x1
    // Offset: 0x3C
    bool debug;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: debug and: offset
    char __padding5[0x3] = {};
    // public System.Double offset
    // Size: 0x8
    // Offset: 0x40
    double offset;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private System.Collections.Generic.List`1<System.String> myPartyMemberIDs
    // Size: 0x8
    // Offset: 0x48
    ::System::Collections::Generic::List_1<::StringW>* myPartyMemberIDs;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::StringW>*) == 0x8);
    // private System.Collections.Generic.HashSet`1<System.String> myPartyMembersHash
    // Size: 0x8
    // Offset: 0x50
    ::System::Collections::Generic::HashSet_1<::StringW>* myPartyMembersHash;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::HashSet_1<::StringW>*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.Color> <myBeadColors>k__BackingField
    // Size: 0x8
    // Offset: 0x58
    ::System::Collections::Generic::List_1<::UnityEngine::Color>* myBeadColors;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Color>*) == 0x8);
    // private UnityEngine.Color <myBraceletColor>k__BackingField
    // Size: 0x10
    // Offset: 0x60
    ::UnityEngine::Color myBraceletColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private System.Int32 <MyBraceletSelfIndex>k__BackingField
    // Size: 0x4
    // Offset: 0x70
    int MyBraceletSelfIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private GroupJoinZone <partyZone>k__BackingField
    // Size: 0x4
    // Offset: 0x74
    ::GlobalNamespace::GroupJoinZone partyZone;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::GroupJoinZone) == 0x4);
    // private System.Collections.Generic.List`1<System.Action`1<GroupJoinZone>> groupZoneCallbacks
    // Size: 0x8
    // Offset: 0x78
    ::System::Collections::Generic::List_1<::System::Action_1<::GlobalNamespace::GroupJoinZone>*>* groupZoneCallbacks;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::System::Action_1<::GlobalNamespace::GroupJoinZone>*>*) == 0x8);
    // private GorillaTag.GTColor/HSVRanges braceletRandomColorHSVRanges
    // Size: 0x18
    // Offset: 0x80
    ::GorillaTag::GTColor::HSVRanges braceletRandomColorHSVRanges;
    // Field size check
    static_assert(sizeof(::GorillaTag::GTColor::HSVRanges) == 0x18);
    // public UnityEngine.GameObject friendshipBubble
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::GameObject* friendshipBubble;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.AudioClip fistBumpInterruptedAudio
    // Size: 0x8
    // Offset: 0xA0
    ::UnityEngine::AudioClip* fistBumpInterruptedAudio;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // private UnityEngine.ParticleSystem particleSystem
    // Size: 0x8
    // Offset: 0xA8
    ::UnityEngine::ParticleSystem* particleSystem;
    // Field size check
    static_assert(sizeof(::UnityEngine::ParticleSystem*) == 0x8);
    // private UnityEngine.AudioSource audioSource
    // Size: 0x8
    // Offset: 0xB0
    ::UnityEngine::AudioSource* audioSource;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // private System.Collections.Generic.Queue`1<GorillaTagScripts.FriendshipGroupDetection/PlayerFist> playersToPropagateFrom
    // Size: 0x8
    // Offset: 0xB8
    ::System::Collections::Generic::Queue_1<::GorillaTagScripts::FriendshipGroupDetection::PlayerFist>* playersToPropagateFrom;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Queue_1<::GorillaTagScripts::FriendshipGroupDetection::PlayerFist>*) == 0x8);
    // private System.Collections.Generic.List`1<System.Int32> playersInProvisionalGroup
    // Size: 0x8
    // Offset: 0xC0
    ::System::Collections::Generic::List_1<int>* playersInProvisionalGroup;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<int>*) == 0x8);
    // private System.Collections.Generic.List`1<System.Int32> provisionalGroupUsingLeftHands
    // Size: 0x8
    // Offset: 0xC8
    ::System::Collections::Generic::List_1<int>* provisionalGroupUsingLeftHands;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<int>*) == 0x8);
    // private System.Collections.Generic.List`1<System.Int32> tempIntList
    // Size: 0x8
    // Offset: 0xD0
    ::System::Collections::Generic::List_1<int>* tempIntList;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<int>*) == 0x8);
    // private System.Boolean amFirstProvisionalPlayer
    // Size: 0x1
    // Offset: 0xD8
    bool amFirstProvisionalPlayer;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: amFirstProvisionalPlayer and: partyMergeIDs
    char __padding23[0x7] = {};
    // private System.Collections.Generic.Dictionary`2<System.Int32,System.Int32[]> partyMergeIDs
    // Size: 0x8
    // Offset: 0xE0
    ::System::Collections::Generic::Dictionary_2<int, ::ArrayW<int>>* partyMergeIDs;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<int, ::ArrayW<int>>*) == 0x8);
    // private System.Single groupCreateAfterTimestamp
    // Size: 0x4
    // Offset: 0xE8
    float groupCreateAfterTimestamp;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single suppressPartyCreationUntilTimestamp
    // Size: 0x4
    // Offset: 0xEC
    float suppressPartyCreationUntilTimestamp;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean <DidJoinLeftHanded>k__BackingField
    // Size: 0x1
    // Offset: 0xF0
    bool DidJoinLeftHanded;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean WillJoinLeftHanded
    // Size: 0x1
    // Offset: 0xF1
    bool WillJoinLeftHanded;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: WillJoinLeftHanded and: playersMakingFists
    char __padding28[0x6] = {};
    // private System.Collections.Generic.List`1<GorillaTagScripts.FriendshipGroupDetection/PlayerFist> playersMakingFists
    // Size: 0x8
    // Offset: 0xF8
    ::System::Collections::Generic::List_1<::GorillaTagScripts::FriendshipGroupDetection::PlayerFist>* playersMakingFists;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GorillaTagScripts::FriendshipGroupDetection::PlayerFist>*) == 0x8);
    // private System.Text.StringBuilder debugStr
    // Size: 0x8
    // Offset: 0x100
    ::System::Text::StringBuilder* debugStr;
    // Field size check
    static_assert(sizeof(::System::Text::StringBuilder*) == 0x8);
    // private System.Single aboutToGroupJoin_CooldownUntilTimestamp
    // Size: 0x4
    // Offset: 0x108
    float aboutToGroupJoin_CooldownUntilTimestamp;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Get static field: static private GorillaTagScripts.FriendshipGroupDetection <Instance>k__BackingField
    static ::GorillaTagScripts::FriendshipGroupDetection* _get_$Instance$k__BackingField();
    // Set static field: static private GorillaTagScripts.FriendshipGroupDetection <Instance>k__BackingField
    static void _set_$Instance$k__BackingField(::GorillaTagScripts::FriendshipGroupDetection* value);
    // Get static field: static private System.Collections.Generic.Dictionary`2<System.Int32,System.String> userIdLookup
    static ::System::Collections::Generic::Dictionary_2<int, ::StringW>* _get_userIdLookup();
    // Set static field: static private System.Collections.Generic.Dictionary`2<System.Int32,System.String> userIdLookup
