// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: GorillaTagScripts.GorillaCaveCrystalSetup
#include "GorillaTagScripts/GorillaCaveCrystalSetup.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Material
  class Material;
}
// Forward declaring namespace: GorillaTagScripts
namespace GorillaTagScripts {
  // Forward declaring type: CrystalVisualsPreset
  class CrystalVisualsPreset;
}
// Completed forward declares
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GorillaTagScripts::GorillaCaveCrystalSetup::CrystalDef);
DEFINE_IL2CPP_ARG_TYPE(::GorillaTagScripts::GorillaCaveCrystalSetup::CrystalDef*, "GorillaTagScripts", "GorillaCaveCrystalSetup/CrystalDef");
// Type namespace: GorillaTagScripts
namespace GorillaTagScripts {
  // Size: 0x2C
  #pragma pack(push, 1)
  // Autogenerated type: GorillaTagScripts.GorillaCaveCrystalSetup/CrystalDef
  // [TokenAttribute] Offset: FFFFFFFF
  class GorillaCaveCrystalSetup::CrystalDef : public ::Il2CppObject {
    public:
    public:
    // public UnityEngine.Material keyMaterial
    // Size: 0x8
    // Offset: 0x10
    ::UnityEngine::Material* keyMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // public GorillaTagScripts.CrystalVisualsPreset visualPreset
    // Size: 0x8
    // Offset: 0x18
    ::GorillaTagScripts::CrystalVisualsPreset* visualPreset;
    // Field size check
    static_assert(sizeof(::GorillaTagScripts::CrystalVisualsPreset*) == 0x8);
    // public System.Int32 low
    // Size: 0x4
    // Offset: 0x20
    int low;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 mid
    // Size: 0x4
    // Offset: 0x24
    int mid;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 high
    // Size: 0x4
    // Offset: 0x28
    int high;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Get instance field reference: public UnityEngine.Material keyMaterial
    [[deprecated("Use field access instead!")]] ::UnityEngine::Material*& dyn_keyMaterial();
    // Get instance field reference: public GorillaTagScripts.CrystalVisualsPreset visualPreset
    [[deprecated("Use field access instead!")]] ::GorillaTagScripts::CrystalVisualsPreset*& dyn_visualPreset();
    // Get instance field reference: public System.Int32 low
    [[deprecated("Use field access instead!")]] int& dyn_low();
    // Get instance field reference: public System.Int32 mid
    [[deprecated("Use field access instead!")]] int& dyn_mid();
    // Get instance field reference: public System.Int32 high
    [[deprecated("Use field access instead!")]] int& dyn_high();
    // public System.Void .ctor()
    // Offset: 0x280D334
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static GorillaCaveCrystalSetup::CrystalDef* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::GorillaTagScripts::GorillaCaveCrystalSetup::CrystalDef::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<GorillaCaveCrystalSetup::CrystalDef*, creationType>()));
    }
  }; // GorillaTagScripts.GorillaCaveCrystalSetup/CrystalDef
  #pragma pack(pop)
  static check_size<sizeof(GorillaCaveCrystalSetup::CrystalDef), 40 + sizeof(int)> __GorillaTagScripts_GorillaCaveCrystalSetup_CrystalDefSizeCheck;
  static_assert(sizeof(GorillaCaveCrystalSetup::CrystalDef) == 0x2C);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: GorillaTagScripts::GorillaCaveCrystalSetup::CrystalDef::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
