// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Globalization
namespace System::Globalization {
  // Forward declaring type: CultureInfo
  class CultureInfo;
  // Forward declaring type: UnicodeCategory
  struct UnicodeCategory;
}
// Forward declaring namespace: System::Text::RegularExpressions
namespace System::Text::RegularExpressions {
  // Skipping declaration: SingleRange because it is already included!
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: StringBuilder
  class StringBuilder;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Completed forward declares
// Type namespace: System.Text.RegularExpressions
namespace System::Text::RegularExpressions {
  // Forward declaring type: RegexCharClass
  class RegexCharClass;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Text::RegularExpressions::RegexCharClass);
DEFINE_IL2CPP_ARG_TYPE(::System::Text::RegularExpressions::RegexCharClass*, "System.Text.RegularExpressions", "RegexCharClass");
// Type namespace: System.Text.RegularExpressions
namespace System::Text::RegularExpressions {
  // Size: 0x30
  #pragma pack(push, 1)
  // Autogenerated type: System.Text.RegularExpressions.RegexCharClass
  // [TokenAttribute] Offset: FFFFFFFF
  class RegexCharClass : public ::Il2CppObject {
    public:
    // Nested type: ::System::Text::RegularExpressions::RegexCharClass::LowerCaseMapping
    struct LowerCaseMapping;
    // Nested type: ::System::Text::RegularExpressions::RegexCharClass::SingleRangeComparer
    class SingleRangeComparer;
    // Nested type: ::System::Text::RegularExpressions::RegexCharClass::SingleRange
    struct SingleRange;
    // Size: 0xC
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: System.Text.RegularExpressions.RegexCharClass/LowerCaseMapping
    // [TokenAttribute] Offset: FFFFFFFF
    // [IsReadOnlyAttribute] Offset: FFFFFFFF
    struct LowerCaseMapping/*, public ::System::ValueType*/ {
      public:
      public:
      // public readonly System.Char ChMin
      // Size: 0x2
      // Offset: 0x0
      ::Il2CppChar ChMin;
      // Field size check
      static_assert(sizeof(::Il2CppChar) == 0x2);
      // public readonly System.Char ChMax
      // Size: 0x2
      // Offset: 0x2
      ::Il2CppChar ChMax;
      // Field size check
      static_assert(sizeof(::Il2CppChar) == 0x2);
      // public readonly System.Int32 LcOp
      // Size: 0x4
      // Offset: 0x4
      int LcOp;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public readonly System.Int32 Data
      // Size: 0x4
      // Offset: 0x8
      int Data;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: LowerCaseMapping
      constexpr LowerCaseMapping(::Il2CppChar ChMin_ = {}, ::Il2CppChar ChMax_ = {}, int LcOp_ = {}, int Data_ = {}) noexcept : ChMin{ChMin_}, ChMax{ChMax_}, LcOp{LcOp_}, Data{Data_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public readonly System.Char ChMin
      [[deprecated("Use field access instead!")]] ::Il2CppChar& dyn_ChMin();
      // Get instance field reference: public readonly System.Char ChMax
      [[deprecated("Use field access instead!")]] ::Il2CppChar& dyn_ChMax();
      // Get instance field reference: public readonly System.Int32 LcOp
      [[deprecated("Use field access instead!")]] int& dyn_LcOp();
      // Get instance field reference: public readonly System.Int32 Data
      [[deprecated("Use field access instead!")]] int& dyn_Data();
      // System.Void .ctor(System.Char chMin, System.Char chMax, System.Int32 lcOp, System.Int32 data)
      // Offset: 0x4F77FF0
      // ABORTED: conflicts with another method.  LowerCaseMapping(::Il2CppChar chMin, ::Il2CppChar chMax, int lcOp, int data);
    }; // System.Text.RegularExpressions.RegexCharClass/LowerCaseMapping
    #pragma pack(pop)
    static check_size<sizeof(RegexCharClass::LowerCaseMapping), 8 + sizeof(int)> __System_Text_RegularExpressions_RegexCharClass_LowerCaseMappingSizeCheck;
    static_assert(sizeof(RegexCharClass::LowerCaseMapping) == 0xC);
    // Size: 0x4
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: System.Text.RegularExpressions.RegexCharClass/SingleRange
    // [TokenAttribute] Offset: FFFFFFFF
    // [IsReadOnlyAttribute] Offset: FFFFFFFF
    struct SingleRange/*, public ::System::ValueType*/ {
      public:
      public:
      // public readonly System.Char First
      // Size: 0x2
      // Offset: 0x0
      ::Il2CppChar First;
      // Field size check
      static_assert(sizeof(::Il2CppChar) == 0x2);
      // public readonly System.Char Last
      // Size: 0x2
      // Offset: 0x2
      ::Il2CppChar Last;
      // Field size check
      static_assert(sizeof(::Il2CppChar) == 0x2);
      public:
      // Creating value type constructor for type: SingleRange
      constexpr SingleRange(::Il2CppChar First_ = {}, ::Il2CppChar Last_ = {}) noexcept : First{First_}, Last{Last_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public readonly System.Char First
      [[deprecated("Use field access instead!")]] ::Il2CppChar& dyn_First();
      // Get instance field reference: public readonly System.Char Last
      [[deprecated("Use field access instead!")]] ::Il2CppChar& dyn_Last();
      // System.Void .ctor(System.Char first, System.Char last)
      // Offset: 0x4F78090
      // ABORTED: conflicts with another method.  SingleRange(::Il2CppChar first, ::Il2CppChar last);
    }; // System.Text.RegularExpressions.RegexCharClass/SingleRange
    #pragma pack(pop)
    static check_size<sizeof(RegexCharClass::SingleRange), 2 + sizeof(::Il2CppChar)> __System_Text_RegularExpressions_RegexCharClass_SingleRangeSizeCheck;
    static_assert(sizeof(RegexCharClass::SingleRange) == 0x4);
    public:
    // private System.Collections.Generic.List`1<System.Text.RegularExpressions.RegexCharClass/SingleRange> _rangelist
    // Size: 0x8
    // Offset: 0x10
    ::System::Collections::Generic::List_1<::System::Text::RegularExpressions::RegexCharClass::SingleRange>* rangelist;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::System::Text::RegularExpressions::RegexCharClass::SingleRange>*) == 0x8);
    // private System.Text.StringBuilder _categories
    // Size: 0x8
    // Offset: 0x18
    ::System::Text::StringBuilder* categories;
    // Field size check
    static_assert(sizeof(::System::Text::StringBuilder*) == 0x8);
    // private System.Boolean _canonical
    // Size: 0x1
    // Offset: 0x20
    bool canonical;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _negate
    // Size: 0x1
    // Offset: 0x21
    bool negate;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: negate and: subtractor
    char __padding3[0x6] = {};
    // private System.Text.RegularExpressions.RegexCharClass _subtractor
    // Size: 0x8
    // Offset: 0x28
    ::System::Text::RegularExpressions::RegexCharClass* subtractor;
    // Field size check
    static_assert(sizeof(::System::Text::RegularExpressions::RegexCharClass*) == 0x8);
    public:
    // Get static field: static private readonly System.String s_internalRegexIgnoreCase
    static ::StringW _get_s_internalRegexIgnoreCase();
    // Set static field: static private readonly System.String s_internalRegexIgnoreCase
    static void _set_s_internalRegexIgnoreCase(::StringW value);
    // Get static field: static private readonly System.String s_space
    static ::StringW _get_s_space();
    // Set static field: static private readonly System.String s_space
    static void _set_s_space(::StringW value);
    // Get static field: static private readonly System.String s_notSpace
    static ::StringW _get_s_notSpace();
    // Set static field: static private readonly System.String s_notSpace
    static void _set_s_notSpace(::StringW value);
