// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Text.RegularExpressions.RegexOptions
#include "System/Text/RegularExpressions/RegexOptions.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Text::RegularExpressions
namespace System::Text::RegularExpressions {
  // Forward declaring type: RegexNode
  class RegexNode;
  // Forward declaring type: RegexTree
  class RegexTree;
  // Forward declaring type: RegexReplacement
  class RegexReplacement;
  // Forward declaring type: RegexCharClass
  class RegexCharClass;
}
// Forward declaring namespace: System::Globalization
namespace System::Globalization {
  // Forward declaring type: CultureInfo
  class CultureInfo;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: Hashtable
  class Hashtable;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: ArgumentException
  class ArgumentException;
}
// Completed forward declares
// Type namespace: System.Text.RegularExpressions
namespace System::Text::RegularExpressions {
  // Forward declaring type: RegexParser
  class RegexParser;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Text::RegularExpressions::RegexParser);
DEFINE_IL2CPP_ARG_TYPE(::System::Text::RegularExpressions::RegexParser*, "System.Text.RegularExpressions", "RegexParser");
// Type namespace: System.Text.RegularExpressions
namespace System::Text::RegularExpressions {
  // Size: 0x91
  #pragma pack(push, 1)
  // Autogenerated type: System.Text.RegularExpressions.RegexParser
  // [TokenAttribute] Offset: FFFFFFFF
  class RegexParser : public ::Il2CppObject {
    public:
    public:
    // private System.Text.RegularExpressions.RegexNode _stack
    // Size: 0x8
    // Offset: 0x10
    ::System::Text::RegularExpressions::RegexNode* stack;
    // Field size check
    static_assert(sizeof(::System::Text::RegularExpressions::RegexNode*) == 0x8);
    // private System.Text.RegularExpressions.RegexNode _group
    // Size: 0x8
    // Offset: 0x18
    ::System::Text::RegularExpressions::RegexNode* group;
    // Field size check
    static_assert(sizeof(::System::Text::RegularExpressions::RegexNode*) == 0x8);
    // private System.Text.RegularExpressions.RegexNode _alternation
    // Size: 0x8
    // Offset: 0x20
    ::System::Text::RegularExpressions::RegexNode* alternation;
    // Field size check
    static_assert(sizeof(::System::Text::RegularExpressions::RegexNode*) == 0x8);
    // private System.Text.RegularExpressions.RegexNode _concatenation
    // Size: 0x8
    // Offset: 0x28
    ::System::Text::RegularExpressions::RegexNode* concatenation;
    // Field size check
    static_assert(sizeof(::System::Text::RegularExpressions::RegexNode*) == 0x8);
    // private System.Text.RegularExpressions.RegexNode _unit
    // Size: 0x8
    // Offset: 0x30
    ::System::Text::RegularExpressions::RegexNode* unit;
    // Field size check
    static_assert(sizeof(::System::Text::RegularExpressions::RegexNode*) == 0x8);
    // private System.String _pattern
    // Size: 0x8
    // Offset: 0x38
    ::StringW pattern;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Int32 _currentPos
    // Size: 0x4
    // Offset: 0x40
    int currentPos;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: currentPos and: culture
    char __padding6[0x4] = {};
    // private System.Globalization.CultureInfo _culture
    // Size: 0x8
    // Offset: 0x48
    ::System::Globalization::CultureInfo* culture;
    // Field size check
    static_assert(sizeof(::System::Globalization::CultureInfo*) == 0x8);
    // private System.Int32 _autocap
    // Size: 0x4
    // Offset: 0x50
    int autocap;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _capcount
    // Size: 0x4
    // Offset: 0x54
    int capcount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _captop
    // Size: 0x4
    // Offset: 0x58
    int captop;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _capsize
    // Size: 0x4
    // Offset: 0x5C
    int capsize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Collections.Hashtable _caps
    // Size: 0x8
    // Offset: 0x60
    ::System::Collections::Hashtable* caps;
    // Field size check
    static_assert(sizeof(::System::Collections::Hashtable*) == 0x8);
    // private System.Collections.Hashtable _capnames
    // Size: 0x8
    // Offset: 0x68
    ::System::Collections::Hashtable* capnames;
    // Field size check
    static_assert(sizeof(::System::Collections::Hashtable*) == 0x8);
    // private System.Int32[] _capnumlist
    // Size: 0x8
    // Offset: 0x70
    ::ArrayW<int> capnumlist;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // private System.Collections.Generic.List`1<System.String> _capnamelist
    // Size: 0x8
    // Offset: 0x78
    ::System::Collections::Generic::List_1<::StringW>* capnamelist;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::StringW>*) == 0x8);
    // private System.Text.RegularExpressions.RegexOptions _options
    // Size: 0x4
    // Offset: 0x80
    ::System::Text::RegularExpressions::RegexOptions options;
    // Field size check
    static_assert(sizeof(::System::Text::RegularExpressions::RegexOptions) == 0x4);
    // Padding between fields: options and: optionsStack
    char __padding16[0x4] = {};
    // private System.Collections.Generic.List`1<System.Text.RegularExpressions.RegexOptions> _optionsStack
    // Size: 0x8
    // Offset: 0x88
    ::System::Collections::Generic::List_1<::System::Text::RegularExpressions::RegexOptions>* optionsStack;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::System::Text::RegularExpressions::RegexOptions>*) == 0x8);
    // private System.Boolean _ignoreNextParen
    // Size: 0x1
    // Offset: 0x90
    bool ignoreNextParen;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get static field: static private readonly System.Byte[] s_category
    static ::ArrayW<uint8_t> _get_s_category();
    // Set static field: static private readonly System.Byte[] s_category
    static void _set_s_category(::ArrayW<uint8_t> value);
    // Get instance field reference: private System.Text.RegularExpressions.RegexNode _stack
    [[deprecated("Use field access instead!")]] ::System::Text::RegularExpressions::RegexNode*& dyn__stack();
    // Get instance field reference: private System.Text.RegularExpressions.RegexNode _group
    [[deprecated("Use field access instead!")]] ::System::Text::RegularExpressions::RegexNode*& dyn__group();
    // Get instance field reference: private System.Text.RegularExpressions.RegexNode _alternation
    [[deprecated("Use field access instead!")]] ::System::Text::RegularExpressions::RegexNode*& dyn__alternation();
