// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Runtime.Serialization.ISerializable
#include "System/Runtime/Serialization/ISerializable.hpp"
// Including type: System.TimeSpan
#include "System/TimeSpan.hpp"
// Including type: System.Text.RegularExpressions.RegexOptions
#include "System/Text/RegularExpressions/RegexOptions.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
  // Forward declaring type: WeakReference`1<T>
  template<typename T>
  class WeakReference_1;
}
// Forward declaring namespace: System::Text::RegularExpressions
namespace System::Text::RegularExpressions {
  // Forward declaring type: RegexRunnerFactory
  class RegexRunnerFactory;
  // Forward declaring type: ExclusiveReference
  class ExclusiveReference;
  // Forward declaring type: RegexReplacement
  class RegexReplacement;
  // Forward declaring type: RegexCode
  class RegexCode;
  // Skipping declaration: CachedCodeEntryKey because it is already included!
  // Forward declaring type: Match
  class Match;
  // Forward declaring type: MatchCollection
  class MatchCollection;
  // Forward declaring type: MatchEvaluator
  class MatchEvaluator;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: Hashtable
  class Hashtable;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: System::Runtime::Serialization
namespace System::Runtime::Serialization {
  // Forward declaring type: SerializationInfo
  class SerializationInfo;
  // Forward declaring type: StreamingContext
  struct StreamingContext;
}
// Completed forward declares
// Type namespace: System.Text.RegularExpressions
namespace System::Text::RegularExpressions {
  // Forward declaring type: Regex
  class Regex;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Text::RegularExpressions::Regex);
DEFINE_IL2CPP_ARG_TYPE(::System::Text::RegularExpressions::Regex*, "System.Text.RegularExpressions", "Regex");
// Type namespace: System.Text.RegularExpressions
namespace System::Text::RegularExpressions {
  // Size: 0x69
  #pragma pack(push, 1)
  // Autogenerated type: System.Text.RegularExpressions.Regex
  // [TokenAttribute] Offset: FFFFFFFF
  class Regex : public ::Il2CppObject/*, public ::System::Runtime::Serialization::ISerializable*/ {
    public:
    // Nested type: ::System::Text::RegularExpressions::Regex::CachedCodeEntryKey
    struct CachedCodeEntryKey;
    // Nested type: ::System::Text::RegularExpressions::Regex::CachedCodeEntry
    class CachedCodeEntry;
    // Size: 0x18
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: System.Text.RegularExpressions.Regex/CachedCodeEntryKey
    // [TokenAttribute] Offset: FFFFFFFF
    // [IsReadOnlyAttribute] Offset: FFFFFFFF
    struct CachedCodeEntryKey/*, public ::System::ValueType, public ::System::IEquatable_1<::System::Text::RegularExpressions::Regex::CachedCodeEntryKey>*/ {
      public:
      public:
      // private readonly System.Text.RegularExpressions.RegexOptions _options
      // Size: 0x4
      // Offset: 0x0
      ::System::Text::RegularExpressions::RegexOptions options;
      // Field size check
      static_assert(sizeof(::System::Text::RegularExpressions::RegexOptions) == 0x4);
      // Padding between fields: options and: cultureKey
      char __padding0[0x4] = {};
      // private readonly System.String _cultureKey
      // Size: 0x8
      // Offset: 0x8
      ::StringW cultureKey;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      // private readonly System.String _pattern
      // Size: 0x8
      // Offset: 0x10
      ::StringW pattern;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      public:
      // Creating value type constructor for type: CachedCodeEntryKey
      constexpr CachedCodeEntryKey(::System::Text::RegularExpressions::RegexOptions options_ = {}, ::StringW cultureKey_ = {}, ::StringW pattern_ = {}) noexcept : options{options_}, cultureKey{cultureKey_}, pattern{pattern_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Creating interface conversion operator: operator ::System::IEquatable_1<::System::Text::RegularExpressions::Regex::CachedCodeEntryKey>
      operator ::System::IEquatable_1<::System::Text::RegularExpressions::Regex::CachedCodeEntryKey>() noexcept {
        return *reinterpret_cast<::System::IEquatable_1<::System::Text::RegularExpressions::Regex::CachedCodeEntryKey>*>(this);
      }
      // Get instance field reference: private readonly System.Text.RegularExpressions.RegexOptions _options
      [[deprecated("Use field access instead!")]] ::System::Text::RegularExpressions::RegexOptions& dyn__options();
      // Get instance field reference: private readonly System.String _cultureKey
      [[deprecated("Use field access instead!")]] ::StringW& dyn__cultureKey();
      // Get instance field reference: private readonly System.String _pattern
      [[deprecated("Use field access instead!")]] ::StringW& dyn__pattern();
      // public System.Void .ctor(System.Text.RegularExpressions.RegexOptions options, System.String cultureKey, System.String pattern)
      // Offset: 0x4F6EAC4
      // ABORTED: conflicts with another method.  CachedCodeEntryKey(::System::Text::RegularExpressions::RegexOptions options, ::StringW cultureKey, ::StringW pattern);
      // public System.Boolean Equals(System.Text.RegularExpressions.Regex/CachedCodeEntryKey other)
      // Offset: 0x4F6EE00
      bool Equals(::System::Text::RegularExpressions::Regex::CachedCodeEntryKey other);
      // public override System.Boolean Equals(System.Object obj)
      // Offset: 0x4F6ED70
      // Implemented from: System.ValueType
      // Base method: System.Boolean ValueType::Equals(System.Object obj)
      bool Equals(::Il2CppObject* obj);
      // public override System.Int32 GetHashCode()
      // Offset: 0x4F6EE68
      // Implemented from: System.ValueType
      // Base method: System.Int32 ValueType::GetHashCode()
      int GetHashCode();
    }; // System.Text.RegularExpressions.Regex/CachedCodeEntryKey
    #pragma pack(pop)
    static check_size<sizeof(Regex::CachedCodeEntryKey), 16 + sizeof(::StringW)> __System_Text_RegularExpressions_Regex_CachedCodeEntryKeySizeCheck;
    static_assert(sizeof(Regex::CachedCodeEntryKey) == 0x18);
    public:
    // protected internal System.TimeSpan internalMatchTimeout
    // Size: 0x8
    // Offset: 0x10
    ::System::TimeSpan internalMatchTimeout;
    // Field size check
    static_assert(sizeof(::System::TimeSpan) == 0x8);
    // protected internal System.String pattern
    // Size: 0x8
    // Offset: 0x18
    ::StringW pattern;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // protected internal System.Text.RegularExpressions.RegexOptions roptions
    // Size: 0x4
    // Offset: 0x20
    ::System::Text::RegularExpressions::RegexOptions roptions;
    // Field size check
    static_assert(sizeof(::System::Text::RegularExpressions::RegexOptions) == 0x4);
    // Padding between fields: roptions and: factory
    char __padding2[0x4] = {};
    // protected internal System.Text.RegularExpressions.RegexRunnerFactory factory
    // Size: 0x8
    // Offset: 0x28
    ::System::Text::RegularExpressions::RegexRunnerFactory* factory;
    // Field size check
    static_assert(sizeof(::System::Text::RegularExpressions::RegexRunnerFactory*) == 0x8);
    // protected internal System.Collections.Hashtable caps
    // Size: 0x8
    // Offset: 0x30
    ::System::Collections::Hashtable* caps;
    // Field size check
    static_assert(sizeof(::System::Collections::Hashtable*) == 0x8);
    // protected internal System.Collections.Hashtable capnames
    // Size: 0x8
    // Offset: 0x38
    ::System::Collections::Hashtable* capnames;
    // Field size check
    static_assert(sizeof(::System::Collections::Hashtable*) == 0x8);
    // protected internal System.String[] capslist
    // Size: 0x8
    // Offset: 0x40
    ::ArrayW<::StringW> capslist;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // protected internal System.Int32 capsize
    // Size: 0x4
    // Offset: 0x48
    int capsize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: capsize and: runnerref
    char __padding7[0x4] = {};
    // System.Text.RegularExpressions.ExclusiveReference _runnerref
    // Size: 0x8
    // Offset: 0x50
    ::System::Text::RegularExpressions::ExclusiveReference* runnerref;
    // Field size check
    static_assert(sizeof(::System::Text::RegularExpressions::ExclusiveReference*) == 0x8);
    // System.WeakReference`1<System.Text.RegularExpressions.RegexReplacement> _replref
    // Size: 0x8
    // Offset: 0x58
    ::System::WeakReference_1<::System::Text::RegularExpressions::RegexReplacement*>* replref;
    // Field size check
    static_assert(sizeof(::System::WeakReference_1<::System::Text::RegularExpressions::RegexReplacement*>*) == 0x8);
    // System.Text.RegularExpressions.RegexCode _code
    // Size: 0x8
    // Offset: 0x60
    ::System::Text::RegularExpressions::RegexCode* code;
    // Field size check
    static_assert(sizeof(::System::Text::RegularExpressions::RegexCode*) == 0x8);
    // System.Boolean _refsInitialized
    // Size: 0x1
    // Offset: 0x68
    bool refsInitialized;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating interface conversion operator: operator ::System::Runtime::Serialization::ISerializable
    operator ::System::Runtime::Serialization::ISerializable() noexcept {
      return *reinterpret_cast<::System::Runtime::Serialization::ISerializable*>(this);
    }
    // static field const value: static private System.Int32 CacheDictionarySwitchLimit
    static constexpr const int CacheDictionarySwitchLimit = 10;
    // Get static field: static private System.Int32 CacheDictionarySwitchLimit
    static int _get_CacheDictionarySwitchLimit();
    // Set static field: static private System.Int32 CacheDictionarySwitchLimit
    static void _set_CacheDictionarySwitchLimit(int value);
    // Get static field: static private System.Int32 s_cacheSize
    static int _get_s_cacheSize();
    // Set static field: static private System.Int32 s_cacheSize
