// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Globalization
namespace System::Globalization {
  // Forward declaring type: CultureInfo
  class CultureInfo;
}
// Completed forward declares
// Type namespace: System.Text.RegularExpressions
namespace System::Text::RegularExpressions {
  // Forward declaring type: RegexBoyerMoore
  class RegexBoyerMoore;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Text::RegularExpressions::RegexBoyerMoore);
DEFINE_IL2CPP_ARG_TYPE(::System::Text::RegularExpressions::RegexBoyerMoore*, "System.Text.RegularExpressions", "RegexBoyerMoore");
// Type namespace: System.Text.RegularExpressions
namespace System::Text::RegularExpressions {
  // Size: 0x48
  #pragma pack(push, 1)
  // Autogenerated type: System.Text.RegularExpressions.RegexBoyerMoore
  // [TokenAttribute] Offset: FFFFFFFF
  class RegexBoyerMoore : public ::Il2CppObject {
    public:
    public:
    // public readonly System.Int32[] Positive
    // Size: 0x8
    // Offset: 0x10
    ::ArrayW<int> Positive;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // public readonly System.Int32[] NegativeASCII
    // Size: 0x8
    // Offset: 0x18
    ::ArrayW<int> NegativeASCII;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // public readonly System.Int32[][] NegativeUnicode
    // Size: 0x8
    // Offset: 0x20
    ::ArrayW<::ArrayW<int>> NegativeUnicode;
    // Field size check
    static_assert(sizeof(::ArrayW<::ArrayW<int>>) == 0x8);
    // public readonly System.String Pattern
    // Size: 0x8
    // Offset: 0x28
    ::StringW Pattern;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public readonly System.Int32 LowASCII
    // Size: 0x4
    // Offset: 0x30
    int LowASCII;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public readonly System.Int32 HighASCII
    // Size: 0x4
    // Offset: 0x34
    int HighASCII;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public readonly System.Boolean RightToLeft
    // Size: 0x1
    // Offset: 0x38
    bool RightToLeft;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public readonly System.Boolean CaseInsensitive
    // Size: 0x1
    // Offset: 0x39
    bool CaseInsensitive;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: CaseInsensitive and: culture
    char __padding7[0x6] = {};
    // private readonly System.Globalization.CultureInfo _culture
    // Size: 0x8
    // Offset: 0x40
    ::System::Globalization::CultureInfo* culture;
    // Field size check
    static_assert(sizeof(::System::Globalization::CultureInfo*) == 0x8);
    public:
    // Get instance field reference: public readonly System.Int32[] Positive
    [[deprecated("Use field access instead!")]] ::ArrayW<int>& dyn_Positive();
    // Get instance field reference: public readonly System.Int32[] NegativeASCII
    [[deprecated("Use field access instead!")]] ::ArrayW<int>& dyn_NegativeASCII();
    // Get instance field reference: public readonly System.Int32[][] NegativeUnicode
    [[deprecated("Use field access instead!")]] ::ArrayW<::ArrayW<int>>& dyn_NegativeUnicode();
    // Get instance field reference: public readonly System.String Pattern
    [[deprecated("Use field access instead!")]] ::StringW& dyn_Pattern();
    // Get instance field reference: public readonly System.Int32 LowASCII
    [[deprecated("Use field access instead!")]] int& dyn_LowASCII();
    // Get instance field reference: public readonly System.Int32 HighASCII
    [[deprecated("Use field access instead!")]] int& dyn_HighASCII();
    // Get instance field reference: public readonly System.Boolean RightToLeft
    [[deprecated("Use field access instead!")]] bool& dyn_RightToLeft();
    // Get instance field reference: public readonly System.Boolean CaseInsensitive
    [[deprecated("Use field access instead!")]] bool& dyn_CaseInsensitive();
    // Get instance field reference: private readonly System.Globalization.CultureInfo _culture
    [[deprecated("Use field access instead!")]] ::System::Globalization::CultureInfo*& dyn__culture();
    // public System.Void .ctor(System.String pattern, System.Boolean caseInsensitive, System.Boolean rightToLeft, System.Globalization.CultureInfo culture)
    // Offset: 0x4F6EFDC
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static RegexBoyerMoore* New_ctor(::StringW pattern, bool caseInsensitive, bool rightToLeft, ::System::Globalization::CultureInfo* culture) {
      static auto ___internal__logger = ::Logger::get().WithContext("::System::Text::RegularExpressions::RegexBoyerMoore::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<RegexBoyerMoore*, creationType>(pattern, caseInsensitive, rightToLeft, culture)));
    }
    // private System.Boolean MatchPattern(System.String text, System.Int32 index)
    // Offset: 0x4F6F4FC
    bool MatchPattern(::StringW text, int index);
    // public System.Boolean IsMatch(System.String text, System.Int32 index, System.Int32 beglimit, System.Int32 endlimit)
    // Offset: 0x4F6F620
    bool IsMatch(::StringW text, int index, int beglimit, int endlimit);
    // public System.Int32 Scan(System.String text, System.Int32 index, System.Int32 beglimit, System.Int32 endlimit)
    // Offset: 0x4F6F68C
    int Scan(::StringW text, int index, int beglimit, int endlimit);
  }; // System.Text.RegularExpressions.RegexBoyerMoore
  #pragma pack(pop)
  static check_size<sizeof(RegexBoyerMoore), 64 + sizeof(::System::Globalization::CultureInfo*)> __System_Text_RegularExpressions_RegexBoyerMooreSizeCheck;
  static_assert(sizeof(RegexBoyerMoore) == 0x48);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: System::Text::RegularExpressions::RegexBoyerMoore::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: System::Text::RegularExpressions::RegexBoyerMoore::MatchPattern
// Il2CppName: MatchPattern
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (System::Text::RegularExpressions::RegexBoyerMoore::*)(::StringW, int)>(&System::Text::RegularExpressions::RegexBoyerMoore::MatchPattern)> {
  static const MethodInfo* get() {
    static auto* text = &::il2cpp_utils::GetClassFromName("System", "String")->byval_arg;
    static auto* index = &::il2cpp_utils::GetClassFromName("System", "Int32")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(System::Text::RegularExpressions::RegexBoyerMoore*), "MatchPattern", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{text, index});
  }
};
// Writing MetadataGetter for method: System::Text::RegularExpressions::RegexBoyerMoore::IsMatch
// Il2CppName: IsMatch
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (System::Text::RegularExpressions::RegexBoyerMoore::*)(::StringW, int, int, int)>(&System::Text::RegularExpressions::RegexBoyerMoore::IsMatch)> {
  static const MethodInfo* get() {
    static auto* text = &::il2cpp_utils::GetClassFromName("System", "String")->byval_arg;
    static auto* index = &::il2cpp_utils::GetClassFromName("System", "Int32")->byval_arg;
    static auto* beglimit = &::il2cpp_utils::GetClassFromName("System", "Int32")->byval_arg;
    static auto* endlimit = &::il2cpp_utils::GetClassFromName("System", "Int32")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(System::Text::RegularExpressions::RegexBoyerMoore*), "IsMatch", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{text, index, beglimit, endlimit});
  }
};
// Writing MetadataGetter for method: System::Text::RegularExpressions::RegexBoyerMoore::Scan
// Il2CppName: Scan
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<int (System::Text::RegularExpressions::RegexBoyerMoore::*)(::StringW, int, int, int)>(&System::Text::RegularExpressions::RegexBoyerMoore::Scan)> {
  static const MethodInfo* get() {
    static auto* text = &::il2cpp_utils::GetClassFromName("System", "String")->byval_arg;
    static auto* index = &::il2cpp_utils::GetClassFromName("System", "Int32")->byval_arg;
    static auto* beglimit = &::il2cpp_utils::GetClassFromName("System", "Int32")->byval_arg;
    static auto* endlimit = &::il2cpp_utils::GetClassFromName("System", "Int32")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(System::Text::RegularExpressions::RegexBoyerMoore*), "Scan", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{text, index, beglimit, endlimit});
  }
};
