// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.RaycastHit
#include "UnityEngine/RaycastHit.hpp"
// Including type: UnityEngine.LayerMask
#include "UnityEngine/LayerMask.hpp"
// Including type: UnityEngine.ContactPoint
#include "UnityEngine/ContactPoint.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: GorillaLocomotion::Swimming
namespace GorillaLocomotion::Swimming {
  // Forward declaring type: WaterVolume
  class WaterVolume;
  // Forward declaring type: PlayerSwimmingParameters
  class PlayerSwimmingParameters;
  // Forward declaring type: WaterParameters
  class WaterParameters;
  // Forward declaring type: WaterCurrent
  class WaterCurrent;
}
// Forward declaring namespace: GorillaLocomotion
namespace GorillaLocomotion {
  // Skipping declaration: MaterialData because it is already included!
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: SphereCollider
  class SphereCollider;
  // Forward declaring type: CapsuleCollider
  class CapsuleCollider;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: Rigidbody
  class Rigidbody;
  // Forward declaring type: Camera
  class Camera;
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: MeshCollider
  class MeshCollider;
  // Forward declaring type: Mesh
  class Mesh;
  // Forward declaring type: Collider
  class Collider;
  // Forward declaring type: Renderer
  class Renderer;
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: ForceMode
  struct ForceMode;
  // Forward declaring type: Collision
  class Collision;
  // Forward declaring type: AudioClip
  class AudioClip;
}
// Forward declaring namespace: GorillaLocomotion::Climbing
namespace GorillaLocomotion::Climbing {
  // Forward declaring type: GorillaVelocityTracker
  class GorillaVelocityTracker;
  // Forward declaring type: GorillaClimbable
  class GorillaClimbable;
  // Forward declaring type: GorillaHandClimber
  class GorillaHandClimber;
  // Forward declaring type: GorillaClimbableRef
  class GorillaClimbableRef;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: PlayerAudioManager
  class PlayerAudioManager;
  // Forward declaring type: GorillaSurfaceOverride
  class GorillaSurfaceOverride;
  // Forward declaring type: BasePlatform
  class BasePlatform;
  // Forward declaring type: ConnectedControllerHandler
  class ConnectedControllerHandler;
}
// Forward declaring namespace: GorillaTag
namespace GorillaTag {
  // Forward declaring type: MaterialDatasSO
  class MaterialDatasSO;
}
// Forward declaring namespace: GorillaLocomotion::Gameplay
namespace GorillaLocomotion::Gameplay {
  // Forward declaring type: GorillaRopeSwing
  class GorillaRopeSwing;
  // Forward declaring type: GorillaZipline
  class GorillaZipline;
}
// Completed forward declares
// Type namespace: GorillaLocomotion
namespace GorillaLocomotion {
  // Forward declaring type: Player
  class Player;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GorillaLocomotion::Player);
DEFINE_IL2CPP_ARG_TYPE(::GorillaLocomotion::Player*, "GorillaLocomotion", "Player");
// Type namespace: GorillaLocomotion
namespace GorillaLocomotion {
  // Size: 0x78A
  #pragma pack(push, 1)
  // Autogenerated type: GorillaLocomotion.Player
  // [TokenAttribute] Offset: FFFFFFFF
  class Player : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::GorillaLocomotion::Player::MaterialData
    struct MaterialData;
    // Nested type: ::GorillaLocomotion::Player::LiquidProperties
    struct LiquidProperties;
    // Nested type: ::GorillaLocomotion::Player::LiquidType
    struct LiquidType;
    // Size: 0x20
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: GorillaLocomotion.Player/MaterialData
    // [TokenAttribute] Offset: FFFFFFFF
    struct MaterialData/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.String matName
      // Size: 0x8
      // Offset: 0x0
      ::StringW matName;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      // public System.Boolean overrideAudio
      // Size: 0x1
      // Offset: 0x8
      bool overrideAudio;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // Padding between fields: overrideAudio and: audio
      char __padding1[0x7] = {};
      // public UnityEngine.AudioClip audio
      // Size: 0x8
      // Offset: 0x10
      ::UnityEngine::AudioClip* audio;
      // Field size check
      static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
      // public System.Boolean overrideSlidePercent
      // Size: 0x1
      // Offset: 0x18
      bool overrideSlidePercent;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // Padding between fields: overrideSlidePercent and: slidePercent
      char __padding3[0x3] = {};
      // public System.Single slidePercent
      // Size: 0x4
      // Offset: 0x1C
      float slidePercent;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      public:
      // Creating value type constructor for type: MaterialData
      constexpr MaterialData(::StringW matName_ = {}, bool overrideAudio_ = {}, ::UnityEngine::AudioClip* audio_ = {}, bool overrideSlidePercent_ = {}, float slidePercent_ = {}) noexcept : matName{matName_}, overrideAudio{overrideAudio_}, audio{audio_}, overrideSlidePercent{overrideSlidePercent_}, slidePercent{slidePercent_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public System.String matName
      [[deprecated("Use field access instead!")]] ::StringW& dyn_matName();
      // Get instance field reference: public System.Boolean overrideAudio
      [[deprecated("Use field access instead!")]] bool& dyn_overrideAudio();
      // Get instance field reference: public UnityEngine.AudioClip audio
      [[deprecated("Use field access instead!")]] ::UnityEngine::AudioClip*& dyn_audio();
      // Get instance field reference: public System.Boolean overrideSlidePercent
      [[deprecated("Use field access instead!")]] bool& dyn_overrideSlidePercent();
      // Get instance field reference: public System.Single slidePercent
      [[deprecated("Use field access instead!")]] float& dyn_slidePercent();
    }; // GorillaLocomotion.Player/MaterialData
    #pragma pack(pop)
    static check_size<sizeof(Player::MaterialData), 28 + sizeof(float)> __GorillaLocomotion_Player_MaterialDataSizeCheck;
    static_assert(sizeof(Player::MaterialData) == 0x20);
    // Size: 0x10
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: GorillaLocomotion.Player/LiquidProperties
    // [TokenAttribute] Offset: FFFFFFFF
    struct LiquidProperties/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.Single resistance
      // Size: 0x4
      // Offset: 0x0
      float resistance;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Single buoyancy
      // Size: 0x4
      // Offset: 0x4
      float buoyancy;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Single dampingFactor
      // Size: 0x4
      // Offset: 0x8
      float dampingFactor;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Single surfaceJumpFactor
      // Size: 0x4
      // Offset: 0xC
      float surfaceJumpFactor;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      public:
      // Creating value type constructor for type: LiquidProperties
      constexpr LiquidProperties(float resistance_ = {}, float buoyancy_ = {}, float dampingFactor_ = {}, float surfaceJumpFactor_ = {}) noexcept : resistance{resistance_}, buoyancy{buoyancy_}, dampingFactor{dampingFactor_}, surfaceJumpFactor{surfaceJumpFactor_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public System.Single resistance
      [[deprecated("Use field access instead!")]] float& dyn_resistance();
      // Get instance field reference: public System.Single buoyancy
      [[deprecated("Use field access instead!")]] float& dyn_buoyancy();
      // Get instance field reference: public System.Single dampingFactor
      [[deprecated("Use field access instead!")]] float& dyn_dampingFactor();
      // Get instance field reference: public System.Single surfaceJumpFactor
      [[deprecated("Use field access instead!")]] float& dyn_surfaceJumpFactor();
    }; // GorillaLocomotion.Player/LiquidProperties
    #pragma pack(pop)
    static check_size<sizeof(Player::LiquidProperties), 12 + sizeof(float)> __GorillaLocomotion_Player_LiquidPropertiesSizeCheck;
    static_assert(sizeof(Player::LiquidProperties) == 0x10);
    public:
    // public UnityEngine.SphereCollider headCollider
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::SphereCollider* headCollider;
    // Field size check
    static_assert(sizeof(::UnityEngine::SphereCollider*) == 0x8);
    // public UnityEngine.CapsuleCollider bodyCollider
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::CapsuleCollider* bodyCollider;
    // Field size check
    static_assert(sizeof(::UnityEngine::CapsuleCollider*) == 0x8);
    // private System.Single bodyInitialRadius
    // Size: 0x4
    // Offset: 0x30
    float bodyInitialRadius;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single bodyInitialHeight
    // Size: 0x4
    // Offset: 0x34
    float bodyInitialHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.RaycastHit bodyHitInfo
    // Size: 0x2C
    // Offset: 0x38
    ::UnityEngine::RaycastHit bodyHitInfo;
    // Field size check
    static_assert(sizeof(::UnityEngine::RaycastHit) == 0x2C);
    // private UnityEngine.RaycastHit lastHitInfoHand
    // Size: 0x2C
    // Offset: 0x64
    ::UnityEngine::RaycastHit lastHitInfoHand;
    // Field size check
    static_assert(sizeof(::UnityEngine::RaycastHit) == 0x2C);
    // public UnityEngine.Transform leftHandFollower
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::Transform* leftHandFollower;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Transform rightHandFollower
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::Transform* rightHandFollower;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Transform rightControllerTransform
    // Size: 0x8
    // Offset: 0xA0
    ::UnityEngine::Transform* rightControllerTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Transform leftControllerTransform
    // Size: 0x8
    // Offset: 0xA8
    ::UnityEngine::Transform* leftControllerTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public GorillaLocomotion.Climbing.GorillaVelocityTracker rightHandCenterVelocityTracker
    // Size: 0x8
    // Offset: 0xB0
    ::GorillaLocomotion::Climbing::GorillaVelocityTracker* rightHandCenterVelocityTracker;
    // Field size check
    static_assert(sizeof(::GorillaLocomotion::Climbing::GorillaVelocityTracker*) == 0x8);
    // public GorillaLocomotion.Climbing.GorillaVelocityTracker leftHandCenterVelocityTracker
    // Size: 0x8
    // Offset: 0xB8
    ::GorillaLocomotion::Climbing::GorillaVelocityTracker* leftHandCenterVelocityTracker;
    // Field size check
    static_assert(sizeof(::GorillaLocomotion::Climbing::GorillaVelocityTracker*) == 0x8);
    // public GorillaLocomotion.Climbing.GorillaVelocityTracker rightInteractPointVelocityTracker
    // Size: 0x8
    // Offset: 0xC0
    ::GorillaLocomotion::Climbing::GorillaVelocityTracker* rightInteractPointVelocityTracker;
    // Field size check
    static_assert(sizeof(::GorillaLocomotion::Climbing::GorillaVelocityTracker*) == 0x8);
    // public GorillaLocomotion.Climbing.GorillaVelocityTracker leftInteractPointVelocityTracker
    // Size: 0x8
    // Offset: 0xC8
    ::GorillaLocomotion::Climbing::GorillaVelocityTracker* leftInteractPointVelocityTracker;
    // Field size check
    static_assert(sizeof(::GorillaLocomotion::Climbing::GorillaVelocityTracker*) == 0x8);
    // public GorillaLocomotion.Climbing.GorillaVelocityTracker bodyVelocityTracker
    // Size: 0x8
    // Offset: 0xD0
    ::GorillaLocomotion::Climbing::GorillaVelocityTracker* bodyVelocityTracker;
    // Field size check
    static_assert(sizeof(::GorillaLocomotion::Climbing::GorillaVelocityTracker*) == 0x8);
    // public PlayerAudioManager audioManager
    // Size: 0x8
    // Offset: 0xD8
    ::GlobalNamespace::PlayerAudioManager* audioManager;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::PlayerAudioManager*) == 0x8);
    // private UnityEngine.Vector3 lastLeftHandPosition
    // Size: 0xC
    // Offset: 0xE0
    ::UnityEngine::Vector3 lastLeftHandPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 lastRightHandPosition
    // Size: 0xC
    // Offset: 0xEC
    ::UnityEngine::Vector3 lastRightHandPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 lastHeadPosition
    // Size: 0xC
    // Offset: 0xF8
    ::UnityEngine::Vector3 lastHeadPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 lastRigidbodyPosition
    // Size: 0xC
    // Offset: 0x104
    ::UnityEngine::Vector3 lastRigidbodyPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Rigidbody playerRigidBody
    // Size: 0x8
    // Offset: 0x110
    ::UnityEngine::Rigidbody* playerRigidBody;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rigidbody*) == 0x8);
    // private UnityEngine.Camera mainCamera
    // Size: 0x8
    // Offset: 0x118
    ::UnityEngine::Camera* mainCamera;
    // Field size check
    static_assert(sizeof(::UnityEngine::Camera*) == 0x8);
    // public System.Int32 velocityHistorySize
    // Size: 0x4
    // Offset: 0x120
    int velocityHistorySize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Single maxArmLength
    // Size: 0x4
    // Offset: 0x124
    float maxArmLength;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single unStickDistance
    // Size: 0x4
    // Offset: 0x128
    float unStickDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single velocityLimit
    // Size: 0x4
    // Offset: 0x12C
    float velocityLimit;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single slideVelocityLimit
    // Size: 0x4
    // Offset: 0x130
    float slideVelocityLimit;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single maxJumpSpeed
    // Size: 0x4
    // Offset: 0x134
    float maxJumpSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single jumpMultiplier
    // Size: 0x4
    // Offset: 0x138
    float jumpMultiplier;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single minimumRaycastDistance
    // Size: 0x4
    // Offset: 0x13C
    float minimumRaycastDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single defaultSlideFactor
    // Size: 0x4
    // Offset: 0x140
    float defaultSlideFactor;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single slidingMinimum
    // Size: 0x4
    // Offset: 0x144
    float slidingMinimum;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single defaultPrecision
    // Size: 0x4
    // Offset: 0x148
    float defaultPrecision;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single teleportThresholdNoVel
    // Size: 0x4
    // Offset: 0x14C
    float teleportThresholdNoVel;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single frictionConstant
    // Size: 0x4
    // Offset: 0x150
    float frictionConstant;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single slideControl
    // Size: 0x4
    // Offset: 0x154
    float slideControl;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single stickDepth
    // Size: 0x4
    // Offset: 0x158
    float stickDepth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: stickDepth and: velocityHistory
    char __padding36[0x4] = {};
    // private UnityEngine.Vector3[] velocityHistory
    // Size: 0x8
    // Offset: 0x160
    ::ArrayW<::UnityEngine::Vector3> velocityHistory;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector3>) == 0x8);
    // private UnityEngine.Vector3[] slideAverageHistory
    // Size: 0x8
    // Offset: 0x168
    ::ArrayW<::UnityEngine::Vector3> slideAverageHistory;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector3>) == 0x8);
    // private System.Int32 velocityIndex
    // Size: 0x4
    // Offset: 0x170
    int velocityIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public UnityEngine.Vector3 currentVelocity
    // Size: 0xC
    // Offset: 0x174
    ::UnityEngine::Vector3 currentVelocity;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 denormalizedVelocityAverage
    // Size: 0xC
    // Offset: 0x180
    ::UnityEngine::Vector3 denormalizedVelocityAverage;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 lastPosition
    // Size: 0xC
    // Offset: 0x18C
    ::UnityEngine::Vector3 lastPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 rightHandOffset
    // Size: 0xC
    // Offset: 0x198
    ::UnityEngine::Vector3 rightHandOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 leftHandOffset
    // Size: 0xC
    // Offset: 0x1A4
    ::UnityEngine::Vector3 leftHandOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Quaternion rightHandRotOffset
    // Size: 0x10
    // Offset: 0x1B0
    ::UnityEngine::Quaternion rightHandRotOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // public UnityEngine.Quaternion leftHandRotOffset
    // Size: 0x10
    // Offset: 0x1C0
    ::UnityEngine::Quaternion leftHandRotOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // public UnityEngine.Vector3 bodyOffset
    // Size: 0xC
    // Offset: 0x1D0
    ::UnityEngine::Vector3 bodyOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.LayerMask locomotionEnabledLayers
    // Size: 0x4
    // Offset: 0x1DC
    ::UnityEngine::LayerMask locomotionEnabledLayers;
    // Field size check
    static_assert(sizeof(::UnityEngine::LayerMask) == 0x4);
    // public UnityEngine.LayerMask waterLayer
    // Size: 0x4
    // Offset: 0x1E0
    ::UnityEngine::LayerMask waterLayer;
    // Field size check
    static_assert(sizeof(::UnityEngine::LayerMask) == 0x4);
    // public System.Boolean wasLeftHandTouching
    // Size: 0x1
    // Offset: 0x1E4
    bool wasLeftHandTouching;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean wasRightHandTouching
    // Size: 0x1
    // Offset: 0x1E5
    bool wasRightHandTouching;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean wasHeadTouching
    // Size: 0x1
    // Offset: 0x1E6
    bool wasHeadTouching;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: wasHeadTouching and: currentMaterialIndex
    char __padding52[0x1] = {};
    // public System.Int32 currentMaterialIndex
    // Size: 0x4
    // Offset: 0x1E8
    int currentMaterialIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Boolean leftHandSlide
    // Size: 0x1
    // Offset: 0x1EC
    bool leftHandSlide;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: leftHandSlide and: leftHandSlideNormal
    char __padding54[0x3] = {};
    // public UnityEngine.Vector3 leftHandSlideNormal
    // Size: 0xC
    // Offset: 0x1F0
    ::UnityEngine::Vector3 leftHandSlideNormal;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public System.Boolean rightHandSlide
    // Size: 0x1
    // Offset: 0x1FC
    bool rightHandSlide;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: rightHandSlide and: rightHandSlideNormal
    char __padding56[0x3] = {};
    // public UnityEngine.Vector3 rightHandSlideNormal
    // Size: 0xC
    // Offset: 0x200
    ::UnityEngine::Vector3 rightHandSlideNormal;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 headSlideNormal
    // Size: 0xC
    // Offset: 0x20C
    ::UnityEngine::Vector3 headSlideNormal;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public System.Single rightHandSlipPercentage
    // Size: 0x4
    // Offset: 0x218
    float rightHandSlipPercentage;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single leftHandSlipPercentage
    // Size: 0x4
    // Offset: 0x21C
    float leftHandSlipPercentage;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single headSlipPercentage
    // Size: 0x4
    // Offset: 0x220
    float headSlipPercentage;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean wasLeftHandSlide
    // Size: 0x1
    // Offset: 0x224
    bool wasLeftHandSlide;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean wasRightHandSlide
    // Size: 0x1
    // Offset: 0x225
    bool wasRightHandSlide;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: wasRightHandSlide and: rightHandHitPoint
    char __padding63[0x2] = {};
    // public UnityEngine.Vector3 rightHandHitPoint
    // Size: 0xC
    // Offset: 0x228
    ::UnityEngine::Vector3 rightHandHitPoint;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 leftHandHitPoint
    // Size: 0xC
    // Offset: 0x234
    ::UnityEngine::Vector3 leftHandHitPoint;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public System.Single scale
    // Size: 0x4
    // Offset: 0x240
    float scale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean debugMovement
    // Size: 0x1
    // Offset: 0x244
    bool debugMovement;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean disableMovement
    // Size: 0x1
    // Offset: 0x245
    bool disableMovement;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean inOverlay
    // Size: 0x1
    // Offset: 0x246
    bool inOverlay;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean isUserPresent
    // Size: 0x1
    // Offset: 0x247
    bool isUserPresent;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public UnityEngine.GameObject turnParent
    // Size: 0x8
    // Offset: 0x248
    ::UnityEngine::GameObject* turnParent;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public System.Int32 leftHandMaterialTouchIndex
    // Size: 0x4
    // Offset: 0x250
    int leftHandMaterialTouchIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: leftHandMaterialTouchIndex and: leftHandSurfaceOverride
    char __padding72[0x4] = {};
    // public GorillaSurfaceOverride leftHandSurfaceOverride
    // Size: 0x8
    // Offset: 0x258
    ::GlobalNamespace::GorillaSurfaceOverride* leftHandSurfaceOverride;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::GorillaSurfaceOverride*) == 0x8);
    // public System.Int32 rightHandMaterialTouchIndex
    // Size: 0x4
    // Offset: 0x260
    int rightHandMaterialTouchIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: rightHandMaterialTouchIndex and: rightHandSurfaceOverride
    char __padding74[0x4] = {};
    // public GorillaSurfaceOverride rightHandSurfaceOverride
    // Size: 0x8
    // Offset: 0x268
    ::GlobalNamespace::GorillaSurfaceOverride* rightHandSurfaceOverride;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::GorillaSurfaceOverride*) == 0x8);
    // public GorillaSurfaceOverride currentOverride
    // Size: 0x8
    // Offset: 0x270
    ::GlobalNamespace::GorillaSurfaceOverride* currentOverride;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::GorillaSurfaceOverride*) == 0x8);
    // public GorillaTag.MaterialDatasSO materialDatasSO
    // Size: 0x8
    // Offset: 0x278
    ::GorillaTag::MaterialDatasSO* materialDatasSO;
    // Field size check
    static_assert(sizeof(::GorillaTag::MaterialDatasSO*) == 0x8);
    // private System.Boolean leftHandColliding
    // Size: 0x1
    // Offset: 0x280
    bool leftHandColliding;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean rightHandColliding
    // Size: 0x1
    // Offset: 0x281
    bool rightHandColliding;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean headColliding
    // Size: 0x1
    // Offset: 0x282
    bool headColliding;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: headColliding and: degreesTurnedThisFrame
    char __padding80[0x1] = {};
    // private System.Single degreesTurnedThisFrame
    // Size: 0x4
    // Offset: 0x284
    float degreesTurnedThisFrame;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector3 finalPosition
    // Size: 0xC
    // Offset: 0x288
    ::UnityEngine::Vector3 finalPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 rigidBodyMovement
    // Size: 0xC
    // Offset: 0x294
    ::UnityEngine::Vector3 rigidBodyMovement;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 leftHandPushDisplacement
    // Size: 0xC
    // Offset: 0x2A0
    ::UnityEngine::Vector3 leftHandPushDisplacement;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 rightHandPushDisplacement
    // Size: 0xC
    // Offset: 0x2AC
    ::UnityEngine::Vector3 rightHandPushDisplacement;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.RaycastHit hitInfo
    // Size: 0x2C
    // Offset: 0x2B8
    ::UnityEngine::RaycastHit hitInfo;
    // Field size check
    static_assert(sizeof(::UnityEngine::RaycastHit) == 0x2C);
    // private UnityEngine.RaycastHit iterativeHitInfo
    // Size: 0x2C
    // Offset: 0x2E4
    ::UnityEngine::RaycastHit iterativeHitInfo;
    // Field size check
    static_assert(sizeof(::UnityEngine::RaycastHit) == 0x2C);
    // private UnityEngine.RaycastHit collisionsInnerHit
    // Size: 0x2C
    // Offset: 0x310
    ::UnityEngine::RaycastHit collisionsInnerHit;
    // Field size check
    static_assert(sizeof(::UnityEngine::RaycastHit) == 0x2C);
    // private System.Single slipPercentage
    // Size: 0x4
    // Offset: 0x33C
    float slipPercentage;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector3 bodyOffsetVector
    // Size: 0xC
    // Offset: 0x340
    ::UnityEngine::Vector3 bodyOffsetVector;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 distanceTraveled
    // Size: 0xC
    // Offset: 0x34C
    ::UnityEngine::Vector3 distanceTraveled;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 movementToProjectedAboveCollisionPlane
    // Size: 0xC
    // Offset: 0x358
    ::UnityEngine::Vector3 movementToProjectedAboveCollisionPlane;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // Padding between fields: movementToProjectedAboveCollisionPlane and: meshCollider
    char __padding92[0x4] = {};
    // private UnityEngine.MeshCollider meshCollider
    // Size: 0x8
    // Offset: 0x368
    ::UnityEngine::MeshCollider* meshCollider;
    // Field size check
    static_assert(sizeof(::UnityEngine::MeshCollider*) == 0x8);
    // private UnityEngine.Mesh collidedMesh
    // Size: 0x8
    // Offset: 0x370
    ::UnityEngine::Mesh* collidedMesh;
    // Field size check
    static_assert(sizeof(::UnityEngine::Mesh*) == 0x8);
    // private GorillaLocomotion.Player/MaterialData foundMatData
    // Size: 0x20
    // Offset: 0x378
    ::GorillaLocomotion::Player::MaterialData foundMatData;
    // Field size check
    static_assert(sizeof(::GorillaLocomotion::Player::MaterialData) == 0x20);
    // private System.String findMatName
    // Size: 0x8
    // Offset: 0x398
    ::StringW findMatName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Int32 vertex1
    // Size: 0x4
    // Offset: 0x3A0
    int vertex1;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 vertex2
    // Size: 0x4
    // Offset: 0x3A4
    int vertex2;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 vertex3
    // Size: 0x4
    // Offset: 0x3A8
    int vertex3;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: vertex3 and: trianglesList
    char __padding99[0x4] = {};
    // private System.Collections.Generic.List`1<System.Int32> trianglesList
    // Size: 0x8
    // Offset: 0x3B0
    ::System::Collections::Generic::List_1<int>* trianglesList;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<int>*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<UnityEngine.Mesh,System.Int32[]> meshTrianglesDict
    // Size: 0x8
    // Offset: 0x3B8
    ::System::Collections::Generic::Dictionary_2<::UnityEngine::Mesh*, ::ArrayW<int>>* meshTrianglesDict;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::UnityEngine::Mesh*, ::ArrayW<int>>*) == 0x8);
    // private System.Int32[] sharedMeshTris
    // Size: 0x8
    // Offset: 0x3C0
    ::ArrayW<int> sharedMeshTris;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // private System.Single lastRealTime
    // Size: 0x4
    // Offset: 0x3C8
    float lastRealTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single calcDeltaTime
    // Size: 0x4
    // Offset: 0x3CC
    float calcDeltaTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single tempRealTime
    // Size: 0x4
    // Offset: 0x3D0
    float tempRealTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector3 junkNormal
    // Size: 0xC
    // Offset: 0x3D4
    ::UnityEngine::Vector3 junkNormal;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 slideAverage
    // Size: 0xC
    // Offset: 0x3E0
    ::UnityEngine::Vector3 slideAverage;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 slideAverageNormal
    // Size: 0xC
    // Offset: 0x3EC
    ::UnityEngine::Vector3 slideAverageNormal;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 tempVector3
    // Size: 0xC
    // Offset: 0x3F8
    ::UnityEngine::Vector3 tempVector3;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.RaycastHit tempHitInfo
    // Size: 0x2C
    // Offset: 0x404
    ::UnityEngine::RaycastHit tempHitInfo;
    // Field size check
    static_assert(sizeof(::UnityEngine::RaycastHit) == 0x2C);
    // private UnityEngine.RaycastHit junkHit
    // Size: 0x2C
    // Offset: 0x430
    ::UnityEngine::RaycastHit junkHit;
    // Field size check
    static_assert(sizeof(::UnityEngine::RaycastHit) == 0x2C);
    // private UnityEngine.Vector3 firstPosition
    // Size: 0xC
    // Offset: 0x45C
    ::UnityEngine::Vector3 firstPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.RaycastHit tempIterativeHit
    // Size: 0x2C
    // Offset: 0x468
    ::UnityEngine::RaycastHit tempIterativeHit;
    // Field size check
    static_assert(sizeof(::UnityEngine::RaycastHit) == 0x2C);
    // private System.Boolean collisionsReturnBool
    // Size: 0x1
    // Offset: 0x494
    bool collisionsReturnBool;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: collisionsReturnBool and: overlapRadiusFunction
    char __padding114[0x3] = {};
    // private System.Single overlapRadiusFunction
    // Size: 0x4
    // Offset: 0x498
    float overlapRadiusFunction;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single maxSphereSize1
    // Size: 0x4
    // Offset: 0x49C
    float maxSphereSize1;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single maxSphereSize2
    // Size: 0x4
    // Offset: 0x4A0
    float maxSphereSize2;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: maxSphereSize2 and: overlapColliders
    char __padding117[0x4] = {};
    // private UnityEngine.Collider[] overlapColliders
    // Size: 0x8
    // Offset: 0x4A8
    ::ArrayW<::UnityEngine::Collider*> overlapColliders;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Collider*>) == 0x8);
    // private System.Int32 overlapAttempts
    // Size: 0x4
    // Offset: 0x4B0
    int overlapAttempts;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 touchPoints
    // Size: 0x4
    // Offset: 0x4B4
    int touchPoints;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single averageSlipPercentage
    // Size: 0x4
    // Offset: 0x4B8
    float averageSlipPercentage;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector3 surfaceDirection
    // Size: 0xC
    // Offset: 0x4BC
    ::UnityEngine::Vector3 surfaceDirection;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public System.Single iceThreshold
    // Size: 0x4
    // Offset: 0x4C8
    float iceThreshold;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single bodyMaxRadius
    // Size: 0x4
    // Offset: 0x4CC
    float bodyMaxRadius;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single bodyLerp
    // Size: 0x4
    // Offset: 0x4D0
    float bodyLerp;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean areBothTouching
    // Size: 0x1
    // Offset: 0x4D4
    bool areBothTouching;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: areBothTouching and: slideFactor
    char __padding126[0x3] = {};
    // private System.Single slideFactor
    // Size: 0x4
    // Offset: 0x4D8
    float slideFactor;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean didAJump
    // Size: 0x1
    // Offset: 0x4DC
    bool didAJump;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: didAJump and: slideRenderer
    char __padding128[0x3] = {};
    // private UnityEngine.Renderer slideRenderer
    // Size: 0x8
    // Offset: 0x4E0
    ::UnityEngine::Renderer* slideRenderer;
    // Field size check
    static_assert(sizeof(::UnityEngine::Renderer*) == 0x8);
    // private UnityEngine.RaycastHit[] rayCastNonAllocColliders
    // Size: 0x8
    // Offset: 0x4E8
    ::ArrayW<::UnityEngine::RaycastHit> rayCastNonAllocColliders;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::RaycastHit>) == 0x8);
    // private UnityEngine.Vector3[] crazyCheckVectors
    // Size: 0x8
    // Offset: 0x4F0
    ::ArrayW<::UnityEngine::Vector3> crazyCheckVectors;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector3>) == 0x8);
    // private UnityEngine.RaycastHit emptyHit
    // Size: 0x2C
    // Offset: 0x4F8
    ::UnityEngine::RaycastHit emptyHit;
    // Field size check
    static_assert(sizeof(::UnityEngine::RaycastHit) == 0x2C);
    // private System.Int32 bufferCount
    // Size: 0x4
    // Offset: 0x524
    int bufferCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.Vector3 lastOpenHeadPosition
    // Size: 0xC
    // Offset: 0x528
    ::UnityEngine::Vector3 lastOpenHeadPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // Padding between fields: lastOpenHeadPosition and: tempMaterialArray
    char __padding134[0x4] = {};
    // private System.Collections.Generic.List`1<UnityEngine.Material> tempMaterialArray
    // Size: 0x8
    // Offset: 0x538
    ::System::Collections::Generic::List_1<::UnityEngine::Material*>* tempMaterialArray;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Material*>*) == 0x8);
    // private System.Int32 leftSlipSetToMaxFrameIdx
    // Size: 0x4
    // Offset: 0x540
    int leftSlipSetToMaxFrameIdx;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 rightSlipSetToMaxFrameIdx
    // Size: 0x4
    // Offset: 0x544
    int rightSlipSetToMaxFrameIdx;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public GorillaLocomotion.Swimming.PlayerSwimmingParameters swimmingParams
    // Size: 0x8
    // Offset: 0x548
    ::GorillaLocomotion::Swimming::PlayerSwimmingParameters* swimmingParams;
    // Field size check
    static_assert(sizeof(::GorillaLocomotion::Swimming::PlayerSwimmingParameters*) == 0x8);
    // public GorillaLocomotion.Swimming.WaterParameters waterParams
    // Size: 0x8
    // Offset: 0x550
    ::GorillaLocomotion::Swimming::WaterParameters* waterParams;
    // Field size check
    static_assert(sizeof(::GorillaLocomotion::Swimming::WaterParameters*) == 0x8);
    // public System.Collections.Generic.List`1<GorillaLocomotion.Player/LiquidProperties> liquidPropertiesList
    // Size: 0x8
    // Offset: 0x558
    ::System::Collections::Generic::List_1<::GorillaLocomotion::Player::LiquidProperties>* liquidPropertiesList;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GorillaLocomotion::Player::LiquidProperties>*) == 0x8);
    // public System.Boolean debugDrawSwimming
    // Size: 0x1
    // Offset: 0x560
    bool debugDrawSwimming;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: debugDrawSwimming and: wizardStaffSlamEffects
    char __padding141[0x7] = {};
    // public UnityEngine.GameObject wizardStaffSlamEffects
    // Size: 0x8
    // Offset: 0x568
    ::UnityEngine::GameObject* wizardStaffSlamEffects;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject geodeHitEffects
    // Size: 0x8
    // Offset: 0x570
    ::UnityEngine::GameObject* geodeHitEffects;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private GorillaLocomotion.Swimming.WaterVolume leftHandWaterVolume
    // Size: 0x8
    // Offset: 0x578
    ::GorillaLocomotion::Swimming::WaterVolume* leftHandWaterVolume;
    // Field size check
    static_assert(sizeof(::GorillaLocomotion::Swimming::WaterVolume*) == 0x8);
    // private GorillaLocomotion.Swimming.WaterVolume rightHandWaterVolume
    // Size: 0x8
    // Offset: 0x580
    ::GorillaLocomotion::Swimming::WaterVolume* rightHandWaterVolume;
    // Field size check
    static_assert(sizeof(::GorillaLocomotion::Swimming::WaterVolume*) == 0x8);
    // private GorillaLocomotion.Swimming.WaterVolume/SurfaceQuery leftHandWaterSurface
    // Size: 0x1C
    // Offset: 0x588
    ::GorillaLocomotion::Swimming::WaterVolume::SurfaceQuery leftHandWaterSurface;
    // Field size check
    static_assert(sizeof(::GorillaLocomotion::Swimming::WaterVolume::SurfaceQuery) == 0x1C);
    // private GorillaLocomotion.Swimming.WaterVolume/SurfaceQuery rightHandWaterSurface
    // Size: 0x1C
    // Offset: 0x5A4
    ::GorillaLocomotion::Swimming::WaterVolume::SurfaceQuery rightHandWaterSurface;
    // Field size check
    static_assert(sizeof(::GorillaLocomotion::Swimming::WaterVolume::SurfaceQuery) == 0x1C);
    // private UnityEngine.Vector3 swimmingVelocity
    // Size: 0xC
    // Offset: 0x5C0
    ::UnityEngine::Vector3 swimmingVelocity;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private GorillaLocomotion.Swimming.WaterVolume/SurfaceQuery waterSurfaceForHead
    // Size: 0x1C
    // Offset: 0x5CC
    ::GorillaLocomotion::Swimming::WaterVolume::SurfaceQuery waterSurfaceForHead;
    // Field size check
    static_assert(sizeof(::GorillaLocomotion::Swimming::WaterVolume::SurfaceQuery) == 0x1C);
    // private System.Boolean bodyInWater
    // Size: 0x1
    // Offset: 0x5E8
    bool bodyInWater;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean headInWater
    // Size: 0x1
    // Offset: 0x5E9
    bool headInWater;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: headInWater and: buoyancyExtension
    char __padding151[0x2] = {};
    // private System.Single buoyancyExtension
    // Size: 0x4
    // Offset: 0x5EC
    float buoyancyExtension;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single lastWaterSurfaceJumpTimeLeft
    // Size: 0x4
    // Offset: 0x5F0
    float lastWaterSurfaceJumpTimeLeft;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single lastWaterSurfaceJumpTimeRight
    // Size: 0x4
    // Offset: 0x5F4
    float lastWaterSurfaceJumpTimeRight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single waterSurfaceJumpCooldown
    // Size: 0x4
    // Offset: 0x5F8
    float waterSurfaceJumpCooldown;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single leftHandNonDiveHapticsAmount
    // Size: 0x4
    // Offset: 0x5FC
    float leftHandNonDiveHapticsAmount;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single rightHandNonDiveHapticsAmount
    // Size: 0x4
    // Offset: 0x600
    float rightHandNonDiveHapticsAmount;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: rightHandNonDiveHapticsAmount and: headOverlappingWaterVolumes
    char __padding157[0x4] = {};
    // private System.Collections.Generic.List`1<GorillaLocomotion.Swimming.WaterVolume> headOverlappingWaterVolumes
    // Size: 0x8
    // Offset: 0x608
    ::System::Collections::Generic::List_1<::GorillaLocomotion::Swimming::WaterVolume*>* headOverlappingWaterVolumes;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GorillaLocomotion::Swimming::WaterVolume*>*) == 0x8);
    // private System.Collections.Generic.List`1<GorillaLocomotion.Swimming.WaterVolume> bodyOverlappingWaterVolumes
    // Size: 0x8
    // Offset: 0x610
    ::System::Collections::Generic::List_1<::GorillaLocomotion::Swimming::WaterVolume*>* bodyOverlappingWaterVolumes;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GorillaLocomotion::Swimming::WaterVolume*>*) == 0x8);
    // private System.Collections.Generic.List`1<GorillaLocomotion.Swimming.WaterCurrent> activeWaterCurrents
    // Size: 0x8
    // Offset: 0x618
    ::System::Collections::Generic::List_1<::GorillaLocomotion::Swimming::WaterCurrent*>* activeWaterCurrents;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GorillaLocomotion::Swimming::WaterCurrent*>*) == 0x8);
    // private UnityEngine.Quaternion playerRotationOverride
    // Size: 0x10
    // Offset: 0x620
    ::UnityEngine::Quaternion playerRotationOverride;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private System.Int32 playerRotationOverrideFrame
    // Size: 0x4
    // Offset: 0x630
    int playerRotationOverrideFrame;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single playerRotationOverrideDecayRate
    // Size: 0x4
    // Offset: 0x634
    float playerRotationOverrideDecayRate;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.ContactPoint[] bodyCollisionContacts
    // Size: 0x8
    // Offset: 0x638
    ::ArrayW<::UnityEngine::ContactPoint> bodyCollisionContacts;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::ContactPoint>) == 0x8);
    // private System.Int32 bodyCollisionContactsCount
    // Size: 0x4
    // Offset: 0x640
    int bodyCollisionContactsCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.ContactPoint bodyGroundContact
    // Size: 0x30
    // Offset: 0x644
    ::UnityEngine::ContactPoint bodyGroundContact;
    // Field size check
    static_assert(sizeof(::UnityEngine::ContactPoint) == 0x30);
    // private System.Single bodyGroundContactTime
    // Size: 0x4
    // Offset: 0x674
    float bodyGroundContactTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private BasePlatform currentPlatform
    // Size: 0x8
    // Offset: 0x678
    ::GlobalNamespace::BasePlatform* currentPlatform;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BasePlatform*) == 0x8);
    // private BasePlatform lastPlatformTouched
    // Size: 0x8
    // Offset: 0x680
    ::GlobalNamespace::BasePlatform* lastPlatformTouched;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BasePlatform*) == 0x8);
    // private UnityEngine.Vector3 lastFrameTouchPosLocal
    // Size: 0xC
    // Offset: 0x688
    ::UnityEngine::Vector3 lastFrameTouchPosLocal;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 lastFrameTouchPosWorld
    // Size: 0xC
    // Offset: 0x694
    ::UnityEngine::Vector3 lastFrameTouchPosWorld;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Boolean lastFrameHasValidTouchPos
    // Size: 0x1
    // Offset: 0x6A0
    bool lastFrameHasValidTouchPos;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: lastFrameHasValidTouchPos and: refMovement
    char __padding172[0x3] = {};
    // private UnityEngine.Vector3 refMovement
    // Size: 0xC
    // Offset: 0x6A4
    ::UnityEngine::Vector3 refMovement;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 platformTouchOffset
    // Size: 0xC
    // Offset: 0x6B0
    ::UnityEngine::Vector3 platformTouchOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 debugLastRightHandPosition
    // Size: 0xC
    // Offset: 0x6BC
    ::UnityEngine::Vector3 debugLastRightHandPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 debugPlatformDeltaPosition
    // Size: 0xC
    // Offset: 0x6C8
    ::UnityEngine::Vector3 debugPlatformDeltaPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Single velocityThrowClimbingMultiplier
    // Size: 0x4
    // Offset: 0x6D4
    float velocityThrowClimbingMultiplier;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single climbingMaxThrowMagnitude
    // Size: 0x4
    // Offset: 0x6D8
    float climbingMaxThrowMagnitude;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean isClimbing
    // Size: 0x1
    // Offset: 0x6DC
    bool isClimbing;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isClimbing and: currentClimbable
    char __padding179[0x3] = {};
    // private GorillaLocomotion.Climbing.GorillaClimbable currentClimbable
    // Size: 0x8
    // Offset: 0x6E0
    ::GorillaLocomotion::Climbing::GorillaClimbable* currentClimbable;
    // Field size check
    static_assert(sizeof(::GorillaLocomotion::Climbing::GorillaClimbable*) == 0x8);
    // private GorillaLocomotion.Climbing.GorillaHandClimber currentClimber
    // Size: 0x8
    // Offset: 0x6E8
    ::GorillaLocomotion::Climbing::GorillaHandClimber* currentClimber;
    // Field size check
    static_assert(sizeof(::GorillaLocomotion::Climbing::GorillaHandClimber*) == 0x8);
    // private UnityEngine.Vector3 climbHelperTargetPos
    // Size: 0xC
    // Offset: 0x6F0
    ::UnityEngine::Vector3 climbHelperTargetPos;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // Padding between fields: climbHelperTargetPos and: climbHelper
    char __padding182[0x4] = {};
    // private UnityEngine.Transform climbHelper
    // Size: 0x8
    // Offset: 0x700
    ::UnityEngine::Transform* climbHelper;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private GorillaLocomotion.Gameplay.GorillaRopeSwing currentSwing
    // Size: 0x8
    // Offset: 0x708
    ::GorillaLocomotion::Gameplay::GorillaRopeSwing* currentSwing;
    // Field size check
    static_assert(sizeof(::GorillaLocomotion::Gameplay::GorillaRopeSwing*) == 0x8);
    // private GorillaLocomotion.Gameplay.GorillaZipline currentZipline
    // Size: 0x8
    // Offset: 0x710
    ::GorillaLocomotion::Gameplay::GorillaZipline* currentZipline;
    // Field size check
    static_assert(sizeof(::GorillaLocomotion::Gameplay::GorillaZipline*) == 0x8);
    // private ConnectedControllerHandler controllerState
    // Size: 0x8
    // Offset: 0x718
    ::GlobalNamespace::ConnectedControllerHandler* controllerState;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ConnectedControllerHandler*) == 0x8);
    // public System.Int32 sizeLayerMask
    // Size: 0x4
    // Offset: 0x720
    int sizeLayerMask;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Boolean InReportMenu
    // Size: 0x1
    // Offset: 0x724
    bool InReportMenu;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: InReportMenu and: halloweenLevitationStrength
    char __padding188[0x3] = {};
    // private System.Single halloweenLevitationStrength
    // Size: 0x4
    // Offset: 0x728
    float halloweenLevitationStrength;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single halloweenLevitationFullStrengthDuration
    // Size: 0x4
    // Offset: 0x72C
    float halloweenLevitationFullStrengthDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single halloweenLevitationTotalDuration
    // Size: 0x4
    // Offset: 0x730
    float halloweenLevitationTotalDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single halloweenLevitationBonusStrength
    // Size: 0x4
    // Offset: 0x734
    float halloweenLevitationBonusStrength;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single halloweenLevitateBonusOffAtYSpeed
    // Size: 0x4
    // Offset: 0x738
    float halloweenLevitateBonusOffAtYSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single halloweenLevitateBonusFullAtYSpeed
    // Size: 0x4
    // Offset: 0x73C
    float halloweenLevitateBonusFullAtYSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single lastTouchedGroundTimestamp
    // Size: 0x4
    // Offset: 0x740
    float lastTouchedGroundTimestamp;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean teleportToTrain
    // Size: 0x1
    // Offset: 0x744
    bool teleportToTrain;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean isAttachedToTrain
    // Size: 0x1
    // Offset: 0x745
    bool isAttachedToTrain;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean stuckLeft
    // Size: 0x1
    // Offset: 0x746
    bool stuckLeft;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean stuckRight
    // Size: 0x1
    // Offset: 0x747
    bool stuckRight;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Single lastScale
    // Size: 0x4
    // Offset: 0x748
    float lastScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: lastScale and: handHolds
    char __padding200[0x4] = {};
    // private System.Collections.Generic.List`1<UnityEngine.Transform> handHolds
    // Size: 0x8
    // Offset: 0x750
    ::System::Collections::Generic::List_1<::UnityEngine::Transform*>* handHolds;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Transform*>*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<UnityEngine.Transform,UnityEngine.Transform> handHoldGrabbers
    // Size: 0x8
    // Offset: 0x758
    ::System::Collections::Generic::Dictionary_2<::UnityEngine::Transform*, ::UnityEngine::Transform*>* handHoldGrabbers;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::UnityEngine::Transform*, ::UnityEngine::Transform*>*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<UnityEngine.Transform,UnityEngine.Vector3> handHoldPositions
    // Size: 0x8
    // Offset: 0x760
    ::System::Collections::Generic::Dictionary_2<::UnityEngine::Transform*, ::UnityEngine::Vector3>* handHoldPositions;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::UnityEngine::Transform*, ::UnityEngine::Vector3>*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<UnityEngine.Transform,UnityEngine.Quaternion> handHoldRotations
    // Size: 0x8
    // Offset: 0x768
    ::System::Collections::Generic::Dictionary_2<::UnityEngine::Transform*, ::UnityEngine::Quaternion>* handHoldRotations;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::UnityEngine::Transform*, ::UnityEngine::Quaternion>*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<UnityEngine.Transform,UnityEngine.Vector3> handHoldVelocities
    // Size: 0x8
    // Offset: 0x770
    ::System::Collections::Generic::Dictionary_2<::UnityEngine::Transform*, ::UnityEngine::Vector3>* handHoldVelocities;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::UnityEngine::Transform*, ::UnityEngine::Vector3>*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<UnityEngine.Transform,UnityEngine.Vector3> attachedPosition
    // Size: 0x8
    // Offset: 0x778
    ::System::Collections::Generic::Dictionary_2<::UnityEngine::Transform*, ::UnityEngine::Vector3>* attachedPosition;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::UnityEngine::Transform*, ::UnityEngine::Vector3>*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<UnityEngine.Transform,UnityEngine.Vector3> attachedPrevPosition
    // Size: 0x8
    // Offset: 0x780
    ::System::Collections::Generic::Dictionary_2<::UnityEngine::Transform*, ::UnityEngine::Vector3>* attachedPrevPosition;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::UnityEngine::Transform*, ::UnityEngine::Vector3>*) == 0x8);
    // private System.Boolean rightHandHolding
    // Size: 0x1
    // Offset: 0x788
    bool rightHandHolding;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean leftHandHolding
    // Size: 0x1
    // Offset: 0x789
    bool leftHandHolding;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get static field: static private GorillaLocomotion.Player _instance
    static ::GorillaLocomotion::Player* _get__instance();
    // Set static field: static private GorillaLocomotion.Player _instance
    static void _set__instance(::GorillaLocomotion::Player* value);
    // Get static field: static public System.Boolean hasInstance
    static bool _get_hasInstance();
    // Set static field: static public System.Boolean hasInstance
