// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.ResourceManagement.Util.ObjectInitializationData
#include "UnityEngine/ResourceManagement/Util/ObjectInitializationData.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::AddressableAssets::ResourceLocators
namespace UnityEngine::AddressableAssets::ResourceLocators {
  // Forward declaring type: ContentCatalogDataEntry
  class ContentCatalogDataEntry;
  // Forward declaring type: ResourceLocationMap
  class ResourceLocationMap;
}
// Forward declaring namespace: UnityEngine::ResourceManagement::ResourceLocations
namespace UnityEngine::ResourceManagement::ResourceLocations {
  // Forward declaring type: IResourceLocation
  class IResourceLocation;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: IList`1<T>
  template<typename T>
  class IList_1;
}
// Completed forward declares
// Type namespace: UnityEngine.AddressableAssets.ResourceLocators
namespace UnityEngine::AddressableAssets::ResourceLocators {
  // Forward declaring type: ContentCatalogData
  class ContentCatalogData;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::AddressableAssets::ResourceLocators::ContentCatalogData);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::AddressableAssets::ResourceLocators::ContentCatalogData*, "UnityEngine.AddressableAssets.ResourceLocators", "ContentCatalogData");
// Type namespace: UnityEngine.AddressableAssets.ResourceLocators
namespace UnityEngine::AddressableAssets::ResourceLocators {
  // Size: 0xE0
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.AddressableAssets.ResourceLocators.ContentCatalogData
  // [TokenAttribute] Offset: FFFFFFFF
  class ContentCatalogData : public ::Il2CppObject {
    public:
    // Nested type: ::UnityEngine::AddressableAssets::ResourceLocators::ContentCatalogData::Bucket
    struct Bucket;
    // Nested type: ::UnityEngine::AddressableAssets::ResourceLocators::ContentCatalogData::CompactLocation
    class CompactLocation;
    // Nested type: ::UnityEngine::AddressableAssets::ResourceLocators::ContentCatalogData::$$c
    class $$c;
    public:
    // System.String localHash
    // Size: 0x8
    // Offset: 0x10
    ::StringW localHash;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // UnityEngine.ResourceManagement.ResourceLocations.IResourceLocation location
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation* location;
    // Field size check
    static_assert(sizeof(::UnityEngine::ResourceManagement::ResourceLocations::IResourceLocation*) == 0x8);
    // System.String m_LocatorId
    // Size: 0x8
    // Offset: 0x20
    ::StringW m_LocatorId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String m_BuildResultHash
    // Size: 0x8
    // Offset: 0x28
    ::StringW m_BuildResultHash;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private UnityEngine.ResourceManagement.Util.ObjectInitializationData m_InstanceProviderData
    // Size: 0x30
    // Offset: 0x30
    ::UnityEngine::ResourceManagement::Util::ObjectInitializationData m_InstanceProviderData;
    // Field size check
    static_assert(sizeof(::UnityEngine::ResourceManagement::Util::ObjectInitializationData) == 0x30);
    // private UnityEngine.ResourceManagement.Util.ObjectInitializationData m_SceneProviderData
    // Size: 0x30
    // Offset: 0x60
    ::UnityEngine::ResourceManagement::Util::ObjectInitializationData m_SceneProviderData;
    // Field size check
    static_assert(sizeof(::UnityEngine::ResourceManagement::Util::ObjectInitializationData) == 0x30);
    // System.Collections.Generic.List`1<UnityEngine.ResourceManagement.Util.ObjectInitializationData> m_ResourceProviderData
    // Size: 0x8
    // Offset: 0x90
    ::System::Collections::Generic::List_1<::UnityEngine::ResourceManagement::Util::ObjectInitializationData>* m_ResourceProviderData;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::ResourceManagement::Util::ObjectInitializationData>*) == 0x8);
    // private System.Collections.Generic.IList`1<UnityEngine.AddressableAssets.ResourceLocators.ContentCatalogDataEntry> m_Entries
    // Size: 0x8
    // Offset: 0x98
    ::System::Collections::Generic::IList_1<::UnityEngine::AddressableAssets::ResourceLocators::ContentCatalogDataEntry*>* m_Entries;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::IList_1<::UnityEngine::AddressableAssets::ResourceLocators::ContentCatalogDataEntry*>*) == 0x8);
    // System.String[] m_ProviderIds
    // Size: 0x8
    // Offset: 0xA0
    ::ArrayW<::StringW> m_ProviderIds;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // System.String[] m_InternalIds
    // Size: 0x8
    // Offset: 0xA8
    ::ArrayW<::StringW> m_InternalIds;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // System.String m_KeyDataString
    // Size: 0x8
    // Offset: 0xB0
    ::StringW m_KeyDataString;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String m_BucketDataString
    // Size: 0x8
    // Offset: 0xB8
    ::StringW m_BucketDataString;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String m_EntryDataString
    // Size: 0x8
    // Offset: 0xC0
    ::StringW m_EntryDataString;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String m_ExtraDataString
    // Size: 0x8
    // Offset: 0xC8
    ::StringW m_ExtraDataString;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // UnityEngine.ResourceManagement.Util.SerializedType[] m_resourceTypes
    // Size: 0x8
    // Offset: 0xD0
    ::ArrayW<::UnityEngine::ResourceManagement::Util::SerializedType> m_resourceTypes;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::ResourceManagement::Util::SerializedType>) == 0x8);
    // private System.String[] m_InternalIdPrefixes
    // Size: 0x8
    // Offset: 0xD8
    ::ArrayW<::StringW> m_InternalIdPrefixes;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    public:
    // Get static field: static private System.Int32 kMagic
    static int _get_kMagic();
    // Set static field: static private System.Int32 kMagic
    static void _set_kMagic(int value);
    // static field const value: static private System.Int32 kVersion
    static constexpr const int kVersion = 1;
    // Get static field: static private System.Int32 kVersion
    static int _get_kVersion();
    // Set static field: static private System.Int32 kVersion
    static void _set_kVersion(int value);
    // static field const value: static private System.Int32 kBytesPerInt32
    static constexpr const int kBytesPerInt32 = 4;
    // Get static field: static private System.Int32 kBytesPerInt32
    static int _get_kBytesPerInt32();
    // Set static field: static private System.Int32 kBytesPerInt32
