// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Fusion.NetworkBehaviour
#include "Fusion/NetworkBehaviour.hpp"
// Including type: Photon.Voice.Unity.ILoggableDependent
#include "Photon/Voice/Unity/ILoggableDependent.hpp"
// Including type: ExitGames.Client.Photon.DebugLevel
#include "ExitGames/Client/Photon/DebugLevel.hpp"
// Including type: Fusion.Changed`1
#include "Fusion/Changed_1.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Photon::Voice::Unity
namespace Photon::Voice::Unity {
  // Forward declaring type: VoiceConnection
  class VoiceConnection;
  // Forward declaring type: Speaker
  class Speaker;
  // Forward declaring type: Recorder
  class Recorder;
  // Forward declaring type: VoiceLogger
  class VoiceLogger;
}
// Forward declaring namespace: Fusion
namespace Fusion {
  // Forward declaring type: ChangedDelegate`1<T>
  template<typename T>
  class ChangedDelegate_1;
  // Forward declaring type: NetworkBehaviourCallbacks`1<T>
  template<typename T>
  class NetworkBehaviourCallbacks_1;
}
// Completed forward declares
// Type namespace: Photon.Voice.Fusion
namespace Photon::Voice::Fusion {
  // Forward declaring type: VoiceNetworkObject
  class VoiceNetworkObject;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Photon::Voice::Fusion::VoiceNetworkObject);
DEFINE_IL2CPP_ARG_TYPE(::Photon::Voice::Fusion::VoiceNetworkObject*, "Photon.Voice.Fusion", "VoiceNetworkObject");
// Type namespace: Photon.Voice.Fusion
namespace Photon::Voice::Fusion {
  // Size: 0xA6
  #pragma pack(push, 1)
  // Autogenerated type: Photon.Voice.Fusion.VoiceNetworkObject
  // [TokenAttribute] Offset: FFFFFFFF
  // [NetworkBehaviourWeavedAttribute] Offset: FFFFFFFF
  class VoiceNetworkObject : public ::Fusion::NetworkBehaviour/*, public ::Photon::Voice::Unity::ILoggableDependent*/ {
    public:
    public:
    // private Photon.Voice.Unity.VoiceConnection voiceConnection
    // Size: 0x8
    // Offset: 0x78
    ::Photon::Voice::Unity::VoiceConnection* voiceConnection;
    // Field size check
    static_assert(sizeof(::Photon::Voice::Unity::VoiceConnection*) == 0x8);
    // private Photon.Voice.Unity.Speaker speakerInUse
    // Size: 0x8
    // Offset: 0x80
    ::Photon::Voice::Unity::Speaker* speakerInUse;
    // Field size check
    static_assert(sizeof(::Photon::Voice::Unity::Speaker*) == 0x8);
    // private Photon.Voice.Unity.Recorder recorderInUse
    // Size: 0x8
    // Offset: 0x88
    ::Photon::Voice::Unity::Recorder* recorderInUse;
    // Field size check
    static_assert(sizeof(::Photon::Voice::Unity::Recorder*) == 0x8);
    // protected ExitGames.Client.Photon.DebugLevel logLevel
    // Size: 0x1
    // Offset: 0x90
    ::ExitGames::Client::Photon::DebugLevel logLevel;
    // Field size check
    static_assert(sizeof(::ExitGames::Client::Photon::DebugLevel) == 0x1);
    // Padding between fields: logLevel and: logger
    char __padding3[0x7] = {};
    // private Photon.Voice.Unity.VoiceLogger logger
    // Size: 0x8
    // Offset: 0x98
    ::Photon::Voice::Unity::VoiceLogger* logger;
    // Field size check
    static_assert(sizeof(::Photon::Voice::Unity::VoiceLogger*) == 0x8);
    // private System.Boolean ignoreGlobalLogLevel
    // Size: 0x1
    // Offset: 0xA0
    bool ignoreGlobalLogLevel;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean AutoCreateRecorderIfNotFound
    // Size: 0x1
    // Offset: 0xA1
    bool AutoCreateRecorderIfNotFound;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean UsePrimaryRecorder
    // Size: 0x1
    // Offset: 0xA2
    bool UsePrimaryRecorder;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean SetupDebugSpeaker
    // Size: 0x1
    // Offset: 0xA3
    bool SetupDebugSpeaker;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <IsSpeaker>k__BackingField
    // Size: 0x1
    // Offset: 0xA4
    bool IsSpeaker;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <IsRecorder>k__BackingField
    // Size: 0x1
    // Offset: 0xA5
    bool IsRecorder;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating interface conversion operator: operator ::Photon::Voice::Unity::ILoggableDependent
    operator ::Photon::Voice::Unity::ILoggableDependent() noexcept {
      return *reinterpret_cast<::Photon::Voice::Unity::ILoggableDependent*>(this);
    }
    // Get static field: static Fusion.Changed`1<Photon.Voice.Fusion.VoiceNetworkObject> $IL2CPP_CHANGED
    static ::Fusion::Changed_1<::Photon::Voice::Fusion::VoiceNetworkObject*> _get_$IL2CPP_CHANGED();
    // Set static field: static Fusion.Changed`1<Photon.Voice.Fusion.VoiceNetworkObject> $IL2CPP_CHANGED
    static void _set_$IL2CPP_CHANGED(::Fusion::Changed_1<::Photon::Voice::Fusion::VoiceNetworkObject*> value);
    // Get static field: static Fusion.ChangedDelegate`1<Photon.Voice.Fusion.VoiceNetworkObject> $IL2CPP_CHANGED_DELEGATE
