// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.AI.CollectObjects
#include "UnityEngine/AI/CollectObjects.hpp"
// Including type: UnityEngine.LayerMask
#include "UnityEngine/LayerMask.hpp"
// Including type: UnityEngine.AI.NavMeshCollectGeometry
#include "UnityEngine/AI/NavMeshCollectGeometry.hpp"
// Including type: UnityEngine.AI.NavMeshDataInstance
#include "UnityEngine/AI/NavMeshDataInstance.hpp"
// Including type: UnityEngine.AI.NavMeshBuildSource
#include "UnityEngine/AI/NavMeshBuildSource.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::AI
namespace UnityEngine::AI {
  // Forward declaring type: NavMeshData
  class NavMeshData;
  // Forward declaring type: NavMeshBuildSettings
  struct NavMeshBuildSettings;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: AsyncOperation
  class AsyncOperation;
  // Forward declaring type: Bounds
  struct Bounds;
  // Skipping declaration: Matrix4x4 because it is already included!
}
// Completed forward declares
// Type namespace: UnityEngine.AI
namespace UnityEngine::AI {
  // Forward declaring type: NavMeshSurface
  class NavMeshSurface;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::AI::NavMeshSurface);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::AI::NavMeshSurface*, "UnityEngine.AI", "NavMeshSurface");
// Type namespace: UnityEngine.AI
namespace UnityEngine::AI {
  // Size: 0x88
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.AI.NavMeshSurface
  // [TokenAttribute] Offset: FFFFFFFF
  // [HelpURLAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: FFFFFFFF
  // [DefaultExecutionOrder] Offset: FFFFFFFF
  // [ExecuteAlways] Offset: FFFFFFFF
  class NavMeshSurface : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::UnityEngine::AI::NavMeshSurface::$$c
    class $$c;
    public:
    // private System.Int32 m_AgentTypeID
    // Size: 0x4
    // Offset: 0x20
    int m_AgentTypeID;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.AI.CollectObjects m_CollectObjects
    // Size: 0x4
    // Offset: 0x24
    ::UnityEngine::AI::CollectObjects m_CollectObjects;
    // Field size check
    static_assert(sizeof(::UnityEngine::AI::CollectObjects) == 0x4);
    // private UnityEngine.Vector3 m_Size
    // Size: 0xC
    // Offset: 0x28
    ::UnityEngine::Vector3 m_Size;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 m_Center
    // Size: 0xC
    // Offset: 0x34
    ::UnityEngine::Vector3 m_Center;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.LayerMask m_LayerMask
    // Size: 0x4
    // Offset: 0x40
    ::UnityEngine::LayerMask m_LayerMask;
    // Field size check
    static_assert(sizeof(::UnityEngine::LayerMask) == 0x4);
    // private UnityEngine.AI.NavMeshCollectGeometry m_UseGeometry
    // Size: 0x4
    // Offset: 0x44
    ::UnityEngine::AI::NavMeshCollectGeometry m_UseGeometry;
    // Field size check
    static_assert(sizeof(::UnityEngine::AI::NavMeshCollectGeometry) == 0x4);
    // private System.Int32 m_DefaultArea
    // Size: 0x4
    // Offset: 0x48
    int m_DefaultArea;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean m_IgnoreNavMeshAgent
    // Size: 0x1
    // Offset: 0x4C
    bool m_IgnoreNavMeshAgent;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_IgnoreNavMeshObstacle
    // Size: 0x1
    // Offset: 0x4D
    bool m_IgnoreNavMeshObstacle;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_OverrideTileSize
    // Size: 0x1
    // Offset: 0x4E
    bool m_OverrideTileSize;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_OverrideTileSize and: m_TileSize
    char __padding9[0x1] = {};
    // private System.Int32 m_TileSize
    // Size: 0x4
    // Offset: 0x50
    int m_TileSize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean m_OverrideVoxelSize
    // Size: 0x1
    // Offset: 0x54
    bool m_OverrideVoxelSize;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_OverrideVoxelSize and: m_VoxelSize
    char __padding11[0x3] = {};
    // private System.Single m_VoxelSize
    // Size: 0x4
    // Offset: 0x58
    float m_VoxelSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_BuildHeightMesh
    // Size: 0x1
    // Offset: 0x5C
    bool m_BuildHeightMesh;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_BuildHeightMesh and: m_NavMeshData
    char __padding13[0x3] = {};
    // private UnityEngine.AI.NavMeshData m_NavMeshData
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::AI::NavMeshData* m_NavMeshData;
    // Field size check
    static_assert(sizeof(::UnityEngine::AI::NavMeshData*) == 0x8);
    // private UnityEngine.AI.NavMeshDataInstance m_NavMeshDataInstance
    // Size: 0x4
    // Offset: 0x68
    ::UnityEngine::AI::NavMeshDataInstance m_NavMeshDataInstance;
    // Field size check
    static_assert(sizeof(::UnityEngine::AI::NavMeshDataInstance) == 0x4);
    // private UnityEngine.Vector3 m_LastPosition
    // Size: 0xC
    // Offset: 0x6C
    ::UnityEngine::Vector3 m_LastPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Quaternion m_LastRotation
    // Size: 0x10
    // Offset: 0x78
    ::UnityEngine::Quaternion m_LastRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    public:
    // Get static field: static private readonly System.Collections.Generic.List`1<UnityEngine.AI.NavMeshSurface> s_NavMeshSurfaces
    static ::System::Collections::Generic::List_1<::UnityEngine::AI::NavMeshSurface*>* _get_s_NavMeshSurfaces();
    // Set static field: static private readonly System.Collections.Generic.List`1<UnityEngine.AI.NavMeshSurface> s_NavMeshSurfaces
    static void _set_s_NavMeshSurfaces(::System::Collections::Generic::List_1<::UnityEngine::AI::NavMeshSurface*>* value);
    // Get instance field reference: private System.Int32 m_AgentTypeID
    [[deprecated("Use field access instead!")]] int& dyn_m_AgentTypeID();
    // Get instance field reference: private UnityEngine.AI.CollectObjects m_CollectObjects
