// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.XR.Interaction.Toolkit.Transformers.XRBaseGrabTransformer
#include "UnityEngine/XR/Interaction/Toolkit/Transformers/XRBaseGrabTransformer.hpp"
// Including type: UnityEngine.Pose
#include "UnityEngine/Pose.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::XR::Interaction::Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Forward declaring type: IXRInteractor
  class IXRInteractor;
  // Forward declaring type: XRGrabInteractable
  class XRGrabInteractable;
}
// Forward declaring namespace: UnityEngine::XR::Interaction::Toolkit::Transformers
namespace UnityEngine::XR::Interaction::Toolkit::Transformers {
  // Skipping declaration: ManipulationAxes because it is already included!
  // Skipping declaration: ConstrainedAxisDisplacementMode because it is already included!
  // Skipping declaration: TwoHandedRotationMode because it is already included!
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Skipping declaration: Quaternion because it is already included!
}
// Completed forward declares
// Type namespace: UnityEngine.XR.Interaction.Toolkit.Transformers
namespace UnityEngine::XR::Interaction::Toolkit::Transformers {
  // Forward declaring type: XRGeneralGrabTransformer
  class XRGeneralGrabTransformer;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::XR::Interaction::Toolkit::Transformers::XRGeneralGrabTransformer);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::XR::Interaction::Toolkit::Transformers::XRGeneralGrabTransformer*, "UnityEngine.XR.Interaction.Toolkit.Transformers", "XRGeneralGrabTransformer");
// Type namespace: UnityEngine.XR.Interaction.Toolkit.Transformers
namespace UnityEngine::XR::Interaction::Toolkit::Transformers {
  // Size: 0x110
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.Transformers.XRGeneralGrabTransformer
  // [TokenAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: FFFFFFFF
  // [HelpURLAttribute] Offset: FFFFFFFF
  class XRGeneralGrabTransformer : public ::UnityEngine::XR::Interaction::Toolkit::Transformers::XRBaseGrabTransformer {
    public:
    // Nested type: ::UnityEngine::XR::Interaction::Toolkit::Transformers::XRGeneralGrabTransformer::ManipulationAxes
    struct ManipulationAxes;
    // Nested type: ::UnityEngine::XR::Interaction::Toolkit::Transformers::XRGeneralGrabTransformer::ConstrainedAxisDisplacementMode
    struct ConstrainedAxisDisplacementMode;
    // Nested type: ::UnityEngine::XR::Interaction::Toolkit::Transformers::XRGeneralGrabTransformer::TwoHandedRotationMode
    struct TwoHandedRotationMode;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.Transformers.XRGeneralGrabTransformer/ManipulationAxes
    // [TokenAttribute] Offset: FFFFFFFF
    // [FlagsAttribute] Offset: FFFFFFFF
    struct ManipulationAxes/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: ManipulationAxes
      constexpr ManipulationAxes(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.Transformers.XRGeneralGrabTransformer/ManipulationAxes X
      static constexpr const int X = 1;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.Transformers.XRGeneralGrabTransformer/ManipulationAxes X
      static ::UnityEngine::XR::Interaction::Toolkit::Transformers::XRGeneralGrabTransformer::ManipulationAxes _get_X();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.Transformers.XRGeneralGrabTransformer/ManipulationAxes X
      static void _set_X(::UnityEngine::XR::Interaction::Toolkit::Transformers::XRGeneralGrabTransformer::ManipulationAxes value);
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.Transformers.XRGeneralGrabTransformer/ManipulationAxes Y
      static constexpr const int Y = 2;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.Transformers.XRGeneralGrabTransformer/ManipulationAxes Y
      static ::UnityEngine::XR::Interaction::Toolkit::Transformers::XRGeneralGrabTransformer::ManipulationAxes _get_Y();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.Transformers.XRGeneralGrabTransformer/ManipulationAxes Y
      static void _set_Y(::UnityEngine::XR::Interaction::Toolkit::Transformers::XRGeneralGrabTransformer::ManipulationAxes value);
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.Transformers.XRGeneralGrabTransformer/ManipulationAxes Z
      static constexpr const int Z = 4;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.Transformers.XRGeneralGrabTransformer/ManipulationAxes Z
      static ::UnityEngine::XR::Interaction::Toolkit::Transformers::XRGeneralGrabTransformer::ManipulationAxes _get_Z();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.Transformers.XRGeneralGrabTransformer/ManipulationAxes Z
      static void _set_Z(::UnityEngine::XR::Interaction::Toolkit::Transformers::XRGeneralGrabTransformer::ManipulationAxes value);
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.Transformers.XRGeneralGrabTransformer/ManipulationAxes All
      static constexpr const int All = 7;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.Transformers.XRGeneralGrabTransformer/ManipulationAxes All
      static ::UnityEngine::XR::Interaction::Toolkit::Transformers::XRGeneralGrabTransformer::ManipulationAxes _get_All();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.Transformers.XRGeneralGrabTransformer/ManipulationAxes All
      static void _set_All(::UnityEngine::XR::Interaction::Toolkit::Transformers::XRGeneralGrabTransformer::ManipulationAxes value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.XR.Interaction.Toolkit.Transformers.XRGeneralGrabTransformer/ManipulationAxes
    #pragma pack(pop)
    static check_size<sizeof(XRGeneralGrabTransformer::ManipulationAxes), 0 + sizeof(int)> __UnityEngine_XR_Interaction_Toolkit_Transformers_XRGeneralGrabTransformer_ManipulationAxesSizeCheck;
    static_assert(sizeof(XRGeneralGrabTransformer::ManipulationAxes) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.Transformers.XRGeneralGrabTransformer/ConstrainedAxisDisplacementMode
    // [TokenAttribute] Offset: FFFFFFFF
    struct ConstrainedAxisDisplacementMode/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: ConstrainedAxisDisplacementMode
      constexpr ConstrainedAxisDisplacementMode(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.Transformers.XRGeneralGrabTransformer/ConstrainedAxisDisplacementMode ObjectRelative
      static constexpr const int ObjectRelative = 0;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.Transformers.XRGeneralGrabTransformer/ConstrainedAxisDisplacementMode ObjectRelative
      static ::UnityEngine::XR::Interaction::Toolkit::Transformers::XRGeneralGrabTransformer::ConstrainedAxisDisplacementMode _get_ObjectRelative();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.Transformers.XRGeneralGrabTransformer/ConstrainedAxisDisplacementMode ObjectRelative
      static void _set_ObjectRelative(::UnityEngine::XR::Interaction::Toolkit::Transformers::XRGeneralGrabTransformer::ConstrainedAxisDisplacementMode value);
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.Transformers.XRGeneralGrabTransformer/ConstrainedAxisDisplacementMode ObjectRelativeWithLockedWorldUp
      static constexpr const int ObjectRelativeWithLockedWorldUp = 1;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.Transformers.XRGeneralGrabTransformer/ConstrainedAxisDisplacementMode ObjectRelativeWithLockedWorldUp
      static ::UnityEngine::XR::Interaction::Toolkit::Transformers::XRGeneralGrabTransformer::ConstrainedAxisDisplacementMode _get_ObjectRelativeWithLockedWorldUp();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.Transformers.XRGeneralGrabTransformer/ConstrainedAxisDisplacementMode ObjectRelativeWithLockedWorldUp
      static void _set_ObjectRelativeWithLockedWorldUp(::UnityEngine::XR::Interaction::Toolkit::Transformers::XRGeneralGrabTransformer::ConstrainedAxisDisplacementMode value);
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.Transformers.XRGeneralGrabTransformer/ConstrainedAxisDisplacementMode WorldAxisRelative
      static constexpr const int WorldAxisRelative = 2;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.Transformers.XRGeneralGrabTransformer/ConstrainedAxisDisplacementMode WorldAxisRelative
      static ::UnityEngine::XR::Interaction::Toolkit::Transformers::XRGeneralGrabTransformer::ConstrainedAxisDisplacementMode _get_WorldAxisRelative();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.Transformers.XRGeneralGrabTransformer/ConstrainedAxisDisplacementMode WorldAxisRelative
      static void _set_WorldAxisRelative(::UnityEngine::XR::Interaction::Toolkit::Transformers::XRGeneralGrabTransformer::ConstrainedAxisDisplacementMode value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.XR.Interaction.Toolkit.Transformers.XRGeneralGrabTransformer/ConstrainedAxisDisplacementMode
    #pragma pack(pop)
    static check_size<sizeof(XRGeneralGrabTransformer::ConstrainedAxisDisplacementMode), 0 + sizeof(int)> __UnityEngine_XR_Interaction_Toolkit_Transformers_XRGeneralGrabTransformer_ConstrainedAxisDisplacementModeSizeCheck;
    static_assert(sizeof(XRGeneralGrabTransformer::ConstrainedAxisDisplacementMode) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.Transformers.XRGeneralGrabTransformer/TwoHandedRotationMode
    // [TokenAttribute] Offset: FFFFFFFF
    struct TwoHandedRotationMode/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: TwoHandedRotationMode
      constexpr TwoHandedRotationMode(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.Transformers.XRGeneralGrabTransformer/TwoHandedRotationMode FirstHandOnly
      static constexpr const int FirstHandOnly = 0;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.Transformers.XRGeneralGrabTransformer/TwoHandedRotationMode FirstHandOnly
      static ::UnityEngine::XR::Interaction::Toolkit::Transformers::XRGeneralGrabTransformer::TwoHandedRotationMode _get_FirstHandOnly();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.Transformers.XRGeneralGrabTransformer/TwoHandedRotationMode FirstHandOnly
      static void _set_FirstHandOnly(::UnityEngine::XR::Interaction::Toolkit::Transformers::XRGeneralGrabTransformer::TwoHandedRotationMode value);
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.Transformers.XRGeneralGrabTransformer/TwoHandedRotationMode FirstHandDirectedTowardsSecondHand
      static constexpr const int FirstHandDirectedTowardsSecondHand = 1;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.Transformers.XRGeneralGrabTransformer/TwoHandedRotationMode FirstHandDirectedTowardsSecondHand
      static ::UnityEngine::XR::Interaction::Toolkit::Transformers::XRGeneralGrabTransformer::TwoHandedRotationMode _get_FirstHandDirectedTowardsSecondHand();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.Transformers.XRGeneralGrabTransformer/TwoHandedRotationMode FirstHandDirectedTowardsSecondHand
      static void _set_FirstHandDirectedTowardsSecondHand(::UnityEngine::XR::Interaction::Toolkit::Transformers::XRGeneralGrabTransformer::TwoHandedRotationMode value);
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.Transformers.XRGeneralGrabTransformer/TwoHandedRotationMode TwoHandedAverage
      static constexpr const int TwoHandedAverage = 2;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.Transformers.XRGeneralGrabTransformer/TwoHandedRotationMode TwoHandedAverage
      static ::UnityEngine::XR::Interaction::Toolkit::Transformers::XRGeneralGrabTransformer::TwoHandedRotationMode _get_TwoHandedAverage();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.Transformers.XRGeneralGrabTransformer/TwoHandedRotationMode TwoHandedAverage
      static void _set_TwoHandedAverage(::UnityEngine::XR::Interaction::Toolkit::Transformers::XRGeneralGrabTransformer::TwoHandedRotationMode value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.XR.Interaction.Toolkit.Transformers.XRGeneralGrabTransformer/TwoHandedRotationMode
    #pragma pack(pop)
    static check_size<sizeof(XRGeneralGrabTransformer::TwoHandedRotationMode), 0 + sizeof(int)> __UnityEngine_XR_Interaction_Toolkit_Transformers_XRGeneralGrabTransformer_TwoHandedRotationModeSizeCheck;
    static_assert(sizeof(XRGeneralGrabTransformer::TwoHandedRotationMode) == 0x4);
    public:
    // private UnityEngine.XR.Interaction.Toolkit.Transformers.XRGeneralGrabTransformer/ManipulationAxes m_PermittedDisplacementAxes
    // Size: 0x4
    // Offset: 0x20
    ::UnityEngine::XR::Interaction::Toolkit::Transformers::XRGeneralGrabTransformer::ManipulationAxes m_PermittedDisplacementAxes;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::Transformers::XRGeneralGrabTransformer::ManipulationAxes) == 0x4);
    // private UnityEngine.XR.Interaction.Toolkit.Transformers.XRGeneralGrabTransformer/ConstrainedAxisDisplacementMode m_ConstrainedAxisDisplacementMode
    // Size: 0x4
    // Offset: 0x24
    ::UnityEngine::XR::Interaction::Toolkit::Transformers::XRGeneralGrabTransformer::ConstrainedAxisDisplacementMode m_ConstrainedAxisDisplacementMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::Transformers::XRGeneralGrabTransformer::ConstrainedAxisDisplacementMode) == 0x4);
    // private UnityEngine.XR.Interaction.Toolkit.Transformers.XRGeneralGrabTransformer/TwoHandedRotationMode m_TwoHandedRotationMode
    // Size: 0x4
    // Offset: 0x28
    ::UnityEngine::XR::Interaction::Toolkit::Transformers::XRGeneralGrabTransformer::TwoHandedRotationMode m_TwoHandedRotationMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::Transformers::XRGeneralGrabTransformer::TwoHandedRotationMode) == 0x4);
    // private System.Boolean m_AllowTwoHandedScaling
    // Size: 0x1
    // Offset: 0x2C
    bool m_AllowTwoHandedScaling;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_AllowTwoHandedScaling and: m_ThresholdMoveRatioForScale
    char __padding3[0x3] = {};
    // private System.Single m_ThresholdMoveRatioForScale
    // Size: 0x4
    // Offset: 0x30
    float m_ThresholdMoveRatioForScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_ClampScaling
    // Size: 0x1
    // Offset: 0x34
    bool m_ClampScaling;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_ClampScaling and: m_MinimumScaleRatio
    char __padding5[0x3] = {};
    // private System.Single m_MinimumScaleRatio
    // Size: 0x4
    // Offset: 0x38
    float m_MinimumScaleRatio;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_MaximumScaleRatio
    // Size: 0x4
    // Offset: 0x3C
    float m_MaximumScaleRatio;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_ScaleMultiplier
    // Size: 0x4
    // Offset: 0x40
    float m_ScaleMultiplier;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Pose m_OriginalObjectPose
    // Size: 0x1C
    // Offset: 0x44
    ::UnityEngine::Pose m_OriginalObjectPose;
    // Field size check
    static_assert(sizeof(::UnityEngine::Pose) == 0x1C);
    // private UnityEngine.Pose m_OffsetPose
    // Size: 0x1C
    // Offset: 0x60
    ::UnityEngine::Pose m_OffsetPose;
    // Field size check
    static_assert(sizeof(::UnityEngine::Pose) == 0x1C);
    // private UnityEngine.Pose m_OriginalInteractorPose
    // Size: 0x1C
    // Offset: 0x7C
    ::UnityEngine::Pose m_OriginalInteractorPose;
    // Field size check
    static_assert(sizeof(::UnityEngine::Pose) == 0x1C);
    // private UnityEngine.Vector3 m_InteractorLocalGrabPoint
    // Size: 0xC
    // Offset: 0x98
    ::UnityEngine::Vector3 m_InteractorLocalGrabPoint;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 m_ObjectLocalGrabPoint
    // Size: 0xC
    // Offset: 0xA4
    ::UnityEngine::Vector3 m_ObjectLocalGrabPoint;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.XR.Interaction.Toolkit.IXRInteractor m_OriginalInteractor
    // Size: 0x8
    // Offset: 0xB0
    ::UnityEngine::XR::Interaction::Toolkit::IXRInteractor* m_OriginalInteractor;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::IXRInteractor*) == 0x8);
    // private System.Int32 m_LastGrabCount
    // Size: 0x4
    // Offset: 0xB8
    int m_LastGrabCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.Vector3 m_StartHandleBar
    // Size: 0xC
    // Offset: 0xBC
    ::UnityEngine::Vector3 m_StartHandleBar;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 m_ScaleAtGrabStart
    // Size: 0xC
    // Offset: 0xC8
    ::UnityEngine::Vector3 m_ScaleAtGrabStart;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Boolean m_FirstFrameSinceTwoHandedGrab
    // Size: 0x1
    // Offset: 0xD4
    bool m_FirstFrameSinceTwoHandedGrab;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_FirstFrameSinceTwoHandedGrab and: m_LastTwoHandedUp
    char __padding18[0x3] = {};
    // private UnityEngine.Vector3 m_LastTwoHandedUp
    // Size: 0xC
    // Offset: 0xD8
    ::UnityEngine::Vector3 m_LastTwoHandedUp;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 m_InitialScale
    // Size: 0xC
    // Offset: 0xE4
    ::UnityEngine::Vector3 m_InitialScale;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 m_MinimumScale
    // Size: 0xC
    // Offset: 0xF0
    ::UnityEngine::Vector3 m_MinimumScale;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 m_MaximumScale
    // Size: 0xC
    // Offset: 0xFC
    ::UnityEngine::Vector3 m_MaximumScale;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.XR.Interaction.Toolkit.Transformers.XRGeneralGrabTransformer/ConstrainedAxisDisplacementMode m_ConstrainedAxisDisplacementModeOnGrab
    // Size: 0x4
    // Offset: 0x108
    ::UnityEngine::XR::Interaction::Toolkit::Transformers::XRGeneralGrabTransformer::ConstrainedAxisDisplacementMode m_ConstrainedAxisDisplacementModeOnGrab;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::Transformers::XRGeneralGrabTransformer::ConstrainedAxisDisplacementMode) == 0x4);
    // private UnityEngine.XR.Interaction.Toolkit.Transformers.XRGeneralGrabTransformer/ManipulationAxes m_PermittedDisplacementAxesOnGrab
    // Size: 0x4
    // Offset: 0x10C
    ::UnityEngine::XR::Interaction::Toolkit::Transformers::XRGeneralGrabTransformer::ManipulationAxes m_PermittedDisplacementAxesOnGrab;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::Transformers::XRGeneralGrabTransformer::ManipulationAxes) == 0x4);
    public:
    // Get instance field reference: private UnityEngine.XR.Interaction.Toolkit.Transformers.XRGeneralGrabTransformer/ManipulationAxes m_PermittedDisplacementAxes
    [[deprecated("Use field access instead!")]] ::UnityEngine::XR::Interaction::Toolkit::Transformers::XRGeneralGrabTransformer::ManipulationAxes& dyn_m_PermittedDisplacementAxes();
    // Get instance field reference: private UnityEngine.XR.Interaction.Toolkit.Transformers.XRGeneralGrabTransformer/ConstrainedAxisDisplacementMode m_ConstrainedAxisDisplacementMode
