// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.IO.Stream
#include "System/IO/Stream.hpp"
// Including type: System.IO.FileAccess
#include "System/IO/FileAccess.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Net::Sockets
namespace System::Net::Sockets {
  // Forward declaring type: Socket
  class Socket;
  // Forward declaring type: SocketShutdown
  struct SocketShutdown;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: SeekOrigin
  struct SeekOrigin;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Span`1<T>
  template<typename T>
  struct Span_1;
  // Forward declaring type: ReadOnlySpan`1<T>
  template<typename T>
  struct ReadOnlySpan_1;
  // Forward declaring type: IAsyncResult
  class IAsyncResult;
  // Forward declaring type: AsyncCallback
  class AsyncCallback;
  // Forward declaring type: Memory`1<T>
  template<typename T>
  struct Memory_1;
  // Forward declaring type: ReadOnlyMemory`1<T>
  template<typename T>
  struct ReadOnlyMemory_1;
}
// Forward declaring namespace: System::Threading::Tasks
namespace System::Threading::Tasks {
  // Forward declaring type: Task`1<TResult>
  template<typename TResult>
  class Task_1;
  // Forward declaring type: ValueTask`1<TResult>
  template<typename TResult>
  struct ValueTask_1;
  // Forward declaring type: Task
  class Task;
  // Forward declaring type: ValueTask
  struct ValueTask;
}
// Forward declaring namespace: System::Threading
namespace System::Threading {
  // Forward declaring type: CancellationToken
  struct CancellationToken;
}
// Completed forward declares
// Type namespace: System.Net.Sockets
namespace System::Net::Sockets {
  // Forward declaring type: NetworkStream
  class NetworkStream;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Net::Sockets::NetworkStream);
DEFINE_IL2CPP_ARG_TYPE(::System::Net::Sockets::NetworkStream*, "System.Net.Sockets", "NetworkStream");
// Type namespace: System.Net.Sockets
namespace System::Net::Sockets {
  // Size: 0x44
  #pragma pack(push, 1)
  // Autogenerated type: System.Net.Sockets.NetworkStream
  // [TokenAttribute] Offset: FFFFFFFF
  class NetworkStream : public ::System::IO::Stream {
    public:
    public:
    // private readonly System.Net.Sockets.Socket _streamSocket
    // Size: 0x8
    // Offset: 0x28
    ::System::Net::Sockets::Socket* streamSocket;
    // Field size check
    static_assert(sizeof(::System::Net::Sockets::Socket*) == 0x8);
    // private readonly System.Boolean _ownsSocket
    // Size: 0x1
    // Offset: 0x30
    bool ownsSocket;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _readable
    // Size: 0x1
    // Offset: 0x31
    bool readable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _writeable
    // Size: 0x1
    // Offset: 0x32
    bool writeable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: writeable and: closeTimeout
    char __padding3[0x1] = {};
    // private System.Int32 _closeTimeout
    // Size: 0x4
    // Offset: 0x34
    int closeTimeout;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean _cleanedUp
    // Size: 0x1
    // Offset: 0x38
    bool cleanedUp;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: cleanedUp and: currentReadTimeout
    char __padding5[0x3] = {};
    // private System.Int32 _currentReadTimeout
    // Size: 0x4
    // Offset: 0x3C
    int currentReadTimeout;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _currentWriteTimeout
    // Size: 0x4
    // Offset: 0x40
    int currentWriteTimeout;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Get instance field reference: private readonly System.Net.Sockets.Socket _streamSocket
    [[deprecated("Use field access instead!")]] ::System::Net::Sockets::Socket*& dyn__streamSocket();
    // Get instance field reference: private readonly System.Boolean _ownsSocket
    [[deprecated("Use field access instead!")]] bool& dyn__ownsSocket();
    // Get instance field reference: private System.Boolean _readable
    [[deprecated("Use field access instead!")]] bool& dyn__readable();
    // Get instance field reference: private System.Boolean _writeable
    [[deprecated("Use field access instead!")]] bool& dyn__writeable();
    // Get instance field reference: private System.Int32 _closeTimeout
    [[deprecated("Use field access instead!")]] int& dyn__closeTimeout();
    // Get instance field reference: private System.Boolean _cleanedUp
