// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: System.IEquatable`1
#include "System/IEquatable_1.hpp"
// Including type: System.UInt32
#include "System/UInt32.hpp"
// Including type: UnityEngine.InputSystem.Users.InputUserAccountHandle
#include "UnityEngine/InputSystem/Users/InputUserAccountHandle.hpp"
// Including type: UnityEngine.InputSystem.InputControlScheme
#include "UnityEngine/InputSystem/InputControlScheme.hpp"
// Including type: UnityEngine.InputSystem.Users.InputUserChange
#include "UnityEngine/InputSystem/Users/InputUserChange.hpp"
// Including type: UnityEngine.InputSystem.LowLevel.InputEventPtr
#include "UnityEngine/InputSystem/LowLevel/InputEventPtr.hpp"
// Including type: UnityEngine.InputSystem.Utilities.InlinedArray`1
#include "UnityEngine/InputSystem/Utilities/InlinedArray_1.hpp"
// Including type: UnityEngine.InputSystem.Utilities.CallbackArray`1
#include "UnityEngine/InputSystem/Utilities/CallbackArray_1.hpp"
// Including type: UnityEngine.InputSystem.InputActionChange
#include "UnityEngine/InputSystem/InputActionChange.hpp"
// Including type: UnityEngine.InputSystem.InputDeviceChange
#include "UnityEngine/InputSystem/InputDeviceChange.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::InputSystem::Users
namespace UnityEngine::InputSystem::Users {
  // Skipping declaration: UserData because it is already included!
  // Skipping declaration: OngoingAccountSelection because it is already included!
  // Forward declaring type: InputUserPairingOptions
  struct InputUserPairingOptions;
}
// Forward declaring namespace: UnityEngine::InputSystem::Utilities
namespace UnityEngine::InputSystem::Utilities {
  // Forward declaring type: ReadOnlyArray`1<TValue>
  template<typename TValue>
  struct ReadOnlyArray_1;
  // Forward declaring type: ISavedState
  class ISavedState;
}
// Forward declaring namespace: UnityEngine::InputSystem
namespace UnityEngine::InputSystem {
  // Forward declaring type: InputDevice
  class InputDevice;
  // Forward declaring type: IInputActionCollection
  class IInputActionCollection;
  // Forward declaring type: InputControl
  class InputControl;
  // Skipping declaration: InputControlList`1 because it is already included!
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`3<T1, T2, T3>
  template<typename T1, typename T2, typename T3>
  class Action_3;
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
  // Forward declaring type: Func`3<T1, T2, TResult>
  template<typename T1, typename T2, typename TResult>
  class Func_3;
}
// Completed forward declares
// Type namespace: UnityEngine.InputSystem.Users
namespace UnityEngine::InputSystem::Users {
  // Forward declaring type: InputUser
  struct InputUser;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::InputSystem::Users::InputUser, "UnityEngine.InputSystem.Users", "InputUser");
// Type namespace: UnityEngine.InputSystem.Users
namespace UnityEngine::InputSystem::Users {
  // Size: 0x4
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: UnityEngine.InputSystem.Users.InputUser
  // [TokenAttribute] Offset: FFFFFFFF
  struct InputUser/*, public ::System::ValueType, public ::System::IEquatable_1<::UnityEngine::InputSystem::Users::InputUser>*/ {
    public:
    // Nested type: ::UnityEngine::InputSystem::Users::InputUser::ControlSchemeChangeSyntax
    struct ControlSchemeChangeSyntax;
    // Nested type: ::UnityEngine::InputSystem::Users::InputUser::UserFlags
    struct UserFlags;
    // Nested type: ::UnityEngine::InputSystem::Users::InputUser::UserData
    struct UserData;
    // Nested type: ::UnityEngine::InputSystem::Users::InputUser::CompareDevicesByUserAccount
    struct CompareDevicesByUserAccount;
    // Nested type: ::UnityEngine::InputSystem::Users::InputUser::OngoingAccountSelection
    struct OngoingAccountSelection;
    // Nested type: ::UnityEngine::InputSystem::Users::InputUser::GlobalState
    struct GlobalState;
    // Nested type: ::UnityEngine::InputSystem::Users::InputUser::$$c
    class $$c;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.InputSystem.Users.InputUser/UserFlags
    // [TokenAttribute] Offset: FFFFFFFF
    // [FlagsAttribute] Offset: FFFFFFFF
    struct UserFlags/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: UserFlags
      constexpr UserFlags(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.InputSystem.Users.InputUser/UserFlags BindToAllDevices
      static constexpr const int BindToAllDevices = 1;
      // Get static field: static public UnityEngine.InputSystem.Users.InputUser/UserFlags BindToAllDevices
      static ::UnityEngine::InputSystem::Users::InputUser::UserFlags _get_BindToAllDevices();
      // Set static field: static public UnityEngine.InputSystem.Users.InputUser/UserFlags BindToAllDevices
      static void _set_BindToAllDevices(::UnityEngine::InputSystem::Users::InputUser::UserFlags value);
      // static field const value: static public UnityEngine.InputSystem.Users.InputUser/UserFlags UserAccountSelectionInProgress
      static constexpr const int UserAccountSelectionInProgress = 2;
      // Get static field: static public UnityEngine.InputSystem.Users.InputUser/UserFlags UserAccountSelectionInProgress
      static ::UnityEngine::InputSystem::Users::InputUser::UserFlags _get_UserAccountSelectionInProgress();
      // Set static field: static public UnityEngine.InputSystem.Users.InputUser/UserFlags UserAccountSelectionInProgress
      static void _set_UserAccountSelectionInProgress(::UnityEngine::InputSystem::Users::InputUser::UserFlags value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.InputSystem.Users.InputUser/UserFlags
    #pragma pack(pop)
    static check_size<sizeof(InputUser::UserFlags), 0 + sizeof(int)> __UnityEngine_InputSystem_Users_InputUser_UserFlagsSizeCheck;
    static_assert(sizeof(InputUser::UserFlags) == 0x4);
    // WARNING Size may be invalid!
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.InputSystem.Users.InputUser/UserData
    // [TokenAttribute] Offset: FFFFFFFF
    struct UserData/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.Nullable`1<UnityEngine.InputSystem.Users.InputUserAccountHandle> platformUserAccountHandle
      // Size: 0xFFFFFFFF
      // Offset: 0x0
      ::System::Nullable_1<::UnityEngine::InputSystem::Users::InputUserAccountHandle> platformUserAccountHandle;
      // public System.String platformUserAccountName
      // Size: 0x8
      // Offset: 0x18
      ::StringW platformUserAccountName;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      // public System.String platformUserAccountId
      // Size: 0x8
      // Offset: 0x20
      ::StringW platformUserAccountId;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      // public System.Int32 deviceCount
      // Size: 0x4
      // Offset: 0x28
      int deviceCount;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Int32 deviceStartIndex
      // Size: 0x4
      // Offset: 0x2C
      int deviceStartIndex;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public UnityEngine.InputSystem.IInputActionCollection actions
      // Size: 0x8
      // Offset: 0x30
      ::UnityEngine::InputSystem::IInputActionCollection* actions;
      // Field size check
      static_assert(sizeof(::UnityEngine::InputSystem::IInputActionCollection*) == 0x8);
      // public System.Nullable`1<UnityEngine.InputSystem.InputControlScheme> controlScheme
      // Size: 0xFFFFFFFF
      // Offset: 0x38
      ::System::Nullable_1<::UnityEngine::InputSystem::InputControlScheme> controlScheme;
      // public UnityEngine.InputSystem.InputControlScheme/MatchResult controlSchemeMatch
      // Size: 0xFFFFFFFF
      // Offset: 0x58
      ::UnityEngine::InputSystem::InputControlScheme::MatchResult controlSchemeMatch;
      // public System.Int32 lostDeviceCount
      // Size: 0x4
      // Offset: 0xA8
      int lostDeviceCount;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Int32 lostDeviceStartIndex
      // Size: 0x4
      // Offset: 0xAC
      int lostDeviceStartIndex;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public UnityEngine.InputSystem.Users.InputUser/UserFlags flags
      // Size: 0x4
      // Offset: 0xB0
      ::UnityEngine::InputSystem::Users::InputUser::UserFlags flags;
      // Field size check
      static_assert(sizeof(::UnityEngine::InputSystem::Users::InputUser::UserFlags) == 0x4);
      public:
      // Creating value type constructor for type: UserData
      constexpr UserData(::System::Nullable_1<::UnityEngine::InputSystem::Users::InputUserAccountHandle> platformUserAccountHandle_ = {}, ::StringW platformUserAccountName_ = {}, ::StringW platformUserAccountId_ = {}, int deviceCount_ = {}, int deviceStartIndex_ = {}, ::UnityEngine::InputSystem::IInputActionCollection* actions_ = {}, ::System::Nullable_1<::UnityEngine::InputSystem::InputControlScheme> controlScheme_ = {}, ::UnityEngine::InputSystem::InputControlScheme::MatchResult controlSchemeMatch_ = {}, int lostDeviceCount_ = {}, int lostDeviceStartIndex_ = {}, ::UnityEngine::InputSystem::Users::InputUser::UserFlags flags_ = {}) noexcept : platformUserAccountHandle{platformUserAccountHandle_}, platformUserAccountName{platformUserAccountName_}, platformUserAccountId{platformUserAccountId_}, deviceCount{deviceCount_}, deviceStartIndex{deviceStartIndex_}, actions{actions_}, controlScheme{controlScheme_}, controlSchemeMatch{controlSchemeMatch_}, lostDeviceCount{lostDeviceCount_}, lostDeviceStartIndex{lostDeviceStartIndex_}, flags{flags_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public System.Nullable`1<UnityEngine.InputSystem.Users.InputUserAccountHandle> platformUserAccountHandle
      [[deprecated("Use field access instead!")]] ::System::Nullable_1<::UnityEngine::InputSystem::Users::InputUserAccountHandle>& dyn_platformUserAccountHandle();
      // Get instance field reference: public System.String platformUserAccountName
      [[deprecated("Use field access instead!")]] ::StringW& dyn_platformUserAccountName();
      // Get instance field reference: public System.String platformUserAccountId
      [[deprecated("Use field access instead!")]] ::StringW& dyn_platformUserAccountId();
      // Get instance field reference: public System.Int32 deviceCount
      [[deprecated("Use field access instead!")]] int& dyn_deviceCount();
      // Get instance field reference: public System.Int32 deviceStartIndex
      [[deprecated("Use field access instead!")]] int& dyn_deviceStartIndex();
      // Get instance field reference: public UnityEngine.InputSystem.IInputActionCollection actions
      [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::IInputActionCollection*& dyn_actions();
      // Get instance field reference: public System.Nullable`1<UnityEngine.InputSystem.InputControlScheme> controlScheme
      [[deprecated("Use field access instead!")]] ::System::Nullable_1<::UnityEngine::InputSystem::InputControlScheme>& dyn_controlScheme();
      // Get instance field reference: public UnityEngine.InputSystem.InputControlScheme/MatchResult controlSchemeMatch
      [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::InputControlScheme::MatchResult& dyn_controlSchemeMatch();
      // Get instance field reference: public System.Int32 lostDeviceCount
      [[deprecated("Use field access instead!")]] int& dyn_lostDeviceCount();
      // Get instance field reference: public System.Int32 lostDeviceStartIndex
      [[deprecated("Use field access instead!")]] int& dyn_lostDeviceStartIndex();
      // Get instance field reference: public UnityEngine.InputSystem.Users.InputUser/UserFlags flags
      [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::Users::InputUser::UserFlags& dyn_flags();
    }; // UnityEngine.InputSystem.Users.InputUser/UserData
    // WARNING Not writing size check since size may be invalid!
    // Size: 0xC
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.InputSystem.Users.InputUser/OngoingAccountSelection
    // [TokenAttribute] Offset: FFFFFFFF
    struct OngoingAccountSelection/*, public ::System::ValueType*/ {
      public:
      public:
      // public UnityEngine.InputSystem.InputDevice device
      // Size: 0x8
      // Offset: 0x0
      ::UnityEngine::InputSystem::InputDevice* device;
      // Field size check
      static_assert(sizeof(::UnityEngine::InputSystem::InputDevice*) == 0x8);
      // public System.UInt32 userId
      // Size: 0x4
      // Offset: 0x8
      uint userId;
      // Field size check
      static_assert(sizeof(uint) == 0x4);
      public:
      // Creating value type constructor for type: OngoingAccountSelection
      constexpr OngoingAccountSelection(::UnityEngine::InputSystem::InputDevice* device_ = {}, uint userId_ = {}) noexcept : device{device_}, userId{userId_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public UnityEngine.InputSystem.InputDevice device
      [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::InputDevice*& dyn_device();
      // Get instance field reference: public System.UInt32 userId
      [[deprecated("Use field access instead!")]] uint& dyn_userId();
    }; // UnityEngine.InputSystem.Users.InputUser/OngoingAccountSelection
    #pragma pack(pop)
    static check_size<sizeof(InputUser::OngoingAccountSelection), 8 + sizeof(uint)> __UnityEngine_InputSystem_Users_InputUser_OngoingAccountSelectionSizeCheck;
    static_assert(sizeof(InputUser::OngoingAccountSelection) == 0xC);
    // WARNING Size may be invalid!
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.InputSystem.Users.InputUser/GlobalState
    // [TokenAttribute] Offset: FFFFFFFF
    struct GlobalState/*, public ::System::ValueType*/ {
      public:
      public:
      // System.Int32 pairingStateVersion
      // Size: 0x4
      // Offset: 0x0
      int pairingStateVersion;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // System.UInt32 lastUserId
      // Size: 0x4
      // Offset: 0x4
      uint lastUserId;
      // Field size check
      static_assert(sizeof(uint) == 0x4);
      // System.Int32 allUserCount
      // Size: 0x4
      // Offset: 0x8
      int allUserCount;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // System.Int32 allPairedDeviceCount
      // Size: 0x4
      // Offset: 0xC
      int allPairedDeviceCount;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // System.Int32 allLostDeviceCount
      // Size: 0x4
      // Offset: 0x10
      int allLostDeviceCount;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // UnityEngine.InputSystem.Users.InputUser[] allUsers
      // Size: 0x8
      // Offset: 0x18
      ::ArrayW<::UnityEngine::InputSystem::Users::InputUser> allUsers;
      // Field size check
      static_assert(sizeof(::ArrayW<::UnityEngine::InputSystem::Users::InputUser>) == 0x8);
      // UnityEngine.InputSystem.Users.InputUser/UserData[] allUserData
      // Size: 0x8
      // Offset: 0x20
      ::ArrayW<::UnityEngine::InputSystem::Users::InputUser::UserData> allUserData;
      // Field size check
      static_assert(sizeof(::ArrayW<::UnityEngine::InputSystem::Users::InputUser::UserData>) == 0x8);
      // UnityEngine.InputSystem.InputDevice[] allPairedDevices
      // Size: 0x8
      // Offset: 0x28
      ::ArrayW<::UnityEngine::InputSystem::InputDevice*> allPairedDevices;
      // Field size check
      static_assert(sizeof(::ArrayW<::UnityEngine::InputSystem::InputDevice*>) == 0x8);
      // UnityEngine.InputSystem.InputDevice[] allLostDevices
      // Size: 0x8
      // Offset: 0x30
      ::ArrayW<::UnityEngine::InputSystem::InputDevice*> allLostDevices;
      // Field size check
      static_assert(sizeof(::ArrayW<::UnityEngine::InputSystem::InputDevice*>) == 0x8);
      // UnityEngine.InputSystem.Utilities.InlinedArray`1<UnityEngine.InputSystem.Users.InputUser/OngoingAccountSelection> ongoingAccountSelections
      // Size: 0xFFFFFFFF
      // Offset: 0x38
      ::UnityEngine::InputSystem::Utilities::InlinedArray_1<::UnityEngine::InputSystem::Users::InputUser::OngoingAccountSelection> ongoingAccountSelections;
      // UnityEngine.InputSystem.Utilities.CallbackArray`1<System.Action`3<UnityEngine.InputSystem.Users.InputUser,UnityEngine.InputSystem.Users.InputUserChange,UnityEngine.InputSystem.InputDevice>> onChange
      // Size: 0xFFFFFFFF
      // Offset: 0x58
      ::UnityEngine::InputSystem::Utilities::CallbackArray_1<::System::Action_3<::UnityEngine::InputSystem::Users::InputUser, ::UnityEngine::InputSystem::Users::InputUserChange, ::UnityEngine::InputSystem::InputDevice*>*> onChange;
      // UnityEngine.InputSystem.Utilities.CallbackArray`1<System.Action`2<UnityEngine.InputSystem.InputControl,UnityEngine.InputSystem.LowLevel.InputEventPtr>> onUnpairedDeviceUsed
      // Size: 0xFFFFFFFF
      // Offset: 0xA8
      ::UnityEngine::InputSystem::Utilities::CallbackArray_1<::System::Action_2<::UnityEngine::InputSystem::InputControl*, ::UnityEngine::InputSystem::LowLevel::InputEventPtr>*> onUnpairedDeviceUsed;
      // UnityEngine.InputSystem.Utilities.CallbackArray`1<System.Func`3<UnityEngine.InputSystem.InputDevice,UnityEngine.InputSystem.LowLevel.InputEventPtr,System.Boolean>> onPreFilterUnpairedDeviceUsed
      // Size: 0xFFFFFFFF
      // Offset: 0xF8
      ::UnityEngine::InputSystem::Utilities::CallbackArray_1<::System::Func_3<::UnityEngine::InputSystem::InputDevice*, ::UnityEngine::InputSystem::LowLevel::InputEventPtr, bool>*> onPreFilterUnpairedDeviceUsed;
      // System.Action`2<System.Object,UnityEngine.InputSystem.InputActionChange> actionChangeDelegate
      // Size: 0x8
      // Offset: 0x148
      ::System::Action_2<::Il2CppObject*, ::UnityEngine::InputSystem::InputActionChange>* actionChangeDelegate;
      // Field size check
      static_assert(sizeof(::System::Action_2<::Il2CppObject*, ::UnityEngine::InputSystem::InputActionChange>*) == 0x8);
      // System.Action`2<UnityEngine.InputSystem.InputDevice,UnityEngine.InputSystem.InputDeviceChange> onDeviceChangeDelegate
      // Size: 0x8
      // Offset: 0x150
      ::System::Action_2<::UnityEngine::InputSystem::InputDevice*, ::UnityEngine::InputSystem::InputDeviceChange>* onDeviceChangeDelegate;
      // Field size check
      static_assert(sizeof(::System::Action_2<::UnityEngine::InputSystem::InputDevice*, ::UnityEngine::InputSystem::InputDeviceChange>*) == 0x8);
      // System.Action`2<UnityEngine.InputSystem.LowLevel.InputEventPtr,UnityEngine.InputSystem.InputDevice> onEventDelegate
      // Size: 0x8
      // Offset: 0x158
      ::System::Action_2<::UnityEngine::InputSystem::LowLevel::InputEventPtr, ::UnityEngine::InputSystem::InputDevice*>* onEventDelegate;
      // Field size check
      static_assert(sizeof(::System::Action_2<::UnityEngine::InputSystem::LowLevel::InputEventPtr, ::UnityEngine::InputSystem::InputDevice*>*) == 0x8);
      // System.Boolean onActionChangeHooked
      // Size: 0x1
      // Offset: 0x160
      bool onActionChangeHooked;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // System.Boolean onDeviceChangeHooked
      // Size: 0x1
      // Offset: 0x161
      bool onDeviceChangeHooked;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // System.Boolean onEventHooked
      // Size: 0x1
      // Offset: 0x162
      bool onEventHooked;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // System.Int32 listenForUnpairedDeviceActivity
      // Size: 0x4
      // Offset: 0x164
      int listenForUnpairedDeviceActivity;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: GlobalState
      constexpr GlobalState(int pairingStateVersion_ = {}, uint lastUserId_ = {}, int allUserCount_ = {}, int allPairedDeviceCount_ = {}, int allLostDeviceCount_ = {}, ::ArrayW<::UnityEngine::InputSystem::Users::InputUser> allUsers_ = ::ArrayW<::UnityEngine::InputSystem::Users::InputUser>(static_cast<void*>(nullptr)), ::ArrayW<::UnityEngine::InputSystem::Users::InputUser::UserData> allUserData_ = ::ArrayW<::UnityEngine::InputSystem::Users::InputUser::UserData>(static_cast<void*>(nullptr)), ::ArrayW<::UnityEngine::InputSystem::InputDevice*> allPairedDevices_ = ::ArrayW<::UnityEngine::InputSystem::InputDevice*>(static_cast<void*>(nullptr)), ::ArrayW<::UnityEngine::InputSystem::InputDevice*> allLostDevices_ = ::ArrayW<::UnityEngine::InputSystem::InputDevice*>(static_cast<void*>(nullptr)), ::UnityEngine::InputSystem::Utilities::InlinedArray_1<::UnityEngine::InputSystem::Users::InputUser::OngoingAccountSelection> ongoingAccountSelections_ = {}, ::UnityEngine::InputSystem::Utilities::CallbackArray_1<::System::Action_3<::UnityEngine::InputSystem::Users::InputUser, ::UnityEngine::InputSystem::Users::InputUserChange, ::UnityEngine::InputSystem::InputDevice*>*> onChange_ = {}, ::UnityEngine::InputSystem::Utilities::CallbackArray_1<::System::Action_2<::UnityEngine::InputSystem::InputControl*, ::UnityEngine::InputSystem::LowLevel::InputEventPtr>*> onUnpairedDeviceUsed_ = {}, ::UnityEngine::InputSystem::Utilities::CallbackArray_1<::System::Func_3<::UnityEngine::InputSystem::InputDevice*, ::UnityEngine::InputSystem::LowLevel::InputEventPtr, bool>*> onPreFilterUnpairedDeviceUsed_ = {}, ::System::Action_2<::Il2CppObject*, ::UnityEngine::InputSystem::InputActionChange>* actionChangeDelegate_ = {}, ::System::Action_2<::UnityEngine::InputSystem::InputDevice*, ::UnityEngine::InputSystem::InputDeviceChange>* onDeviceChangeDelegate_ = {}, ::System::Action_2<::UnityEngine::InputSystem::LowLevel::InputEventPtr, ::UnityEngine::InputSystem::InputDevice*>* onEventDelegate_ = {}, bool onActionChangeHooked_ = {}, bool onDeviceChangeHooked_ = {}, bool onEventHooked_ = {}, int listenForUnpairedDeviceActivity_ = {}) noexcept : pairingStateVersion{pairingStateVersion_}, lastUserId{lastUserId_}, allUserCount{allUserCount_}, allPairedDeviceCount{allPairedDeviceCount_}, allLostDeviceCount{allLostDeviceCount_}, allUsers{allUsers_}, allUserData{allUserData_}, allPairedDevices{allPairedDevices_}, allLostDevices{allLostDevices_}, ongoingAccountSelections{ongoingAccountSelections_}, onChange{onChange_}, onUnpairedDeviceUsed{onUnpairedDeviceUsed_}, onPreFilterUnpairedDeviceUsed{onPreFilterUnpairedDeviceUsed_}, actionChangeDelegate{actionChangeDelegate_}, onDeviceChangeDelegate{onDeviceChangeDelegate_}, onEventDelegate{onEventDelegate_}, onActionChangeHooked{onActionChangeHooked_}, onDeviceChangeHooked{onDeviceChangeHooked_}, onEventHooked{onEventHooked_}, listenForUnpairedDeviceActivity{listenForUnpairedDeviceActivity_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: System.Int32 pairingStateVersion
      [[deprecated("Use field access instead!")]] int& dyn_pairingStateVersion();
      // Get instance field reference: System.UInt32 lastUserId
      [[deprecated("Use field access instead!")]] uint& dyn_lastUserId();
      // Get instance field reference: System.Int32 allUserCount
      [[deprecated("Use field access instead!")]] int& dyn_allUserCount();
      // Get instance field reference: System.Int32 allPairedDeviceCount
      [[deprecated("Use field access instead!")]] int& dyn_allPairedDeviceCount();
      // Get instance field reference: System.Int32 allLostDeviceCount
      [[deprecated("Use field access instead!")]] int& dyn_allLostDeviceCount();
      // Get instance field reference: UnityEngine.InputSystem.Users.InputUser[] allUsers
      [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::InputSystem::Users::InputUser>& dyn_allUsers();
      // Get instance field reference: UnityEngine.InputSystem.Users.InputUser/UserData[] allUserData
      [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::InputSystem::Users::InputUser::UserData>& dyn_allUserData();
      // Get instance field reference: UnityEngine.InputSystem.InputDevice[] allPairedDevices
      [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::InputSystem::InputDevice*>& dyn_allPairedDevices();
      // Get instance field reference: UnityEngine.InputSystem.InputDevice[] allLostDevices
      [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::InputSystem::InputDevice*>& dyn_allLostDevices();
      // Get instance field reference: UnityEngine.InputSystem.Utilities.InlinedArray`1<UnityEngine.InputSystem.Users.InputUser/OngoingAccountSelection> ongoingAccountSelections
      [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::Utilities::InlinedArray_1<::UnityEngine::InputSystem::Users::InputUser::OngoingAccountSelection>& dyn_ongoingAccountSelections();
      // Get instance field reference: UnityEngine.InputSystem.Utilities.CallbackArray`1<System.Action`3<UnityEngine.InputSystem.Users.InputUser,UnityEngine.InputSystem.Users.InputUserChange,UnityEngine.InputSystem.InputDevice>> onChange
      [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::Utilities::CallbackArray_1<::System::Action_3<::UnityEngine::InputSystem::Users::InputUser, ::UnityEngine::InputSystem::Users::InputUserChange, ::UnityEngine::InputSystem::InputDevice*>*>& dyn_onChange();
      // Get instance field reference: UnityEngine.InputSystem.Utilities.CallbackArray`1<System.Action`2<UnityEngine.InputSystem.InputControl,UnityEngine.InputSystem.LowLevel.InputEventPtr>> onUnpairedDeviceUsed
      [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::Utilities::CallbackArray_1<::System::Action_2<::UnityEngine::InputSystem::InputControl*, ::UnityEngine::InputSystem::LowLevel::InputEventPtr>*>& dyn_onUnpairedDeviceUsed();
      // Get instance field reference: UnityEngine.InputSystem.Utilities.CallbackArray`1<System.Func`3<UnityEngine.InputSystem.InputDevice,UnityEngine.InputSystem.LowLevel.InputEventPtr,System.Boolean>> onPreFilterUnpairedDeviceUsed
      [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::Utilities::CallbackArray_1<::System::Func_3<::UnityEngine::InputSystem::InputDevice*, ::UnityEngine::InputSystem::LowLevel::InputEventPtr, bool>*>& dyn_onPreFilterUnpairedDeviceUsed();
      // Get instance field reference: System.Action`2<System.Object,UnityEngine.InputSystem.InputActionChange> actionChangeDelegate
      [[deprecated("Use field access instead!")]] ::System::Action_2<::Il2CppObject*, ::UnityEngine::InputSystem::InputActionChange>*& dyn_actionChangeDelegate();
      // Get instance field reference: System.Action`2<UnityEngine.InputSystem.InputDevice,UnityEngine.InputSystem.InputDeviceChange> onDeviceChangeDelegate
      [[deprecated("Use field access instead!")]] ::System::Action_2<::UnityEngine::InputSystem::InputDevice*, ::UnityEngine::InputSystem::InputDeviceChange>*& dyn_onDeviceChangeDelegate();
      // Get instance field reference: System.Action`2<UnityEngine.InputSystem.LowLevel.InputEventPtr,UnityEngine.InputSystem.InputDevice> onEventDelegate
      [[deprecated("Use field access instead!")]] ::System::Action_2<::UnityEngine::InputSystem::LowLevel::InputEventPtr, ::UnityEngine::InputSystem::InputDevice*>*& dyn_onEventDelegate();
      // Get instance field reference: System.Boolean onActionChangeHooked
      [[deprecated("Use field access instead!")]] bool& dyn_onActionChangeHooked();
      // Get instance field reference: System.Boolean onDeviceChangeHooked
      [[deprecated("Use field access instead!")]] bool& dyn_onDeviceChangeHooked();
      // Get instance field reference: System.Boolean onEventHooked
      [[deprecated("Use field access instead!")]] bool& dyn_onEventHooked();
      // Get instance field reference: System.Int32 listenForUnpairedDeviceActivity
      [[deprecated("Use field access instead!")]] int& dyn_listenForUnpairedDeviceActivity();
    }; // UnityEngine.InputSystem.Users.InputUser/GlobalState
    // WARNING Not writing size check since size may be invalid!
    public:
    // private System.UInt32 m_Id
    // Size: 0x4
    // Offset: 0x0
    uint m_Id;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    public:
    // Creating value type constructor for type: InputUser
    constexpr InputUser(uint m_Id_ = {}) noexcept : m_Id{m_Id_} {}
    // Creating interface conversion operator: operator ::System::ValueType
    operator ::System::ValueType() noexcept {
      return *reinterpret_cast<::System::ValueType*>(this);
    }
    // Creating interface conversion operator: operator ::System::IEquatable_1<::UnityEngine::InputSystem::Users::InputUser>
    operator ::System::IEquatable_1<::UnityEngine::InputSystem::Users::InputUser>() noexcept {
      return *reinterpret_cast<::System::IEquatable_1<::UnityEngine::InputSystem::Users::InputUser>*>(this);
    }
    // Creating conversion operator: operator uint
    constexpr operator uint() const noexcept {
      return m_Id;
    }
    // static field const value: static public System.UInt32 InvalidId
