// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Photon.Pun.MonoBehaviourPunCallbacks
#include "Photon/Pun/MonoBehaviourPunCallbacks.hpp"
// Including type: Photon.Pun.IPunObservable
#include "Photon/Pun/IPunObservable.hpp"
// Including type: Photon.Pun.IOnPhotonViewOwnerChange
#include "Photon/Pun/IOnPhotonViewOwnerChange.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::AI
namespace UnityEngine::AI {
  // Forward declaring type: NavMeshPath
  class NavMeshPath;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
}
// Forward declaring namespace: Photon::Realtime
namespace Photon::Realtime {
  // Forward declaring type: Player
  class Player;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: AngryBeeAnimator
  class AngryBeeAnimator;
  // Skipping declaration: ChaseState because it is already included!
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: Photon::Pun
namespace Photon::Pun {
  // Forward declaring type: PhotonStream
  class PhotonStream;
  // Forward declaring type: PhotonMessageInfo
  struct PhotonMessageInfo;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: AngryBeeSwarm
  class AngryBeeSwarm;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::AngryBeeSwarm);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::AngryBeeSwarm*, "", "AngryBeeSwarm");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x110
  #pragma pack(push, 1)
  // Autogenerated type: AngryBeeSwarm
  // [TokenAttribute] Offset: FFFFFFFF
  class AngryBeeSwarm : public ::Photon::Pun::MonoBehaviourPunCallbacks/*, public ::Photon::Pun::IPunObservable, public ::Photon::Pun::IOnPhotonViewOwnerChange*/ {
    public:
    // Nested type: ::GlobalNamespace::AngryBeeSwarm::ChaseState
    struct ChaseState;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: AngryBeeSwarm/ChaseState
    // [TokenAttribute] Offset: FFFFFFFF
    struct ChaseState/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: ChaseState
      constexpr ChaseState(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public AngryBeeSwarm/ChaseState Dormant
      static constexpr const int Dormant = 1;
      // Get static field: static public AngryBeeSwarm/ChaseState Dormant
      static ::GlobalNamespace::AngryBeeSwarm::ChaseState _get_Dormant();
      // Set static field: static public AngryBeeSwarm/ChaseState Dormant
      static void _set_Dormant(::GlobalNamespace::AngryBeeSwarm::ChaseState value);
      // static field const value: static public AngryBeeSwarm/ChaseState InitialEmerge
      static constexpr const int InitialEmerge = 2;
      // Get static field: static public AngryBeeSwarm/ChaseState InitialEmerge
      static ::GlobalNamespace::AngryBeeSwarm::ChaseState _get_InitialEmerge();
      // Set static field: static public AngryBeeSwarm/ChaseState InitialEmerge
      static void _set_InitialEmerge(::GlobalNamespace::AngryBeeSwarm::ChaseState value);
      // static field const value: static public AngryBeeSwarm/ChaseState Chasing
      static constexpr const int Chasing = 4;
      // Get static field: static public AngryBeeSwarm/ChaseState Chasing
      static ::GlobalNamespace::AngryBeeSwarm::ChaseState _get_Chasing();
      // Set static field: static public AngryBeeSwarm/ChaseState Chasing
      static void _set_Chasing(::GlobalNamespace::AngryBeeSwarm::ChaseState value);
      // static field const value: static public AngryBeeSwarm/ChaseState Grabbing
      static constexpr const int Grabbing = 8;
      // Get static field: static public AngryBeeSwarm/ChaseState Grabbing
      static ::GlobalNamespace::AngryBeeSwarm::ChaseState _get_Grabbing();
      // Set static field: static public AngryBeeSwarm/ChaseState Grabbing
      static void _set_Grabbing(::GlobalNamespace::AngryBeeSwarm::ChaseState value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // AngryBeeSwarm/ChaseState
    #pragma pack(pop)
    static check_size<sizeof(AngryBeeSwarm::ChaseState), 0 + sizeof(int)> __GlobalNamespace_AngryBeeSwarm_ChaseStateSizeCheck;
    static_assert(sizeof(AngryBeeSwarm::ChaseState) == 0x4);
    public:
    // public System.Single heightAboveNavmesh
    // Size: 0x4
    // Offset: 0x28
    float heightAboveNavmesh;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: heightAboveNavmesh and: followTarget
    char __padding0[0x4] = {};
    // public UnityEngine.Transform followTarget
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Transform* followTarget;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private System.Single velocityStep
    // Size: 0x4
    // Offset: 0x38
    float velocityStep;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single currentSpeed
    // Size: 0x4
    // Offset: 0x3C
    float currentSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single velocityIncreaseInterval
    // Size: 0x4
    // Offset: 0x40
    float velocityIncreaseInterval;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.Vector3 noisyOffset
    // Size: 0xC
    // Offset: 0x44
    ::UnityEngine::Vector3 noisyOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 ghostOffsetGrabbingLocal
    // Size: 0xC
    // Offset: 0x50
    ::UnityEngine::Vector3 ghostOffsetGrabbingLocal;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Single emergeStartedTimestamp
    // Size: 0x4
    // Offset: 0x5C
    float emergeStartedTimestamp;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single grabTimestamp
    // Size: 0x4
    // Offset: 0x60
    float grabTimestamp;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single lastSpeedIncreased
    // Size: 0x4
    // Offset: 0x64
    float lastSpeedIncreased;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single totalTimeToEmerge
    // Size: 0x4
    // Offset: 0x68
    float totalTimeToEmerge;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single catchDistance
    // Size: 0x4
    // Offset: 0x6C
    float catchDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single grabDuration
    // Size: 0x4
    // Offset: 0x70
    float grabDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single grabSpeed
    // Size: 0x4
    // Offset: 0x74
    float grabSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single minGrabCooldown
    // Size: 0x4
    // Offset: 0x78
    float minGrabCooldown;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single initialRangeLimit
    // Size: 0x4
    // Offset: 0x7C
    float initialRangeLimit;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single finalRangeLimit
    // Size: 0x4
    // Offset: 0x80
    float finalRangeLimit;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single rangeLimitBlendDuration
    // Size: 0x4
    // Offset: 0x84
    float rangeLimitBlendDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single boredAfterDuration
    // Size: 0x4
    // Offset: 0x88
    float boredAfterDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: boredAfterDuration and: targetPlayer
    char __padding18[0x4] = {};
    // public Photon.Realtime.Player targetPlayer
    // Size: 0x8
    // Offset: 0x90
    ::Photon::Realtime::Player* targetPlayer;
    // Field size check
    static_assert(sizeof(::Photon::Realtime::Player*) == 0x8);
    // public AngryBeeAnimator beeAnimator
    // Size: 0x8
    // Offset: 0x98
    ::GlobalNamespace::AngryBeeAnimator* beeAnimator;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::AngryBeeAnimator*) == 0x8);
    // public AngryBeeSwarm/ChaseState currentState
    // Size: 0x4
    // Offset: 0xA0
    ::GlobalNamespace::AngryBeeSwarm::ChaseState currentState;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::AngryBeeSwarm::ChaseState) == 0x4);
    // public AngryBeeSwarm/ChaseState lastState
    // Size: 0x4
    // Offset: 0xA4
    ::GlobalNamespace::AngryBeeSwarm::ChaseState lastState;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::AngryBeeSwarm::ChaseState) == 0x4);
    // public Photon.Realtime.Player grabbedPlayer
    // Size: 0x8
    // Offset: 0xA8
    ::Photon::Realtime::Player* grabbedPlayer;
    // Field size check
    static_assert(sizeof(::Photon::Realtime::Player*) == 0x8);
    // private System.Boolean targetIsOnNavMesh
    // Size: 0x1
    // Offset: 0xB0
    bool targetIsOnNavMesh;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: targetIsOnNavMesh and: hapticStrength
    char __padding24[0x3] = {};
    // public System.Single hapticStrength
    // Size: 0x4
    // Offset: 0xB4
    float hapticStrength;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single hapticDuration
    // Size: 0x4
    // Offset: 0xB8
    float hapticDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single MinHeightAboveWater
    // Size: 0x4
    // Offset: 0xBC
    float MinHeightAboveWater;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single PlayerMinHeightAboveWater
    // Size: 0x4
    // Offset: 0xC0
    float PlayerMinHeightAboveWater;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single RefreshClosestPlayerInterval
    // Size: 0x4
    // Offset: 0xC4
    float RefreshClosestPlayerInterval;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single NextRefreshClosestPlayerTimestamp
    // Size: 0x4
    // Offset: 0xC8
    float NextRefreshClosestPlayerTimestamp;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single BoredToDeathAtTimestamp
    // Size: 0x4
    // Offset: 0xCC
    float BoredToDeathAtTimestamp;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Transform testEmergeFrom
    // Size: 0x8
    // Offset: 0xD0
    ::UnityEngine::Transform* testEmergeFrom;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform testEmergeTo
    // Size: 0x8
    // Offset: 0xD8
    ::UnityEngine::Transform* testEmergeTo;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Vector3 emergeFromPosition
    // Size: 0xC
    // Offset: 0xE0
    ::UnityEngine::Vector3 emergeFromPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 emergeToPosition
    // Size: 0xC
    // Offset: 0xEC
    ::UnityEngine::Vector3 emergeToPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.AI.NavMeshPath path
    // Size: 0x8
    // Offset: 0xF8
    ::UnityEngine::AI::NavMeshPath* path;
    // Field size check
    static_assert(sizeof(::UnityEngine::AI::NavMeshPath*) == 0x8);
    // public System.Collections.Generic.List`1<UnityEngine.Vector3> pathPoints
    // Size: 0x8
    // Offset: 0x100
    ::System::Collections::Generic::List_1<::UnityEngine::Vector3>* pathPoints;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Vector3>*) == 0x8);
    // public System.Int32 currentPathPointIdx
    // Size: 0x4
    // Offset: 0x108
    int currentPathPointIdx;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single nextPathTimestamp
    // Size: 0x4
    // Offset: 0x10C
    float nextPathTimestamp;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Creating interface conversion operator: operator ::Photon::Pun::IPunObservable
    operator ::Photon::Pun::IPunObservable() noexcept {
      return *reinterpret_cast<::Photon::Pun::IPunObservable*>(this);
    }
    // Creating interface conversion operator: operator ::Photon::Pun::IOnPhotonViewOwnerChange
    operator ::Photon::Pun::IOnPhotonViewOwnerChange() noexcept {
      return *reinterpret_cast<::Photon::Pun::IOnPhotonViewOwnerChange*>(this);
    }
    // Get static field: static public AngryBeeSwarm instance
    static ::GlobalNamespace::AngryBeeSwarm* _get_instance();
    // Set static field: static public AngryBeeSwarm instance
    static void _set_instance(::GlobalNamespace::AngryBeeSwarm* value);
    // static field const value: static private System.Single navMeshSampleRange
    static constexpr const float navMeshSampleRange = 5;
