// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
// Including type: UnityEngine.Quaternion
#include "UnityEngine/Quaternion.hpp"
// Including type: ShaderHashId
#include "GlobalNamespace/ShaderHashId.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: MeshRenderer
  class MeshRenderer;
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: Color
  struct Color;
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: ButterflySwarmManager
  class ButterflySwarmManager;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: AnimatedButterfly
  struct AnimatedButterfly;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::AnimatedButterfly, "", "AnimatedButterfly");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x75
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: AnimatedButterfly
  // [TokenAttribute] Offset: FFFFFFFF
  struct AnimatedButterfly/*, public ::System::ValueType*/ {
    public:
    // Nested type: ::GlobalNamespace::AnimatedButterfly::TimedDestination
    struct TimedDestination;
    // Size: 0x10
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: AnimatedButterfly/TimedDestination
    // [TokenAttribute] Offset: FFFFFFFF
    struct TimedDestination/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.Single syncTime
      // Size: 0x4
      // Offset: 0x0
      float syncTime;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Single syncEndTime
      // Size: 0x4
      // Offset: 0x4
      float syncEndTime;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public UnityEngine.GameObject destination
      // Size: 0x8
      // Offset: 0x8
      ::UnityEngine::GameObject* destination;
      // Field size check
      static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
      public:
      // Creating value type constructor for type: TimedDestination
      constexpr TimedDestination(float syncTime_ = {}, float syncEndTime_ = {}, ::UnityEngine::GameObject* destination_ = {}) noexcept : syncTime{syncTime_}, syncEndTime{syncEndTime_}, destination{destination_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public System.Single syncTime
      [[deprecated("Use field access instead!")]] float& dyn_syncTime();
      // Get instance field reference: public System.Single syncEndTime
      [[deprecated("Use field access instead!")]] float& dyn_syncEndTime();
      // Get instance field reference: public UnityEngine.GameObject destination
      [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_destination();
    }; // AnimatedButterfly/TimedDestination
    #pragma pack(pop)
    static check_size<sizeof(AnimatedButterfly::TimedDestination), 8 + sizeof(::UnityEngine::GameObject*)> __GlobalNamespace_AnimatedButterfly_TimedDestinationSizeCheck;
    static_assert(sizeof(AnimatedButterfly::TimedDestination) == 0x10);
    public:
    // private System.Collections.Generic.List`1<AnimatedButterfly/TimedDestination> destinationCache
    // Size: 0x8
    // Offset: 0x0
    ::System::Collections::Generic::List_1<::GlobalNamespace::AnimatedButterfly::TimedDestination>* destinationCache;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GlobalNamespace::AnimatedButterfly::TimedDestination>*) == 0x8);
    // private AnimatedButterfly/TimedDestination destinationA
    // Size: 0x10
    // Offset: 0x8
    ::GlobalNamespace::AnimatedButterfly::TimedDestination destinationA;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::AnimatedButterfly::TimedDestination) == 0x10);
    // private AnimatedButterfly/TimedDestination destinationB
    // Size: 0x10
    // Offset: 0x18
    ::GlobalNamespace::AnimatedButterfly::TimedDestination destinationB;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::AnimatedButterfly::TimedDestination) == 0x10);
    // private System.Single loopDuration
    // Size: 0x4
    // Offset: 0x28
    float loopDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector3 oldPosition
    // Size: 0xC
    // Offset: 0x2C
    ::UnityEngine::Vector3 oldPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 velocity
    // Size: 0xC
    // Offset: 0x38
    ::UnityEngine::Vector3 velocity;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // Padding between fields: velocity and: visual
    char __padding5[0x4] = {};
    // public UnityEngine.MeshRenderer visual
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::MeshRenderer* visual;
    // Field size check
    static_assert(sizeof(::UnityEngine::MeshRenderer*) == 0x8);
    // private UnityEngine.Material material
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::Material* material;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private System.Single speed
    // Size: 0x4
    // Offset: 0x58
    float speed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single maxTravelTime
    // Size: 0x4
    // Offset: 0x5C
    float maxTravelTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Quaternion travellingLocalRotation
    // Size: 0x10
    // Offset: 0x60
    ::UnityEngine::Quaternion travellingLocalRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private System.Single baseFlapSpeed
    // Size: 0x4
    // Offset: 0x70
    float baseFlapSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean wasPerched
    // Size: 0x1
    // Offset: 0x74
    bool wasPerched;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating value type constructor for type: AnimatedButterfly
    constexpr AnimatedButterfly(::System::Collections::Generic::List_1<::GlobalNamespace::AnimatedButterfly::TimedDestination>* destinationCache_ = {}, ::GlobalNamespace::AnimatedButterfly::TimedDestination destinationA_ = {}, ::GlobalNamespace::AnimatedButterfly::TimedDestination destinationB_ = {}, float loopDuration_ = {}, ::UnityEngine::Vector3 oldPosition_ = {}, ::UnityEngine::Vector3 velocity_ = {}, ::UnityEngine::MeshRenderer* visual_ = {}, ::UnityEngine::Material* material_ = {}, float speed_ = {}, float maxTravelTime_ = {}, ::UnityEngine::Quaternion travellingLocalRotation_ = {}, float baseFlapSpeed_ = {}, bool wasPerched_ = {}) noexcept : destinationCache{destinationCache_}, destinationA{destinationA_}, destinationB{destinationB_}, loopDuration{loopDuration_}, oldPosition{oldPosition_}, velocity{velocity_}, visual{visual_}, material{material_}, speed{speed_}, maxTravelTime{maxTravelTime_}, travellingLocalRotation{travellingLocalRotation_}, baseFlapSpeed{baseFlapSpeed_}, wasPerched{wasPerched_} {}
    // Creating interface conversion operator: operator ::System::ValueType
    operator ::System::ValueType() noexcept {
      return *reinterpret_cast<::System::ValueType*>(this);
    }
    // Get static field: static private ShaderHashId _BaseColor
    static ::GlobalNamespace::ShaderHashId _get__BaseColor();
    // Set static field: static private ShaderHashId _BaseColor
    static void _set__BaseColor(::GlobalNamespace::ShaderHashId value);
    // Get static field: static private ShaderHashId _VertexFlapPhaseOffset
    static ::GlobalNamespace::ShaderHashId _get__VertexFlapPhaseOffset();
    // Set static field: static private ShaderHashId _VertexFlapPhaseOffset
    static void _set__VertexFlapPhaseOffset(::GlobalNamespace::ShaderHashId value);
    // Get static field: static private ShaderHashId _VertexFlapSpeed
    static ::GlobalNamespace::ShaderHashId _get__VertexFlapSpeed();
    // Set static field: static private ShaderHashId _VertexFlapSpeed
    static void _set__VertexFlapSpeed(::GlobalNamespace::ShaderHashId value);
    // Get instance field reference: private System.Collections.Generic.List`1<AnimatedButterfly/TimedDestination> destinationCache
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::GlobalNamespace::AnimatedButterfly::TimedDestination>*& dyn_destinationCache();
    // Get instance field reference: private AnimatedButterfly/TimedDestination destinationA
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::AnimatedButterfly::TimedDestination& dyn_destinationA();
    // Get instance field reference: private AnimatedButterfly/TimedDestination destinationB
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::AnimatedButterfly::TimedDestination& dyn_destinationB();
    // Get instance field reference: private System.Single loopDuration
    [[deprecated("Use field access instead!")]] float& dyn_loopDuration();
    // Get instance field reference: private UnityEngine.Vector3 oldPosition
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_oldPosition();
    // Get instance field reference: private UnityEngine.Vector3 velocity
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_velocity();
    // Get instance field reference: public UnityEngine.MeshRenderer visual
    [[deprecated("Use field access instead!")]] ::UnityEngine::MeshRenderer*& dyn_visual();
    // Get instance field reference: private UnityEngine.Material material
    [[deprecated("Use field access instead!")]] ::UnityEngine::Material*& dyn_material();
    // Get instance field reference: private System.Single speed
    [[deprecated("Use field access instead!")]] float& dyn_speed();
    // Get instance field reference: private System.Single maxTravelTime
    [[deprecated("Use field access instead!")]] float& dyn_maxTravelTime();
    // Get instance field reference: private UnityEngine.Quaternion travellingLocalRotation
    [[deprecated("Use field access instead!")]] ::UnityEngine::Quaternion& dyn_travellingLocalRotation();
    // Get instance field reference: private System.Single baseFlapSpeed
    [[deprecated("Use field access instead!")]] float& dyn_baseFlapSpeed();
    // Get instance field reference: private System.Boolean wasPerched
    [[deprecated("Use field access instead!")]] bool& dyn_wasPerched();
    // public System.Void UpdateVisual(System.Single syncTime, ButterflySwarmManager manager)
    // Offset: 0x2784F6C
    void UpdateVisual(float syncTime, ::GlobalNamespace::ButterflySwarmManager* manager);
    // public System.Void GetPositionAndDestinationAtTime(System.Single syncTime, out UnityEngine.Vector3 idealPosition, out UnityEngine.Vector3 destination)
    // Offset: 0x2785A94
    void GetPositionAndDestinationAtTime(float syncTime, ByRef<::UnityEngine::Vector3> idealPosition, ByRef<::UnityEngine::Vector3> destination);
    // public System.Void InitVisual(UnityEngine.MeshRenderer prefab, ButterflySwarmManager manager)
    // Offset: 0x2785D00
    void InitVisual(::UnityEngine::MeshRenderer* prefab, ::GlobalNamespace::ButterflySwarmManager* manager);
    // public System.Void SetColor(UnityEngine.Color color)
    // Offset: 0x2785E18
    void SetColor(::UnityEngine::Color color);
    // public System.Void SetFlapSpeed(System.Single flapSpeed)
    // Offset: 0x2785EB8
    void SetFlapSpeed(float flapSpeed);
    // public System.Void InitRoute(System.Collections.Generic.List`1<UnityEngine.GameObject> route, System.Collections.Generic.List`1<System.Single> holdTimes, ButterflySwarmManager manager)
    // Offset: 0x2785F40
    void InitRoute(::System::Collections::Generic::List_1<::UnityEngine::GameObject*>* route, ::System::Collections::Generic::List_1<float>* holdTimes, ::GlobalNamespace::ButterflySwarmManager* manager);
    // static private System.Void .cctor()
    // Offset: 0x2786550
    static void _cctor();
  }; // AnimatedButterfly
  #pragma pack(pop)
  static check_size<sizeof(AnimatedButterfly), 116 + sizeof(bool)> __GlobalNamespace_AnimatedButterflySizeCheck;
  static_assert(sizeof(AnimatedButterfly) == 0x75);
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::AnimatedButterfly::TimedDestination, "", "AnimatedButterfly/TimedDestination");
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: GlobalNamespace::AnimatedButterfly::UpdateVisual
// Il2CppName: UpdateVisual
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::AnimatedButterfly::*)(float, ::GlobalNamespace::ButterflySwarmManager*)>(&GlobalNamespace::AnimatedButterfly::UpdateVisual)> {
  static const MethodInfo* get() {
    static auto* syncTime = &::il2cpp_utils::GetClassFromName("System", "Single")->byval_arg;
    static auto* manager = &::il2cpp_utils::GetClassFromName("", "ButterflySwarmManager")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::AnimatedButterfly), "UpdateVisual", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{syncTime, manager});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::AnimatedButterfly::GetPositionAndDestinationAtTime
// Il2CppName: GetPositionAndDestinationAtTime
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::AnimatedButterfly::*)(float, ByRef<::UnityEngine::Vector3>, ByRef<::UnityEngine::Vector3>)>(&GlobalNamespace::AnimatedButterfly::GetPositionAndDestinationAtTime)> {
  static const MethodInfo* get() {
    static auto* syncTime = &::il2cpp_utils::GetClassFromName("System", "Single")->byval_arg;
    static auto* idealPosition = &::il2cpp_utils::GetClassFromName("UnityEngine", "Vector3")->this_arg;
    static auto* destination = &::il2cpp_utils::GetClassFromName("UnityEngine", "Vector3")->this_arg;
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::AnimatedButterfly), "GetPositionAndDestinationAtTime", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{syncTime, idealPosition, destination});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::AnimatedButterfly::InitVisual
// Il2CppName: InitVisual
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::AnimatedButterfly::*)(::UnityEngine::MeshRenderer*, ::GlobalNamespace::ButterflySwarmManager*)>(&GlobalNamespace::AnimatedButterfly::InitVisual)> {
  static const MethodInfo* get() {
    static auto* prefab = &::il2cpp_utils::GetClassFromName("UnityEngine", "MeshRenderer")->byval_arg;
    static auto* manager = &::il2cpp_utils::GetClassFromName("", "ButterflySwarmManager")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::AnimatedButterfly), "InitVisual", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{prefab, manager});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::AnimatedButterfly::SetColor
// Il2CppName: SetColor
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::AnimatedButterfly::*)(::UnityEngine::Color)>(&GlobalNamespace::AnimatedButterfly::SetColor)> {
  static const MethodInfo* get() {
    static auto* color = &::il2cpp_utils::GetClassFromName("UnityEngine", "Color")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::AnimatedButterfly), "SetColor", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{color});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::AnimatedButterfly::SetFlapSpeed
// Il2CppName: SetFlapSpeed
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::AnimatedButterfly::*)(float)>(&GlobalNamespace::AnimatedButterfly::SetFlapSpeed)> {
  static const MethodInfo* get() {
    static auto* flapSpeed = &::il2cpp_utils::GetClassFromName("System", "Single")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::AnimatedButterfly), "SetFlapSpeed", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{flapSpeed});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::AnimatedButterfly::InitRoute
// Il2CppName: InitRoute
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::AnimatedButterfly::*)(::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*, ::System::Collections::Generic::List_1<float>*, ::GlobalNamespace::ButterflySwarmManager*)>(&GlobalNamespace::AnimatedButterfly::InitRoute)> {
  static const MethodInfo* get() {
    static auto* route = &::il2cpp_utils::MakeGeneric(::il2cpp_utils::GetClassFromName("System.Collections.Generic", "List`1"), ::std::vector<const Il2CppClass*>{::il2cpp_utils::GetClassFromName("UnityEngine", "GameObject")})->byval_arg;
    static auto* holdTimes = &::il2cpp_utils::MakeGeneric(::il2cpp_utils::GetClassFromName("System.Collections.Generic", "List`1"), ::std::vector<const Il2CppClass*>{::il2cpp_utils::GetClassFromName("System", "Single")})->byval_arg;
    static auto* manager = &::il2cpp_utils::GetClassFromName("", "ButterflySwarmManager")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::AnimatedButterfly), "InitRoute", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{route, holdTimes, manager});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::AnimatedButterfly::_cctor
// Il2CppName: .cctor
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (*)()>(&GlobalNamespace::AnimatedButterfly::_cctor)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::AnimatedButterfly), ".cctor", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
