// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Pathfinding.VersionedMonoBehaviour
#include "Pathfinding/VersionedMonoBehaviour.hpp"
// Including type: Pathfinding.GraphDebugMode
#include "Pathfinding/GraphDebugMode.hpp"
// Including type: Pathfinding.PathLog
#include "Pathfinding/PathLog.hpp"
// Including type: Pathfinding.Heuristic
#include "Pathfinding/Heuristic.hpp"
// Including type: Pathfinding.ThreadCount
#include "Pathfinding/ThreadCount.hpp"
// Including type: Pathfinding.PathProcessor/GraphUpdateLock
#include "Pathfinding/PathProcessor_GraphUpdateLock.hpp"
// Including type: Pathfinding.Progress
#include "Pathfinding/Progress.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
}
// Forward declaring namespace: Pathfinding
namespace Pathfinding {
  // Forward declaring type: AstarData
  class AstarData;
  // Forward declaring type: AstarColor
  class AstarColor;
  // Forward declaring type: PathHandler
  class PathHandler;
  // Forward declaring type: GraphUpdateProcessor
  class GraphUpdateProcessor;
  // Forward declaring type: HierarchicalGraph
  class HierarchicalGraph;
  // Forward declaring type: NavmeshUpdates
  class NavmeshUpdates;
  // Forward declaring type: WorkItemProcessor
  class WorkItemProcessor;
  // Skipping declaration: PathProcessor because it is already included!
  // Forward declaring type: PathReturnQueue
  class PathReturnQueue;
  // Forward declaring type: EuclideanEmbedding
  class EuclideanEmbedding;
  // Forward declaring type: OnGraphDelegate
  class OnGraphDelegate;
  // Forward declaring type: OnPathDelegate
  class OnPathDelegate;
  // Forward declaring type: OnScanDelegate
  class OnScanDelegate;
  // Forward declaring type: NNConstraint
  class NNConstraint;
  // Forward declaring type: NavGraph
  class NavGraph;
  // Forward declaring type: Path
  class Path;
  // Forward declaring type: IWorkItemContext
  class IWorkItemContext;
  // Forward declaring type: AstarWorkItem
  struct AstarWorkItem;
  // Forward declaring type: GraphUpdateObject
  class GraphUpdateObject;
  // Forward declaring type: GraphNode
  class GraphNode;
  // Forward declaring type: NNInfo
  struct NNInfo;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Version
  class Version;
  // Forward declaring type: Type
  class Type;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: Pathfinding::Util
namespace Pathfinding::Util {
  // Forward declaring type: RetainedGizmos
  class RetainedGizmos;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Bounds
  struct Bounds;
  // Skipping declaration: Vector3 because it is already included!
  // Forward declaring type: Ray
  struct Ray;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: IEnumerable`1<T>
  template<typename T>
  class IEnumerable_1;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: AstarPath
  class AstarPath;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::AstarPath);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::AstarPath*, "", "AstarPath");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x119
  #pragma pack(push, 1)
  // Autogenerated type: AstarPath
  // [TokenAttribute] Offset: FFFFFFFF
  // [HelpURLAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: FFFFFFFF
  // [ExecuteInEditMode] Offset: FFFFFFFF
  class AstarPath : public ::Pathfinding::VersionedMonoBehaviour {
    public:
    // Writing base type padding for base size: 0x24 to desired offset: 0x28
    char ___base_padding[0x4] = {};
    // Nested type: ::GlobalNamespace::AstarPath::AstarDistribution
    struct AstarDistribution;
    // Nested type: ::GlobalNamespace::AstarPath::$$c
    class $$c;
    // Nested type: ::GlobalNamespace::AstarPath::$$c__DisplayClass109_0
    class $$c__DisplayClass109_0;
    // Nested type: ::GlobalNamespace::AstarPath::$$c__DisplayClass144_0
    class $$c__DisplayClass144_0;
    // Nested type: ::GlobalNamespace::AstarPath::$$c__DisplayClass154_0
    class $$c__DisplayClass154_0;
    // Nested type: ::GlobalNamespace::AstarPath::$$c__DisplayClass97_0
    class $$c__DisplayClass97_0;
    // Nested type: ::GlobalNamespace::AstarPath::$DelayedGraphUpdate$d__110
    class $DelayedGraphUpdate$d__110;
    // Nested type: ::GlobalNamespace::AstarPath::$ScanAsync$d__143
    class $ScanAsync$d__143;
    // Nested type: ::GlobalNamespace::AstarPath::$ScanGraph$d__144
    class $ScanGraph$d__144;
    // Nested type: ::GlobalNamespace::AstarPath::$UpdateGraphsInternal$d__113
    class $UpdateGraphsInternal$d__113;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: AstarPath/AstarDistribution
    // [TokenAttribute] Offset: FFFFFFFF
    struct AstarDistribution/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: AstarDistribution
      constexpr AstarDistribution(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public AstarPath/AstarDistribution WebsiteDownload
      static constexpr const int WebsiteDownload = 0;
      // Get static field: static public AstarPath/AstarDistribution WebsiteDownload
      static ::GlobalNamespace::AstarPath::AstarDistribution _get_WebsiteDownload();
      // Set static field: static public AstarPath/AstarDistribution WebsiteDownload
      static void _set_WebsiteDownload(::GlobalNamespace::AstarPath::AstarDistribution value);
      // static field const value: static public AstarPath/AstarDistribution AssetStore
      static constexpr const int AssetStore = 1;
      // Get static field: static public AstarPath/AstarDistribution AssetStore
      static ::GlobalNamespace::AstarPath::AstarDistribution _get_AssetStore();
      // Set static field: static public AstarPath/AstarDistribution AssetStore
      static void _set_AssetStore(::GlobalNamespace::AstarPath::AstarDistribution value);
      // static field const value: static public AstarPath/AstarDistribution PackageManager
      static constexpr const int PackageManager = 2;
      // Get static field: static public AstarPath/AstarDistribution PackageManager
      static ::GlobalNamespace::AstarPath::AstarDistribution _get_PackageManager();
      // Set static field: static public AstarPath/AstarDistribution PackageManager
      static void _set_PackageManager(::GlobalNamespace::AstarPath::AstarDistribution value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // AstarPath/AstarDistribution
    #pragma pack(pop)
    static check_size<sizeof(AstarPath::AstarDistribution), 0 + sizeof(int)> __GlobalNamespace_AstarPath_AstarDistributionSizeCheck;
    static_assert(sizeof(AstarPath::AstarDistribution) == 0x4);
    public:
    // public Pathfinding.AstarData data
    // Size: 0x8
    // Offset: 0x28
    ::Pathfinding::AstarData* data;
    // Field size check
    static_assert(sizeof(::Pathfinding::AstarData*) == 0x8);
    // public System.Boolean showNavGraphs
    // Size: 0x1
    // Offset: 0x30
    bool showNavGraphs;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean showUnwalkableNodes
    // Size: 0x1
    // Offset: 0x31
    bool showUnwalkableNodes;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: showUnwalkableNodes and: debugMode
    char __padding2[0x2] = {};
    // public Pathfinding.GraphDebugMode debugMode
    // Size: 0x4
    // Offset: 0x34
    ::Pathfinding::GraphDebugMode debugMode;
    // Field size check
    static_assert(sizeof(::Pathfinding::GraphDebugMode) == 0x4);
    // public System.Single debugFloor
    // Size: 0x4
    // Offset: 0x38
    float debugFloor;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single debugRoof
    // Size: 0x4
    // Offset: 0x3C
    float debugRoof;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean manualDebugFloorRoof
    // Size: 0x1
    // Offset: 0x40
    bool manualDebugFloorRoof;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean showSearchTree
    // Size: 0x1
    // Offset: 0x41
    bool showSearchTree;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: showSearchTree and: unwalkableNodeDebugSize
    char __padding7[0x2] = {};
    // public System.Single unwalkableNodeDebugSize
    // Size: 0x4
    // Offset: 0x44
    float unwalkableNodeDebugSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public Pathfinding.PathLog logPathResults
    // Size: 0x4
    // Offset: 0x48
    ::Pathfinding::PathLog logPathResults;
    // Field size check
    static_assert(sizeof(::Pathfinding::PathLog) == 0x4);
    // public System.Single maxNearestNodeDistance
    // Size: 0x4
    // Offset: 0x4C
    float maxNearestNodeDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean scanOnStartup
    // Size: 0x1
    // Offset: 0x50
    bool scanOnStartup;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean fullGetNearestSearch
    // Size: 0x1
    // Offset: 0x51
    bool fullGetNearestSearch;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean prioritizeGraphs
    // Size: 0x1
    // Offset: 0x52
    bool prioritizeGraphs;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: prioritizeGraphs and: prioritizeGraphsLimit
    char __padding13[0x1] = {};
    // public System.Single prioritizeGraphsLimit
    // Size: 0x4
    // Offset: 0x54
    float prioritizeGraphsLimit;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public Pathfinding.AstarColor colorSettings
    // Size: 0x8
    // Offset: 0x58
    ::Pathfinding::AstarColor* colorSettings;
    // Field size check
    static_assert(sizeof(::Pathfinding::AstarColor*) == 0x8);
    // protected System.String[] tagNames
    // Size: 0x8
    // Offset: 0x60
    ::ArrayW<::StringW> tagNames;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // public Pathfinding.Heuristic heuristic
    // Size: 0x4
    // Offset: 0x68
    ::Pathfinding::Heuristic heuristic;
    // Field size check
    static_assert(sizeof(::Pathfinding::Heuristic) == 0x4);
    // public System.Single heuristicScale
    // Size: 0x4
    // Offset: 0x6C
    float heuristicScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public Pathfinding.ThreadCount threadCount
    // Size: 0x4
    // Offset: 0x70
    ::Pathfinding::ThreadCount threadCount;
    // Field size check
    static_assert(sizeof(::Pathfinding::ThreadCount) == 0x4);
    // public System.Single maxFrameTime
    // Size: 0x4
    // Offset: 0x74
    float maxFrameTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean batchGraphUpdates
    // Size: 0x1
    // Offset: 0x78
    bool batchGraphUpdates;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: batchGraphUpdates and: graphUpdateBatchingInterval
    char __padding21[0x3] = {};
    // public System.Single graphUpdateBatchingInterval
    // Size: 0x4
    // Offset: 0x7C
    float graphUpdateBatchingInterval;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <lastScanTime>k__BackingField
    // Size: 0x4
    // Offset: 0x80
    float lastScanTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: lastScanTime and: debugPathData
    char __padding23[0x4] = {};
    // public Pathfinding.PathHandler debugPathData
    // Size: 0x8
    // Offset: 0x88
    ::Pathfinding::PathHandler* debugPathData;
    // Field size check
    static_assert(sizeof(::Pathfinding::PathHandler*) == 0x8);
    // public System.UInt16 debugPathID
    // Size: 0x2
    // Offset: 0x90
    uint16_t debugPathID;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // Padding between fields: debugPathID and: inGameDebugPath
    char __padding25[0x6] = {};
    // private System.String inGameDebugPath
    // Size: 0x8
    // Offset: 0x98
    ::StringW inGameDebugPath;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean isScanningBacking
    // Size: 0x1
    // Offset: 0xA0
    bool isScanningBacking;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isScanningBacking and: OnGraphsWillBeUpdated
    char __padding27[0x7] = {};
    // public System.Action OnGraphsWillBeUpdated
    // Size: 0x8
    // Offset: 0xA8
    ::System::Action* OnGraphsWillBeUpdated;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // public System.Action OnGraphsWillBeUpdated2
    // Size: 0x8
    // Offset: 0xB0
    ::System::Action* OnGraphsWillBeUpdated2;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private readonly Pathfinding.GraphUpdateProcessor graphUpdates
    // Size: 0x8
    // Offset: 0xB8
    ::Pathfinding::GraphUpdateProcessor* graphUpdates;
    // Field size check
    static_assert(sizeof(::Pathfinding::GraphUpdateProcessor*) == 0x8);
    // readonly Pathfinding.HierarchicalGraph hierarchicalGraph
    // Size: 0x8
    // Offset: 0xC0
    ::Pathfinding::HierarchicalGraph* hierarchicalGraph;
    // Field size check
    static_assert(sizeof(::Pathfinding::HierarchicalGraph*) == 0x8);
    // public readonly Pathfinding.NavmeshUpdates navmeshUpdates
    // Size: 0x8
    // Offset: 0xC8
    ::Pathfinding::NavmeshUpdates* navmeshUpdates;
    // Field size check
    static_assert(sizeof(::Pathfinding::NavmeshUpdates*) == 0x8);
    // private readonly Pathfinding.WorkItemProcessor workItems
    // Size: 0x8
    // Offset: 0xD0
    ::Pathfinding::WorkItemProcessor* workItems;
    // Field size check
    static_assert(sizeof(::Pathfinding::WorkItemProcessor*) == 0x8);
    // private Pathfinding.PathProcessor pathProcessor
    // Size: 0x8
    // Offset: 0xD8
    ::Pathfinding::PathProcessor* pathProcessor;
    // Field size check
    static_assert(sizeof(::Pathfinding::PathProcessor*) == 0x8);
    // private System.Boolean graphUpdateRoutineRunning
    // Size: 0x1
    // Offset: 0xE0
    bool graphUpdateRoutineRunning;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean graphUpdatesWorkItemAdded
    // Size: 0x1
    // Offset: 0xE1
    bool graphUpdatesWorkItemAdded;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: graphUpdatesWorkItemAdded and: lastGraphUpdate
    char __padding36[0x2] = {};
    // private System.Single lastGraphUpdate
    // Size: 0x4
    // Offset: 0xE4
    float lastGraphUpdate;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private Pathfinding.PathProcessor/GraphUpdateLock workItemLock
    // Size: 0xC
    // Offset: 0xE8
    ::Pathfinding::PathProcessor::GraphUpdateLock workItemLock;
    // Field size check
    static_assert(sizeof(::Pathfinding::PathProcessor::GraphUpdateLock) == 0xC);
    // Padding between fields: workItemLock and: pathReturnQueue
    char __padding38[0x4] = {};
    // readonly Pathfinding.PathReturnQueue pathReturnQueue
    // Size: 0x8
    // Offset: 0xF8
    ::Pathfinding::PathReturnQueue* pathReturnQueue;
    // Field size check
    static_assert(sizeof(::Pathfinding::PathReturnQueue*) == 0x8);
    // public Pathfinding.EuclideanEmbedding euclideanEmbedding
    // Size: 0x8
    // Offset: 0x100
    ::Pathfinding::EuclideanEmbedding* euclideanEmbedding;
    // Field size check
    static_assert(sizeof(::Pathfinding::EuclideanEmbedding*) == 0x8);
    // public System.Boolean showGraphs
    // Size: 0x1
    // Offset: 0x108
    bool showGraphs;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: showGraphs and: nextFreePathID
    char __padding41[0x1] = {};
    // private System.UInt16 nextFreePathID
    // Size: 0x2
    // Offset: 0x10A
    uint16_t nextFreePathID;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // Padding between fields: nextFreePathID and: gizmos
    char __padding42[0x4] = {};
    // private Pathfinding.Util.RetainedGizmos gizmos
    // Size: 0x8
    // Offset: 0x110
    ::Pathfinding::Util::RetainedGizmos* gizmos;
    // Field size check
    static_assert(sizeof(::Pathfinding::Util::RetainedGizmos*) == 0x8);
    // private System.Boolean initialized
    // Size: 0x1
    // Offset: 0x118
    bool initialized;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get static field: static public readonly System.Version Version
    static ::System::Version* _get_Version();
    // Set static field: static public readonly System.Version Version
    static void _set_Version(::System::Version* value);
    // Get static field: static public readonly AstarPath/AstarDistribution Distribution
    static ::GlobalNamespace::AstarPath::AstarDistribution _get_Distribution();
    // Set static field: static public readonly AstarPath/AstarDistribution Distribution
    static void _set_Distribution(::GlobalNamespace::AstarPath::AstarDistribution value);
    // Get static field: static public readonly System.String Branch
    static ::StringW _get_Branch();
    // Set static field: static public readonly System.String Branch
    static void _set_Branch(::StringW value);
    // Get static field: static public AstarPath active
