// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: TransferrableObject
#include "GlobalNamespace/TransferrableObject.hpp"
// Including type: IFXContext
#include "GlobalNamespace/IFXContext.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Collider
  class Collider;
  // Forward declaring type: Renderer
  class Renderer;
  // Forward declaring type: LineRenderer
  class LineRenderer;
  // Forward declaring type: Rigidbody
  class Rigidbody;
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: AudioSource
  class AudioSource;
  // Forward declaring type: Collision
  class Collision;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: ITetheredObjectBehavior
  class ITetheredObjectBehavior;
  // Forward declaring type: FXSystemSettings
  class FXSystemSettings;
}
// Forward declaring namespace: Photon::Realtime
namespace Photon::Realtime {
  // Forward declaring type: Player
  class Player;
}
// Forward declaring namespace: GorillaLocomotion::Swimming
namespace GorillaLocomotion::Swimming {
  // Forward declaring type: WaterVolume
  class WaterVolume;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: BalloonHoldable
  class BalloonHoldable;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::BalloonHoldable);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::BalloonHoldable*, "", "BalloonHoldable");
// Type namespace: 
namespace GlobalNamespace {
  // WARNING Size may be invalid!
  // Autogenerated type: BalloonHoldable
  // [TokenAttribute] Offset: FFFFFFFF
  class BalloonHoldable : public ::GlobalNamespace::TransferrableObject/*, public ::GlobalNamespace::IFXContext*/ {
    public:
    // Nested type: ::GlobalNamespace::BalloonHoldable::BalloonStates
    struct BalloonStates;
    // Nested type: ::GlobalNamespace::BalloonHoldable::$$c
    class $$c;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: BalloonHoldable/BalloonStates
    // [TokenAttribute] Offset: FFFFFFFF
    struct BalloonStates/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: BalloonStates
      constexpr BalloonStates(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public BalloonHoldable/BalloonStates Normal
      static constexpr const int Normal = 0;
      // Get static field: static public BalloonHoldable/BalloonStates Normal
      static ::GlobalNamespace::BalloonHoldable::BalloonStates _get_Normal();
      // Set static field: static public BalloonHoldable/BalloonStates Normal
      static void _set_Normal(::GlobalNamespace::BalloonHoldable::BalloonStates value);
      // static field const value: static public BalloonHoldable/BalloonStates Pop
      static constexpr const int Pop = 1;
      // Get static field: static public BalloonHoldable/BalloonStates Pop
      static ::GlobalNamespace::BalloonHoldable::BalloonStates _get_Pop();
      // Set static field: static public BalloonHoldable/BalloonStates Pop
      static void _set_Pop(::GlobalNamespace::BalloonHoldable::BalloonStates value);
      // static field const value: static public BalloonHoldable/BalloonStates Waiting
      static constexpr const int Waiting = 2;
      // Get static field: static public BalloonHoldable/BalloonStates Waiting
      static ::GlobalNamespace::BalloonHoldable::BalloonStates _get_Waiting();
      // Set static field: static public BalloonHoldable/BalloonStates Waiting
      static void _set_Waiting(::GlobalNamespace::BalloonHoldable::BalloonStates value);
      // static field const value: static public BalloonHoldable/BalloonStates WaitForOwnershipTransfer
      static constexpr const int WaitForOwnershipTransfer = 3;
      // Get static field: static public BalloonHoldable/BalloonStates WaitForOwnershipTransfer
      static ::GlobalNamespace::BalloonHoldable::BalloonStates _get_WaitForOwnershipTransfer();
      // Set static field: static public BalloonHoldable/BalloonStates WaitForOwnershipTransfer
      static void _set_WaitForOwnershipTransfer(::GlobalNamespace::BalloonHoldable::BalloonStates value);
      // static field const value: static public BalloonHoldable/BalloonStates WaitForReDock
      static constexpr const int WaitForReDock = 4;
      // Get static field: static public BalloonHoldable/BalloonStates WaitForReDock
      static ::GlobalNamespace::BalloonHoldable::BalloonStates _get_WaitForReDock();
      // Set static field: static public BalloonHoldable/BalloonStates WaitForReDock
      static void _set_WaitForReDock(::GlobalNamespace::BalloonHoldable::BalloonStates value);
      // static field const value: static public BalloonHoldable/BalloonStates Refilling
      static constexpr const int Refilling = 5;
      // Get static field: static public BalloonHoldable/BalloonStates Refilling
      static ::GlobalNamespace::BalloonHoldable::BalloonStates _get_Refilling();
      // Set static field: static public BalloonHoldable/BalloonStates Refilling
      static void _set_Refilling(::GlobalNamespace::BalloonHoldable::BalloonStates value);
      // static field const value: static public BalloonHoldable/BalloonStates Returning
      static constexpr const int Returning = 6;
      // Get static field: static public BalloonHoldable/BalloonStates Returning
      static ::GlobalNamespace::BalloonHoldable::BalloonStates _get_Returning();
      // Set static field: static public BalloonHoldable/BalloonStates Returning
      static void _set_Returning(::GlobalNamespace::BalloonHoldable::BalloonStates value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // BalloonHoldable/BalloonStates
    #pragma pack(pop)
    static check_size<sizeof(BalloonHoldable::BalloonStates), 0 + sizeof(int)> __GlobalNamespace_BalloonHoldable_BalloonStatesSizeCheck;
    static_assert(sizeof(BalloonHoldable::BalloonStates) == 0x4);
    public:
    // private ITetheredObjectBehavior balloonDynamics
    // Size: 0x8
    // Offset: 0x2D0
    ::GlobalNamespace::ITetheredObjectBehavior* balloonDynamics;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ITetheredObjectBehavior*) == 0x8);
    // private UnityEngine.Renderer mesh
    // Size: 0x8
    // Offset: 0x2D8
    ::UnityEngine::Renderer* mesh;
    // Field size check
    static_assert(sizeof(::UnityEngine::Renderer*) == 0x8);
    // private UnityEngine.LineRenderer lineRenderer
    // Size: 0x8
    // Offset: 0x2E0
    ::UnityEngine::LineRenderer* lineRenderer;
    // Field size check
    static_assert(sizeof(::UnityEngine::LineRenderer*) == 0x8);
    // private UnityEngine.Rigidbody rb
    // Size: 0x8
    // Offset: 0x2E8
    ::UnityEngine::Rigidbody* rb;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rigidbody*) == 0x8);
    // private Photon.Realtime.Player originalOwner
    // Size: 0x8
    // Offset: 0x2F0
    ::Photon::Realtime::Player* originalOwner;
    // Field size check
    static_assert(sizeof(::Photon::Realtime::Player*) == 0x8);
    // public UnityEngine.GameObject balloonPopFXPrefab
    // Size: 0x8
    // Offset: 0x2F8
    ::UnityEngine::GameObject* balloonPopFXPrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.Color balloonPopFXColor
    // Size: 0x10
    // Offset: 0x300
    ::UnityEngine::Color balloonPopFXColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private System.Single timer
    // Size: 0x4
    // Offset: 0x310
    float timer;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single scaleTimerLength
    // Size: 0x4
    // Offset: 0x314
    float scaleTimerLength;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single poppedTimerLength
    // Size: 0x4
    // Offset: 0x318
    float poppedTimerLength;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single beginScale
    // Size: 0x4
    // Offset: 0x31C
    float beginScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single bopSpeed
    // Size: 0x4
    // Offset: 0x320
    float bopSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector3 localScale
    // Size: 0xC
    // Offset: 0x324
    ::UnityEngine::Vector3 localScale;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.AudioSource balloonBopSource
    // Size: 0x8
    // Offset: 0x330
    ::UnityEngine::AudioSource* balloonBopSource;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // public UnityEngine.AudioSource balloonInflatSource
    // Size: 0x8
    // Offset: 0x338
    ::UnityEngine::AudioSource* balloonInflatSource;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // private UnityEngine.Vector3 forceAppliedAsRemote
    // Size: 0xC
    // Offset: 0x340
    ::UnityEngine::Vector3 forceAppliedAsRemote;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 collisionPtAsRemote
    // Size: 0xC
    // Offset: 0x34C
    ::UnityEngine::Vector3 collisionPtAsRemote;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private GorillaLocomotion.Swimming.WaterVolume waterVolume
    // Size: 0x8
    // Offset: 0x358
    ::GorillaLocomotion::Swimming::WaterVolume* waterVolume;
    // Field size check
    static_assert(sizeof(::GorillaLocomotion::Swimming::WaterVolume*) == 0x8);
    // private BalloonHoldable/BalloonStates balloonState
    // Size: 0x4
    // Offset: 0x360
    ::GlobalNamespace::BalloonHoldable::BalloonStates balloonState;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BalloonHoldable::BalloonStates) == 0x4);
    // private System.Single returnTimer
    // Size: 0x4
    // Offset: 0x364
    float returnTimer;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single lastOwnershipRequest
    // Size: 0x4
    // Offset: 0x368
    float lastOwnershipRequest;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean disableCollisionHandling
    // Size: 0x1
    // Offset: 0x36C
    bool disableCollisionHandling;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean disableRelease
    // Size: 0x1
    // Offset: 0x36D
    bool disableRelease;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating interface conversion operator: operator ::GlobalNamespace::IFXContext
    operator ::GlobalNamespace::IFXContext() noexcept {
      return *reinterpret_cast<::GlobalNamespace::IFXContext*>(this);
    }
    // Get instance field reference: private ITetheredObjectBehavior balloonDynamics
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::ITetheredObjectBehavior*& dyn_balloonDynamics();
    // Get instance field reference: private UnityEngine.Renderer mesh
    [[deprecated("Use field access instead!")]] ::UnityEngine::Renderer*& dyn_mesh();
    // Get instance field reference: private UnityEngine.LineRenderer lineRenderer
    [[deprecated("Use field access instead!")]] ::UnityEngine::LineRenderer*& dyn_lineRenderer();
    // Get instance field reference: private UnityEngine.Rigidbody rb
