// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Photon.Pun.MonoBehaviourPun
#include "Photon/Pun/MonoBehaviourPun.hpp"
// Including type: XSceneRef
#include "GlobalNamespace/XSceneRef.hpp"
// Including type: AnimatedBee
#include "GlobalNamespace/AnimatedBee.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: MeshRenderer
  class MeshRenderer;
  // Forward declaring type: AudioSource
  class AudioSource;
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Transform
  class Transform;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: BeePerchPoint
  class BeePerchPoint;
  // Forward declaring type: SRand
  struct SRand;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: BeeSwarmManager
  class BeeSwarmManager;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::BeeSwarmManager);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::BeeSwarmManager*, "", "BeeSwarmManager");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0xA8
  #pragma pack(push, 1)
  // Autogenerated type: BeeSwarmManager
  // [TokenAttribute] Offset: FFFFFFFF
  class BeeSwarmManager : public ::Photon::Pun::MonoBehaviourPun {
    public:
    public:
    // private XSceneRef[] flowerSections
    // Size: 0x8
    // Offset: 0x28
    ::ArrayW<::GlobalNamespace::XSceneRef> flowerSections;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::XSceneRef>) == 0x8);
    // private System.Int32 loopSizePerBee
    // Size: 0x4
    // Offset: 0x30
    int loopSizePerBee;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 numBees
    // Size: 0x4
    // Offset: 0x34
    int numBees;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.MeshRenderer beePrefab
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::MeshRenderer* beePrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::MeshRenderer*) == 0x8);
    // private UnityEngine.AudioSource nearbyBeeBuzz
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::AudioSource* nearbyBeeBuzz;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // private UnityEngine.AudioSource generalBeeBuzz
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::AudioSource* generalBeeBuzz;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // private UnityEngine.GameObject[] flowerSectionsResolved
    // Size: 0x8
    // Offset: 0x50
    ::ArrayW<::UnityEngine::GameObject*> flowerSectionsResolved;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // private BeePerchPoint <BeeHive>k__BackingField
    // Size: 0x8
    // Offset: 0x58
    ::GlobalNamespace::BeePerchPoint* BeeHive;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BeePerchPoint*) == 0x8);
    // private System.Single <BeeSpeed>k__BackingField
    // Size: 0x4
    // Offset: 0x60
    float BeeSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <BeeMaxTravelTime>k__BackingField
    // Size: 0x4
    // Offset: 0x64
    float BeeMaxTravelTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <BeeAcceleration>k__BackingField
    // Size: 0x4
    // Offset: 0x68
    float BeeAcceleration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <BeeJitterStrength>k__BackingField
    // Size: 0x4
    // Offset: 0x6C
    float BeeJitterStrength;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <BeeJitterDamping>k__BackingField
    // Size: 0x4
    // Offset: 0x70
    float BeeJitterDamping;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <BeeMaxJitterRadius>k__BackingField
    // Size: 0x4
    // Offset: 0x74
    float BeeMaxJitterRadius;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <BeeNearDestinationRadius>k__BackingField
    // Size: 0x4
    // Offset: 0x78
    float BeeNearDestinationRadius;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <AvoidPointRadius>k__BackingField
    // Size: 0x4
    // Offset: 0x7C
    float AvoidPointRadius;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <BeeMinFlowerDuration>k__BackingField
    // Size: 0x4
    // Offset: 0x80
    float BeeMinFlowerDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <BeeMaxFlowerDuration>k__BackingField
    // Size: 0x4
    // Offset: 0x84
    float BeeMaxFlowerDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <GeneralBuzzRange>k__BackingField
    // Size: 0x4
    // Offset: 0x88
    float GeneralBuzzRange;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: GeneralBuzzRange and: bees
    char __padding18[0x4] = {};
    // private System.Collections.Generic.List`1<AnimatedBee> bees
    // Size: 0x8
    // Offset: 0x90
    ::System::Collections::Generic::List_1<::GlobalNamespace::AnimatedBee>* bees;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GlobalNamespace::AnimatedBee>*) == 0x8);
    // private UnityEngine.Transform playerCamera
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::Transform* playerCamera;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private System.Collections.Generic.List`1<BeePerchPoint> allPerchPoints
    // Size: 0x8
    // Offset: 0xA0
    ::System::Collections::Generic::List_1<::GlobalNamespace::BeePerchPoint*>* allPerchPoints;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GlobalNamespace::BeePerchPoint*>*) == 0x8);
    public:
    // Get static field: static public readonly System.Collections.Generic.List`1<UnityEngine.GameObject> avoidPoints
    static ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>* _get_avoidPoints();
    // Set static field: static public readonly System.Collections.Generic.List`1<UnityEngine.GameObject> avoidPoints
    static void _set_avoidPoints(::System::Collections::Generic::List_1<::UnityEngine::GameObject*>* value);
    // Get instance field reference: private XSceneRef[] flowerSections
    [[deprecated("Use field access instead!")]] ::ArrayW<::GlobalNamespace::XSceneRef>& dyn_flowerSections();
    // Get instance field reference: private System.Int32 loopSizePerBee
