// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: ITimeOfDaySystem
#include "GlobalNamespace/ITimeOfDaySystem.hpp"
// Including type: TimeSettings
#include "GlobalNamespace/TimeSettings.hpp"
// Including type: ShaderHashId
#include "GlobalNamespace/ShaderHashId.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: AddCollidersToParticleSystemTriggers
  class AddCollidersToParticleSystemTriggers;
  // Forward declaring type: PerSceneRenderData
  class PerSceneRenderData;
  // Skipping declaration: WeatherType because it is already included!
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Shader
  class Shader;
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: Texture2D
  class Texture2D;
  // Forward declaring type: Collider
  class Collider;
  // Forward declaring type: Coroutine
  class Coroutine;
  // Forward declaring type: Vector4
  struct Vector4;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Random
  class Random;
  // Forward declaring type: Action
  class Action;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: BetterDayNightManager
  class BetterDayNightManager;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::BetterDayNightManager);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::BetterDayNightManager*, "", "BetterDayNightManager");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x248
  #pragma pack(push, 1)
  // Autogenerated type: BetterDayNightManager
  // [TokenAttribute] Offset: FFFFFFFF
  class BetterDayNightManager : public ::UnityEngine::MonoBehaviour/*, public ::GlobalNamespace::ITimeOfDaySystem*/ {
    public:
    // Nested type: ::GlobalNamespace::BetterDayNightManager::WeatherType
    struct WeatherType;
    // Nested type: ::GlobalNamespace::BetterDayNightManager::ScheduledEvent
    class ScheduledEvent;
    // Nested type: ::GlobalNamespace::BetterDayNightManager::$AnimateLightFlashCo$d__104
    class $AnimateLightFlashCo$d__104;
    // Nested type: ::GlobalNamespace::BetterDayNightManager::$UpdateTimeOfDay$d__79
    class $UpdateTimeOfDay$d__79;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: BetterDayNightManager/WeatherType
    // [TokenAttribute] Offset: FFFFFFFF
    struct WeatherType/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: WeatherType
      constexpr WeatherType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public BetterDayNightManager/WeatherType None
      static constexpr const int None = 0;
      // Get static field: static public BetterDayNightManager/WeatherType None
      static ::GlobalNamespace::BetterDayNightManager::WeatherType _get_None();
      // Set static field: static public BetterDayNightManager/WeatherType None
      static void _set_None(::GlobalNamespace::BetterDayNightManager::WeatherType value);
      // static field const value: static public BetterDayNightManager/WeatherType Raining
      static constexpr const int Raining = 1;
      // Get static field: static public BetterDayNightManager/WeatherType Raining
      static ::GlobalNamespace::BetterDayNightManager::WeatherType _get_Raining();
      // Set static field: static public BetterDayNightManager/WeatherType Raining
      static void _set_Raining(::GlobalNamespace::BetterDayNightManager::WeatherType value);
      // static field const value: static public BetterDayNightManager/WeatherType All
      static constexpr const int All = 2;
      // Get static field: static public BetterDayNightManager/WeatherType All
      static ::GlobalNamespace::BetterDayNightManager::WeatherType _get_All();
      // Set static field: static public BetterDayNightManager/WeatherType All
      static void _set_All(::GlobalNamespace::BetterDayNightManager::WeatherType value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // BetterDayNightManager/WeatherType
    #pragma pack(pop)
    static check_size<sizeof(BetterDayNightManager::WeatherType), 0 + sizeof(int)> __GlobalNamespace_BetterDayNightManager_WeatherTypeSizeCheck;
    static_assert(sizeof(BetterDayNightManager::WeatherType) == 0x4);
    public:
    // public UnityEngine.Shader standard
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::Shader* standard;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // public UnityEngine.Shader standardCutout
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::Shader* standardCutout;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // public UnityEngine.Shader gorillaUnlit
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Shader* gorillaUnlit;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // public UnityEngine.Shader gorillaUnlitCutout
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::Shader* gorillaUnlitCutout;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // public UnityEngine.Material[] standardMaterialsUnlit
    // Size: 0x8
    // Offset: 0x40
    ::ArrayW<::UnityEngine::Material*> standardMaterialsUnlit;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Material*>) == 0x8);
    // public UnityEngine.Material[] standardMaterialsUnlitDarker
    // Size: 0x8
    // Offset: 0x48
    ::ArrayW<::UnityEngine::Material*> standardMaterialsUnlitDarker;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Material*>) == 0x8);
    // public UnityEngine.Material[] dayNightSupportedMaterials
    // Size: 0x8
    // Offset: 0x50
    ::ArrayW<::UnityEngine::Material*> dayNightSupportedMaterials;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Material*>) == 0x8);
    // public UnityEngine.Material[] dayNightSupportedMaterialsCutout
    // Size: 0x8
    // Offset: 0x58
    ::ArrayW<::UnityEngine::Material*> dayNightSupportedMaterialsCutout;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Material*>) == 0x8);
    // public System.String[] dayNightLightmapNames
    // Size: 0x8
    // Offset: 0x60
    ::ArrayW<::StringW> dayNightLightmapNames;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // public System.String[] dayNightWeatherLightmapNames
    // Size: 0x8
    // Offset: 0x68
    ::ArrayW<::StringW> dayNightWeatherLightmapNames;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // public UnityEngine.Texture2D[] dayNightSkyboxTextures
    // Size: 0x8
    // Offset: 0x70
    ::ArrayW<::UnityEngine::Texture2D*> dayNightSkyboxTextures;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Texture2D*>) == 0x8);
    // public UnityEngine.Texture2D[] cloudsDayNightSkyboxTextures
    // Size: 0x8
    // Offset: 0x78
    ::ArrayW<::UnityEngine::Texture2D*> cloudsDayNightSkyboxTextures;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Texture2D*>) == 0x8);
    // public UnityEngine.Texture2D[] beachDayNightSkyboxTextures
    // Size: 0x8
    // Offset: 0x80
    ::ArrayW<::UnityEngine::Texture2D*> beachDayNightSkyboxTextures;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Texture2D*>) == 0x8);
    // public UnityEngine.Texture2D[] dayNightWeatherSkyboxTextures
    // Size: 0x8
    // Offset: 0x88
    ::ArrayW<::UnityEngine::Texture2D*> dayNightWeatherSkyboxTextures;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Texture2D*>) == 0x8);
    // public System.Single[] standardUnlitColor
    // Size: 0x8
    // Offset: 0x90
    ::ArrayW<float> standardUnlitColor;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    // public System.Single[] standardUnlitColorWithPremadeColorDarker
    // Size: 0x8
    // Offset: 0x98
    ::ArrayW<float> standardUnlitColorWithPremadeColorDarker;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    // public System.Single currentLerp
    // Size: 0x4
    // Offset: 0xA0
    float currentLerp;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single currentTimestep
    // Size: 0x4
    // Offset: 0xA4
    float currentTimestep;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Double[] timeOfDayRange
    // Size: 0x8
    // Offset: 0xA8
    ::ArrayW<double> timeOfDayRange;
    // Field size check
    static_assert(sizeof(::ArrayW<double>) == 0x8);
    // public System.Double timeMultiplier
    // Size: 0x8
    // Offset: 0xB0
    double timeMultiplier;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private System.Single lastTime
    // Size: 0x4
    // Offset: 0xB8
    float lastTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: lastTime and: currentTime
    char __padding20[0x4] = {};
    // private System.Double currentTime
    // Size: 0x8
    // Offset: 0xC0
    double currentTime;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private System.Double totalHours
    // Size: 0x8
    // Offset: 0xC8
    double totalHours;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private System.Double totalSeconds
    // Size: 0x8
    // Offset: 0xD0
    double totalSeconds;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private System.Single colorFrom
    // Size: 0x4
    // Offset: 0xD8
    float colorFrom;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single colorTo
    // Size: 0x4
    // Offset: 0xDC
    float colorTo;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single colorFromDarker
    // Size: 0x4
    // Offset: 0xE0
    float colorFromDarker;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single colorToDarker
    // Size: 0x4
    // Offset: 0xE4
    float colorToDarker;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Int32 currentTimeIndex
    // Size: 0x4
    // Offset: 0xE8
    int currentTimeIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 currentWeatherIndex
    // Size: 0x4
    // Offset: 0xEC
    int currentWeatherIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 lastIndex
    // Size: 0x4
    // Offset: 0xF0
    int lastIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: lastIndex and: currentIndexSeconds
    char __padding30[0x4] = {};
    // private System.Double currentIndexSeconds
    // Size: 0x8
    // Offset: 0xF8
    double currentIndexSeconds;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private System.Single tempLerp
    // Size: 0x4
    // Offset: 0x100
    float tempLerp;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: tempLerp and: baseSeconds
    char __padding32[0x4] = {};
    // private System.Double baseSeconds
    // Size: 0x8
    // Offset: 0x108
    double baseSeconds;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private System.Boolean computerInit
    // Size: 0x1
    // Offset: 0x110
    bool computerInit;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: computerInit and: h
    char __padding34[0x3] = {};
    // private System.Single h
    // Size: 0x4
    // Offset: 0x114
    float h;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single s
    // Size: 0x4
    // Offset: 0x118
    float s;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single v
    // Size: 0x4
    // Offset: 0x11C
    float v;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Int32 mySeed
    // Size: 0x4
    // Offset: 0x120
    int mySeed;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: mySeed and: randomNumberGenerator
    char __padding38[0x4] = {};
    // public System.Random randomNumberGenerator
    // Size: 0x8
    // Offset: 0x128
    ::System::Random* randomNumberGenerator;
    // Field size check
    static_assert(sizeof(::System::Random*) == 0x8);
    // public BetterDayNightManager/WeatherType[] weatherCycle
    // Size: 0x8
    // Offset: 0x130
    ::ArrayW<::GlobalNamespace::BetterDayNightManager::WeatherType> weatherCycle;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::BetterDayNightManager::WeatherType>) == 0x8);
    // private System.String <currentTimeOfDay>k__BackingField
    // Size: 0x8
    // Offset: 0x138
    ::StringW currentTimeOfDay;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Single rainChance
    // Size: 0x4
    // Offset: 0x140
    float rainChance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Int32 maxRainDuration
    // Size: 0x4
    // Offset: 0x144
    int maxRainDuration;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 rainDuration
    // Size: 0x4
    // Offset: 0x148
    int rainDuration;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single remainingSeconds
    // Size: 0x4
    // Offset: 0x14C
    float remainingSeconds;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int64 initialDayCycles
    // Size: 0x8
    // Offset: 0x150
    int64_t initialDayCycles;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private System.Int64 gameEpochDay
    // Size: 0x8
    // Offset: 0x158
    int64_t gameEpochDay;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private System.Int32 currentWeatherCycle
    // Size: 0x4
    // Offset: 0x160
    int currentWeatherCycle;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 fromWeatherIndex
    // Size: 0x4
    // Offset: 0x164
    int fromWeatherIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 toWeatherIndex
    // Size: 0x4
    // Offset: 0x168
    int toWeatherIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: toWeatherIndex and: fromSky
    char __padding50[0x4] = {};
    // private UnityEngine.Texture2D fromSky
    // Size: 0x8
    // Offset: 0x170
    ::UnityEngine::Texture2D* fromSky;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture2D*) == 0x8);
    // private UnityEngine.Texture2D fromSky2
    // Size: 0x8
    // Offset: 0x178
    ::UnityEngine::Texture2D* fromSky2;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture2D*) == 0x8);
    // private UnityEngine.Texture2D fromSky3
    // Size: 0x8
    // Offset: 0x180
    ::UnityEngine::Texture2D* fromSky3;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture2D*) == 0x8);
    // private UnityEngine.Texture2D toSky
    // Size: 0x8
    // Offset: 0x188
    ::UnityEngine::Texture2D* toSky;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture2D*) == 0x8);
    // private UnityEngine.Texture2D toSky2
    // Size: 0x8
    // Offset: 0x190
    ::UnityEngine::Texture2D* toSky2;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture2D*) == 0x8);
    // private UnityEngine.Texture2D toSky3
    // Size: 0x8
    // Offset: 0x198
    ::UnityEngine::Texture2D* toSky3;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture2D*) == 0x8);
    // public AddCollidersToParticleSystemTriggers[] weatherSystems
    // Size: 0x8
    // Offset: 0x1A0
    ::ArrayW<::GlobalNamespace::AddCollidersToParticleSystemTriggers*> weatherSystems;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::AddCollidersToParticleSystemTriggers*>) == 0x8);
    // public System.Collections.Generic.List`1<UnityEngine.Collider> collidersToAddToWeatherSystems
    // Size: 0x8
    // Offset: 0x1A8
    ::System::Collections::Generic::List_1<::UnityEngine::Collider*>* collidersToAddToWeatherSystems;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Collider*>*) == 0x8);
    // public System.Int32 overrideIndex
    // Size: 0x4
    // Offset: 0x1B0
    int overrideIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public TimeSettings currentSetting
    // Size: 0x4
    // Offset: 0x1B4
    ::GlobalNamespace::TimeSettings currentSetting;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::TimeSettings) == 0x4);
    // private ShaderHashId _Color
    // Size: 0xC
    // Offset: 0x1B8
    ::GlobalNamespace::ShaderHashId Color;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ShaderHashId) == 0xC);
    // Padding between fields: Color and: GlobalDayNightLerpValue
    char __padding61[0x4] = {};
    // private ShaderHashId _GlobalDayNightLerpValue
    // Size: 0xC
    // Offset: 0x1C8
    ::GlobalNamespace::ShaderHashId GlobalDayNightLerpValue;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ShaderHashId) == 0xC);
    // Padding between fields: GlobalDayNightLerpValue and: GlobalDayNightSkyTex1
    char __padding62[0x4] = {};
    // private ShaderHashId _GlobalDayNightSkyTex1
    // Size: 0xC
    // Offset: 0x1D8
    ::GlobalNamespace::ShaderHashId GlobalDayNightSkyTex1;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ShaderHashId) == 0xC);
    // Padding between fields: GlobalDayNightSkyTex1 and: GlobalDayNightSkyTex2
    char __padding63[0x4] = {};
    // private ShaderHashId _GlobalDayNightSkyTex2
    // Size: 0xC
    // Offset: 0x1E8
    ::GlobalNamespace::ShaderHashId GlobalDayNightSkyTex2;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ShaderHashId) == 0xC);
    // Padding between fields: GlobalDayNightSkyTex2 and: GlobalDayNightSky2Tex1
    char __padding64[0x4] = {};
    // private ShaderHashId _GlobalDayNightSky2Tex1
    // Size: 0xC
    // Offset: 0x1F8
    ::GlobalNamespace::ShaderHashId GlobalDayNightSky2Tex1;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ShaderHashId) == 0xC);
    // Padding between fields: GlobalDayNightSky2Tex1 and: GlobalDayNightSky2Tex2
    char __padding65[0x4] = {};
    // private ShaderHashId _GlobalDayNightSky2Tex2
    // Size: 0xC
    // Offset: 0x208
    ::GlobalNamespace::ShaderHashId GlobalDayNightSky2Tex2;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ShaderHashId) == 0xC);
    // Padding between fields: GlobalDayNightSky2Tex2 and: GlobalDayNightSky3Tex1
    char __padding66[0x4] = {};
    // private ShaderHashId _GlobalDayNightSky3Tex1
    // Size: 0xC
    // Offset: 0x218
    ::GlobalNamespace::ShaderHashId GlobalDayNightSky3Tex1;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ShaderHashId) == 0xC);
    // Padding between fields: GlobalDayNightSky3Tex1 and: GlobalDayNightSky3Tex2
    char __padding67[0x4] = {};
    // private ShaderHashId _GlobalDayNightSky3Tex2
    // Size: 0xC
    // Offset: 0x228
    ::GlobalNamespace::ShaderHashId GlobalDayNightSky3Tex2;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ShaderHashId) == 0xC);
    // Padding between fields: GlobalDayNightSky3Tex2 and: shouldRepopulate
    char __padding68[0x4] = {};
    // private System.Boolean shouldRepopulate
    // Size: 0x1
    // Offset: 0x238
    bool shouldRepopulate;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: shouldRepopulate and: animatingLightFlash
    char __padding69[0x7] = {};
    // private UnityEngine.Coroutine animatingLightFlash
    // Size: 0x8
    // Offset: 0x240
    ::UnityEngine::Coroutine* animatingLightFlash;
    // Field size check
    static_assert(sizeof(::UnityEngine::Coroutine*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::GlobalNamespace::ITimeOfDaySystem
    operator ::GlobalNamespace::ITimeOfDaySystem() noexcept {
      return *reinterpret_cast<::GlobalNamespace::ITimeOfDaySystem*>(this);
    }
    // Get static field: static public BetterDayNightManager instance
    static ::GlobalNamespace::BetterDayNightManager* _get_instance();
    // Set static field: static public BetterDayNightManager instance
    static void _set_instance(::GlobalNamespace::BetterDayNightManager* value);
    // Get static field: static public System.Collections.Generic.List`1<PerSceneRenderData> allScenesRenderData
    static ::System::Collections::Generic::List_1<::GlobalNamespace::PerSceneRenderData*>* _get_allScenesRenderData();
