// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Photon.Pun.MonoBehaviourPunCallbacks
#include "Photon/Pun/MonoBehaviourPunCallbacks.hpp"
// Including type: TransferrableObject
#include "GlobalNamespace/TransferrableObject.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: VRRig
  class VRRig;
  // Forward declaring type: WorldShareableItem
  class WorldShareableItem;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Transform
  class Transform;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: Photon::Realtime
namespace Photon::Realtime {
  // Forward declaring type: Player
  class Player;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: BodyDockPositions
  class BodyDockPositions;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::BodyDockPositions);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::BodyDockPositions*, "", "BodyDockPositions");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0xB8
  #pragma pack(push, 1)
  // Autogenerated type: BodyDockPositions
  // [TokenAttribute] Offset: FFFFFFFF
  class BodyDockPositions : public ::Photon::Pun::MonoBehaviourPunCallbacks {
    public:
    // Nested type: ::GlobalNamespace::BodyDockPositions::DropPositions
    struct DropPositions;
    // Nested type: ::GlobalNamespace::BodyDockPositions::DockingResult
    class DockingResult;
    public:
    // public VRRig myRig
    // Size: 0x8
    // Offset: 0x28
    ::GlobalNamespace::VRRig* myRig;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::VRRig*) == 0x8);
    // public UnityEngine.GameObject[] leftHandThrowables
    // Size: 0x8
    // Offset: 0x30
    ::ArrayW<::UnityEngine::GameObject*> leftHandThrowables;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // public UnityEngine.GameObject[] rightHandThrowables
    // Size: 0x8
    // Offset: 0x38
    ::ArrayW<::UnityEngine::GameObject*> rightHandThrowables;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // public TransferrableObject[] _allObjects
    // Size: 0x8
    // Offset: 0x40
    ::ArrayW<::GlobalNamespace::TransferrableObject*> allObjects;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::TransferrableObject*>) == 0x8);
    // private System.Collections.Generic.List`1<System.Int32> objectsToEnable
    // Size: 0x8
    // Offset: 0x48
    ::System::Collections::Generic::List_1<int>* objectsToEnable;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<int>*) == 0x8);
    // private System.Collections.Generic.List`1<System.Int32> objectsToDisable
    // Size: 0x8
    // Offset: 0x50
    ::System::Collections::Generic::List_1<int>* objectsToDisable;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<int>*) == 0x8);
    // public UnityEngine.Transform leftHandTransform
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::Transform* leftHandTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Transform rightHandTransform
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::Transform* rightHandTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Transform chestTransform
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::Transform* chestTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Transform leftArmTransform
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::Transform* leftArmTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Transform rightArmTransform
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::Transform* rightArmTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Transform leftBackTransform
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::Transform* leftBackTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Transform rightBackTransform
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::Transform* rightBackTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public WorldShareableItem leftBackSharableItem
    // Size: 0x8
    // Offset: 0x90
    ::GlobalNamespace::WorldShareableItem* leftBackSharableItem;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::WorldShareableItem*) == 0x8);
    // public WorldShareableItem rightBackShareableItem
    // Size: 0x8
    // Offset: 0x98
    ::GlobalNamespace::WorldShareableItem* rightBackShareableItem;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::WorldShareableItem*) == 0x8);
    // public UnityEngine.GameObject SharableItemInstance
    // Size: 0x8
    // Offset: 0xA0
    ::UnityEngine::GameObject* SharableItemInstance;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Int32[] throwableDisabledIndex
    // Size: 0x8
    // Offset: 0xA8
    ::ArrayW<int> throwableDisabledIndex;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // private System.Single[] throwableDisabledTime
    // Size: 0x8
    // Offset: 0xB0
    ::ArrayW<float> throwableDisabledTime;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    public:
    // Get instance field reference: public VRRig myRig
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::VRRig*& dyn_myRig();
    // Get instance field reference: public UnityEngine.GameObject[] leftHandThrowables
    [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::GameObject*>& dyn_leftHandThrowables();
    // Get instance field reference: public UnityEngine.GameObject[] rightHandThrowables
    [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::GameObject*>& dyn_rightHandThrowables();
    // Get instance field reference: public TransferrableObject[] _allObjects
    [[deprecated("Use field access instead!")]] ::ArrayW<::GlobalNamespace::TransferrableObject*>& dyn__allObjects();
