// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: SnapBounds
#include "GlobalNamespace/SnapBounds.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Skipping declaration: State because it is already included!
  // Forward declaring type: BuilderMaterialOptions
  class BuilderMaterialOptions;
  // Forward declaring type: IBuilderPieceComponent
  class IBuilderPieceComponent;
  // Forward declaring type: BasePlatform
  class BasePlatform;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: MeshRenderer
  class MeshRenderer;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Collider
  class Collider;
  // Skipping declaration: Behaviour because it is already included!
  // Forward declaring type: Rigidbody
  class Rigidbody;
}
// Forward declaring namespace: GorillaTagScripts
namespace GorillaTagScripts {
  // Forward declaring type: BuilderAttachGridPlane
  class BuilderAttachGridPlane;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: BuilderPiece
  class BuilderPiece;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::BuilderPiece);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::BuilderPiece*, "", "BuilderPiece");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x15C
  #pragma pack(push, 1)
  // Autogenerated type: BuilderPiece
  // [TokenAttribute] Offset: FFFFFFFF
  class BuilderPiece : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::GlobalNamespace::BuilderPiece::State
    struct State;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: BuilderPiece/State
    // [TokenAttribute] Offset: FFFFFFFF
    struct State/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: State
      constexpr State(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public BuilderPiece/State None
      static constexpr const int None = -1;
      // Get static field: static public BuilderPiece/State None
      static ::GlobalNamespace::BuilderPiece::State _get_None();
      // Set static field: static public BuilderPiece/State None
      static void _set_None(::GlobalNamespace::BuilderPiece::State value);
      // static field const value: static public BuilderPiece/State AttachedAndPlaced
      static constexpr const int AttachedAndPlaced = 0;
      // Get static field: static public BuilderPiece/State AttachedAndPlaced
      static ::GlobalNamespace::BuilderPiece::State _get_AttachedAndPlaced();
      // Set static field: static public BuilderPiece/State AttachedAndPlaced
      static void _set_AttachedAndPlaced(::GlobalNamespace::BuilderPiece::State value);
      // static field const value: static public BuilderPiece/State AttachedToDropped
      static constexpr const int AttachedToDropped = 1;
      // Get static field: static public BuilderPiece/State AttachedToDropped
      static ::GlobalNamespace::BuilderPiece::State _get_AttachedToDropped();
      // Set static field: static public BuilderPiece/State AttachedToDropped
      static void _set_AttachedToDropped(::GlobalNamespace::BuilderPiece::State value);
      // static field const value: static public BuilderPiece/State Grabbed
      static constexpr const int Grabbed = 2;
      // Get static field: static public BuilderPiece/State Grabbed
      static ::GlobalNamespace::BuilderPiece::State _get_Grabbed();
      // Set static field: static public BuilderPiece/State Grabbed
      static void _set_Grabbed(::GlobalNamespace::BuilderPiece::State value);
      // static field const value: static public BuilderPiece/State Dropped
      static constexpr const int Dropped = 3;
      // Get static field: static public BuilderPiece/State Dropped
      static ::GlobalNamespace::BuilderPiece::State _get_Dropped();
      // Set static field: static public BuilderPiece/State Dropped
      static void _set_Dropped(::GlobalNamespace::BuilderPiece::State value);
      // static field const value: static public BuilderPiece/State OnShelf
      static constexpr const int OnShelf = 4;
      // Get static field: static public BuilderPiece/State OnShelf
      static ::GlobalNamespace::BuilderPiece::State _get_OnShelf();
      // Set static field: static public BuilderPiece/State OnShelf
      static void _set_OnShelf(::GlobalNamespace::BuilderPiece::State value);
      // static field const value: static public BuilderPiece/State Displayed
      static constexpr const int Displayed = 5;
      // Get static field: static public BuilderPiece/State Displayed
      static ::GlobalNamespace::BuilderPiece::State _get_Displayed();
      // Set static field: static public BuilderPiece/State Displayed
      static void _set_Displayed(::GlobalNamespace::BuilderPiece::State value);
      // static field const value: static public BuilderPiece/State GrabbedLocal
      static constexpr const int GrabbedLocal = 6;
      // Get static field: static public BuilderPiece/State GrabbedLocal
      static ::GlobalNamespace::BuilderPiece::State _get_GrabbedLocal();
      // Set static field: static public BuilderPiece/State GrabbedLocal
      static void _set_GrabbedLocal(::GlobalNamespace::BuilderPiece::State value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // BuilderPiece/State
    #pragma pack(pop)
    static check_size<sizeof(BuilderPiece::State), 0 + sizeof(int)> __GlobalNamespace_BuilderPiece_StateSizeCheck;
    static_assert(sizeof(BuilderPiece::State) == 0x4);
    public:
    // public System.String displayName
    // Size: 0x8
    // Offset: 0x20
    ::StringW displayName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public BuilderMaterialOptions materialOptions
    // Size: 0x8
    // Offset: 0x28
    ::GlobalNamespace::BuilderMaterialOptions* materialOptions;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BuilderMaterialOptions*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.MeshRenderer> materialSwapTargets
    // Size: 0x8
    // Offset: 0x30
    ::System::Collections::Generic::List_1<::UnityEngine::MeshRenderer*>* materialSwapTargets;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::MeshRenderer*>*) == 0x8);
    // public UnityEngine.Transform scaleRoot
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::Transform* scaleRoot;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.GameObject placeVFX
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::GameObject* placeVFX;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject disconnectVFX
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::GameObject* disconnectVFX;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject grabbedVFX
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::GameObject* grabbedVFX;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject locationLockVFX
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::GameObject* locationLockVFX;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public System.Int32 pieceType
    // Size: 0x4
    // Offset: 0x60
    int pieceType;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 pieceId
    // Size: 0x4
    // Offset: 0x64
    int pieceId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 materialType
    // Size: 0x4
    // Offset: 0x68
    int materialType;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 heldByPlayerActorNumber
    // Size: 0x4
    // Offset: 0x6C
    int heldByPlayerActorNumber;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Boolean heldInLeftHand
    // Size: 0x1
    // Offset: 0x70
    bool heldInLeftHand;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: heldInLeftHand and: parentHeld
    char __padding12[0x7] = {};
    // public UnityEngine.Transform parentHeld
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::Transform* parentHeld;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public BuilderPiece parentPiece
    // Size: 0x8
    // Offset: 0x80
    ::GlobalNamespace::BuilderPiece* parentPiece;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BuilderPiece*) == 0x8);
    // public BuilderPiece firstChildPiece
    // Size: 0x8
    // Offset: 0x88
    ::GlobalNamespace::BuilderPiece* firstChildPiece;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BuilderPiece*) == 0x8);
    // public BuilderPiece nextSiblingPiece
    // Size: 0x8
    // Offset: 0x90
    ::GlobalNamespace::BuilderPiece* nextSiblingPiece;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BuilderPiece*) == 0x8);
    // public System.Int32 attachIndex
    // Size: 0x4
    // Offset: 0x98
    int attachIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public SnapBounds attachBounds
    // Size: 0x10
    // Offset: 0x9C
    ::GlobalNamespace::SnapBounds attachBounds;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SnapBounds) == 0x10);
    // public System.Int32 parentAttachIndex
    // Size: 0x4
    // Offset: 0xAC
    int parentAttachIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public SnapBounds parentAttachBounds
    // Size: 0x10
    // Offset: 0xB0
    ::GlobalNamespace::SnapBounds parentAttachBounds;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SnapBounds) == 0x10);
    // public System.Collections.Generic.List`1<GorillaTagScripts.BuilderAttachGridPlane> gridPlanes
    // Size: 0x8
    // Offset: 0xC0
    ::System::Collections::Generic::List_1<::GorillaTagScripts::BuilderAttachGridPlane*>* gridPlanes;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GorillaTagScripts::BuilderAttachGridPlane*>*) == 0x8);
    // public System.Collections.Generic.List`1<UnityEngine.Collider> colliders
    // Size: 0x8
    // Offset: 0xC8
    ::System::Collections::Generic::List_1<::UnityEngine::Collider*>* colliders;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Collider*>*) == 0x8);
    // public System.Collections.Generic.List`1<UnityEngine.Behaviour> onlyWhenPlacedBehaviours
    // Size: 0x8
    // Offset: 0xD0
    ::System::Collections::Generic::List_1<::UnityEngine::Behaviour*>* onlyWhenPlacedBehaviours;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Behaviour*>*) == 0x8);
    // public System.Collections.Generic.List`1<IBuilderPieceComponent> pieceComponents
    // Size: 0x8
    // Offset: 0xD8
    ::System::Collections::Generic::List_1<::GlobalNamespace::IBuilderPieceComponent*>* pieceComponents;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GlobalNamespace::IBuilderPieceComponent*>*) == 0x8);
    // private System.Boolean pieceComponentsActive
    // Size: 0x1
    // Offset: 0xE0
    bool pieceComponentsActive;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: pieceComponentsActive and: onlyWhenPlaced
    char __padding25[0x7] = {};
    // public System.Collections.Generic.List`1<UnityEngine.GameObject> onlyWhenPlaced
    // Size: 0x8
    // Offset: 0xE8
    ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>* onlyWhenPlaced;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*) == 0x8);
    // public System.Collections.Generic.List`1<UnityEngine.GameObject> onlyWhenNotPlaced
    // Size: 0x8
    // Offset: 0xF0
    ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>* onlyWhenNotPlaced;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*) == 0x8);
    // public System.Boolean areMeshesToggledOnPlace
    // Size: 0x1
    // Offset: 0xF8
    bool areMeshesToggledOnPlace;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: areMeshesToggledOnPlace and: moveToRoot
    char __padding28[0x7] = {};
    // public System.Collections.Generic.List`1<UnityEngine.GameObject> moveToRoot
    // Size: 0x8
    // Offset: 0x100
    ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>* moveToRoot;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*) == 0x8);
    // public UnityEngine.Rigidbody rigidBody
    // Size: 0x8
    // Offset: 0x108
    ::UnityEngine::Rigidbody* rigidBody;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rigidbody*) == 0x8);
    // public BasePlatform platform
    // Size: 0x8
    // Offset: 0x110
    ::GlobalNamespace::BasePlatform* platform;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BasePlatform*) == 0x8);
    // public System.Int32 preventSnapUntilMoved
    // Size: 0x4
    // Offset: 0x118
    int preventSnapUntilMoved;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public UnityEngine.Vector3 preventSnapUntilMovedFromPos
    // Size: 0xC
    // Offset: 0x11C
    ::UnityEngine::Vector3 preventSnapUntilMovedFromPos;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public BuilderPiece requestedParentPiece
    // Size: 0x8
    // Offset: 0x128
    ::GlobalNamespace::BuilderPiece* requestedParentPiece;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BuilderPiece*) == 0x8);
    // public System.Collections.Generic.List`1<UnityEngine.MeshRenderer> meshesToCombine
    // Size: 0x8
    // Offset: 0x130
    ::System::Collections::Generic::List_1<::UnityEngine::MeshRenderer*>* meshesToCombine;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::MeshRenderer*>*) == 0x8);
    // public UnityEngine.GameObject bumpPrefab
    // Size: 0x8
    // Offset: 0x138
    ::UnityEngine::GameObject* bumpPrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public System.Collections.Generic.List`1<UnityEngine.GameObject> bumps
    // Size: 0x8
    // Offset: 0x140
    ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>* bumps;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*) == 0x8);
    // public BuilderPiece/State state
    // Size: 0x4
    // Offset: 0x148
    ::GlobalNamespace::BuilderPiece::State state;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BuilderPiece::State) == 0x4);
    // public System.Boolean isStatic
    // Size: 0x1
    // Offset: 0x14C
    bool isStatic;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean isBuiltIntoTable
    // Size: 0x1
    // Offset: 0x14D
    bool isBuiltIntoTable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isBuiltIntoTable and: renderingIndirect
    char __padding40[0x2] = {};
    // public System.Collections.Generic.List`1<UnityEngine.MeshRenderer> renderingIndirect
    // Size: 0x8
    // Offset: 0x150
    ::System::Collections::Generic::List_1<::UnityEngine::MeshRenderer*>* renderingIndirect;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::MeshRenderer*>*) == 0x8);
    // public System.Single tint
    // Size: 0x4
    // Offset: 0x158
    float tint;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // static field const value: static public System.Int32 INVALID
    static constexpr const int INVALID = -1;
    // Get static field: static public System.Int32 INVALID
    static int _get_INVALID();
    // Set static field: static public System.Int32 INVALID
    static void _set_INVALID(int value);
    // Get instance field reference: public System.String displayName
    [[deprecated("Use field access instead!")]] ::StringW& dyn_displayName();
    // Get instance field reference: public BuilderMaterialOptions materialOptions
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::BuilderMaterialOptions*& dyn_materialOptions();
    // Get instance field reference: private System.Collections.Generic.List`1<UnityEngine.MeshRenderer> materialSwapTargets
