// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: GorillaTagScripts.BuilderPotentialPlacement
#include "GorillaTagScripts/BuilderPotentialPlacement.hpp"
// Including type: Unity.Collections.NativeArray`1
#include "Unity/Collections/NativeArray_1.hpp"
// Including type: UnityEngine.OverlapSphereCommand
#include "UnityEngine/OverlapSphereCommand.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: BuilderPiece
  class BuilderPiece;
  // Forward declaring type: EquipmentInteractor
  class EquipmentInteractor;
  // Forward declaring type: GorillaVelocityEstimator
  class GorillaVelocityEstimator;
  // Forward declaring type: BuilderLaserSight
  class BuilderLaserSight;
  // Forward declaring type: BuilderBumpGlow
  class BuilderBumpGlow;
  // Skipping declaration: HandState because it is already included!
  // Forward declaring type: HoldableObject
  class HoldableObject;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: HashSet`1<T>
  template<typename T>
  class HashSet_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Collider
  class Collider;
  // Forward declaring type: Transform
  class Transform;
}
// Forward declaring namespace: GorillaTagScripts
namespace GorillaTagScripts {
  // Forward declaring type: BuilderAttachGridPlane
  class BuilderAttachGridPlane;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: BuilderPieceInteractor
  class BuilderPieceInteractor;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::BuilderPieceInteractor);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::BuilderPieceInteractor*, "", "BuilderPieceInteractor");
// Type namespace: 
namespace GlobalNamespace {
  // WARNING Size may be invalid!
  // Autogenerated type: BuilderPieceInteractor
  // [TokenAttribute] Offset: FFFFFFFF
  class BuilderPieceInteractor : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::GlobalNamespace::BuilderPieceInteractor::HandType
    struct HandType;
    // Nested type: ::GlobalNamespace::BuilderPieceInteractor::HandState
    struct HandState;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: BuilderPieceInteractor/HandState
    // [TokenAttribute] Offset: FFFFFFFF
    struct HandState/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: HandState
      constexpr HandState(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public BuilderPieceInteractor/HandState Invalid
      static constexpr const int Invalid = -1;
      // Get static field: static public BuilderPieceInteractor/HandState Invalid
      static ::GlobalNamespace::BuilderPieceInteractor::HandState _get_Invalid();
      // Set static field: static public BuilderPieceInteractor/HandState Invalid
      static void _set_Invalid(::GlobalNamespace::BuilderPieceInteractor::HandState value);
      // static field const value: static public BuilderPieceInteractor/HandState Empty
      static constexpr const int Empty = 0;
      // Get static field: static public BuilderPieceInteractor/HandState Empty
      static ::GlobalNamespace::BuilderPieceInteractor::HandState _get_Empty();
      // Set static field: static public BuilderPieceInteractor/HandState Empty
      static void _set_Empty(::GlobalNamespace::BuilderPieceInteractor::HandState value);
      // static field const value: static public BuilderPieceInteractor/HandState Grabbed
      static constexpr const int Grabbed = 1;
      // Get static field: static public BuilderPieceInteractor/HandState Grabbed
      static ::GlobalNamespace::BuilderPieceInteractor::HandState _get_Grabbed();
      // Set static field: static public BuilderPieceInteractor/HandState Grabbed
      static void _set_Grabbed(::GlobalNamespace::BuilderPieceInteractor::HandState value);
      // static field const value: static public BuilderPieceInteractor/HandState PotentialGrabbed
      static constexpr const int PotentialGrabbed = 2;
      // Get static field: static public BuilderPieceInteractor/HandState PotentialGrabbed
      static ::GlobalNamespace::BuilderPieceInteractor::HandState _get_PotentialGrabbed();
      // Set static field: static public BuilderPieceInteractor/HandState PotentialGrabbed
      static void _set_PotentialGrabbed(::GlobalNamespace::BuilderPieceInteractor::HandState value);
      // static field const value: static public BuilderPieceInteractor/HandState WaitingForSnap
      static constexpr const int WaitingForSnap = 3;
      // Get static field: static public BuilderPieceInteractor/HandState WaitingForSnap
      static ::GlobalNamespace::BuilderPieceInteractor::HandState _get_WaitingForSnap();
      // Set static field: static public BuilderPieceInteractor/HandState WaitingForSnap
      static void _set_WaitingForSnap(::GlobalNamespace::BuilderPieceInteractor::HandState value);
      // static field const value: static public BuilderPieceInteractor/HandState WaitingForUnSnap
      static constexpr const int WaitingForUnSnap = 4;
      // Get static field: static public BuilderPieceInteractor/HandState WaitingForUnSnap
      static ::GlobalNamespace::BuilderPieceInteractor::HandState _get_WaitingForUnSnap();
      // Set static field: static public BuilderPieceInteractor/HandState WaitingForUnSnap
      static void _set_WaitingForUnSnap(::GlobalNamespace::BuilderPieceInteractor::HandState value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // BuilderPieceInteractor/HandState
    #pragma pack(pop)
    static check_size<sizeof(BuilderPieceInteractor::HandState), 0 + sizeof(int)> __GlobalNamespace_BuilderPieceInteractor_HandStateSizeCheck;
    static_assert(sizeof(BuilderPieceInteractor::HandState) == 0x4);
    public:
    // public EquipmentInteractor equipmentInteractor
    // Size: 0x8
    // Offset: 0x20
    ::GlobalNamespace::EquipmentInteractor* equipmentInteractor;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::EquipmentInteractor*) == 0x8);
    // public GorillaVelocityEstimator velocityEstimatorLeft
    // Size: 0x8
    // Offset: 0x28
    ::GlobalNamespace::GorillaVelocityEstimator* velocityEstimatorLeft;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::GorillaVelocityEstimator*) == 0x8);
    // public GorillaVelocityEstimator velocityEstimatorRight
    // Size: 0x8
    // Offset: 0x30
    ::GlobalNamespace::GorillaVelocityEstimator* velocityEstimatorRight;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::GorillaVelocityEstimator*) == 0x8);
    // public BuilderLaserSight laserSightLeft
    // Size: 0x8
    // Offset: 0x38
    ::GlobalNamespace::BuilderLaserSight* laserSightLeft;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BuilderLaserSight*) == 0x8);
    // public BuilderLaserSight laserSightRight
    // Size: 0x8
    // Offset: 0x40
    ::GlobalNamespace::BuilderLaserSight* laserSightRight;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BuilderLaserSight*) == 0x8);
    // public System.Collections.Generic.List`1<GorillaVelocityEstimator> velocityEstimator
    // Size: 0x8
    // Offset: 0x48
    ::System::Collections::Generic::List_1<::GlobalNamespace::GorillaVelocityEstimator*>* velocityEstimator;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GlobalNamespace::GorillaVelocityEstimator*>*) == 0x8);
    // public System.Collections.Generic.List`1<BuilderPieceInteractor/HandState> handState
    // Size: 0x8
    // Offset: 0x50
    ::System::Collections::Generic::List_1<::GlobalNamespace::BuilderPieceInteractor::HandState>* handState;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GlobalNamespace::BuilderPieceInteractor::HandState>*) == 0x8);
    // public System.Collections.Generic.List`1<BuilderPiece> heldPiece
    // Size: 0x8
    // Offset: 0x58
    ::System::Collections::Generic::List_1<::GlobalNamespace::BuilderPiece*>* heldPiece;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GlobalNamespace::BuilderPiece*>*) == 0x8);
    // public System.Collections.Generic.List`1<BuilderPiece> potentialHeldPiece
    // Size: 0x8
    // Offset: 0x60
    ::System::Collections::Generic::List_1<::GlobalNamespace::BuilderPiece*>* potentialHeldPiece;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GlobalNamespace::BuilderPiece*>*) == 0x8);
    // public System.Collections.Generic.List`1<System.Single> potentialGrabbedOffsetDist
    // Size: 0x8
    // Offset: 0x68
    ::System::Collections::Generic::List_1<float>* potentialGrabbedOffsetDist;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<float>*) == 0x8);
    // public System.Collections.Generic.List`1<UnityEngine.Quaternion> heldInitialRot
    // Size: 0x8
    // Offset: 0x70
    ::System::Collections::Generic::List_1<::UnityEngine::Quaternion>* heldInitialRot;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Quaternion>*) == 0x8);
    // public System.Collections.Generic.List`1<UnityEngine.Quaternion> heldCurrentRot
    // Size: 0x8
    // Offset: 0x78
    ::System::Collections::Generic::List_1<::UnityEngine::Quaternion>* heldCurrentRot;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Quaternion>*) == 0x8);
    // public System.Collections.Generic.List`1<UnityEngine.Vector3> heldInitialPos
    // Size: 0x8
    // Offset: 0x80
    ::System::Collections::Generic::List_1<::UnityEngine::Vector3>* heldInitialPos;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Vector3>*) == 0x8);
    // public System.Collections.Generic.List`1<UnityEngine.Vector3> heldCurrentPos
    // Size: 0x8
    // Offset: 0x88
    ::System::Collections::Generic::List_1<::UnityEngine::Vector3>* heldCurrentPos;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Vector3>*) == 0x8);
    // public System.Collections.Generic.List`1<GorillaTagScripts.BuilderPotentialPlacement> delayedPotentialPlacement
    // Size: 0x8
    // Offset: 0x90
    ::System::Collections::Generic::List_1<::GorillaTagScripts::BuilderPotentialPlacement>* delayedPotentialPlacement;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GorillaTagScripts::BuilderPotentialPlacement>*) == 0x8);
    // public System.Collections.Generic.List`1<System.Single> delayedPlacementTime
    // Size: 0x8
    // Offset: 0x98
    ::System::Collections::Generic::List_1<float>* delayedPlacementTime;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<float>*) == 0x8);
    // public System.Collections.Generic.List`1<GorillaTagScripts.BuilderPotentialPlacement> prevPotentialPlacement
    // Size: 0x8
    // Offset: 0xA0
    ::System::Collections::Generic::List_1<::GorillaTagScripts::BuilderPotentialPlacement>* prevPotentialPlacement;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GorillaTagScripts::BuilderPotentialPlacement>*) == 0x8);
    // public System.Collections.Generic.List`1<BuilderLaserSight> laserSight
    // Size: 0x8
    // Offset: 0xA8
    ::System::Collections::Generic::List_1<::GlobalNamespace::BuilderLaserSight*>* laserSight;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GlobalNamespace::BuilderLaserSight*>*) == 0x8);
    // public System.Collections.Generic.List`1<UnityEngine.GameObject> collisionDisabledPiecesLeft
    // Size: 0x8
    // Offset: 0xB0
    ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>* collisionDisabledPiecesLeft;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*) == 0x8);
    // public System.Collections.Generic.List`1<UnityEngine.GameObject> collisionDisabledPiecesRight
    // Size: 0x8
    // Offset: 0xB8
    ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>* collisionDisabledPiecesRight;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*) == 0x8);
    // public Unity.Collections.NativeArray`1<UnityEngine.OverlapSphereCommand> checkPiecesInSphere
    // Size: 0xFFFFFFFF
    // Offset: 0xC0
    ::Unity::Collections::NativeArray_1<::UnityEngine::OverlapSphereCommand> checkPiecesInSphere;
    // public Unity.Collections.NativeArray`1<UnityEngine.ColliderHit> checkPiecesInSphereResults
    // Size: 0xFFFFFFFF
    // Offset: 0xD0
    ::Unity::Collections::NativeArray_1<::UnityEngine::ColliderHit> checkPiecesInSphereResults;
    // public Unity.Jobs.JobHandle checkNearbyPiecesHandle
    // Size: 0xC
    // Offset: 0xE0
    ::Unity::Jobs::JobHandle checkNearbyPiecesHandle;
    // Field size check
    static_assert(sizeof(::Unity::Jobs::JobHandle) == 0xC);
    // public BuilderBumpGlow glowBumpPrefab
    // Size: 0x8
    // Offset: 0xF0
    ::GlobalNamespace::BuilderBumpGlow* glowBumpPrefab;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BuilderBumpGlow*) == 0x8);
    // public System.Collections.Generic.List`1<System.Collections.Generic.List`1<BuilderBumpGlow>> glowBumps
    // Size: 0x8
    // Offset: 0xF8
    ::System::Collections::Generic::List_1<::System::Collections::Generic::List_1<::GlobalNamespace::BuilderBumpGlow*>*>* glowBumps;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::System::Collections::Generic::List_1<::GlobalNamespace::BuilderBumpGlow*>*>*) == 0x8);
    // private System.Boolean inDropZone
    // Size: 0x1
    // Offset: 0x100
    bool inDropZone;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get static field: static public BuilderPieceInteractor instance
    static ::GlobalNamespace::BuilderPieceInteractor* _get_instance();
    // Set static field: static public BuilderPieceInteractor instance
    static void _set_instance(::GlobalNamespace::BuilderPieceInteractor* value);
    // Get static field: static public System.Boolean hasInstance
    static bool _get_hasInstance();
    // Set static field: static public System.Boolean hasInstance
    static void _set_hasInstance(bool value);
    // static field const value: static private System.Int32 NUM_HANDS
    static constexpr const int NUM_HANDS = 2;
    // Get static field: static private System.Int32 NUM_HANDS
    static int _get_NUM_HANDS();
    // Set static field: static private System.Int32 NUM_HANDS
    static void _set_NUM_HANDS(int value);
