// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: BushFieldReactorMain
  class BushFieldReactorMain;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::BushFieldReactorMain);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::BushFieldReactorMain*, "", "BushFieldReactorMain");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x74
  #pragma pack(push, 1)
  // Autogenerated type: BushFieldReactorMain
  // [TokenAttribute] Offset: FFFFFFFF
  class BushFieldReactorMain : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // public UnityEngine.GameObject Bush
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::GameObject* Bush;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject Blossom
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::GameObject* Blossom;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject Sphere
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::GameObject* Sphere;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public System.Int32 NumBushes
    // Size: 0x4
    // Offset: 0x38
    int NumBushes;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public UnityEngine.Vector2 BushScaleRange
    // Size: 0x8
    // Offset: 0x3C
    ::UnityEngine::Vector2 BushScaleRange;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // public System.Int32 NumBlossoms
    // Size: 0x4
    // Offset: 0x44
    int NumBlossoms;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public UnityEngine.Vector2 BlossomScaleRange
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::Vector2 BlossomScaleRange;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // public UnityEngine.Vector2 FieldBounds
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::Vector2 FieldBounds;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // public System.Int32 NumSpheresPerCircle
    // Size: 0x4
    // Offset: 0x58
    int NumSpheresPerCircle;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 NumCircles
    // Size: 0x4
    // Offset: 0x5C
    int NumCircles;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Single MaxCircleRadius
    // Size: 0x4
    // Offset: 0x60
    float MaxCircleRadius;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single CircleSpeed
    // Size: 0x4
    // Offset: 0x64
    float CircleSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Collections.Generic.List`1<UnityEngine.GameObject> m_aSphere
    // Size: 0x8
    // Offset: 0x68
    ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>* m_aSphere;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*) == 0x8);
    // private System.Single m_basePhase
    // Size: 0x4
    // Offset: 0x70
    float m_basePhase;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Get instance field reference: public UnityEngine.GameObject Bush
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_Bush();
    // Get instance field reference: public UnityEngine.GameObject Blossom
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_Blossom();
    // Get instance field reference: public UnityEngine.GameObject Sphere
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_Sphere();
    // Get instance field reference: public System.Int32 NumBushes
    [[deprecated("Use field access instead!")]] int& dyn_NumBushes();
    // Get instance field reference: public UnityEngine.Vector2 BushScaleRange
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector2& dyn_BushScaleRange();
    // Get instance field reference: public System.Int32 NumBlossoms
    [[deprecated("Use field access instead!")]] int& dyn_NumBlossoms();
    // Get instance field reference: public UnityEngine.Vector2 BlossomScaleRange
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector2& dyn_BlossomScaleRange();
    // Get instance field reference: public UnityEngine.Vector2 FieldBounds
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector2& dyn_FieldBounds();
    // Get instance field reference: public System.Int32 NumSpheresPerCircle
    [[deprecated("Use field access instead!")]] int& dyn_NumSpheresPerCircle();
    // Get instance field reference: public System.Int32 NumCircles
    [[deprecated("Use field access instead!")]] int& dyn_NumCircles();
    // Get instance field reference: public System.Single MaxCircleRadius
    [[deprecated("Use field access instead!")]] float& dyn_MaxCircleRadius();
    // Get instance field reference: public System.Single CircleSpeed
    [[deprecated("Use field access instead!")]] float& dyn_CircleSpeed();
    // Get instance field reference: private System.Collections.Generic.List`1<UnityEngine.GameObject> m_aSphere
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*& dyn_m_aSphere();
    // Get instance field reference: private System.Single m_basePhase
    [[deprecated("Use field access instead!")]] float& dyn_m_basePhase();
    // public System.Void Start()
    // Offset: 0x2685074
    void Start();
    // public System.Void Update()
    // Offset: 0x268558C
    void Update();
    // public System.Void .ctor()
    // Offset: 0x26856FC
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static BushFieldReactorMain* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::GlobalNamespace::BushFieldReactorMain::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<BushFieldReactorMain*, creationType>()));
    }
  }; // BushFieldReactorMain
  #pragma pack(pop)
  static check_size<sizeof(BushFieldReactorMain), 112 + sizeof(float)> __GlobalNamespace_BushFieldReactorMainSizeCheck;
  static_assert(sizeof(BushFieldReactorMain) == 0x74);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: GlobalNamespace::BushFieldReactorMain::Start
// Il2CppName: Start
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::BushFieldReactorMain::*)()>(&GlobalNamespace::BushFieldReactorMain::Start)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::BushFieldReactorMain*), "Start", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::BushFieldReactorMain::Update
// Il2CppName: Update
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::BushFieldReactorMain::*)()>(&GlobalNamespace::BushFieldReactorMain::Update)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::BushFieldReactorMain*), "Update", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::BushFieldReactorMain::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
