// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Photon.Pun.MonoBehaviourPun
#include "Photon/Pun/MonoBehaviourPun.hpp"
// Including type: XSceneRef
#include "GlobalNamespace/XSceneRef.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: AnimatedButterfly
#include "GlobalNamespace/AnimatedButterfly.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: MeshRenderer
  class MeshRenderer;
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: SRand
  struct SRand;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: ButterflySwarmManager
  class ButterflySwarmManager;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::ButterflySwarmManager);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::ButterflySwarmManager*, "", "ButterflySwarmManager");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0xB0
  #pragma pack(push, 1)
  // Autogenerated type: ButterflySwarmManager
  // [TokenAttribute] Offset: FFFFFFFF
  class ButterflySwarmManager : public ::Photon::Pun::MonoBehaviourPun {
    public:
    public:
    // private XSceneRef[] perchSections
    // Size: 0x8
    // Offset: 0x28
    ::ArrayW<::GlobalNamespace::XSceneRef> perchSections;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::XSceneRef>) == 0x8);
    // private System.Int32 loopSizePerBee
    // Size: 0x4
    // Offset: 0x30
    int loopSizePerBee;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 numBees
    // Size: 0x4
    // Offset: 0x34
    int numBees;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.MeshRenderer beePrefab
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::MeshRenderer* beePrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::MeshRenderer*) == 0x8);
    // private System.Single maxFlapSpeed
    // Size: 0x4
    // Offset: 0x40
    float maxFlapSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single minFlapSpeed
    // Size: 0x4
    // Offset: 0x44
    float minFlapSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <PerchedFlapSpeed>k__BackingField
    // Size: 0x4
    // Offset: 0x48
    float PerchedFlapSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <PerchedFlapPhase>k__BackingField
    // Size: 0x4
    // Offset: 0x4C
    float PerchedFlapPhase;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <BeeSpeed>k__BackingField
    // Size: 0x4
    // Offset: 0x50
    float BeeSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <BeeMaxTravelTime>k__BackingField
    // Size: 0x4
    // Offset: 0x54
    float BeeMaxTravelTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <BeeAcceleration>k__BackingField
    // Size: 0x4
    // Offset: 0x58
    float BeeAcceleration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <BeeJitterStrength>k__BackingField
    // Size: 0x4
    // Offset: 0x5C
    float BeeJitterStrength;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <BeeJitterDamping>k__BackingField
    // Size: 0x4
    // Offset: 0x60
    float BeeJitterDamping;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <BeeMaxJitterRadius>k__BackingField
    // Size: 0x4
    // Offset: 0x64
    float BeeMaxJitterRadius;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <BeeNearDestinationRadius>k__BackingField
    // Size: 0x4
    // Offset: 0x68
    float BeeNearDestinationRadius;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <DestRotationAlignmentSpeed>k__BackingField
    // Size: 0x4
    // Offset: 0x6C
    float DestRotationAlignmentSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector3 <TravellingLocalRotationEuler>k__BackingField
    // Size: 0xC
    // Offset: 0x70
    ::UnityEngine::Vector3 TravellingLocalRotationEuler;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Quaternion <TravellingLocalRotation>k__BackingField
    // Size: 0x10
    // Offset: 0x7C
    ::UnityEngine::Quaternion TravellingLocalRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private System.Single <AvoidPointRadius>k__BackingField
    // Size: 0x4
    // Offset: 0x8C
    float AvoidPointRadius;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <BeeMinFlowerDuration>k__BackingField
    // Size: 0x4
    // Offset: 0x90
    float BeeMinFlowerDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <BeeMaxFlowerDuration>k__BackingField
    // Size: 0x4
    // Offset: 0x94
    float BeeMaxFlowerDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Color[] <BeeColors>k__BackingField
    // Size: 0x8
    // Offset: 0x98
    ::ArrayW<::UnityEngine::Color> BeeColors;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Color>) == 0x8);
    // private System.Collections.Generic.List`1<AnimatedButterfly> butterflies
    // Size: 0x8
    // Offset: 0xA0
    ::System::Collections::Generic::List_1<::GlobalNamespace::AnimatedButterfly>* butterflies;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GlobalNamespace::AnimatedButterfly>*) == 0x8);
    // private System.Collections.Generic.List`1<System.Collections.Generic.List`1<UnityEngine.GameObject>> allPerchZones
    // Size: 0x8
    // Offset: 0xA8
    ::System::Collections::Generic::List_1<::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*>* allPerchZones;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*>*) == 0x8);
    public:
    // Get instance field reference: private XSceneRef[] perchSections
    [[deprecated("Use field access instead!")]] ::ArrayW<::GlobalNamespace::XSceneRef>& dyn_perchSections();
    // Get instance field reference: private System.Int32 loopSizePerBee
    [[deprecated("Use field access instead!")]] int& dyn_loopSizePerBee();
    // Get instance field reference: private System.Int32 numBees
    [[deprecated("Use field access instead!")]] int& dyn_numBees();
    // Get instance field reference: private UnityEngine.MeshRenderer beePrefab
    [[deprecated("Use field access instead!")]] ::UnityEngine::MeshRenderer*& dyn_beePrefab();
