// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.XR.InputDevice
#include "UnityEngine/XR/InputDevice.hpp"
// Including type: GorillaControllerType
#include "GlobalNamespace/GorillaControllerType.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::XR
namespace UnityEngine::XR {
  // Forward declaring type: XRNode
  struct XRNode;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: ControllerInputPoller
  class ControllerInputPoller;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::ControllerInputPoller);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::ControllerInputPoller*, "", "ControllerInputPoller");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0xE4
  #pragma pack(push, 1)
  // Autogenerated type: ControllerInputPoller
  // [TokenAttribute] Offset: FFFFFFFF
  class ControllerInputPoller : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // public System.Single leftControllerIndexFloat
    // Size: 0x4
    // Offset: 0x20
    float leftControllerIndexFloat;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single leftControllerGripFloat
    // Size: 0x4
    // Offset: 0x24
    float leftControllerGripFloat;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single rightControllerIndexFloat
    // Size: 0x4
    // Offset: 0x28
    float rightControllerIndexFloat;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single rightControllerGripFloat
    // Size: 0x4
    // Offset: 0x2C
    float rightControllerGripFloat;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single leftControllerIndexTouch
    // Size: 0x4
    // Offset: 0x30
    float leftControllerIndexTouch;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single rightControllerIndexTouch
    // Size: 0x4
    // Offset: 0x34
    float rightControllerIndexTouch;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single rightStickLRFloat
    // Size: 0x4
    // Offset: 0x38
    float rightStickLRFloat;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.Vector3 leftControllerPosition
    // Size: 0xC
    // Offset: 0x3C
    ::UnityEngine::Vector3 leftControllerPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 rightControllerPosition
    // Size: 0xC
    // Offset: 0x48
    ::UnityEngine::Vector3 rightControllerPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 headPosition
    // Size: 0xC
    // Offset: 0x54
    ::UnityEngine::Vector3 headPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Quaternion leftControllerRotation
    // Size: 0x10
    // Offset: 0x60
    ::UnityEngine::Quaternion leftControllerRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // public UnityEngine.Quaternion rightControllerRotation
    // Size: 0x10
    // Offset: 0x70
    ::UnityEngine::Quaternion rightControllerRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // public UnityEngine.Quaternion headRotation
    // Size: 0x10
    // Offset: 0x80
    ::UnityEngine::Quaternion headRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // public UnityEngine.XR.InputDevice leftControllerDevice
    // Size: 0x9
    // Offset: 0x90
    ::UnityEngine::XR::InputDevice leftControllerDevice;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::InputDevice) == 0x9);
    // Padding between fields: leftControllerDevice and: rightControllerDevice
    char __padding13[0x7] = {};
    // public UnityEngine.XR.InputDevice rightControllerDevice
    // Size: 0x9
    // Offset: 0xA0
    ::UnityEngine::XR::InputDevice rightControllerDevice;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::InputDevice) == 0x9);
    // Padding between fields: rightControllerDevice and: headDevice
    char __padding14[0x7] = {};
    // public UnityEngine.XR.InputDevice headDevice
    // Size: 0x9
    // Offset: 0xB0
    ::UnityEngine::XR::InputDevice headDevice;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::InputDevice) == 0x9);
    // Padding between fields: headDevice and: leftControllerPrimaryButton
    char __padding15[0x7] = {};
    // public System.Boolean leftControllerPrimaryButton
    // Size: 0x1
    // Offset: 0xC0
    bool leftControllerPrimaryButton;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean leftControllerSecondaryButton
    // Size: 0x1
    // Offset: 0xC1
    bool leftControllerSecondaryButton;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean rightControllerPrimaryButton
    // Size: 0x1
    // Offset: 0xC2
    bool rightControllerPrimaryButton;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean rightControllerSecondaryButton
    // Size: 0x1
    // Offset: 0xC3
    bool rightControllerSecondaryButton;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean leftControllerPrimaryButtonTouch
    // Size: 0x1
    // Offset: 0xC4
    bool leftControllerPrimaryButtonTouch;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean leftControllerSecondaryButtonTouch
    // Size: 0x1
    // Offset: 0xC5
    bool leftControllerSecondaryButtonTouch;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean rightControllerPrimaryButtonTouch
    // Size: 0x1
    // Offset: 0xC6
    bool rightControllerPrimaryButtonTouch;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean rightControllerSecondaryButtonTouch
    // Size: 0x1
    // Offset: 0xC7
    bool rightControllerSecondaryButtonTouch;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean leftGrab
    // Size: 0x1
    // Offset: 0xC8
    bool leftGrab;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean leftGrabRelease
    // Size: 0x1
    // Offset: 0xC9
    bool leftGrabRelease;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean rightGrab
    // Size: 0x1
    // Offset: 0xCA
    bool rightGrab;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean rightGrabRelease
    // Size: 0x1
    // Offset: 0xCB
    bool rightGrabRelease;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean leftGrabMomentary
    // Size: 0x1
    // Offset: 0xCC
    bool leftGrabMomentary;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean leftGrabReleaseMomentary
    // Size: 0x1
    // Offset: 0xCD
    bool leftGrabReleaseMomentary;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean rightGrabMomentary
    // Size: 0x1
    // Offset: 0xCE
    bool rightGrabMomentary;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean rightGrabReleaseMomentary
    // Size: 0x1
    // Offset: 0xCF
    bool rightGrabReleaseMomentary;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private GorillaControllerType <controllerType>k__BackingField
    // Size: 0x4
    // Offset: 0xD0
    ::GlobalNamespace::GorillaControllerType controllerType;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::GorillaControllerType) == 0x4);
    // public UnityEngine.Vector2 leftControllerPrimary2DAxis
    // Size: 0x8
    // Offset: 0xD4
    ::UnityEngine::Vector2 leftControllerPrimary2DAxis;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // public UnityEngine.Vector2 rightControllerPrimary2DAxis
    // Size: 0x8
    // Offset: 0xDC
    ::UnityEngine::Vector2 rightControllerPrimary2DAxis;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    public:
    // Get static field: static public ControllerInputPoller instance
    static ::GlobalNamespace::ControllerInputPoller* _get_instance();
    // Set static field: static public ControllerInputPoller instance
    static void _set_instance(::GlobalNamespace::ControllerInputPoller* value);
    // Get instance field reference: public System.Single leftControllerIndexFloat
    [[deprecated("Use field access instead!")]] float& dyn_leftControllerIndexFloat();
    // Get instance field reference: public System.Single leftControllerGripFloat
    [[deprecated("Use field access instead!")]] float& dyn_leftControllerGripFloat();
    // Get instance field reference: public System.Single rightControllerIndexFloat
    [[deprecated("Use field access instead!")]] float& dyn_rightControllerIndexFloat();
