// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: IDelayedExecListener
#include "GlobalNamespace/IDelayedExecListener.hpp"
// Including type: ITickSystemTick
#include "GlobalNamespace/ITickSystemTick.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
// Including type: UnityEngine.ResourceManagement.AsyncOperations.AsyncOperationHandle`1
#include "UnityEngine/ResourceManagement/AsyncOperations/AsyncOperationHandle_1.hpp"
// Including type: GorillaTag.CosmeticSystem.CosmeticAttachInfo
#include "GorillaTag/CosmeticSystem/CosmeticAttachInfo.hpp"
// Including type: GorillaTag.CosmeticSystem.CosmeticPart
#include "GorillaTag/CosmeticSystem/CosmeticPart.hpp"
// Including type: GorillaTag.CosmeticSystem.CosmeticInfoV2
#include "GorillaTag/CosmeticSystem/CosmeticInfoV2.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: BodyDockPositions
  class BodyDockPositions;
  // Forward declaring type: SnowballMaker
  class SnowballMaker;
  // Forward declaring type: SnowballThrowable
  class SnowballThrowable;
  // Forward declaring type: VRRig
  class VRRig;
  // Skipping declaration: LoadOpInfo because it is already included!
  // Skipping declaration: TransferrableObject because it is already included!
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: GorillaLocomotion
namespace GorillaLocomotion {
  // Forward declaring type: Player
  class Player;
}
// Forward declaring namespace: System::Diagnostics
namespace System::Diagnostics {
  // Forward declaring type: Stopwatch
  class Stopwatch;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: CosmeticsV2Spawner_Dirty
  class CosmeticsV2Spawner_Dirty;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::CosmeticsV2Spawner_Dirty);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::CosmeticsV2Spawner_Dirty*, "", "CosmeticsV2Spawner_Dirty");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x12
  #pragma pack(push, 1)
  // Autogenerated type: CosmeticsV2Spawner_Dirty
  // [TokenAttribute] Offset: FFFFFFFF
  class CosmeticsV2Spawner_Dirty : public ::Il2CppObject/*, public ::GlobalNamespace::IDelayedExecListener, public ::GlobalNamespace::ITickSystemTick*/ {
    public:
    // Nested type: ::GlobalNamespace::CosmeticsV2Spawner_Dirty::LoadOpInfo
    struct LoadOpInfo;
    // Nested type: ::GlobalNamespace::CosmeticsV2Spawner_Dirty::VRRigData
    struct VRRigData;
    // WARNING Size may be invalid!
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: CosmeticsV2Spawner_Dirty/LoadOpInfo
    // [TokenAttribute] Offset: FFFFFFFF
    struct LoadOpInfo/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.Boolean isStarted
      // Size: 0x1
      // Offset: 0x0
      bool isStarted;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // public UnityEngine.ResourceManagement.AsyncOperations.AsyncOperationHandle`1<UnityEngine.GameObject> loadOp
      // Size: 0xFFFFFFFF
      // Offset: 0x8
      ::UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle_1<::UnityEngine::GameObject*> loadOp;
      // public UnityEngine.GameObject resultGObj
      // Size: 0x8
      // Offset: 0x28
      ::UnityEngine::GameObject* resultGObj;
      // Field size check
      static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
      // public readonly GorillaTag.CosmeticSystem.CosmeticAttachInfo attachInfo
      // Size: 0xFFFFFFFF
      // Offset: 0x30
      ::GorillaTag::CosmeticSystem::CosmeticAttachInfo attachInfo;
      // public readonly GorillaTag.CosmeticSystem.CosmeticPart part
      // Size: 0x14
      // Offset: 0x70
      ::GorillaTag::CosmeticSystem::CosmeticPart part;
      // Field size check
      static_assert(sizeof(::GorillaTag::CosmeticSystem::CosmeticPart) == 0x14);
      // public readonly System.Int32 partIndex
      // Size: 0x4
      // Offset: 0x88
      int partIndex;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public readonly GorillaTag.CosmeticSystem.CosmeticInfoV2 cosmeticInfoV2
      // Size: 0xFFFFFFFF
      // Offset: 0x90
      ::GorillaTag::CosmeticSystem::CosmeticInfoV2 cosmeticInfoV2;
      // public readonly System.Int32 vrRigIndex
      // Size: 0x4
      // Offset: 0x1C0
      int vrRigIndex;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: LoadOpInfo
      constexpr LoadOpInfo(bool isStarted_ = {}, ::UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle_1<::UnityEngine::GameObject*> loadOp_ = {}, ::UnityEngine::GameObject* resultGObj_ = {}, ::GorillaTag::CosmeticSystem::CosmeticAttachInfo attachInfo_ = {}, ::GorillaTag::CosmeticSystem::CosmeticPart part_ = {}, int partIndex_ = {}, ::GorillaTag::CosmeticSystem::CosmeticInfoV2 cosmeticInfoV2_ = {}, int vrRigIndex_ = {}) noexcept : isStarted{isStarted_}, loadOp{loadOp_}, resultGObj{resultGObj_}, attachInfo{attachInfo_}, part{part_}, partIndex{partIndex_}, cosmeticInfoV2{cosmeticInfoV2_}, vrRigIndex{vrRigIndex_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public System.Boolean isStarted
      [[deprecated("Use field access instead!")]] bool& dyn_isStarted();
      // Get instance field reference: public UnityEngine.ResourceManagement.AsyncOperations.AsyncOperationHandle`1<UnityEngine.GameObject> loadOp
      [[deprecated("Use field access instead!")]] ::UnityEngine::ResourceManagement::AsyncOperations::AsyncOperationHandle_1<::UnityEngine::GameObject*>& dyn_loadOp();
      // Get instance field reference: public UnityEngine.GameObject resultGObj
      [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_resultGObj();
      // Get instance field reference: public readonly GorillaTag.CosmeticSystem.CosmeticAttachInfo attachInfo
      [[deprecated("Use field access instead!")]] ::GorillaTag::CosmeticSystem::CosmeticAttachInfo& dyn_attachInfo();
      // Get instance field reference: public readonly GorillaTag.CosmeticSystem.CosmeticPart part
      [[deprecated("Use field access instead!")]] ::GorillaTag::CosmeticSystem::CosmeticPart& dyn_part();
      // Get instance field reference: public readonly System.Int32 partIndex
      [[deprecated("Use field access instead!")]] int& dyn_partIndex();
      // Get instance field reference: public readonly GorillaTag.CosmeticSystem.CosmeticInfoV2 cosmeticInfoV2
      [[deprecated("Use field access instead!")]] ::GorillaTag::CosmeticSystem::CosmeticInfoV2& dyn_cosmeticInfoV2();
      // Get instance field reference: public readonly System.Int32 vrRigIndex
      [[deprecated("Use field access instead!")]] int& dyn_vrRigIndex();
      // public System.Void .ctor(GorillaTag.CosmeticSystem.CosmeticAttachInfo attachInfo, GorillaTag.CosmeticSystem.CosmeticPart part, System.Int32 partIndex, GorillaTag.CosmeticSystem.CosmeticInfoV2 cosmeticInfoV2, System.Int32 vrRigIndex)
      // Offset: 0x2797218
      LoadOpInfo(::GorillaTag::CosmeticSystem::CosmeticAttachInfo attachInfo, ::GorillaTag::CosmeticSystem::CosmeticPart part, int partIndex, ::GorillaTag::CosmeticSystem::CosmeticInfoV2 cosmeticInfoV2, int vrRigIndex);
    }; // CosmeticsV2Spawner_Dirty/LoadOpInfo
    // WARNING Not writing size check since size may be invalid!
    // Size: 0x50
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: CosmeticsV2Spawner_Dirty/VRRigData
    // [TokenAttribute] Offset: FFFFFFFF
    struct VRRigData/*, public ::System::ValueType*/ {
      public:
      public:
      // public readonly VRRig vrRig
      // Size: 0x8
      // Offset: 0x0
      ::GlobalNamespace::VRRig* vrRig;
      // Field size check
      static_assert(sizeof(::GlobalNamespace::VRRig*) == 0x8);
      // public readonly UnityEngine.Transform[] boneXforms
      // Size: 0x8
      // Offset: 0x8
      ::ArrayW<::UnityEngine::Transform*> boneXforms;
      // Field size check
      static_assert(sizeof(::ArrayW<::UnityEngine::Transform*>) == 0x8);
      // public readonly BodyDockPositions bdPositionsComp
      // Size: 0x8
      // Offset: 0x10
      ::GlobalNamespace::BodyDockPositions* bdPositionsComp;
      // Field size check
      static_assert(sizeof(::GlobalNamespace::BodyDockPositions*) == 0x8);
      // public readonly System.Collections.Generic.List`1<UnityEngine.GameObject> vrRig_cosmetics
      // Size: 0x8
      // Offset: 0x18
      ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>* vrRig_cosmetics;
      // Field size check
      static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*) == 0x8);
      // public readonly System.Collections.Generic.List`1<UnityEngine.GameObject> vrRig_override
      // Size: 0x8
      // Offset: 0x20
      ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>* vrRig_override;
      // Field size check
      static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*) == 0x8);
      // public readonly UnityEngine.Transform parentOfDeactivatedHoldables
      // Size: 0x8
      // Offset: 0x28
      ::UnityEngine::Transform* parentOfDeactivatedHoldables;
      // Field size check
      static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
      // public readonly System.Collections.Generic.List`1<TransferrableObject> bdPositions_allObjects
      // Size: 0x8
      // Offset: 0x30
      ::System::Collections::Generic::List_1<::GlobalNamespace::TransferrableObject*>* bdPositions_allObjects;
      // Field size check
      static_assert(sizeof(::System::Collections::Generic::List_1<::GlobalNamespace::TransferrableObject*>*) == 0x8);
      // public System.Int32 bdPositions_allObjects_length
      // Size: 0x4
      // Offset: 0x38
      int bdPositions_allObjects_length;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Padding between fields: bdPositions_allObjects_length and: bdPositions_leftHandThrowables
      char __padding7[0x4] = {};
      // public readonly System.Collections.Generic.List`1<UnityEngine.GameObject> bdPositions_leftHandThrowables
      // Size: 0x8
      // Offset: 0x40
      ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>* bdPositions_leftHandThrowables;
      // Field size check
      static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*) == 0x8);
      // public readonly System.Collections.Generic.List`1<UnityEngine.GameObject> bdPositions_rightHandThrowables
      // Size: 0x8
      // Offset: 0x48
      ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>* bdPositions_rightHandThrowables;
      // Field size check
      static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*) == 0x8);
      public:
      // Creating value type constructor for type: VRRigData
      constexpr VRRigData(::GlobalNamespace::VRRig* vrRig_ = {}, ::ArrayW<::UnityEngine::Transform*> boneXforms_ = ::ArrayW<::UnityEngine::Transform*>(static_cast<void*>(nullptr)), ::GlobalNamespace::BodyDockPositions* bdPositionsComp_ = {}, ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>* vrRig_cosmetics_ = {}, ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>* vrRig_override_ = {}, ::UnityEngine::Transform* parentOfDeactivatedHoldables_ = {}, ::System::Collections::Generic::List_1<::GlobalNamespace::TransferrableObject*>* bdPositions_allObjects_ = {}, int bdPositions_allObjects_length_ = {}, ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>* bdPositions_leftHandThrowables_ = {}, ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>* bdPositions_rightHandThrowables_ = {}) noexcept : vrRig{vrRig_}, boneXforms{boneXforms_}, bdPositionsComp{bdPositionsComp_}, vrRig_cosmetics{vrRig_cosmetics_}, vrRig_override{vrRig_override_}, parentOfDeactivatedHoldables{parentOfDeactivatedHoldables_}, bdPositions_allObjects{bdPositions_allObjects_}, bdPositions_allObjects_length{bdPositions_allObjects_length_}, bdPositions_leftHandThrowables{bdPositions_leftHandThrowables_}, bdPositions_rightHandThrowables{bdPositions_rightHandThrowables_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public readonly VRRig vrRig
      [[deprecated("Use field access instead!")]] ::GlobalNamespace::VRRig*& dyn_vrRig();
      // Get instance field reference: public readonly UnityEngine.Transform[] boneXforms
      [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::Transform*>& dyn_boneXforms();
      // Get instance field reference: public readonly BodyDockPositions bdPositionsComp
      [[deprecated("Use field access instead!")]] ::GlobalNamespace::BodyDockPositions*& dyn_bdPositionsComp();
      // Get instance field reference: public readonly System.Collections.Generic.List`1<UnityEngine.GameObject> vrRig_cosmetics
      [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*& dyn_vrRig_cosmetics();
      // Get instance field reference: public readonly System.Collections.Generic.List`1<UnityEngine.GameObject> vrRig_override
      [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*& dyn_vrRig_override();
      // Get instance field reference: public readonly UnityEngine.Transform parentOfDeactivatedHoldables
      [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_parentOfDeactivatedHoldables();
      // Get instance field reference: public readonly System.Collections.Generic.List`1<TransferrableObject> bdPositions_allObjects
      [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::GlobalNamespace::TransferrableObject*>*& dyn_bdPositions_allObjects();
      // Get instance field reference: public System.Int32 bdPositions_allObjects_length
      [[deprecated("Use field access instead!")]] int& dyn_bdPositions_allObjects_length();
      // Get instance field reference: public readonly System.Collections.Generic.List`1<UnityEngine.GameObject> bdPositions_leftHandThrowables
      [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*& dyn_bdPositions_leftHandThrowables();
      // Get instance field reference: public readonly System.Collections.Generic.List`1<UnityEngine.GameObject> bdPositions_rightHandThrowables
      [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*& dyn_bdPositions_rightHandThrowables();
      // public System.Void .ctor(VRRig vrRig, UnityEngine.Transform[] boneXforms)
      // Offset: 0x2796B64
      VRRigData(::GlobalNamespace::VRRig* vrRig, ::ArrayW<::UnityEngine::Transform*> boneXforms);
    }; // CosmeticsV2Spawner_Dirty/VRRigData
    #pragma pack(pop)
    static check_size<sizeof(CosmeticsV2Spawner_Dirty::VRRigData), 72 + sizeof(::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*)> __GlobalNamespace_CosmeticsV2Spawner_Dirty_VRRigDataSizeCheck;
    static_assert(sizeof(CosmeticsV2Spawner_Dirty::VRRigData) == 0x50);
    public:
    // private System.Boolean _shouldTick
    // Size: 0x1
    // Offset: 0x10
    bool shouldTick;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <TickRunning>k__BackingField
    // Size: 0x1
    // Offset: 0x11
    bool TickRunning;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating interface conversion operator: operator ::GlobalNamespace::IDelayedExecListener
    operator ::GlobalNamespace::IDelayedExecListener() noexcept {
      return *reinterpret_cast<::GlobalNamespace::IDelayedExecListener*>(this);
    }
    // Creating interface conversion operator: operator ::GlobalNamespace::ITickSystemTick
    operator ::GlobalNamespace::ITickSystemTick() noexcept {
      return *reinterpret_cast<::GlobalNamespace::ITickSystemTick*>(this);
    }
    // Get static field: static private CosmeticsV2Spawner_Dirty _instance
    static ::GlobalNamespace::CosmeticsV2Spawner_Dirty* _get__instance();
    // Set static field: static private CosmeticsV2Spawner_Dirty _instance
    static void _set__instance(::GlobalNamespace::CosmeticsV2Spawner_Dirty* value);
    // Get static field: static public System.Action OnPostInstantiateAllPrefabs
