// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: GorillaTag.ISpawnable
#include "GorillaTag/ISpawnable.hpp"
// Including type: UnityEngine.XR.InputDevice
#include "UnityEngine/XR/InputDevice.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: AudioSource
  class AudioSource;
  // Forward declaring type: AudioClip
  class AudioClip;
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: VRRig
  class VRRig;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: FingerTorch
  class FingerTorch;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::FingerTorch);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::FingerTorch*, "", "FingerTorch");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x8D
  #pragma pack(push, 1)
  // Autogenerated type: FingerTorch
  // [TokenAttribute] Offset: FFFFFFFF
  class FingerTorch : public ::UnityEngine::MonoBehaviour/*, public ::GorillaTag::ISpawnable*/ {
    public:
    public:
    // public System.Boolean attachedToLeftHand
    // Size: 0x1
    // Offset: 0x20
    bool attachedToLeftHand;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: attachedToLeftHand and: pinkyRingBone
    char __padding0[0x7] = {};
    // public UnityEngine.Transform pinkyRingBone
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::Transform* pinkyRingBone;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Transform thumbRingBone
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Transform* thumbRingBone;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.AudioSource audioSource
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::AudioSource* audioSource;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // public UnityEngine.AudioClip extendAudioClip
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::AudioClip* extendAudioClip;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // public UnityEngine.AudioClip retractAudioClip
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::AudioClip* retractAudioClip;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // public System.Single extendVibrationDuration
    // Size: 0x4
    // Offset: 0x50
    float extendVibrationDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single extendVibrationStrength
    // Size: 0x4
    // Offset: 0x54
    float extendVibrationStrength;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single retractVibrationDuration
    // Size: 0x4
    // Offset: 0x58
    float retractVibrationDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single retractVibrationStrength
    // Size: 0x4
    // Offset: 0x5C
    float retractVibrationStrength;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.GameObject particleFX
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::GameObject* particleFX;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Boolean networkedExtended
    // Size: 0x1
    // Offset: 0x68
    bool networkedExtended;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean extended
    // Size: 0x1
    // Offset: 0x69
    bool extended;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean fullyRetracted
    // Size: 0x1
    // Offset: 0x6A
    bool fullyRetracted;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: fullyRetracted and: retractExtendTime
    char __padding13[0x1] = {};
    // private System.Single retractExtendTime
    // Size: 0x4
    // Offset: 0x6C
    float retractExtendTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.XR.InputDevice inputDevice
    // Size: 0x9
    // Offset: 0x70
    ::UnityEngine::XR::InputDevice inputDevice;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::InputDevice) == 0x9);
    // Padding between fields: inputDevice and: myRig
    char __padding15[0x7] = {};
    // private VRRig myRig
    // Size: 0x8
    // Offset: 0x80
    ::GlobalNamespace::VRRig* myRig;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::VRRig*) == 0x8);
    // private System.Int32 stateBitIndex
    // Size: 0x4
    // Offset: 0x88
    int stateBitIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean <GorillaTag.ISpawnable.IsSpawned>k__BackingField
    // Size: 0x1
    // Offset: 0x8C
    bool IsSpawned;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating interface conversion operator: operator ::GorillaTag::ISpawnable
    operator ::GorillaTag::ISpawnable() noexcept {
      return *reinterpret_cast<::GorillaTag::ISpawnable*>(this);
    }
    // Get instance field reference: public System.Boolean attachedToLeftHand
    [[deprecated("Use field access instead!")]] bool& dyn_attachedToLeftHand();
    // Get instance field reference: public UnityEngine.Transform pinkyRingBone
    [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_pinkyRingBone();
    // Get instance field reference: public UnityEngine.Transform thumbRingBone
    [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_thumbRingBone();
    // Get instance field reference: public UnityEngine.AudioSource audioSource
    [[deprecated("Use field access instead!")]] ::UnityEngine::AudioSource*& dyn_audioSource();
    // Get instance field reference: public UnityEngine.AudioClip extendAudioClip
    [[deprecated("Use field access instead!")]] ::UnityEngine::AudioClip*& dyn_extendAudioClip();
    // Get instance field reference: public UnityEngine.AudioClip retractAudioClip
    [[deprecated("Use field access instead!")]] ::UnityEngine::AudioClip*& dyn_retractAudioClip();
    // Get instance field reference: public System.Single extendVibrationDuration
    [[deprecated("Use field access instead!")]] float& dyn_extendVibrationDuration();
    // Get instance field reference: public System.Single extendVibrationStrength
    [[deprecated("Use field access instead!")]] float& dyn_extendVibrationStrength();
    // Get instance field reference: public System.Single retractVibrationDuration
    [[deprecated("Use field access instead!")]] float& dyn_retractVibrationDuration();
    // Get instance field reference: public System.Single retractVibrationStrength
    [[deprecated("Use field access instead!")]] float& dyn_retractVibrationStrength();
    // Get instance field reference: public UnityEngine.GameObject particleFX
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_particleFX();
    // Get instance field reference: private System.Boolean networkedExtended
    [[deprecated("Use field access instead!")]] bool& dyn_networkedExtended();
    // Get instance field reference: private System.Boolean extended
    [[deprecated("Use field access instead!")]] bool& dyn_extended();
    // Get instance field reference: private System.Boolean fullyRetracted
    [[deprecated("Use field access instead!")]] bool& dyn_fullyRetracted();
    // Get instance field reference: private System.Single retractExtendTime
    [[deprecated("Use field access instead!")]] float& dyn_retractExtendTime();
    // Get instance field reference: private UnityEngine.XR.InputDevice inputDevice
    [[deprecated("Use field access instead!")]] ::UnityEngine::XR::InputDevice& dyn_inputDevice();
    // Get instance field reference: private VRRig myRig
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::VRRig*& dyn_myRig();
    // Get instance field reference: private System.Int32 stateBitIndex
    [[deprecated("Use field access instead!")]] int& dyn_stateBitIndex();
    // Get instance field reference: private System.Boolean <GorillaTag.ISpawnable.IsSpawned>k__BackingField
    [[deprecated("Use field access instead!")]] bool& dyn_$GorillaTag_ISpawnable_IsSpawned$k__BackingField();
    // private System.Boolean GorillaTag.ISpawnable.get_IsSpawned()
    // Offset: 0x26A287C
    bool GorillaTag_ISpawnable_get_IsSpawned();
    // private System.Void GorillaTag.ISpawnable.set_IsSpawned(System.Boolean value)
    // Offset: 0x26A2884
    void GorillaTag_ISpawnable_set_IsSpawned(bool value);
    // private System.Void GorillaTag.ISpawnable.OnSpawn()
    // Offset: 0x26A2890
    void GorillaTag_ISpawnable_OnSpawn();
    // private System.Void GorillaTag.ISpawnable.OnDespawn()
    // Offset: 0x26A2960
    void GorillaTag_ISpawnable_OnDespawn();
    // protected System.Void OnEnable()
    // Offset: 0x26A2964
    void OnEnable();
    // protected System.Void OnDisable()
    // Offset: 0x26A2B58
    void OnDisable();
    // private System.Void UpdateLocal()
    // Offset: 0x26A2B5C
    void UpdateLocal();
    // private System.Void UpdateShared()
    // Offset: 0x26A2CAC
    void UpdateShared();
    // private System.Void UpdateReplicated()
    // Offset: 0x26A2CF4
    void UpdateReplicated();
    // public System.Boolean IsMyItem()
    // Offset: 0x26A2D88
    bool IsMyItem();
    // protected System.Void LateUpdate()
    // Offset: 0x26A2E10
    void LateUpdate();
    // private System.Void OnExtendStateChanged(System.Boolean playAudio)
    // Offset: 0x26A2A00
    void OnExtendStateChanged(bool playAudio);
    // public System.Void .ctor()
    // Offset: 0x26A2E40
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static FingerTorch* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::GlobalNamespace::FingerTorch::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<FingerTorch*, creationType>()));
    }
  }; // FingerTorch
  #pragma pack(pop)
  static check_size<sizeof(FingerTorch), 140 + sizeof(bool)> __GlobalNamespace_FingerTorchSizeCheck;
  static_assert(sizeof(FingerTorch) == 0x8D);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: GlobalNamespace::FingerTorch::GorillaTag_ISpawnable_get_IsSpawned
// Il2CppName: GorillaTag.ISpawnable.get_IsSpawned
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (GlobalNamespace::FingerTorch::*)()>(&GlobalNamespace::FingerTorch::GorillaTag_ISpawnable_get_IsSpawned)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::FingerTorch*), "GorillaTag.ISpawnable.get_IsSpawned", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::FingerTorch::GorillaTag_ISpawnable_set_IsSpawned
// Il2CppName: GorillaTag.ISpawnable.set_IsSpawned
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::FingerTorch::*)(bool)>(&GlobalNamespace::FingerTorch::GorillaTag_ISpawnable_set_IsSpawned)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("System", "Boolean")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::FingerTorch*), "GorillaTag.ISpawnable.set_IsSpawned", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::FingerTorch::GorillaTag_ISpawnable_OnSpawn
// Il2CppName: GorillaTag.ISpawnable.OnSpawn
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::FingerTorch::*)()>(&GlobalNamespace::FingerTorch::GorillaTag_ISpawnable_OnSpawn)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::FingerTorch*), "GorillaTag.ISpawnable.OnSpawn", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::FingerTorch::GorillaTag_ISpawnable_OnDespawn
// Il2CppName: GorillaTag.ISpawnable.OnDespawn
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::FingerTorch::*)()>(&GlobalNamespace::FingerTorch::GorillaTag_ISpawnable_OnDespawn)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::FingerTorch*), "GorillaTag.ISpawnable.OnDespawn", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::FingerTorch::OnEnable
// Il2CppName: OnEnable
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::FingerTorch::*)()>(&GlobalNamespace::FingerTorch::OnEnable)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::FingerTorch*), "OnEnable", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::FingerTorch::OnDisable
// Il2CppName: OnDisable
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::FingerTorch::*)()>(&GlobalNamespace::FingerTorch::OnDisable)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::FingerTorch*), "OnDisable", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::FingerTorch::UpdateLocal
// Il2CppName: UpdateLocal
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::FingerTorch::*)()>(&GlobalNamespace::FingerTorch::UpdateLocal)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::FingerTorch*), "UpdateLocal", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::FingerTorch::UpdateShared
// Il2CppName: UpdateShared
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::FingerTorch::*)()>(&GlobalNamespace::FingerTorch::UpdateShared)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::FingerTorch*), "UpdateShared", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::FingerTorch::UpdateReplicated
// Il2CppName: UpdateReplicated
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::FingerTorch::*)()>(&GlobalNamespace::FingerTorch::UpdateReplicated)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::FingerTorch*), "UpdateReplicated", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::FingerTorch::IsMyItem
// Il2CppName: IsMyItem
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (GlobalNamespace::FingerTorch::*)()>(&GlobalNamespace::FingerTorch::IsMyItem)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::FingerTorch*), "IsMyItem", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::FingerTorch::LateUpdate
// Il2CppName: LateUpdate
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::FingerTorch::*)()>(&GlobalNamespace::FingerTorch::LateUpdate)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::FingerTorch*), "LateUpdate", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::FingerTorch::OnExtendStateChanged
// Il2CppName: OnExtendStateChanged
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::FingerTorch::*)(bool)>(&GlobalNamespace::FingerTorch::OnExtendStateChanged)> {
  static const MethodInfo* get() {
    static auto* playAudio = &::il2cpp_utils::GetClassFromName("System", "Boolean")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::FingerTorch*), "OnExtendStateChanged", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{playAudio});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::FingerTorch::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
