// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: FusionGraphBase
#include "GlobalNamespace/FusionGraphBase.hpp"
// Including type: Fusion.FusionGraphVisualization
#include "Fusion/FusionGraphVisualization.hpp"
// Including type: System.ValueTuple`2
#include "System/ValueTuple_2.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Text
  class Text;
  // Forward declaring type: Image
  class Image;
  // Forward declaring type: Dropdown
  class Dropdown;
  // Forward declaring type: Button
  class Button;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Shader
  class Shader;
  // Forward declaring type: RectTransform
  class RectTransform;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Skipping declaration: Layouts because it is already included!
  // Skipping declaration: ShowGraphOptions because it is already included!
  // Forward declaring type: FusionStats
  class FusionStats;
}
// Forward declaring namespace: Fusion
namespace Fusion {
  // Forward declaring type: IStatsBuffer
  class IStatsBuffer;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: FusionGraph
  class FusionGraph;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::FusionGraph);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::FusionGraph*, "", "FusionGraph");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x170
  #pragma pack(push, 1)
  // Autogenerated type: FusionGraph
  // [TokenAttribute] Offset: FFFFFFFF
  class FusionGraph : public ::GlobalNamespace::FusionGraphBase {
    public:
    // Nested type: ::GlobalNamespace::FusionGraph::Layouts
    struct Layouts;
    // Nested type: ::GlobalNamespace::FusionGraph::ShowGraphOptions
    struct ShowGraphOptions;
    // Nested type: ::GlobalNamespace::FusionGraph::ShaderType
    struct ShaderType;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: FusionGraph/Layouts
    // [TokenAttribute] Offset: FFFFFFFF
    struct Layouts/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: Layouts
      constexpr Layouts(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public FusionGraph/Layouts Auto
      static constexpr const int Auto = 0;
      // Get static field: static public FusionGraph/Layouts Auto
      static ::GlobalNamespace::FusionGraph::Layouts _get_Auto();
      // Set static field: static public FusionGraph/Layouts Auto
      static void _set_Auto(::GlobalNamespace::FusionGraph::Layouts value);
      // static field const value: static public FusionGraph/Layouts FullAuto
      static constexpr const int FullAuto = 1;
      // Get static field: static public FusionGraph/Layouts FullAuto
      static ::GlobalNamespace::FusionGraph::Layouts _get_FullAuto();
      // Set static field: static public FusionGraph/Layouts FullAuto
      static void _set_FullAuto(::GlobalNamespace::FusionGraph::Layouts value);
      // static field const value: static public FusionGraph/Layouts FullNoOverlap
      static constexpr const int FullNoOverlap = 2;
      // Get static field: static public FusionGraph/Layouts FullNoOverlap
      static ::GlobalNamespace::FusionGraph::Layouts _get_FullNoOverlap();
      // Set static field: static public FusionGraph/Layouts FullNoOverlap
      static void _set_FullNoOverlap(::GlobalNamespace::FusionGraph::Layouts value);
      // static field const value: static public FusionGraph/Layouts CenteredAuto
      static constexpr const int CenteredAuto = 3;
      // Get static field: static public FusionGraph/Layouts CenteredAuto
      static ::GlobalNamespace::FusionGraph::Layouts _get_CenteredAuto();
      // Set static field: static public FusionGraph/Layouts CenteredAuto
      static void _set_CenteredAuto(::GlobalNamespace::FusionGraph::Layouts value);
      // static field const value: static public FusionGraph/Layouts CenteredNoGraph
      static constexpr const int CenteredNoGraph = 4;
      // Get static field: static public FusionGraph/Layouts CenteredNoGraph
      static ::GlobalNamespace::FusionGraph::Layouts _get_CenteredNoGraph();
      // Set static field: static public FusionGraph/Layouts CenteredNoGraph
      static void _set_CenteredNoGraph(::GlobalNamespace::FusionGraph::Layouts value);
      // static field const value: static public FusionGraph/Layouts CenteredNoOverlap
      static constexpr const int CenteredNoOverlap = 5;
      // Get static field: static public FusionGraph/Layouts CenteredNoOverlap
      static ::GlobalNamespace::FusionGraph::Layouts _get_CenteredNoOverlap();
      // Set static field: static public FusionGraph/Layouts CenteredNoOverlap
      static void _set_CenteredNoOverlap(::GlobalNamespace::FusionGraph::Layouts value);
      // static field const value: static public FusionGraph/Layouts CompactAuto
      static constexpr const int CompactAuto = 6;
      // Get static field: static public FusionGraph/Layouts CompactAuto
      static ::GlobalNamespace::FusionGraph::Layouts _get_CompactAuto();
      // Set static field: static public FusionGraph/Layouts CompactAuto
      static void _set_CompactAuto(::GlobalNamespace::FusionGraph::Layouts value);
      // static field const value: static public FusionGraph/Layouts CompactNoGraph
      static constexpr const int CompactNoGraph = 7;
      // Get static field: static public FusionGraph/Layouts CompactNoGraph
      static ::GlobalNamespace::FusionGraph::Layouts _get_CompactNoGraph();
      // Set static field: static public FusionGraph/Layouts CompactNoGraph
      static void _set_CompactNoGraph(::GlobalNamespace::FusionGraph::Layouts value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // FusionGraph/Layouts
    #pragma pack(pop)
    static check_size<sizeof(FusionGraph::Layouts), 0 + sizeof(int)> __GlobalNamespace_FusionGraph_LayoutsSizeCheck;
    static_assert(sizeof(FusionGraph::Layouts) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: FusionGraph/ShowGraphOptions
    // [TokenAttribute] Offset: FFFFFFFF
    struct ShowGraphOptions/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: ShowGraphOptions
      constexpr ShowGraphOptions(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public FusionGraph/ShowGraphOptions Never
      static constexpr const int Never = 0;
      // Get static field: static public FusionGraph/ShowGraphOptions Never
      static ::GlobalNamespace::FusionGraph::ShowGraphOptions _get_Never();
      // Set static field: static public FusionGraph/ShowGraphOptions Never
      static void _set_Never(::GlobalNamespace::FusionGraph::ShowGraphOptions value);
      // static field const value: static public FusionGraph/ShowGraphOptions OverlayOnly
      static constexpr const int OverlayOnly = 1;
      // Get static field: static public FusionGraph/ShowGraphOptions OverlayOnly
      static ::GlobalNamespace::FusionGraph::ShowGraphOptions _get_OverlayOnly();
      // Set static field: static public FusionGraph/ShowGraphOptions OverlayOnly
      static void _set_OverlayOnly(::GlobalNamespace::FusionGraph::ShowGraphOptions value);
      // static field const value: static public FusionGraph/ShowGraphOptions Always
      static constexpr const int Always = 2;
      // Get static field: static public FusionGraph/ShowGraphOptions Always
      static ::GlobalNamespace::FusionGraph::ShowGraphOptions _get_Always();
      // Set static field: static public FusionGraph/ShowGraphOptions Always
      static void _set_Always(::GlobalNamespace::FusionGraph::ShowGraphOptions value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // FusionGraph/ShowGraphOptions
    #pragma pack(pop)
    static check_size<sizeof(FusionGraph::ShowGraphOptions), 0 + sizeof(int)> __GlobalNamespace_FusionGraph_ShowGraphOptionsSizeCheck;
    static_assert(sizeof(FusionGraph::ShowGraphOptions) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: FusionGraph/ShaderType
    // [TokenAttribute] Offset: FFFFFFFF
    struct ShaderType/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: ShaderType
      constexpr ShaderType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public FusionGraph/ShaderType None
      static constexpr const int None = 0;
      // Get static field: static public FusionGraph/ShaderType None
      static ::GlobalNamespace::FusionGraph::ShaderType _get_None();
      // Set static field: static public FusionGraph/ShaderType None
      static void _set_None(::GlobalNamespace::FusionGraph::ShaderType value);
      // static field const value: static public FusionGraph/ShaderType Overlay
      static constexpr const int Overlay = 1;
      // Get static field: static public FusionGraph/ShaderType Overlay
      static ::GlobalNamespace::FusionGraph::ShaderType _get_Overlay();
      // Set static field: static public FusionGraph/ShaderType Overlay
      static void _set_Overlay(::GlobalNamespace::FusionGraph::ShaderType value);
      // static field const value: static public FusionGraph/ShaderType GameObject
      static constexpr const int GameObject = 2;
      // Get static field: static public FusionGraph/ShaderType GameObject
      static ::GlobalNamespace::FusionGraph::ShaderType _get_GameObject();
      // Set static field: static public FusionGraph/ShaderType GameObject
      static void _set_GameObject(::GlobalNamespace::FusionGraph::ShaderType value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // FusionGraph/ShaderType
    #pragma pack(pop)
    static check_size<sizeof(FusionGraph::ShaderType), 0 + sizeof(int)> __GlobalNamespace_FusionGraph_ShaderTypeSizeCheck;
    static_assert(sizeof(FusionGraph::ShaderType) == 0x4);
    public:
    // public System.Single Height
    // Size: 0x4
    // Offset: 0xB8
    float Height;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private FusionGraph/Layouts _layout
    // Size: 0x4
    // Offset: 0xBC
    ::GlobalNamespace::FusionGraph::Layouts layout;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::FusionGraph::Layouts) == 0x4);
    // private FusionGraph/ShowGraphOptions _showGraph
    // Size: 0x4
    // Offset: 0xC0
    ::GlobalNamespace::FusionGraph::ShowGraphOptions showGraph;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::FusionGraph::ShowGraphOptions) == 0x4);
    // public System.Single Padding
    // Size: 0x4
    // Offset: 0xC4
    float Padding;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean _alwaysExpandGraph
    // Size: 0x1
    // Offset: 0xC8
    bool alwaysExpandGraph;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _showUITargets
    // Size: 0x1
    // Offset: 0xC9
    bool showUITargets;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: showUITargets and: GraphImg
    char __padding5[0x6] = {};
    // public UnityEngine.UI.Image GraphImg
    // Size: 0x8
    // Offset: 0xD0
    ::UnityEngine::UI::Image* GraphImg;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Image*) == 0x8);
    // public UnityEngine.UI.Text LabelMin
    // Size: 0x8
    // Offset: 0xD8
    ::UnityEngine::UI::Text* LabelMin;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // public UnityEngine.UI.Text LabelMax
    // Size: 0x8
    // Offset: 0xE0
    ::UnityEngine::UI::Text* LabelMax;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // public UnityEngine.UI.Text LabelAvg
    // Size: 0x8
    // Offset: 0xE8
    ::UnityEngine::UI::Text* LabelAvg;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // public UnityEngine.UI.Text LabelLast
    // Size: 0x8
    // Offset: 0xF0
    ::UnityEngine::UI::Text* LabelLast;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // public UnityEngine.UI.Text LabelPer
    // Size: 0x8
    // Offset: 0xF8
    ::UnityEngine::UI::Text* LabelPer;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // public UnityEngine.UI.Dropdown _viewDropdown
    // Size: 0x8
    // Offset: 0x100
    ::UnityEngine::UI::Dropdown* viewDropdown;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Dropdown*) == 0x8);
    // public UnityEngine.UI.Button _avgBttn
    // Size: 0x8
    // Offset: 0x108
    ::UnityEngine::UI::Button* avgBttn;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Button*) == 0x8);
    // private System.Single _min
    // Size: 0x4
    // Offset: 0x110
    float min;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _max
    // Size: 0x4
    // Offset: 0x114
    float max;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single[] _values
    // Size: 0x8
    // Offset: 0x118
    ::ArrayW<float> values;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    // private System.Single[] _intensity
    // Size: 0x8
    // Offset: 0x120
    ::ArrayW<float> intensity;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    // private System.Single[] _histogram
    // Size: 0x8
    // Offset: 0x128
    ::ArrayW<float> histogram;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    // private System.Collections.Generic.List`1<System.Int32> DropdownLookup
    // Size: 0x8
    // Offset: 0x130
    ::System::Collections::Generic::List_1<int>* DropdownLookup;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<int>*) == 0x8);
    // private Fusion.FusionGraphVisualization _graphVisualization
    // Size: 0x4
    // Offset: 0x138
    ::Fusion::FusionGraphVisualization graphVisualization;
    // Field size check
    static_assert(sizeof(::Fusion::FusionGraphVisualization) == 0x4);
    // private FusionGraph/ShaderType _currentShader
    // Size: 0x4
    // Offset: 0x13C
    ::GlobalNamespace::FusionGraph::ShaderType currentShader;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::FusionGraph::ShaderType) == 0x4);
    // private System.ValueTuple`2<System.Int32,System.Single>[] _cachedValues
    // Size: 0x8
    // Offset: 0x140
    ::ArrayW<::System::ValueTuple_2<int, float>> cachedValues;
    // Field size check
    static_assert(sizeof(::ArrayW<::System::ValueTuple_2<int, float>>) == 0x8);
    // private System.Double _lastCachedTickTime
    // Size: 0x8
    // Offset: 0x148
    double lastCachedTickTime;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private System.Int32 _lastCachedTick
    // Size: 0x4
    // Offset: 0x150
    int lastCachedTick;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _histoHighestUsedBucketIndex
    // Size: 0x4
    // Offset: 0x154
    int histoHighestUsedBucketIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _histoAvgSampleCount
    // Size: 0x4
    // Offset: 0x158
    int histoAvgSampleCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: histoAvgSampleCount and: histoStepInverse
    char __padding26[0x4] = {};
    // private System.Double _histoStepInverse
    // Size: 0x8
    // Offset: 0x160
    double histoStepInverse;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private System.Double _histoAvg
    // Size: 0x8
    // Offset: 0x168
    double histoAvg;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    public:
    // static field const value: static private System.Int32 GRPH_TOP_PAD
    static constexpr const int GRPH_TOP_PAD = 36;
    // Get static field: static private System.Int32 GRPH_TOP_PAD
    static int _get_GRPH_TOP_PAD();
    // Set static field: static private System.Int32 GRPH_TOP_PAD
    static void _set_GRPH_TOP_PAD(int value);
    // static field const value: static private System.Int32 GRPH_BTM_PAD
    static constexpr const int GRPH_BTM_PAD = 36;
    // Get static field: static private System.Int32 GRPH_BTM_PAD
    static int _get_GRPH_BTM_PAD();
    // Set static field: static private System.Int32 GRPH_BTM_PAD
    static void _set_GRPH_BTM_PAD(int value);
    // static field const value: static private System.Int32 HIDE_XTRAS_WDTH
    static constexpr const int HIDE_XTRAS_WDTH = 200;
    // Get static field: static private System.Int32 HIDE_XTRAS_WDTH
