// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: Fusion.INetworkRunnerCallbacks
#include "Fusion/INetworkRunnerCallbacks.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
}
// Forward declaring namespace: Fusion
namespace Fusion {
  // Forward declaring type: NetworkRunner
  class NetworkRunner;
  // Forward declaring type: SessionInfo
  class SessionInfo;
  // Forward declaring type: PlayerRef
  struct PlayerRef;
  // Forward declaring type: NetworkInput
  struct NetworkInput;
  // Forward declaring type: ShutdownReason
  struct ShutdownReason;
  // Forward declaring type: SimulationMessagePtr
  struct SimulationMessagePtr;
  // Forward declaring type: HostMigrationToken
  class HostMigrationToken;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Forward declaring namespace: Fusion::Sockets
namespace Fusion::Sockets {
  // Forward declaring type: NetAddress
  struct NetAddress;
  // Forward declaring type: NetConnectFailedReason
  struct NetConnectFailedReason;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: ArraySegment`1<T>
  template<typename T>
  struct ArraySegment_1;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: FusionRegionCrawler
  class FusionRegionCrawler;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::FusionRegionCrawler);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::FusionRegionCrawler*, "", "FusionRegionCrawler");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x4C
  #pragma pack(push, 1)
  // Autogenerated type: FusionRegionCrawler
  // [TokenAttribute] Offset: FFFFFFFF
  class FusionRegionCrawler : public ::UnityEngine::MonoBehaviour/*, public ::Fusion::INetworkRunnerCallbacks*/ {
    public:
    // Nested type: ::GlobalNamespace::FusionRegionCrawler::PlayerCountUpdated
    class PlayerCountUpdated;
    // Nested type: ::GlobalNamespace::FusionRegionCrawler::$OccasionalUpdate$d__12
    class $OccasionalUpdate$d__12;
    // Nested type: ::GlobalNamespace::FusionRegionCrawler::$UpdatePlayerCount$d__13
    class $UpdatePlayerCount$d__13;
    public:
    // public FusionRegionCrawler/PlayerCountUpdated OnPlayerCountUpdated
    // Size: 0x8
    // Offset: 0x20
    ::GlobalNamespace::FusionRegionCrawler::PlayerCountUpdated* OnPlayerCountUpdated;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::FusionRegionCrawler::PlayerCountUpdated*) == 0x8);
    // private Fusion.NetworkRunner regionRunner
    // Size: 0x8
    // Offset: 0x28
    ::Fusion::NetworkRunner* regionRunner;
    // Field size check
    static_assert(sizeof(::Fusion::NetworkRunner*) == 0x8);
    // private System.Collections.Generic.List`1<Fusion.SessionInfo> sessionInfoCache
    // Size: 0x8
    // Offset: 0x30
    ::System::Collections::Generic::List_1<::Fusion::SessionInfo*>* sessionInfoCache;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Fusion::SessionInfo*>*) == 0x8);
    // private System.Boolean waitingForSessionListUpdate
    // Size: 0x1
    // Offset: 0x38
    bool waitingForSessionListUpdate;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: waitingForSessionListUpdate and: globalPlayerCount
    char __padding3[0x3] = {};
    // private System.Int32 globalPlayerCount
    // Size: 0x4
    // Offset: 0x3C
    int globalPlayerCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single UpdateFrequency
    // Size: 0x4
    // Offset: 0x40
    float UpdateFrequency;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean refreshPlayerCountAutomatically
    // Size: 0x1
    // Offset: 0x44
    bool refreshPlayerCountAutomatically;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: refreshPlayerCountAutomatically and: tempSessionPlayerCount
    char __padding6[0x3] = {};
    // private System.Int32 tempSessionPlayerCount
    // Size: 0x4
    // Offset: 0x48
    int tempSessionPlayerCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Creating interface conversion operator: operator ::Fusion::INetworkRunnerCallbacks
    operator ::Fusion::INetworkRunnerCallbacks() noexcept {
      return *reinterpret_cast<::Fusion::INetworkRunnerCallbacks*>(this);
    }
    // Get instance field reference: public FusionRegionCrawler/PlayerCountUpdated OnPlayerCountUpdated
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::FusionRegionCrawler::PlayerCountUpdated*& dyn_OnPlayerCountUpdated();
    // Get instance field reference: private Fusion.NetworkRunner regionRunner
    [[deprecated("Use field access instead!")]] ::Fusion::NetworkRunner*& dyn_regionRunner();
    // Get instance field reference: private System.Collections.Generic.List`1<Fusion.SessionInfo> sessionInfoCache
