// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Fusion.Behaviour
#include "Fusion/Behaviour.hpp"
// Including type: UnityEngine.Rect
#include "UnityEngine/Rect.hpp"
// Including type: FusionGraph/Layouts
#include "GlobalNamespace/FusionGraph.hpp"
// Including type: Fusion.SimulationModes
#include "Fusion/SimulationModes.hpp"
// Including type: Fusion.Simulation/Statistics/ObjStatFlags
#include "Fusion/Simulation_Statistics_ObjStatFlags.hpp"
// Including type: Fusion.Simulation/Statistics/NetStatFlags
#include "Fusion/Simulation_Statistics_NetStatFlags.hpp"
// Including type: Fusion.Simulation/Statistics/SimStatFlags
#include "Fusion/Simulation_Statistics_SimStatFlags.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
// Including type: System.Nullable`1
#include "System/Nullable_1.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Fusion
namespace Fusion {
  // Forward declaring type: NetworkObject
  class NetworkObject;
  // Forward declaring type: NetworkRunner
  class NetworkRunner;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Skipping declaration: StatCanvasTypes because it is already included!
  // Skipping declaration: FusionGraph because it is already included!
  // Skipping declaration: DefaultLayouts because it is already included!
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: Fusion::StatsInternal
namespace Fusion::StatsInternal {
  // Forward declaring type: IFusionStatsView
  class IFusionStatsView;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Text
  class Text;
  // Forward declaring type: GridLayoutGroup
  class GridLayoutGroup;
  // Forward declaring type: Button
  class Button;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Canvas
  class Canvas;
  // Forward declaring type: RectTransform
  class RectTransform;
  // Forward declaring type: Font
  class Font;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: Shader
  class Shader;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: FusionStats
  class FusionStats;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::FusionStats);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::FusionStats*, "", "FusionStats");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x2B4
  #pragma pack(push, 1)
  // Autogenerated type: FusionStats
  // [TokenAttribute] Offset: FFFFFFFF
  // [ExecuteAlways] Offset: FFFFFFFF
  // [ScriptHelpAttribute] Offset: FFFFFFFF
  class FusionStats : public ::Fusion::Behaviour {
    public:
    // Nested type: ::GlobalNamespace::FusionStats::StatCanvasTypes
    struct StatCanvasTypes;
    // Nested type: ::GlobalNamespace::FusionStats::DefaultLayouts
    struct DefaultLayouts;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: FusionStats/StatCanvasTypes
    // [TokenAttribute] Offset: FFFFFFFF
    struct StatCanvasTypes/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: StatCanvasTypes
      constexpr StatCanvasTypes(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public FusionStats/StatCanvasTypes Overlay
      static constexpr const int Overlay = 0;
      // Get static field: static public FusionStats/StatCanvasTypes Overlay
      static ::GlobalNamespace::FusionStats::StatCanvasTypes _get_Overlay();
      // Set static field: static public FusionStats/StatCanvasTypes Overlay
      static void _set_Overlay(::GlobalNamespace::FusionStats::StatCanvasTypes value);
      // static field const value: static public FusionStats/StatCanvasTypes GameObject
      static constexpr const int GameObject = 1;
      // Get static field: static public FusionStats/StatCanvasTypes GameObject
      static ::GlobalNamespace::FusionStats::StatCanvasTypes _get_GameObject();
      // Set static field: static public FusionStats/StatCanvasTypes GameObject
      static void _set_GameObject(::GlobalNamespace::FusionStats::StatCanvasTypes value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // FusionStats/StatCanvasTypes
    #pragma pack(pop)
    static check_size<sizeof(FusionStats::StatCanvasTypes), 0 + sizeof(int)> __GlobalNamespace_FusionStats_StatCanvasTypesSizeCheck;
    static_assert(sizeof(FusionStats::StatCanvasTypes) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: FusionStats/DefaultLayouts
    // [TokenAttribute] Offset: FFFFFFFF
    struct DefaultLayouts/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: DefaultLayouts
      constexpr DefaultLayouts(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public FusionStats/DefaultLayouts Custom
      static constexpr const int Custom = 0;
      // Get static field: static public FusionStats/DefaultLayouts Custom
      static ::GlobalNamespace::FusionStats::DefaultLayouts _get_Custom();
      // Set static field: static public FusionStats/DefaultLayouts Custom
      static void _set_Custom(::GlobalNamespace::FusionStats::DefaultLayouts value);
      // static field const value: static public FusionStats/DefaultLayouts Left
      static constexpr const int Left = 1;
      // Get static field: static public FusionStats/DefaultLayouts Left
      static ::GlobalNamespace::FusionStats::DefaultLayouts _get_Left();
      // Set static field: static public FusionStats/DefaultLayouts Left
      static void _set_Left(::GlobalNamespace::FusionStats::DefaultLayouts value);
      // static field const value: static public FusionStats/DefaultLayouts Right
      static constexpr const int Right = 2;
      // Get static field: static public FusionStats/DefaultLayouts Right
      static ::GlobalNamespace::FusionStats::DefaultLayouts _get_Right();
      // Set static field: static public FusionStats/DefaultLayouts Right
      static void _set_Right(::GlobalNamespace::FusionStats::DefaultLayouts value);
      // static field const value: static public FusionStats/DefaultLayouts UpperLeft
      static constexpr const int UpperLeft = 3;
      // Get static field: static public FusionStats/DefaultLayouts UpperLeft
      static ::GlobalNamespace::FusionStats::DefaultLayouts _get_UpperLeft();
      // Set static field: static public FusionStats/DefaultLayouts UpperLeft
      static void _set_UpperLeft(::GlobalNamespace::FusionStats::DefaultLayouts value);
      // static field const value: static public FusionStats/DefaultLayouts UpperRight
      static constexpr const int UpperRight = 4;
      // Get static field: static public FusionStats/DefaultLayouts UpperRight
      static ::GlobalNamespace::FusionStats::DefaultLayouts _get_UpperRight();
      // Set static field: static public FusionStats/DefaultLayouts UpperRight
      static void _set_UpperRight(::GlobalNamespace::FusionStats::DefaultLayouts value);
      // static field const value: static public FusionStats/DefaultLayouts Full
      static constexpr const int Full = 5;
      // Get static field: static public FusionStats/DefaultLayouts Full
      static ::GlobalNamespace::FusionStats::DefaultLayouts _get_Full();
      // Set static field: static public FusionStats/DefaultLayouts Full
      static void _set_Full(::GlobalNamespace::FusionStats::DefaultLayouts value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // FusionStats/DefaultLayouts
    #pragma pack(pop)
    static check_size<sizeof(FusionStats::DefaultLayouts), 0 + sizeof(int)> __GlobalNamespace_FusionStats_DefaultLayoutsSizeCheck;
    static_assert(sizeof(FusionStats::DefaultLayouts) == 0x4);
    public:
    // public System.Single RedrawInterval
    // Size: 0x4
    // Offset: 0x20
    float RedrawInterval;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private FusionStats/StatCanvasTypes _canvasType
    // Size: 0x4
    // Offset: 0x24
    ::GlobalNamespace::FusionStats::StatCanvasTypes canvasType;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::FusionStats::StatCanvasTypes) == 0x4);
    // private System.Boolean _showButtonLabels
    // Size: 0x1
    // Offset: 0x28
    bool showButtonLabels;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: showButtonLabels and: maxHeaderHeight
    char __padding2[0x3] = {};
    // private System.Int32 _maxHeaderHeight
    // Size: 0x4
    // Offset: 0x2C
    int maxHeaderHeight;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Single CanvasScale
    // Size: 0x4
    // Offset: 0x30
    float CanvasScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single CanvasDistance
    // Size: 0x4
    // Offset: 0x34
    float CanvasDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Rect _gameObjectRect
    // Size: 0x10
    // Offset: 0x38
    ::UnityEngine::Rect gameObjectRect;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rect) == 0x10);
    // private UnityEngine.Rect _overlayRect
    // Size: 0x10
    // Offset: 0x48
    ::UnityEngine::Rect overlayRect;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rect) == 0x10);
    // private FusionGraph/Layouts _defaultLayout
    // Size: 0x4
    // Offset: 0x58
    ::GlobalNamespace::FusionGraph::Layouts defaultLayout;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::FusionGraph::Layouts) == 0x4);
    // private System.Boolean _noTextOverlap
    // Size: 0x1
    // Offset: 0x5C
    bool noTextOverlap;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _noGraphShader
    // Size: 0x1
    // Offset: 0x5D
    bool noGraphShader;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: noGraphShader and: GraphColumnCount
    char __padding10[0x2] = {};
    // public System.Int32 GraphColumnCount
    // Size: 0x4
    // Offset: 0x60
    int GraphColumnCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _graphMaxWidth
    // Size: 0x4
    // Offset: 0x64
    int graphMaxWidth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean _enableObjectStats
    // Size: 0x1
    // Offset: 0x68
    bool enableObjectStats;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: enableObjectStats and: object
    char __padding13[0x7] = {};
    // private Fusion.NetworkObject _object
    // Size: 0x8
    // Offset: 0x70
    ::Fusion::NetworkObject* object;
    // Field size check
    static_assert(sizeof(::Fusion::NetworkObject*) == 0x8);
    // private System.Int32 _objectTitleHeight
    // Size: 0x4
    // Offset: 0x78
    int objectTitleHeight;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _objectIdsHeight
    // Size: 0x4
    // Offset: 0x7C
    int objectIdsHeight;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _objectMetersHeight
    // Size: 0x4
    // Offset: 0x80
    int objectMetersHeight;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: objectMetersHeight and: runner
    char __padding17[0x4] = {};
    // private Fusion.NetworkRunner _runner
    // Size: 0x8
    // Offset: 0x88
    ::Fusion::NetworkRunner* runner;
    // Field size check
    static_assert(sizeof(::Fusion::NetworkRunner*) == 0x8);
    // public System.Boolean InitializeAllGraphs
    // Size: 0x1
    // Offset: 0x90
    bool InitializeAllGraphs;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: InitializeAllGraphs and: ConnectTo
    char __padding19[0x3] = {};
    // public Fusion.SimulationModes ConnectTo
    // Size: 0x4
    // Offset: 0x94
    ::Fusion::SimulationModes ConnectTo;
    // Field size check
    static_assert(sizeof(::Fusion::SimulationModes) == 0x4);
    // private Fusion.Simulation/Statistics/ObjStatFlags _includedObjStats
    // Size: 0x4
    // Offset: 0x98
    ::Fusion::Simulation::Statistics::ObjStatFlags includedObjStats;
    // Field size check
    static_assert(sizeof(::Fusion::Simulation::Statistics::ObjStatFlags) == 0x4);
    // private Fusion.Simulation/Statistics/NetStatFlags _includedNetStats
    // Size: 0x4
    // Offset: 0x9C
    ::Fusion::Simulation::Statistics::NetStatFlags includedNetStats;
    // Field size check
    static_assert(sizeof(::Fusion::Simulation::Statistics::NetStatFlags) == 0x4);
    // private Fusion.Simulation/Statistics/SimStatFlags _includedSimStats
    // Size: 0x4
    // Offset: 0xA0
    ::Fusion::Simulation::Statistics::SimStatFlags includedSimStats;
    // Field size check
    static_assert(sizeof(::Fusion::Simulation::Statistics::SimStatFlags) == 0x4);
    // public System.Boolean AutoDestroy
    // Size: 0x1
    // Offset: 0xA4
    bool AutoDestroy;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean EnforceSingle
    // Size: 0x1
    // Offset: 0xA5
    bool EnforceSingle;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: EnforceSingle and: Guid
    char __padding25[0x2] = {};
    // public System.String Guid
    // Size: 0x8
    // Offset: 0xA8
    ::StringW Guid;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean _modifyColors
    // Size: 0x1
    // Offset: 0xB0
    bool modifyColors;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: modifyColors and: graphColorGood
    char __padding27[0x3] = {};
    // private UnityEngine.Color _graphColorGood
    // Size: 0x10
    // Offset: 0xB4
    ::UnityEngine::Color graphColorGood;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color _graphColorWarn
    // Size: 0x10
    // Offset: 0xC4
    ::UnityEngine::Color graphColorWarn;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color _graphColorBad
    // Size: 0x10
    // Offset: 0xD4
    ::UnityEngine::Color graphColorBad;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color _graphColorFlag
    // Size: 0x10
    // Offset: 0xE4
    ::UnityEngine::Color graphColorFlag;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color _fontColor
    // Size: 0x10
    // Offset: 0xF4
    ::UnityEngine::Color fontColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color PanelColor
    // Size: 0x10
    // Offset: 0x104
    ::UnityEngine::Color PanelColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color _simDataBackColor
    // Size: 0x10
    // Offset: 0x114
    ::UnityEngine::Color simDataBackColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color _netDataBackColor
    // Size: 0x10
    // Offset: 0x124
    ::UnityEngine::Color netDataBackColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color _objDataBackColor
    // Size: 0x10
    // Offset: 0x134
    ::UnityEngine::Color objDataBackColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // Padding between fields: objDataBackColor and: simGraphs
    char __padding36[0x4] = {};
    // private FusionGraph[] _simGraphs
    // Size: 0x8
    // Offset: 0x148
    ::ArrayW<::GlobalNamespace::FusionGraph*> simGraphs;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::FusionGraph*>) == 0x8);
    // private FusionGraph[] _objGraphs
    // Size: 0x8
    // Offset: 0x150
    ::ArrayW<::GlobalNamespace::FusionGraph*> objGraphs;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::FusionGraph*>) == 0x8);
    // private FusionGraph[] _netGraphs
    // Size: 0x8
    // Offset: 0x158
    ::ArrayW<::GlobalNamespace::FusionGraph*> netGraphs;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::FusionGraph*>) == 0x8);
    // private System.Collections.Generic.List`1<Fusion.StatsInternal.IFusionStatsView> _foundViews
    // Size: 0x8
    // Offset: 0x160
    ::System::Collections::Generic::List_1<::Fusion::StatsInternal::IFusionStatsView*>* foundViews;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Fusion::StatsInternal::IFusionStatsView*>*) == 0x8);
    // private System.Collections.Generic.List`1<FusionGraph> _foundGraphs
    // Size: 0x8
    // Offset: 0x168
    ::System::Collections::Generic::List_1<::GlobalNamespace::FusionGraph*>* foundGraphs;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GlobalNamespace::FusionGraph*>*) == 0x8);
    // private UnityEngine.UI.Text _titleText
    // Size: 0x8
    // Offset: 0x170
    ::UnityEngine::UI::Text* titleText;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // private UnityEngine.UI.Text _clearIcon
    // Size: 0x8
    // Offset: 0x178
    ::UnityEngine::UI::Text* clearIcon;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // private UnityEngine.UI.Text _pauseIcon
    // Size: 0x8
    // Offset: 0x180
    ::UnityEngine::UI::Text* pauseIcon;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // private UnityEngine.UI.Text _togglIcon
    // Size: 0x8
    // Offset: 0x188
    ::UnityEngine::UI::Text* togglIcon;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // private UnityEngine.UI.Text _closeIcon
    // Size: 0x8
    // Offset: 0x190
    ::UnityEngine::UI::Text* closeIcon;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // private UnityEngine.UI.Text _canvsIcon
    // Size: 0x8
    // Offset: 0x198
    ::UnityEngine::UI::Text* canvsIcon;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // private UnityEngine.UI.Text _clearLabel
    // Size: 0x8
    // Offset: 0x1A0
    ::UnityEngine::UI::Text* clearLabel;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // private UnityEngine.UI.Text _pauseLabel
    // Size: 0x8
    // Offset: 0x1A8
    ::UnityEngine::UI::Text* pauseLabel;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // private UnityEngine.UI.Text _togglLabel
    // Size: 0x8
    // Offset: 0x1B0
    ::UnityEngine::UI::Text* togglLabel;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // private UnityEngine.UI.Text _closeLabel
    // Size: 0x8
    // Offset: 0x1B8
    ::UnityEngine::UI::Text* closeLabel;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // private UnityEngine.UI.Text _canvsLabel
    // Size: 0x8
    // Offset: 0x1C0
    ::UnityEngine::UI::Text* canvsLabel;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // private UnityEngine.UI.Text _objectNameText
    // Size: 0x8
    // Offset: 0x1C8
    ::UnityEngine::UI::Text* objectNameText;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // private UnityEngine.UI.GridLayoutGroup _graphGridLayoutGroup
    // Size: 0x8
    // Offset: 0x1D0
    ::UnityEngine::UI::GridLayoutGroup* graphGridLayoutGroup;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::GridLayoutGroup*) == 0x8);
    // private UnityEngine.Canvas _canvas
    // Size: 0x8
    // Offset: 0x1D8
    ::UnityEngine::Canvas* canvas;
    // Field size check
    static_assert(sizeof(::UnityEngine::Canvas*) == 0x8);
    // private UnityEngine.RectTransform _canvasRT
    // Size: 0x8
    // Offset: 0x1E0
    ::UnityEngine::RectTransform* canvasRT;
    // Field size check
    static_assert(sizeof(::UnityEngine::RectTransform*) == 0x8);
    // private UnityEngine.RectTransform _rootPanelRT
    // Size: 0x8
    // Offset: 0x1E8
    ::UnityEngine::RectTransform* rootPanelRT;
    // Field size check
    static_assert(sizeof(::UnityEngine::RectTransform*) == 0x8);
    // private UnityEngine.RectTransform _guidesRT
    // Size: 0x8
    // Offset: 0x1F0
    ::UnityEngine::RectTransform* guidesRT;
    // Field size check
    static_assert(sizeof(::UnityEngine::RectTransform*) == 0x8);
    // private UnityEngine.RectTransform _headerRT
    // Size: 0x8
    // Offset: 0x1F8
    ::UnityEngine::RectTransform* headerRT;
    // Field size check
    static_assert(sizeof(::UnityEngine::RectTransform*) == 0x8);
    // private UnityEngine.RectTransform _statsPanelRT
    // Size: 0x8
    // Offset: 0x200
    ::UnityEngine::RectTransform* statsPanelRT;
    // Field size check
    static_assert(sizeof(::UnityEngine::RectTransform*) == 0x8);
    // private UnityEngine.RectTransform _graphsLayoutRT
    // Size: 0x8
    // Offset: 0x208
    ::UnityEngine::RectTransform* graphsLayoutRT;
    // Field size check
    static_assert(sizeof(::UnityEngine::RectTransform*) == 0x8);
    // private UnityEngine.RectTransform _titleRT
    // Size: 0x8
    // Offset: 0x210
    ::UnityEngine::RectTransform* titleRT;
    // Field size check
    static_assert(sizeof(::UnityEngine::RectTransform*) == 0x8);
    // private UnityEngine.RectTransform _buttonsRT
    // Size: 0x8
    // Offset: 0x218
    ::UnityEngine::RectTransform* buttonsRT;
    // Field size check
    static_assert(sizeof(::UnityEngine::RectTransform*) == 0x8);
    // private UnityEngine.RectTransform _objectTitlePanelRT
    // Size: 0x8
    // Offset: 0x220
    ::UnityEngine::RectTransform* objectTitlePanelRT;
    // Field size check
    static_assert(sizeof(::UnityEngine::RectTransform*) == 0x8);
    // private UnityEngine.RectTransform _objectIdsGroupRT
    // Size: 0x8
    // Offset: 0x228
    ::UnityEngine::RectTransform* objectIdsGroupRT;
    // Field size check
    static_assert(sizeof(::UnityEngine::RectTransform*) == 0x8);
    // private UnityEngine.RectTransform _objectMetersPanelRT
    // Size: 0x8
    // Offset: 0x230
    ::UnityEngine::RectTransform* objectMetersPanelRT;
    // Field size check
    static_assert(sizeof(::UnityEngine::RectTransform*) == 0x8);
    // private UnityEngine.RectTransform _clientIdPanelRT
    // Size: 0x8
    // Offset: 0x238
    ::UnityEngine::RectTransform* clientIdPanelRT;
    // Field size check
    static_assert(sizeof(::UnityEngine::RectTransform*) == 0x8);
    // private UnityEngine.RectTransform _authorityPanelRT
    // Size: 0x8
    // Offset: 0x240
    ::UnityEngine::RectTransform* authorityPanelRT;
    // Field size check
    static_assert(sizeof(::UnityEngine::RectTransform*) == 0x8);
    // private UnityEngine.UI.Button _titleButton
    // Size: 0x8
    // Offset: 0x248
    ::UnityEngine::UI::Button* titleButton;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Button*) == 0x8);
    // private UnityEngine.UI.Button _objctButton
    // Size: 0x8
    // Offset: 0x250
    ::UnityEngine::UI::Button* objctButton;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Button*) == 0x8);
    // private UnityEngine.UI.Button _clearButton
    // Size: 0x8
    // Offset: 0x258
    ::UnityEngine::UI::Button* clearButton;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Button*) == 0x8);
    // private UnityEngine.UI.Button _togglButton
    // Size: 0x8
    // Offset: 0x260
    ::UnityEngine::UI::Button* togglButton;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Button*) == 0x8);
    // private UnityEngine.UI.Button _pauseButton
    // Size: 0x8
    // Offset: 0x268
    ::UnityEngine::UI::Button* pauseButton;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Button*) == 0x8);
    // private UnityEngine.UI.Button _closeButton
    // Size: 0x8
    // Offset: 0x270
    ::UnityEngine::UI::Button* closeButton;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Button*) == 0x8);
    // private UnityEngine.UI.Button _canvsButton
    // Size: 0x8
    // Offset: 0x278
    ::UnityEngine::UI::Button* canvsButton;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Button*) == 0x8);
    // private UnityEngine.Font _font
    // Size: 0x8
    // Offset: 0x280
    ::UnityEngine::Font* font;
    // Field size check
    static_assert(sizeof(::UnityEngine::Font*) == 0x8);
    // private System.Boolean _hidden
    // Size: 0x1
    // Offset: 0x288
    bool hidden;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _paused
    // Size: 0x1
    // Offset: 0x289
    bool paused;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: paused and: layoutDirty
    char __padding78[0x2] = {};
    // private System.Int32 _layoutDirty
    // Size: 0x4
    // Offset: 0x28C
    int layoutDirty;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean _activeDirty
    // Size: 0x1
    // Offset: 0x290
    bool activeDirty;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: activeDirty and: currentDrawTime
    char __padding80[0x7] = {};
    // private System.Double _currentDrawTime
    // Size: 0x8
    // Offset: 0x298
    double currentDrawTime;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private System.Double _delayDrawUntil
    // Size: 0x8
    // Offset: 0x2A0
    double delayDrawUntil;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private System.String _previousObjectTitle
    // Size: 0x8
    // Offset: 0x2A8
    ::StringW previousObjectTitle;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Single _lastLayoutUpdate
    // Size: 0x4
    // Offset: 0x2B0
    float lastLayoutUpdate;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Get static field: static private System.Collections.Generic.Dictionary`2<Fusion.NetworkRunner,System.Collections.Generic.List`1<FusionStats>> _statsForRunnerLookup
    static ::System::Collections::Generic::Dictionary_2<::Fusion::NetworkRunner*, ::System::Collections::Generic::List_1<::GlobalNamespace::FusionStats*>*>* _get__statsForRunnerLookup();
    // Set static field: static private System.Collections.Generic.Dictionary`2<Fusion.NetworkRunner,System.Collections.Generic.List`1<FusionStats>> _statsForRunnerLookup
    static void _set__statsForRunnerLookup(::System::Collections::Generic::Dictionary_2<::Fusion::NetworkRunner*, ::System::Collections::Generic::List_1<::GlobalNamespace::FusionStats*>*>* value);
    // Get static field: static private System.Collections.Generic.Dictionary`2<System.String,FusionStats> _activeGuids
