// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: HoldableObject
#include "GlobalNamespace/HoldableObject.hpp"
// Including type: Photon.Pun.IPunObservable
#include "Photon/Pun/IPunObservable.hpp"
// Including type: IRequestableOwnershipGuardCallbacks
#include "GlobalNamespace/IRequestableOwnershipGuardCallbacks.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
// Including type: System.Nullable`1
#include "System/Nullable_1.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: VRRig
  class VRRig;
  // Forward declaring type: AverageVector3
  class AverageVector3;
  // Forward declaring type: InteractionPoint
  class InteractionPoint;
  // Forward declaring type: RequestableOwnershipGuard
  class RequestableOwnershipGuard;
  // Forward declaring type: DropZone
  class DropZone;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Rigidbody
  class Rigidbody;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: AnimationCurve
  class AnimationCurve;
  // Forward declaring type: MeshRenderer
  class MeshRenderer;
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: AudioSource
  class AudioSource;
  // Forward declaring type: Coroutine
  class Coroutine;
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Collider
  class Collider;
}
// Forward declaring namespace: Photon::Pun
namespace Photon::Pun {
  // Forward declaring type: PhotonStream
  class PhotonStream;
  // Forward declaring type: PhotonMessageInfo
  struct PhotonMessageInfo;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Forward declaring namespace: Photon::Realtime
namespace Photon::Realtime {
  // Forward declaring type: Player
  class Player;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: GliderHoldable
  class GliderHoldable;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::GliderHoldable);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::GliderHoldable*, "", "GliderHoldable");
// Type namespace: 
namespace GlobalNamespace {
  // WARNING Size may be invalid!
  // Autogenerated type: GliderHoldable
  // [TokenAttribute] Offset: FFFFFFFF
  // [RequireComponent] Offset: FFFFFFFF
  class GliderHoldable : public ::GlobalNamespace::HoldableObject/*, public ::Photon::Pun::IPunObservable, public ::GlobalNamespace::IRequestableOwnershipGuardCallbacks*/ {
    public:
    // Nested type: ::GlobalNamespace::GliderHoldable::GliderState
    struct GliderState;
    // Nested type: ::GlobalNamespace::GliderHoldable::HoldingHand
    struct HoldingHand;
    // Nested type: ::GlobalNamespace::GliderHoldable::SyncedState
    struct SyncedState;
    // Nested type: ::GlobalNamespace::GliderHoldable::CosmeticMaterialOverride
    struct CosmeticMaterialOverride;
    // Nested type: ::GlobalNamespace::GliderHoldable::$ReenableOwnershipRequest$d__169
    class $ReenableOwnershipRequest$d__169;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: GliderHoldable/GliderState
    // [TokenAttribute] Offset: FFFFFFFF
    struct GliderState/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: GliderState
      constexpr GliderState(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public GliderHoldable/GliderState LocallyHeld
      static constexpr const int LocallyHeld = 0;
      // Get static field: static public GliderHoldable/GliderState LocallyHeld
      static ::GlobalNamespace::GliderHoldable::GliderState _get_LocallyHeld();
      // Set static field: static public GliderHoldable/GliderState LocallyHeld
      static void _set_LocallyHeld(::GlobalNamespace::GliderHoldable::GliderState value);
      // static field const value: static public GliderHoldable/GliderState LocallyDropped
      static constexpr const int LocallyDropped = 1;
      // Get static field: static public GliderHoldable/GliderState LocallyDropped
      static ::GlobalNamespace::GliderHoldable::GliderState _get_LocallyDropped();
      // Set static field: static public GliderHoldable/GliderState LocallyDropped
      static void _set_LocallyDropped(::GlobalNamespace::GliderHoldable::GliderState value);
      // static field const value: static public GliderHoldable/GliderState RemoteSyncing
      static constexpr const int RemoteSyncing = 2;
      // Get static field: static public GliderHoldable/GliderState RemoteSyncing
      static ::GlobalNamespace::GliderHoldable::GliderState _get_RemoteSyncing();
      // Set static field: static public GliderHoldable/GliderState RemoteSyncing
      static void _set_RemoteSyncing(::GlobalNamespace::GliderHoldable::GliderState value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // GliderHoldable/GliderState
    #pragma pack(pop)
    static check_size<sizeof(GliderHoldable::GliderState), 0 + sizeof(int)> __GlobalNamespace_GliderHoldable_GliderStateSizeCheck;
    static_assert(sizeof(GliderHoldable::GliderState) == 0x4);
    // Size: 0x38
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: GliderHoldable/HoldingHand
    // [TokenAttribute] Offset: FFFFFFFF
    struct HoldingHand/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.Boolean active
      // Size: 0x1
      // Offset: 0x0
      bool active;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // Padding between fields: active and: transform
      char __padding0[0x7] = {};
      // public UnityEngine.Transform transform
      // Size: 0x8
      // Offset: 0x8
      ::UnityEngine::Transform* transform;
      // Field size check
      static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
      // public UnityEngine.Vector3 holdLocalPos
      // Size: 0xC
      // Offset: 0x10
      ::UnityEngine::Vector3 holdLocalPos;
      // Field size check
      static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
      // public UnityEngine.Vector3 handleLocalPos
      // Size: 0xC
      // Offset: 0x1C
      ::UnityEngine::Vector3 handleLocalPos;
      // Field size check
      static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
      // public UnityEngine.Quaternion localHoldRotation
      // Size: 0x10
      // Offset: 0x28
      ::UnityEngine::Quaternion localHoldRotation;
      // Field size check
      static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
      public:
      // Creating value type constructor for type: HoldingHand
      constexpr HoldingHand(bool active_ = {}, ::UnityEngine::Transform* transform_ = {}, ::UnityEngine::Vector3 holdLocalPos_ = {}, ::UnityEngine::Vector3 handleLocalPos_ = {}, ::UnityEngine::Quaternion localHoldRotation_ = {}) noexcept : active{active_}, transform{transform_}, holdLocalPos{holdLocalPos_}, handleLocalPos{handleLocalPos_}, localHoldRotation{localHoldRotation_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public System.Boolean active
      [[deprecated("Use field access instead!")]] bool& dyn_active();
      // Get instance field reference: public UnityEngine.Transform transform
      [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_transform();
      // Get instance field reference: public UnityEngine.Vector3 holdLocalPos
      [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_holdLocalPos();
      // Get instance field reference: public UnityEngine.Vector3 handleLocalPos
      [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_handleLocalPos();
      // Get instance field reference: public UnityEngine.Quaternion localHoldRotation
      [[deprecated("Use field access instead!")]] ::UnityEngine::Quaternion& dyn_localHoldRotation();
      // public System.Void Activate(UnityEngine.Transform handTransform, UnityEngine.Transform gliderTransform, UnityEngine.Vector3 worldGrabPoint)
      // Offset: 0x275D230
      void Activate(::UnityEngine::Transform* handTransform, ::UnityEngine::Transform* gliderTransform, ::UnityEngine::Vector3 worldGrabPoint);
      // public System.Void Deactivate()
      // Offset: 0x275D9C0
      void Deactivate();
    }; // GliderHoldable/HoldingHand
    #pragma pack(pop)
    static check_size<sizeof(GliderHoldable::HoldingHand), 40 + sizeof(::UnityEngine::Quaternion)> __GlobalNamespace_GliderHoldable_HoldingHandSizeCheck;
    static_assert(sizeof(GliderHoldable::HoldingHand) == 0x38);
    // Size: 0x24
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: GliderHoldable/SyncedState
    // [TokenAttribute] Offset: FFFFFFFF
    struct SyncedState/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.Int32 riderId
      // Size: 0x4
      // Offset: 0x0
      int riderId;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Byte materialIndex
      // Size: 0x1
      // Offset: 0x4
      uint8_t materialIndex;
      // Field size check
      static_assert(sizeof(uint8_t) == 0x1);
      // public System.Byte audioLevel
      // Size: 0x1
      // Offset: 0x5
      uint8_t audioLevel;
      // Field size check
      static_assert(sizeof(uint8_t) == 0x1);
      // public System.Boolean tagged
      // Size: 0x1
      // Offset: 0x6
      bool tagged;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // Padding between fields: tagged and: position
      char __padding3[0x1] = {};
      // public UnityEngine.Vector3 position
      // Size: 0xC
      // Offset: 0x8
      ::UnityEngine::Vector3 position;
      // Field size check
      static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
      // public UnityEngine.Quaternion rotation
      // Size: 0x10
      // Offset: 0x14
      ::UnityEngine::Quaternion rotation;
      // Field size check
      static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
      public:
      // Creating value type constructor for type: SyncedState
      constexpr SyncedState(int riderId_ = {}, uint8_t materialIndex_ = {}, uint8_t audioLevel_ = {}, bool tagged_ = {}, ::UnityEngine::Vector3 position_ = {}, ::UnityEngine::Quaternion rotation_ = {}) noexcept : riderId{riderId_}, materialIndex{materialIndex_}, audioLevel{audioLevel_}, tagged{tagged_}, position{position_}, rotation{rotation_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public System.Int32 riderId
      [[deprecated("Use field access instead!")]] int& dyn_riderId();
      // Get instance field reference: public System.Byte materialIndex
      [[deprecated("Use field access instead!")]] uint8_t& dyn_materialIndex();
      // Get instance field reference: public System.Byte audioLevel
      [[deprecated("Use field access instead!")]] uint8_t& dyn_audioLevel();
      // Get instance field reference: public System.Boolean tagged
      [[deprecated("Use field access instead!")]] bool& dyn_tagged();
      // Get instance field reference: public UnityEngine.Vector3 position
      [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_position();
      // Get instance field reference: public UnityEngine.Quaternion rotation
      [[deprecated("Use field access instead!")]] ::UnityEngine::Quaternion& dyn_rotation();
      // public System.Void Init(UnityEngine.Vector3 defaultPosition, UnityEngine.Quaternion defaultRotation)
      // Offset: 0x275BD8C
      void Init(::UnityEngine::Vector3 defaultPosition, ::UnityEngine::Quaternion defaultRotation);
    }; // GliderHoldable/SyncedState
    #pragma pack(pop)
    static check_size<sizeof(GliderHoldable::SyncedState), 20 + sizeof(::UnityEngine::Quaternion)> __GlobalNamespace_GliderHoldable_SyncedStateSizeCheck;
    static_assert(sizeof(GliderHoldable::SyncedState) == 0x24);
    // Size: 0x10
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: GliderHoldable/CosmeticMaterialOverride
    // [TokenAttribute] Offset: FFFFFFFF
    struct CosmeticMaterialOverride/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.String cosmeticName
      // Size: 0x8
      // Offset: 0x0
      ::StringW cosmeticName;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      // public UnityEngine.Material material
      // Size: 0x8
      // Offset: 0x8
      ::UnityEngine::Material* material;
      // Field size check
      static_assert(sizeof(::UnityEngine::Material*) == 0x8);
      public:
      // Creating value type constructor for type: CosmeticMaterialOverride
      constexpr CosmeticMaterialOverride(::StringW cosmeticName_ = {}, ::UnityEngine::Material* material_ = {}) noexcept : cosmeticName{cosmeticName_}, material{material_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public System.String cosmeticName
      [[deprecated("Use field access instead!")]] ::StringW& dyn_cosmeticName();
      // Get instance field reference: public UnityEngine.Material material
      [[deprecated("Use field access instead!")]] ::UnityEngine::Material*& dyn_material();
    }; // GliderHoldable/CosmeticMaterialOverride
    #pragma pack(pop)
    static check_size<sizeof(GliderHoldable::CosmeticMaterialOverride), 8 + sizeof(::UnityEngine::Material*)> __GlobalNamespace_GliderHoldable_CosmeticMaterialOverrideSizeCheck;
    static_assert(sizeof(GliderHoldable::CosmeticMaterialOverride) == 0x10);
    public:
    // private UnityEngine.Vector2 pitchMinMax
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::Vector2 pitchMinMax;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private UnityEngine.Vector2 rollMinMax
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Vector2 rollMinMax;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private System.Single pitchHalfLife
    // Size: 0x4
    // Offset: 0x38
    float pitchHalfLife;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single yawHalfLife
    // Size: 0x4
    // Offset: 0x3C
    float yawHalfLife;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single rollHalfLife
    // Size: 0x4
    // Offset: 0x40
    float rollHalfLife;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single yawRateFactor
    // Size: 0x4
    // Offset: 0x44
    float yawRateFactor;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single yawRateFactorRollOnly
    // Size: 0x4
    // Offset: 0x48
    float yawRateFactorRollOnly;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.Vector2 pitchVelocityTargetMinMax
    // Size: 0x8
    // Offset: 0x4C
    ::UnityEngine::Vector2 pitchVelocityTargetMinMax;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // public UnityEngine.Vector2 pitchVelocityRampTimeMinMax
    // Size: 0x8
    // Offset: 0x54
    ::UnityEngine::Vector2 pitchVelocityRampTimeMinMax;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private System.Single pitchVelocityFollowRateAngle
    // Size: 0x4
    // Offset: 0x5C
    float pitchVelocityFollowRateAngle;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single pitchVelocityFollowRateMagnitude
    // Size: 0x4
    // Offset: 0x60
    float pitchVelocityFollowRateMagnitude;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single yawVelocityFollowRateAngle
    // Size: 0x4
    // Offset: 0x64
    float yawVelocityFollowRateAngle;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single yawVelocityFollowRateMagnitude
    // Size: 0x4
    // Offset: 0x68
    float yawVelocityFollowRateMagnitude;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.AnimationCurve liftVsAttack
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::AnimationCurve* liftVsAttack;
    // Field size check
    static_assert(sizeof(::UnityEngine::AnimationCurve*) == 0x8);
    // private UnityEngine.AnimationCurve dragVsAttack
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::AnimationCurve* dragVsAttack;
    // Field size check
    static_assert(sizeof(::UnityEngine::AnimationCurve*) == 0x8);
    // public System.Single attackDragFactor
    // Size: 0x4
    // Offset: 0x80
    float attackDragFactor;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.AnimationCurve dragVsSpeed
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::AnimationCurve* dragVsSpeed;
    // Field size check
    static_assert(sizeof(::UnityEngine::AnimationCurve*) == 0x8);
    // public System.Single dragVsSpeedMaxSpeed
    // Size: 0x4
    // Offset: 0x90
    float dragVsSpeedMaxSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single dragVsSpeedDragFactor
    // Size: 0x4
    // Offset: 0x94
    float dragVsSpeedDragFactor;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.AnimationCurve liftIncreaseVsRoll
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::AnimationCurve* liftIncreaseVsRoll;
    // Field size check
    static_assert(sizeof(::UnityEngine::AnimationCurve*) == 0x8);
    // private System.Single liftIncreaseVsRollMaxAngle
    // Size: 0x4
    // Offset: 0xA0
    float liftIncreaseVsRollMaxAngle;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single gravityCompensation
    // Size: 0x4
    // Offset: 0xA4
    float gravityCompensation;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single pullUpLiftBonus
    // Size: 0x4
    // Offset: 0xA8
    float pullUpLiftBonus;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single pullUpLiftActivationVelocity
    // Size: 0x4
    // Offset: 0xAC
    float pullUpLiftActivationVelocity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single pullUpLiftActivationAcceleration
    // Size: 0x4
    // Offset: 0xB0
    float pullUpLiftActivationAcceleration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single riderPosDirectPitchMax
    // Size: 0x4
    // Offset: 0xB4
    float riderPosDirectPitchMax;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector2 riderPosRange
    // Size: 0x8
    // Offset: 0xB8
    ::UnityEngine::Vector2 riderPosRange;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private System.Single riderPosRangeOffset
    // Size: 0x4
    // Offset: 0xC0
    float riderPosRangeOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector2 riderPosRangeNormalizedDeadzone
    // Size: 0x8
    // Offset: 0xC4
    ::UnityEngine::Vector2 riderPosRangeNormalizedDeadzone;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private System.Single holdRotationAngleMax
    // Size: 0x4
    // Offset: 0xCC
    float holdRotationAngleMax;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single oneHandHoldRotationRate
    // Size: 0x4
    // Offset: 0xD0
    float oneHandHoldRotationRate;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector3 oneHandSimulatedHoldOffset
    // Size: 0xC
    // Offset: 0xD4
    ::UnityEngine::Vector3 oneHandSimulatedHoldOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Single oneHandPitchMultiplier
    // Size: 0x4
    // Offset: 0xE0
    float oneHandPitchMultiplier;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single twoHandHoldRotationRate
    // Size: 0x4
    // Offset: 0xE4
    float twoHandHoldRotationRate;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean twoHandGliderInversionOnYawInsteadOfRoll
    // Size: 0x1
    // Offset: 0xE8
    bool twoHandGliderInversionOnYawInsteadOfRoll;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean setMaxHandSlipDuringFlight
    // Size: 0x1
    // Offset: 0xE9
    bool setMaxHandSlipDuringFlight;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Single maxSlipOverrideSpeedThreshold
    // Size: 0x4
    // Offset: 0xEC
    float maxSlipOverrideSpeedThreshold;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single subtlePlayerPitchFactor
    // Size: 0x4
    // Offset: 0xF0
    float subtlePlayerPitchFactor;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single subtlePlayerPitchRate
    // Size: 0x4
    // Offset: 0xF4
    float subtlePlayerPitchRate;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single subtlePlayerRollFactor
    // Size: 0x4
    // Offset: 0xF8
    float subtlePlayerRollFactor;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single subtlePlayerRollRate
    // Size: 0x4
    // Offset: 0xFC
    float subtlePlayerRollRate;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector2 subtlePlayerRotationSpeedRampMinMax
    // Size: 0x8
    // Offset: 0x100
    ::UnityEngine::Vector2 subtlePlayerRotationSpeedRampMinMax;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private UnityEngine.Vector2 subtlePlayerRollAccelMinMax
    // Size: 0x8
    // Offset: 0x108
    ::UnityEngine::Vector2 subtlePlayerRollAccelMinMax;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private UnityEngine.Vector2 subtlePlayerPitchAccelMinMax
    // Size: 0x8
    // Offset: 0x110
    ::UnityEngine::Vector2 subtlePlayerPitchAccelMinMax;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private System.Single accelSmoothingFollowRate
    // Size: 0x4
    // Offset: 0x118
    float accelSmoothingFollowRate;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single horizontalAccelSmoothingFollowRate
    // Size: 0x4
    // Offset: 0x11C
    float horizontalAccelSmoothingFollowRate;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector2 hapticAccelInputRange
    // Size: 0x8
    // Offset: 0x120
    ::UnityEngine::Vector2 hapticAccelInputRange;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private System.Single hapticAccelOutputMax
    // Size: 0x4
    // Offset: 0x128
    float hapticAccelOutputMax;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector2 hapticMaxSpeedInputRange
    // Size: 0x8
    // Offset: 0x12C
    ::UnityEngine::Vector2 hapticMaxSpeedInputRange;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private UnityEngine.Vector2 hapticSpeedInputRange
    // Size: 0x8
    // Offset: 0x134
    ::UnityEngine::Vector2 hapticSpeedInputRange;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private System.Single hapticSpeedOutputMax
    // Size: 0x4
    // Offset: 0x13C
    float hapticSpeedOutputMax;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector2 whistlingAudioSpeedInputRange
    // Size: 0x8
    // Offset: 0x140
    ::UnityEngine::Vector2 whistlingAudioSpeedInputRange;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private System.Single audioVolumeMultiplier
    // Size: 0x4
    // Offset: 0x148
    float audioVolumeMultiplier;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single infectedAudioVolumeMultiplier
    // Size: 0x4
    // Offset: 0x14C
    float infectedAudioVolumeMultiplier;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector2 whooshSpeedThresholdInput
    // Size: 0x8
    // Offset: 0x150
    ::UnityEngine::Vector2 whooshSpeedThresholdInput;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private UnityEngine.Vector2 whooshVolumeOutput
    // Size: 0x8
    // Offset: 0x158
    ::UnityEngine::Vector2 whooshVolumeOutput;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private System.Single whooshCheckDistance
    // Size: 0x4
    // Offset: 0x160
    float whooshCheckDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean extendTagRangeInFlight
    // Size: 0x1
    // Offset: 0x164
    bool extendTagRangeInFlight;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private UnityEngine.Vector2 tagRangeSpeedInput
    // Size: 0x8
    // Offset: 0x168
    ::UnityEngine::Vector2 tagRangeSpeedInput;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private UnityEngine.Vector2 tagRangeOutput
    // Size: 0x8
    // Offset: 0x170
    ::UnityEngine::Vector2 tagRangeOutput;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private System.Boolean debugDrawTagRange
    // Size: 0x1
    // Offset: 0x178
    bool debugDrawTagRange;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Single infectedSpeedIncrease
    // Size: 0x4
    // Offset: 0x17C
    float infectedSpeedIncrease;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.MeshRenderer leafMesh
    // Size: 0x8
    // Offset: 0x180
    ::UnityEngine::MeshRenderer* leafMesh;
    // Field size check
    static_assert(sizeof(::UnityEngine::MeshRenderer*) == 0x8);
    // private UnityEngine.Material baseLeafMaterial
    // Size: 0x8
    // Offset: 0x188
    ::UnityEngine::Material* baseLeafMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private UnityEngine.Material infectedLeafMaterial
    // Size: 0x8
    // Offset: 0x190
    ::UnityEngine::Material* infectedLeafMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private GliderHoldable/CosmeticMaterialOverride[] cosmeticMaterialOverrides
    // Size: 0x8
    // Offset: 0x198
    ::ArrayW<::GlobalNamespace::GliderHoldable::CosmeticMaterialOverride> cosmeticMaterialOverrides;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::GliderHoldable::CosmeticMaterialOverride>) == 0x8);
    // private System.Single networkSyncFollowRate
    // Size: 0x4
    // Offset: 0x1A0
    float networkSyncFollowRate;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Transform maxDistanceRespawnOrigin
    // Size: 0x8
    // Offset: 0x1A8
    ::UnityEngine::Transform* maxDistanceRespawnOrigin;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private System.Single maxDistanceBeforeRespawn
    // Size: 0x4
    // Offset: 0x1B0
    float maxDistanceBeforeRespawn;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single maxDroppedTimeToRespawn
    // Size: 0x4
    // Offset: 0x1B4
    float maxDroppedTimeToRespawn;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single windUprightTorqueMultiplier
    // Size: 0x4
    // Offset: 0x1B8
    float windUprightTorqueMultiplier;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single gravityUprightTorqueMultiplier
    // Size: 0x4
    // Offset: 0x1BC
    float gravityUprightTorqueMultiplier;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single fallingGravityReduction
    // Size: 0x4
    // Offset: 0x1C0
    float fallingGravityReduction;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.AudioSource calmAudio
    // Size: 0x8
    // Offset: 0x1C8
    ::UnityEngine::AudioSource* calmAudio;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // private UnityEngine.AudioSource activeAudio
    // Size: 0x8
    // Offset: 0x1D0
    ::UnityEngine::AudioSource* activeAudio;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // private UnityEngine.AudioSource whistlingAudio
    // Size: 0x8
    // Offset: 0x1D8
    ::UnityEngine::AudioSource* whistlingAudio;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // private UnityEngine.AudioSource leftWhooshAudio
    // Size: 0x8
    // Offset: 0x1E0
    ::UnityEngine::AudioSource* leftWhooshAudio;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // private UnityEngine.AudioSource rightWhooshAudio
    // Size: 0x8
    // Offset: 0x1E8
    ::UnityEngine::AudioSource* rightWhooshAudio;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // private InteractionPoint handle
    // Size: 0x8
    // Offset: 0x1F0
    ::GlobalNamespace::InteractionPoint* handle;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::InteractionPoint*) == 0x8);
    // private RequestableOwnershipGuard ownershipGuard
    // Size: 0x8
    // Offset: 0x1F8
    ::GlobalNamespace::RequestableOwnershipGuard* ownershipGuard;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::RequestableOwnershipGuard*) == 0x8);
    // private System.Boolean subtlePlayerPitchActive
    // Size: 0x1
    // Offset: 0x200
    bool subtlePlayerPitchActive;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean subtlePlayerRollActive
    // Size: 0x1
    // Offset: 0x201
    bool subtlePlayerRollActive;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Single subtlePlayerPitch
    // Size: 0x4
    // Offset: 0x204
    float subtlePlayerPitch;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single subtlePlayerRoll
    // Size: 0x4
    // Offset: 0x208
    float subtlePlayerRoll;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single subtlePlayerPitchRateExp
    // Size: 0x4
    // Offset: 0x20C
    float subtlePlayerPitchRateExp;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single subtlePlayerRollRateExp
    // Size: 0x4
    // Offset: 0x210
    float subtlePlayerRollRateExp;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private GliderHoldable/HoldingHand leftHold
    // Size: 0x38
    // Offset: 0x218
    ::GlobalNamespace::GliderHoldable::HoldingHand leftHold;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::GliderHoldable::HoldingHand) == 0x38);
    // private GliderHoldable/HoldingHand rightHold
    // Size: 0x38
    // Offset: 0x250
    ::GlobalNamespace::GliderHoldable::HoldingHand rightHold;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::GliderHoldable::HoldingHand) == 0x38);
    // private GliderHoldable/SyncedState syncedState
    // Size: 0x24
    // Offset: 0x288
    ::GlobalNamespace::GliderHoldable::SyncedState syncedState;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::GliderHoldable::SyncedState) == 0x24);
    // private UnityEngine.Vector3 twoHandRotationOffsetAxis
    // Size: 0xC
    // Offset: 0x2AC
    ::UnityEngine::Vector3 twoHandRotationOffsetAxis;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Single twoHandRotationOffsetAngle
    // Size: 0x4
    // Offset: 0x2B8
    float twoHandRotationOffsetAngle;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Rigidbody rb
    // Size: 0x8
    // Offset: 0x2C0
    ::UnityEngine::Rigidbody* rb;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rigidbody*) == 0x8);
    // private UnityEngine.Vector2 riderPosition
    // Size: 0x8
    // Offset: 0x2C8
    ::UnityEngine::Vector2 riderPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private UnityEngine.Vector3 previousVelocity
    // Size: 0xC
    // Offset: 0x2D0
    ::UnityEngine::Vector3 previousVelocity;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 currentVelocity
    // Size: 0xC
    // Offset: 0x2DC
    ::UnityEngine::Vector3 currentVelocity;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Single pitch
    // Size: 0x4
    // Offset: 0x2E8
    float pitch;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single yaw
    // Size: 0x4
    // Offset: 0x2EC
    float yaw;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single roll
    // Size: 0x4
    // Offset: 0x2F0
    float roll;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single pitchVel
    // Size: 0x4
    // Offset: 0x2F4
    float pitchVel;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single yawVel
    // Size: 0x4
    // Offset: 0x2F8
    float yawVel;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single rollVel
    // Size: 0x4
    // Offset: 0x2FC
    float rollVel;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single oneHandRotationRateExp
    // Size: 0x4
    // Offset: 0x300
    float oneHandRotationRateExp;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single twoHandRotationRateExp
    // Size: 0x4
    // Offset: 0x304
    float twoHandRotationRateExp;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Quaternion playerFacingRotationOffset
    // Size: 0x10
    // Offset: 0x308
    ::UnityEngine::Quaternion playerFacingRotationOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private AverageVector3 accelerationAverage
    // Size: 0x8
    // Offset: 0x318
    ::GlobalNamespace::AverageVector3* accelerationAverage;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::AverageVector3*) == 0x8);
    // private System.Single accelerationSmoothed
    // Size: 0x4
    // Offset: 0x320
    float accelerationSmoothed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single turnAccelerationSmoothed
    // Size: 0x4
    // Offset: 0x324
    float turnAccelerationSmoothed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single accelSmoothingFollowRateExp
    // Size: 0x4
    // Offset: 0x328
    float accelSmoothingFollowRateExp;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single networkSyncFollowRateExp
    // Size: 0x4
    // Offset: 0x32C
    float networkSyncFollowRateExp;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean pendingOwnershipRequest
    // Size: 0x1
    // Offset: 0x330
    bool pendingOwnershipRequest;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private UnityEngine.Vector3 positionLocalToVRRig
    // Size: 0xC
    // Offset: 0x334
    ::UnityEngine::Vector3 positionLocalToVRRig;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Quaternion rotationLocalToVRRig
    // Size: 0x10
    // Offset: 0x340
    ::UnityEngine::Quaternion rotationLocalToVRRig;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.Coroutine reenableOwnershipRequestCoroutine
    // Size: 0x8
    // Offset: 0x350
    ::UnityEngine::Coroutine* reenableOwnershipRequestCoroutine;
    // Field size check
    static_assert(sizeof(::UnityEngine::Coroutine*) == 0x8);
    // private UnityEngine.Vector3 spawnPosition
    // Size: 0xC
    // Offset: 0x358
    ::UnityEngine::Vector3 spawnPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Quaternion spawnRotation
    // Size: 0x10
    // Offset: 0x364
    ::UnityEngine::Quaternion spawnRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private System.Single lastHeldTime
    // Size: 0x4
    // Offset: 0x374
    float lastHeldTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Nullable`1<UnityEngine.Vector3> leftHoldPositionLocal
    // Size: 0xFFFFFFFF
    // Offset: 0x378
    ::System::Nullable_1<::UnityEngine::Vector3> leftHoldPositionLocal;
    // private System.Nullable`1<UnityEngine.Vector3> rightHoldPositionLocal
    // Size: 0xFFFFFFFF
    // Offset: 0x388
    ::System::Nullable_1<::UnityEngine::Vector3> rightHoldPositionLocal;
    // private System.Single whooshSoundDuration
    // Size: 0x4
    // Offset: 0x398
    float whooshSoundDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single whooshSoundRetriggerThreshold
    // Size: 0x4
    // Offset: 0x39C
    float whooshSoundRetriggerThreshold;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single leftWhooshStartTime
    // Size: 0x4
    // Offset: 0x3A0
    float leftWhooshStartTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector3 leftWhooshHitPoint
    // Size: 0xC
    // Offset: 0x3A4
    ::UnityEngine::Vector3 leftWhooshHitPoint;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 whooshAudioPositionOffset
    // Size: 0xC
    // Offset: 0x3B0
    ::UnityEngine::Vector3 whooshAudioPositionOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Single rightWhooshStartTime
    // Size: 0x4
    // Offset: 0x3BC
    float rightWhooshStartTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector3 rightWhooshHitPoint
    // Size: 0xC
    // Offset: 0x3C0
    ::UnityEngine::Vector3 rightWhooshHitPoint;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Int32 ridersMaterialOverideIndex
    // Size: 0x4
    // Offset: 0x3CC
    int ridersMaterialOverideIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 windVolumeForceAppliedFrame
    // Size: 0x4
    // Offset: 0x3D0
    int windVolumeForceAppliedFrame;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean holdingTwoGliders
    // Size: 0x1
    // Offset: 0x3D4
    bool holdingTwoGliders;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private GliderHoldable/GliderState gliderState
    // Size: 0x4
    // Offset: 0x3D8
    ::GlobalNamespace::GliderHoldable::GliderState gliderState;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::GliderHoldable::GliderState) == 0x4);
    // private System.Single audioLevel
    // Size: 0x4
    // Offset: 0x3DC
    float audioLevel;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 riderId
    // Size: 0x4
    // Offset: 0x3E0
    int riderId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private VRRig cachedRig
    // Size: 0x8
    // Offset: 0x3E8
    ::GlobalNamespace::VRRig* cachedRig;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::VRRig*) == 0x8);
    // private System.Boolean infectedState
    // Size: 0x1
    // Offset: 0x3F0
    bool infectedState;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating interface conversion operator: operator ::Photon::Pun::IPunObservable
    operator ::Photon::Pun::IPunObservable() noexcept {
      return *reinterpret_cast<::Photon::Pun::IPunObservable*>(this);
    }
    // Creating interface conversion operator: operator ::GlobalNamespace::IRequestableOwnershipGuardCallbacks
    operator ::GlobalNamespace::IRequestableOwnershipGuardCallbacks() noexcept {
      return *reinterpret_cast<::GlobalNamespace::IRequestableOwnershipGuardCallbacks*>(this);
    }
    // static field const value: static private System.Single accelAveragingWindow
    static constexpr const float accelAveragingWindow = 0.1;
    // Get static field: static private System.Single accelAveragingWindow
    static float _get_accelAveragingWindow();
    // Set static field: static private System.Single accelAveragingWindow
