// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: VRRig
  class VRRig;
  // Forward declaring type: NetPlayer
  class NetPlayer;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: GorillaParent
  class GorillaParent;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::GorillaParent);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::GorillaParent*, "", "GorillaParent");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x4D
  #pragma pack(push, 1)
  // Autogenerated type: GorillaParent
  // [TokenAttribute] Offset: FFFFFFFF
  class GorillaParent : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // public UnityEngine.GameObject tagUI
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::GameObject* tagUI;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject playerParent
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::GameObject* playerParent;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject vrrigParent
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::GameObject* vrrigParent;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public System.Collections.Generic.List`1<VRRig> vrrigs
    // Size: 0x8
    // Offset: 0x38
    ::System::Collections::Generic::List_1<::GlobalNamespace::VRRig*>* vrrigs;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GlobalNamespace::VRRig*>*) == 0x8);
    // public System.Collections.Generic.Dictionary`2<NetPlayer,VRRig> vrrigDict
    // Size: 0x8
    // Offset: 0x40
    ::System::Collections::Generic::Dictionary_2<::GlobalNamespace::NetPlayer*, ::GlobalNamespace::VRRig*>* vrrigDict;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::GlobalNamespace::NetPlayer*, ::GlobalNamespace::VRRig*>*) == 0x8);
    // private System.Int32 i
    // Size: 0x4
    // Offset: 0x48
    int i;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean joinedRoom
    // Size: 0x1
    // Offset: 0x4C
    bool joinedRoom;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get static field: static public GorillaParent instance
    static ::GlobalNamespace::GorillaParent* _get_instance();
    // Set static field: static public GorillaParent instance
    static void _set_instance(::GlobalNamespace::GorillaParent* value);
    // Get static field: static public System.Boolean hasInstance
    static bool _get_hasInstance();
    // Set static field: static public System.Boolean hasInstance
    static void _set_hasInstance(bool value);
    // Get static field: static private System.Boolean replicatedClientReady
    static bool _get_replicatedClientReady();
    // Set static field: static private System.Boolean replicatedClientReady
    static void _set_replicatedClientReady(bool value);
    // Get static field: static private System.Action onReplicatedClientReady
    static ::System::Action* _get_onReplicatedClientReady();
    // Set static field: static private System.Action onReplicatedClientReady
    static void _set_onReplicatedClientReady(::System::Action* value);
    // Get instance field reference: public UnityEngine.GameObject tagUI
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_tagUI();
    // Get instance field reference: public UnityEngine.GameObject playerParent
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_playerParent();
    // Get instance field reference: public UnityEngine.GameObject vrrigParent
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_vrrigParent();
    // Get instance field reference: public System.Collections.Generic.List`1<VRRig> vrrigs
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::GlobalNamespace::VRRig*>*& dyn_vrrigs();
    // Get instance field reference: public System.Collections.Generic.Dictionary`2<NetPlayer,VRRig> vrrigDict
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::Dictionary_2<::GlobalNamespace::NetPlayer*, ::GlobalNamespace::VRRig*>*& dyn_vrrigDict();
    // Get instance field reference: private System.Int32 i
    [[deprecated("Use field access instead!")]] int& dyn_i();
    // Get instance field reference: private System.Boolean joinedRoom
    [[deprecated("Use field access instead!")]] bool& dyn_joinedRoom();
    // public System.Void Awake()
    // Offset: 0x2717178
    void Awake();
    // protected System.Void OnDestroy()
    // Offset: 0x27172AC
    void OnDestroy();
    // public System.Void LateUpdate()
    // Offset: 0x2717374
    void LateUpdate();
    // static public System.Void ReplicatedClientReady()
    // Offset: 0x271767C
    static void ReplicatedClientReady();
    // static public System.Void OnReplicatedClientReady(System.Action action)
    // Offset: 0x27176E8
    static void OnReplicatedClientReady(::System::Action* action);
    // public System.Void .ctor()
    // Offset: 0x27177C4
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static GorillaParent* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::GlobalNamespace::GorillaParent::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<GorillaParent*, creationType>()));
    }
  }; // GorillaParent
  #pragma pack(pop)
  static check_size<sizeof(GorillaParent), 76 + sizeof(bool)> __GlobalNamespace_GorillaParentSizeCheck;
  static_assert(sizeof(GorillaParent) == 0x4D);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: GlobalNamespace::GorillaParent::Awake
// Il2CppName: Awake
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::GorillaParent::*)()>(&GlobalNamespace::GorillaParent::Awake)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::GorillaParent*), "Awake", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::GorillaParent::OnDestroy
// Il2CppName: OnDestroy
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::GorillaParent::*)()>(&GlobalNamespace::GorillaParent::OnDestroy)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::GorillaParent*), "OnDestroy", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::GorillaParent::LateUpdate
// Il2CppName: LateUpdate
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::GorillaParent::*)()>(&GlobalNamespace::GorillaParent::LateUpdate)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::GorillaParent*), "LateUpdate", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::GorillaParent::ReplicatedClientReady
// Il2CppName: ReplicatedClientReady
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (*)()>(&GlobalNamespace::GorillaParent::ReplicatedClientReady)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::GorillaParent*), "ReplicatedClientReady", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::GorillaParent::OnReplicatedClientReady
// Il2CppName: OnReplicatedClientReady
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (*)(::System::Action*)>(&GlobalNamespace::GorillaParent::OnReplicatedClientReady)> {
  static const MethodInfo* get() {
    static auto* action = &::il2cpp_utils::GetClassFromName("System", "Action")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::GorillaParent*), "OnReplicatedClientReady", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{action});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::GorillaParent::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
