// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: GorillaPlayerLineButton
#include "GlobalNamespace/GorillaPlayerLineButton.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: NetPlayer
  class NetPlayer;
  // Forward declaring type: VRRig
  class VRRig;
  // Forward declaring type: GorillaScoreBoard
  class GorillaScoreBoard;
  // Forward declaring type: RigContainer
  class RigContainer;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Text
  class Text;
  // Forward declaring type: Image
  class Image;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Texture
  class Texture;
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: SpriteRenderer
  class SpriteRenderer;
  // Forward declaring type: MeshRenderer
  class MeshRenderer;
}
// Forward declaring namespace: Photon::Voice::Unity
namespace Photon::Voice::Unity {
  // Forward declaring type: Recorder
  class Recorder;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: GorillaPlayerScoreboardLine
  class GorillaPlayerScoreboardLine;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::GorillaPlayerScoreboardLine);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::GorillaPlayerScoreboardLine*, "", "GorillaPlayerScoreboardLine");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x130
  #pragma pack(push, 1)
  // Autogenerated type: GorillaPlayerScoreboardLine
  // [TokenAttribute] Offset: FFFFFFFF
  class GorillaPlayerScoreboardLine : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::GlobalNamespace::GorillaPlayerScoreboardLine::$$c
    class $$c;
    public:
    // public UnityEngine.UI.Text playerName
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::UI::Text* playerName;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // public UnityEngine.UI.Text playerLevel
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::UI::Text* playerLevel;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // public UnityEngine.UI.Text playerMMR
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::UI::Text* playerMMR;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // public UnityEngine.UI.Image playerSwatch
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::UI::Image* playerSwatch;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Image*) == 0x8);
    // public UnityEngine.Texture infectedTexture
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::Texture* infectedTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture*) == 0x8);
    // public NetPlayer linePlayer
    // Size: 0x8
    // Offset: 0x48
    ::GlobalNamespace::NetPlayer* linePlayer;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::NetPlayer*) == 0x8);
    // public VRRig playerVRRig
    // Size: 0x8
    // Offset: 0x50
    ::GlobalNamespace::VRRig* playerVRRig;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::VRRig*) == 0x8);
    // public System.String playerLevelValue
    // Size: 0x8
    // Offset: 0x58
    ::StringW playerLevelValue;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String playerMMRValue
    // Size: 0x8
    // Offset: 0x60
    ::StringW playerMMRValue;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String playerNameValue
    // Size: 0x8
    // Offset: 0x68
    ::StringW playerNameValue;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String playerNameVisible
    // Size: 0x8
    // Offset: 0x70
    ::StringW playerNameVisible;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Int32 playerActorNumber
    // Size: 0x4
    // Offset: 0x78
    int playerActorNumber;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: playerActorNumber and: muteButton
    char __padding11[0x4] = {};
    // public GorillaPlayerLineButton muteButton
    // Size: 0x8
    // Offset: 0x80
    ::GlobalNamespace::GorillaPlayerLineButton* muteButton;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::GorillaPlayerLineButton*) == 0x8);
    // public GorillaPlayerLineButton reportButton
    // Size: 0x8
    // Offset: 0x88
    ::GlobalNamespace::GorillaPlayerLineButton* reportButton;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::GorillaPlayerLineButton*) == 0x8);
    // public UnityEngine.GameObject hateSpeechButton
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::GameObject* hateSpeechButton;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject toxicityButton
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::GameObject* toxicityButton;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject cheatingButton
    // Size: 0x8
    // Offset: 0xA0
    ::UnityEngine::GameObject* cheatingButton;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject cancelButton
    // Size: 0x8
    // Offset: 0xA8
    ::UnityEngine::GameObject* cancelButton;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.SpriteRenderer speakerIcon
    // Size: 0x8
    // Offset: 0xB0
    ::UnityEngine::SpriteRenderer* speakerIcon;
    // Field size check
    static_assert(sizeof(::UnityEngine::SpriteRenderer*) == 0x8);
    // public System.Boolean canPressNextReportButton
    // Size: 0x1
    // Offset: 0xB8
    bool canPressNextReportButton;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: canPressNextReportButton and: texts
    char __padding19[0x7] = {};
    // public UnityEngine.UI.Text[] texts
    // Size: 0x8
    // Offset: 0xC0
    ::ArrayW<::UnityEngine::UI::Text*> texts;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::UI::Text*>) == 0x8);
    // public UnityEngine.SpriteRenderer[] sprites
    // Size: 0x8
    // Offset: 0xC8
    ::ArrayW<::UnityEngine::SpriteRenderer*> sprites;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::SpriteRenderer*>) == 0x8);
    // public UnityEngine.MeshRenderer[] meshes
    // Size: 0x8
    // Offset: 0xD0
    ::ArrayW<::UnityEngine::MeshRenderer*> meshes;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::MeshRenderer*>) == 0x8);
    // public UnityEngine.UI.Image[] images
    // Size: 0x8
    // Offset: 0xD8
    ::ArrayW<::UnityEngine::UI::Image*> images;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::UI::Image*>) == 0x8);
    // private Photon.Voice.Unity.Recorder myRecorder
    // Size: 0x8
    // Offset: 0xE0
    ::Photon::Voice::Unity::Recorder* myRecorder;
    // Field size check
    static_assert(sizeof(::Photon::Voice::Unity::Recorder*) == 0x8);
    // private System.Boolean isMuteManual
    // Size: 0x1
    // Offset: 0xE8
    bool isMuteManual;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isMuteManual and: mute
    char __padding25[0x3] = {};
    // private System.Int32 mute
    // Size: 0x4
    // Offset: 0xEC
    int mute;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 emptyRigCount
    // Size: 0x4
    // Offset: 0xF0
    int emptyRigCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: emptyRigCount and: myRig
    char __padding27[0x4] = {};
    // public UnityEngine.GameObject myRig
    // Size: 0x8
    // Offset: 0xF8
    ::UnityEngine::GameObject* myRig;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public System.Boolean reportedCheating
    // Size: 0x1
    // Offset: 0x100
    bool reportedCheating;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean reportedToxicity
    // Size: 0x1
    // Offset: 0x101
    bool reportedToxicity;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean reportedHateSpeech
    // Size: 0x1
    // Offset: 0x102
    bool reportedHateSpeech;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean reportInProgress
    // Size: 0x1
    // Offset: 0x103
    bool reportInProgress;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: reportInProgress and: currentNickname
    char __padding32[0x4] = {};
    // private System.String currentNickname
    // Size: 0x8
    // Offset: 0x108
    ::StringW currentNickname;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Boolean doneReporting
    // Size: 0x1
    // Offset: 0x110
    bool doneReporting;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean lastVisible
    // Size: 0x1
    // Offset: 0x111
    bool lastVisible;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: lastVisible and: parentScoreboard
    char __padding35[0x6] = {};
    // public GorillaScoreBoard parentScoreboard
    // Size: 0x8
    // Offset: 0x118
    ::GlobalNamespace::GorillaScoreBoard* parentScoreboard;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::GorillaScoreBoard*) == 0x8);
    // public System.Single initTime
    // Size: 0x4
    // Offset: 0x120
    float initTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single emptyRigCooldown
    // Size: 0x4
    // Offset: 0x124
    float emptyRigCooldown;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // RigContainer rigContainer
    // Size: 0x8
    // Offset: 0x128
    ::GlobalNamespace::RigContainer* rigContainer;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::RigContainer*) == 0x8);
    public:
    // Get static field: static private System.Int32[] targetActors
    static ::ArrayW<int> _get_targetActors();
    // Set static field: static private System.Int32[] targetActors
    static void _set_targetActors(::ArrayW<int> value);
    // Get instance field reference: public UnityEngine.UI.Text playerName
    [[deprecated("Use field access instead!")]] ::UnityEngine::UI::Text*& dyn_playerName();
    // Get instance field reference: public UnityEngine.UI.Text playerLevel
    [[deprecated("Use field access instead!")]] ::UnityEngine::UI::Text*& dyn_playerLevel();
    // Get instance field reference: public UnityEngine.UI.Text playerMMR
    [[deprecated("Use field access instead!")]] ::UnityEngine::UI::Text*& dyn_playerMMR();
    // Get instance field reference: public UnityEngine.UI.Image playerSwatch
