// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Photon.Pun.MonoBehaviourPunCallbacks
#include "Photon/Pun/MonoBehaviourPunCallbacks.hpp"
// Including type: Photon.Realtime.IOnEventCallback
#include "Photon/Realtime/IOnEventCallback.hpp"
// Including type: System.Byte
#include "System/Byte.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: ReportInfo
  class ReportInfo;
  // Forward declaring type: PhotonMessageInfoWrapped
  struct PhotonMessageInfoWrapped;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: Queue`1<T>
  template<typename T>
  class Queue_1;
  // Forward declaring type: HashSet`1<T>
  template<typename T>
  class HashSet_1;
}
// Forward declaring namespace: Photon::Realtime
namespace Photon::Realtime {
  // Forward declaring type: Player
  class Player;
}
// Forward declaring namespace: ExitGames::Client::Photon
namespace ExitGames::Client::Photon {
  // Forward declaring type: Hashtable
  class Hashtable;
  // Forward declaring type: EventData
  class EventData;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: LogType
  struct LogType;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Forward declaring namespace: Photon::Pun
namespace Photon::Pun {
  // Forward declaring type: PhotonMessageInfo
  struct PhotonMessageInfo;
}
// Forward declaring namespace: Photon::Voice::Unity
namespace Photon::Voice::Unity {
  // Forward declaring type: RemoteVoiceLink
  class RemoteVoiceLink;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: GorillaNot
  class GorillaNot;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::GorillaNot);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::GorillaNot*, "", "GorillaNot");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0xE8
  #pragma pack(push, 1)
  // Autogenerated type: GorillaNot
  // [TokenAttribute] Offset: FFFFFFFF
  class GorillaNot : public ::Photon::Pun::MonoBehaviourPunCallbacks/*, public ::Photon::Realtime::IOnEventCallback*/ {
    public:
    // Nested type: ::GlobalNamespace::GorillaNot::RPCCallTracker
    class RPCCallTracker;
    // Nested type: ::GlobalNamespace::GorillaNot::$$c
    class $$c;
    // Nested type: ::GlobalNamespace::GorillaNot::$CheckDirtyRoom$d__75
    class $CheckDirtyRoom$d__75;
    // Nested type: ::GlobalNamespace::GorillaNot::$CheckReports$d__53
    class $CheckReports$d__53;
    // Nested type: ::GlobalNamespace::GorillaNot::$QuitDelay$d__64
    class $QuitDelay$d__64;
    public:
    // private System.Boolean _sendReport
    // Size: 0x1
    // Offset: 0x28
    bool sendReport;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: sendReport and: suspiciousPlayerId
    char __padding0[0x7] = {};
    // private System.String _suspiciousPlayerId
    // Size: 0x8
    // Offset: 0x30
    ::StringW suspiciousPlayerId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String _suspiciousPlayerName
    // Size: 0x8
    // Offset: 0x38
    ::StringW suspiciousPlayerName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String _suspiciousReason
    // Size: 0x8
    // Offset: 0x40
    ::StringW suspiciousReason;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.Collections.Generic.List`1<System.String> reportedPlayers
    // Size: 0x8
    // Offset: 0x48
    ::System::Collections::Generic::List_1<::StringW>* reportedPlayers;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::StringW>*) == 0x8);
    // public System.Byte roomSize
    // Size: 0x1
    // Offset: 0x50
    uint8_t roomSize;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // Padding between fields: roomSize and: lastCheck
    char __padding5[0x3] = {};
    // public System.Single lastCheck
    // Size: 0x4
    // Offset: 0x54
    float lastCheck;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single checkCooldown
    // Size: 0x4
    // Offset: 0x58
    float checkCooldown;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single userDecayTime
    // Size: 0x4
    // Offset: 0x5C
    float userDecayTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public Photon.Realtime.Player currentMasterClient
    // Size: 0x8
    // Offset: 0x60
    ::Photon::Realtime::Player* currentMasterClient;
    // Field size check
    static_assert(sizeof(::Photon::Realtime::Player*) == 0x8);
    // public System.Boolean testAssault
    // Size: 0x1
    // Offset: 0x68
    bool testAssault;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: testAssault and: lowestActorNumber
    char __padding10[0x3] = {};
    // private System.Int32 lowestActorNumber
    // Size: 0x4
    // Offset: 0x6C
    int lowestActorNumber;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 calls
    // Size: 0x4
    // Offset: 0x70
    int calls;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 rpcCallLimit
    // Size: 0x4
    // Offset: 0x74
    int rpcCallLimit;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 logErrorMax
    // Size: 0x4
    // Offset: 0x78
    int logErrorMax;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 rpcErrorMax
    // Size: 0x4
    // Offset: 0x7C
    int rpcErrorMax;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Object outObj
    // Size: 0x8
    // Offset: 0x80
    ::Il2CppObject* outObj;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private Photon.Realtime.Player tempPlayer
    // Size: 0x8
    // Offset: 0x88
    ::Photon::Realtime::Player* tempPlayer;
    // Field size check
    static_assert(sizeof(::Photon::Realtime::Player*) == 0x8);
    // private System.Int32 logErrorCount
    // Size: 0x4
    // Offset: 0x90
    int logErrorCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 stringIndex
    // Size: 0x4
    // Offset: 0x94
    int stringIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.String playerID
    // Size: 0x8
    // Offset: 0x98
    ::StringW playerID;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String playerNick
    // Size: 0x8
    // Offset: 0xA0
    ::StringW playerNick;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Int32 lastServerTimestamp
    // Size: 0x4
    // Offset: 0xA8
    int lastServerTimestamp;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: lastServerTimestamp and: cachedPlayerList
    char __padding22[0x4] = {};
    // public Photon.Realtime.Player[] cachedPlayerList
    // Size: 0x8
    // Offset: 0xB0
    ::ArrayW<::Photon::Realtime::Player*> cachedPlayerList;
    // Field size check
    static_assert(sizeof(::ArrayW<::Photon::Realtime::Player*>) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.String,System.Collections.Generic.Dictionary`2<System.String,GorillaNot/RPCCallTracker>> userRPCCalls
    // Size: 0x8
    // Offset: 0xB8
    ::System::Collections::Generic::Dictionary_2<::StringW, ::System::Collections::Generic::Dictionary_2<::StringW, ::GlobalNamespace::GorillaNot::RPCCallTracker*>*>* userRPCCalls;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, ::System::Collections::Generic::Dictionary_2<::StringW, ::GlobalNamespace::GorillaNot::RPCCallTracker*>*>*) == 0x8);
    // public System.String roomGameMode
    // Size: 0x8
    // Offset: 0xC0
    ::StringW roomGameMode;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Collections.Generic.Queue`1<ReportInfo> reportQueue
    // Size: 0x8
    // Offset: 0xC8
    ::System::Collections::Generic::Queue_1<::GlobalNamespace::ReportInfo*>* reportQueue;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Queue_1<::GlobalNamespace::ReportInfo*>*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.String,System.Collections.Generic.HashSet`1<ReportInfo>> queuedReports
    // Size: 0x8
    // Offset: 0xD0
    ::System::Collections::Generic::Dictionary_2<::StringW, ::System::Collections::Generic::HashSet_1<::GlobalNamespace::ReportInfo*>*>* queuedReports;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, ::System::Collections::Generic::HashSet_1<::GlobalNamespace::ReportInfo*>*>*) == 0x8);
    // private System.Boolean closeDirty
    // Size: 0x1
    // Offset: 0xD8
    bool closeDirty;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: closeDirty and: hashTable
    char __padding28[0x7] = {};
    // private ExitGames.Client.Photon.Hashtable hashTable
    // Size: 0x8
    // Offset: 0xE0
    ::ExitGames::Client::Photon::Hashtable* hashTable;
    // Field size check
    static_assert(sizeof(::ExitGames::Client::Photon::Hashtable*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::Photon::Realtime::IOnEventCallback
    operator ::Photon::Realtime::IOnEventCallback() noexcept {
      return *reinterpret_cast<::Photon::Realtime::IOnEventCallback*>(this);
    }
    // Get static field: static public GorillaNot instance
    static ::GlobalNamespace::GorillaNot* _get_instance();
    // Set static field: static public GorillaNot instance
    static void _set_instance(::GlobalNamespace::GorillaNot* value);
    // static field const value: static private System.Byte ReportAssault
    static constexpr const uint8_t ReportAssault = 8u;
    // Get static field: static private System.Byte ReportAssault
    static uint8_t _get_ReportAssault();
    // Set static field: static private System.Byte ReportAssault
