// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: VRRig
  class VRRig;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: CapsuleCollider
  class CapsuleCollider;
  // Forward declaring type: Collider
  class Collider;
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: GorillaFriendCollider
  class GorillaFriendCollider;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::GorillaFriendCollider);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::GorillaFriendCollider*, "", "GorillaFriendCollider");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x64
  #pragma pack(push, 1)
  // Autogenerated type: GorillaFriendCollider
  // [TokenAttribute] Offset: FFFFFFFF
  class GorillaFriendCollider : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::GlobalNamespace::GorillaFriendCollider::$UpdatePlayersInSphere$d__12
    class $UpdatePlayersInSphere$d__12;
    public:
    // public System.Collections.Generic.List`1<System.String> playerIDsCurrentlyTouching
    // Size: 0x8
    // Offset: 0x20
    ::System::Collections::Generic::List_1<::StringW>* playerIDsCurrentlyTouching;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::StringW>*) == 0x8);
    // public UnityEngine.CapsuleCollider thisCapsule
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::CapsuleCollider* thisCapsule;
    // Field size check
    static_assert(sizeof(::UnityEngine::CapsuleCollider*) == 0x8);
    // public System.String[] myAllowedMapsToJoin
    // Size: 0x8
    // Offset: 0x30
    ::ArrayW<::StringW> myAllowedMapsToJoin;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // private readonly UnityEngine.Collider[] overlapColliders
    // Size: 0x8
    // Offset: 0x38
    ::ArrayW<::UnityEngine::Collider*> overlapColliders;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Collider*>) == 0x8);
    // private System.Int32 tagAndBodyLayerMask
    // Size: 0x4
    // Offset: 0x40
    int tagAndBodyLayerMask;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single jiggleAmount
    // Size: 0x4
    // Offset: 0x44
    float jiggleAmount;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Collider otherCollider
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::Collider* otherCollider;
    // Field size check
    static_assert(sizeof(::UnityEngine::Collider*) == 0x8);
    // private UnityEngine.GameObject otherColliderGO
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::GameObject* otherColliderGO;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private VRRig collidingRig
    // Size: 0x8
    // Offset: 0x58
    ::GlobalNamespace::VRRig* collidingRig;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::VRRig*) == 0x8);
    // private System.Int32 collisions
    // Size: 0x4
    // Offset: 0x60
    int collisions;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Get instance field reference: public System.Collections.Generic.List`1<System.String> playerIDsCurrentlyTouching
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::StringW>*& dyn_playerIDsCurrentlyTouching();
    // Get instance field reference: public UnityEngine.CapsuleCollider thisCapsule
    [[deprecated("Use field access instead!")]] ::UnityEngine::CapsuleCollider*& dyn_thisCapsule();
    // Get instance field reference: public System.String[] myAllowedMapsToJoin
    [[deprecated("Use field access instead!")]] ::ArrayW<::StringW>& dyn_myAllowedMapsToJoin();
    // Get instance field reference: private readonly UnityEngine.Collider[] overlapColliders
    [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::Collider*>& dyn_overlapColliders();
    // Get instance field reference: private System.Int32 tagAndBodyLayerMask
    [[deprecated("Use field access instead!")]] int& dyn_tagAndBodyLayerMask();
    // Get instance field reference: private System.Single jiggleAmount
    [[deprecated("Use field access instead!")]] float& dyn_jiggleAmount();
    // Get instance field reference: private UnityEngine.Collider otherCollider
    [[deprecated("Use field access instead!")]] ::UnityEngine::Collider*& dyn_otherCollider();
    // Get instance field reference: private UnityEngine.GameObject otherColliderGO
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_otherColliderGO();
    // Get instance field reference: private VRRig collidingRig
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::VRRig*& dyn_collidingRig();
    // Get instance field reference: private System.Int32 collisions
    [[deprecated("Use field access instead!")]] int& dyn_collisions();
    // public System.Void Awake()
    // Offset: 0x2757C08
    void Awake();
    // private System.Void AddUserID(in System.String userID)
    // Offset: 0x2757DC8
    void AddUserID(ByRef<::StringW> userID);
    // private System.Collections.IEnumerator UpdatePlayersInSphere()
    // Offset: 0x2757D5C
    ::System::Collections::IEnumerator* UpdatePlayersInSphere();
    // public System.Void .ctor()
    // Offset: 0x2757ED0
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static GorillaFriendCollider* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::GlobalNamespace::GorillaFriendCollider::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<GorillaFriendCollider*, creationType>()));
    }
  }; // GorillaFriendCollider
  #pragma pack(pop)
  static check_size<sizeof(GorillaFriendCollider), 96 + sizeof(int)> __GlobalNamespace_GorillaFriendColliderSizeCheck;
  static_assert(sizeof(GorillaFriendCollider) == 0x64);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: GlobalNamespace::GorillaFriendCollider::Awake
// Il2CppName: Awake
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::GorillaFriendCollider::*)()>(&GlobalNamespace::GorillaFriendCollider::Awake)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::GorillaFriendCollider*), "Awake", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::GorillaFriendCollider::AddUserID
// Il2CppName: AddUserID
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::GorillaFriendCollider::*)(ByRef<::StringW>)>(&GlobalNamespace::GorillaFriendCollider::AddUserID)> {
  static const MethodInfo* get() {
    static auto* userID = &::il2cpp_utils::GetClassFromName("System", "String")->this_arg;
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::GorillaFriendCollider*), "AddUserID", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{userID});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::GorillaFriendCollider::UpdatePlayersInSphere
// Il2CppName: UpdatePlayersInSphere
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::System::Collections::IEnumerator* (GlobalNamespace::GorillaFriendCollider::*)()>(&GlobalNamespace::GorillaFriendCollider::UpdatePlayersInSphere)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::GorillaFriendCollider*), "UpdatePlayersInSphere", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::GorillaFriendCollider::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
