// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: GorillaGameManager
#include "GlobalNamespace/GorillaGameManager.hpp"
// Including type: System.Collections.Generic.KeyValuePair`2
#include "System/Collections/Generic/KeyValuePair_2.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Photon::Pun
namespace Photon::Pun {
  // Forward declaring type: PhotonView
  class PhotonView;
  // Forward declaring type: PhotonMessageInfo
  struct PhotonMessageInfo;
  // Forward declaring type: PhotonStream
  class PhotonStream;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Skipping declaration: BattleStatus because it is already included!
  // Skipping declaration: BattleState because it is already included!
  // Forward declaring type: GameModeSerializer
  class GameModeSerializer;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Forward declaring namespace: Photon::Realtime
namespace Photon::Realtime {
  // Forward declaring type: Player
  class Player;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Skipping declaration: Vector3 because it is already included!
}
// Forward declaring namespace: GorillaGameModes
namespace GorillaGameModes {
  // Forward declaring type: GameModeType
  struct GameModeType;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: GorillaBattleManager
  class GorillaBattleManager;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::GorillaBattleManager);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::GorillaBattleManager*, "", "GorillaBattleManager");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x178
  #pragma pack(push, 1)
  // Autogenerated type: GorillaBattleManager
  // [TokenAttribute] Offset: FFFFFFFF
  class GorillaBattleManager : public ::GlobalNamespace::GorillaGameManager {
    public:
    // Nested type: ::GlobalNamespace::GorillaBattleManager::BattleStatus
    struct BattleStatus;
    // Nested type: ::GlobalNamespace::GorillaBattleManager::BattleState
    struct BattleState;
    // Nested type: ::GlobalNamespace::GorillaBattleManager::$$c__DisplayClass81_0
    class $$c__DisplayClass81_0;
    // Nested type: ::GlobalNamespace::GorillaBattleManager::$StartBattleCountdown$d__45
    class $StartBattleCountdown$d__45;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: GorillaBattleManager/BattleStatus
    // [TokenAttribute] Offset: FFFFFFFF
    struct BattleStatus/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: BattleStatus
      constexpr BattleStatus(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public GorillaBattleManager/BattleStatus RedTeam
      static constexpr const int RedTeam = 1;
      // Get static field: static public GorillaBattleManager/BattleStatus RedTeam
      static ::GlobalNamespace::GorillaBattleManager::BattleStatus _get_RedTeam();
      // Set static field: static public GorillaBattleManager/BattleStatus RedTeam
      static void _set_RedTeam(::GlobalNamespace::GorillaBattleManager::BattleStatus value);
      // static field const value: static public GorillaBattleManager/BattleStatus BlueTeam
      static constexpr const int BlueTeam = 2;
      // Get static field: static public GorillaBattleManager/BattleStatus BlueTeam
      static ::GlobalNamespace::GorillaBattleManager::BattleStatus _get_BlueTeam();
      // Set static field: static public GorillaBattleManager/BattleStatus BlueTeam
      static void _set_BlueTeam(::GlobalNamespace::GorillaBattleManager::BattleStatus value);
      // static field const value: static public GorillaBattleManager/BattleStatus Normal
      static constexpr const int Normal = 4;
      // Get static field: static public GorillaBattleManager/BattleStatus Normal
      static ::GlobalNamespace::GorillaBattleManager::BattleStatus _get_Normal();
      // Set static field: static public GorillaBattleManager/BattleStatus Normal
      static void _set_Normal(::GlobalNamespace::GorillaBattleManager::BattleStatus value);
      // static field const value: static public GorillaBattleManager/BattleStatus Hit
      static constexpr const int Hit = 8;
      // Get static field: static public GorillaBattleManager/BattleStatus Hit
      static ::GlobalNamespace::GorillaBattleManager::BattleStatus _get_Hit();
      // Set static field: static public GorillaBattleManager/BattleStatus Hit
      static void _set_Hit(::GlobalNamespace::GorillaBattleManager::BattleStatus value);
      // static field const value: static public GorillaBattleManager/BattleStatus Stunned
      static constexpr const int Stunned = 16;
      // Get static field: static public GorillaBattleManager/BattleStatus Stunned
      static ::GlobalNamespace::GorillaBattleManager::BattleStatus _get_Stunned();
      // Set static field: static public GorillaBattleManager/BattleStatus Stunned
      static void _set_Stunned(::GlobalNamespace::GorillaBattleManager::BattleStatus value);
      // static field const value: static public GorillaBattleManager/BattleStatus Grace
      static constexpr const int Grace = 32;
      // Get static field: static public GorillaBattleManager/BattleStatus Grace
      static ::GlobalNamespace::GorillaBattleManager::BattleStatus _get_Grace();
      // Set static field: static public GorillaBattleManager/BattleStatus Grace
      static void _set_Grace(::GlobalNamespace::GorillaBattleManager::BattleStatus value);
      // static field const value: static public GorillaBattleManager/BattleStatus Eliminated
      static constexpr const int Eliminated = 64;
      // Get static field: static public GorillaBattleManager/BattleStatus Eliminated
      static ::GlobalNamespace::GorillaBattleManager::BattleStatus _get_Eliminated();
      // Set static field: static public GorillaBattleManager/BattleStatus Eliminated
      static void _set_Eliminated(::GlobalNamespace::GorillaBattleManager::BattleStatus value);
      // static field const value: static public GorillaBattleManager/BattleStatus None
      static constexpr const int None = 0;
      // Get static field: static public GorillaBattleManager/BattleStatus None
      static ::GlobalNamespace::GorillaBattleManager::BattleStatus _get_None();
      // Set static field: static public GorillaBattleManager/BattleStatus None
      static void _set_None(::GlobalNamespace::GorillaBattleManager::BattleStatus value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // GorillaBattleManager/BattleStatus
    #pragma pack(pop)
    static check_size<sizeof(GorillaBattleManager::BattleStatus), 0 + sizeof(int)> __GlobalNamespace_GorillaBattleManager_BattleStatusSizeCheck;
    static_assert(sizeof(GorillaBattleManager::BattleStatus) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: GorillaBattleManager/BattleState
    // [TokenAttribute] Offset: FFFFFFFF
    struct BattleState/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: BattleState
      constexpr BattleState(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public GorillaBattleManager/BattleState NotEnoughPlayers
      static constexpr const int NotEnoughPlayers = 0;
      // Get static field: static public GorillaBattleManager/BattleState NotEnoughPlayers
      static ::GlobalNamespace::GorillaBattleManager::BattleState _get_NotEnoughPlayers();
      // Set static field: static public GorillaBattleManager/BattleState NotEnoughPlayers
      static void _set_NotEnoughPlayers(::GlobalNamespace::GorillaBattleManager::BattleState value);
      // static field const value: static public GorillaBattleManager/BattleState GameEnd
      static constexpr const int GameEnd = 1;
      // Get static field: static public GorillaBattleManager/BattleState GameEnd
      static ::GlobalNamespace::GorillaBattleManager::BattleState _get_GameEnd();
      // Set static field: static public GorillaBattleManager/BattleState GameEnd
      static void _set_GameEnd(::GlobalNamespace::GorillaBattleManager::BattleState value);
      // static field const value: static public GorillaBattleManager/BattleState GameEndWaiting
      static constexpr const int GameEndWaiting = 2;
      // Get static field: static public GorillaBattleManager/BattleState GameEndWaiting
      static ::GlobalNamespace::GorillaBattleManager::BattleState _get_GameEndWaiting();
      // Set static field: static public GorillaBattleManager/BattleState GameEndWaiting
      static void _set_GameEndWaiting(::GlobalNamespace::GorillaBattleManager::BattleState value);
      // static field const value: static public GorillaBattleManager/BattleState StartCountdown
      static constexpr const int StartCountdown = 3;
      // Get static field: static public GorillaBattleManager/BattleState StartCountdown
      static ::GlobalNamespace::GorillaBattleManager::BattleState _get_StartCountdown();
      // Set static field: static public GorillaBattleManager/BattleState StartCountdown
      static void _set_StartCountdown(::GlobalNamespace::GorillaBattleManager::BattleState value);
      // static field const value: static public GorillaBattleManager/BattleState CountingDownToStart
      static constexpr const int CountingDownToStart = 4;
      // Get static field: static public GorillaBattleManager/BattleState CountingDownToStart
      static ::GlobalNamespace::GorillaBattleManager::BattleState _get_CountingDownToStart();
      // Set static field: static public GorillaBattleManager/BattleState CountingDownToStart
      static void _set_CountingDownToStart(::GlobalNamespace::GorillaBattleManager::BattleState value);
      // static field const value: static public GorillaBattleManager/BattleState GameStart
      static constexpr const int GameStart = 5;
      // Get static field: static public GorillaBattleManager/BattleState GameStart
      static ::GlobalNamespace::GorillaBattleManager::BattleState _get_GameStart();
      // Set static field: static public GorillaBattleManager/BattleState GameStart
      static void _set_GameStart(::GlobalNamespace::GorillaBattleManager::BattleState value);
      // static field const value: static public GorillaBattleManager/BattleState GameRunning
      static constexpr const int GameRunning = 6;
      // Get static field: static public GorillaBattleManager/BattleState GameRunning
      static ::GlobalNamespace::GorillaBattleManager::BattleState _get_GameRunning();
      // Set static field: static public GorillaBattleManager/BattleState GameRunning
      static void _set_GameRunning(::GlobalNamespace::GorillaBattleManager::BattleState value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // GorillaBattleManager/BattleState
    #pragma pack(pop)
    static check_size<sizeof(GorillaBattleManager::BattleState), 0 + sizeof(int)> __GlobalNamespace_GorillaBattleManager_BattleStateSizeCheck;
    static_assert(sizeof(GorillaBattleManager::BattleState) == 0x4);
    public:
    // private System.Single playerMin
    // Size: 0x4
    // Offset: 0xD8
    float playerMin;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single tagCoolDown
    // Size: 0x4
    // Offset: 0xDC
    float tagCoolDown;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Collections.Generic.Dictionary`2<System.Int32,System.Int32> playerLives
    // Size: 0x8
    // Offset: 0xE0
    ::System::Collections::Generic::Dictionary_2<int, int>* playerLives;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<int, int>*) == 0x8);
    // public System.Collections.Generic.Dictionary`2<System.Int32,GorillaBattleManager/BattleStatus> playerStatusDict
    // Size: 0x8
    // Offset: 0xE8
    ::System::Collections::Generic::Dictionary_2<int, ::GlobalNamespace::GorillaBattleManager::BattleStatus>* playerStatusDict;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<int, ::GlobalNamespace::GorillaBattleManager::BattleStatus>*) == 0x8);
    // public System.Collections.Generic.Dictionary`2<System.Int32,System.Single> playerHitTimes
    // Size: 0x8
    // Offset: 0xF0
    ::System::Collections::Generic::Dictionary_2<int, float>* playerHitTimes;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<int, float>*) == 0x8);
    // public System.Collections.Generic.Dictionary`2<System.Int32,System.Single> playerStunTimes
    // Size: 0x8
    // Offset: 0xF8
    ::System::Collections::Generic::Dictionary_2<int, float>* playerStunTimes;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<int, float>*) == 0x8);
    // public System.Int32[] playerActorNumberArray
    // Size: 0x8
    // Offset: 0x100
    ::ArrayW<int> playerActorNumberArray;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // public System.Int32[] playerLivesArray
    // Size: 0x8
    // Offset: 0x108
    ::ArrayW<int> playerLivesArray;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // public GorillaBattleManager/BattleStatus[] playerStatusArray
    // Size: 0x8
    // Offset: 0x110
    ::ArrayW<::GlobalNamespace::GorillaBattleManager::BattleStatus> playerStatusArray;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::GorillaBattleManager::BattleStatus>) == 0x8);
    // public System.Boolean teamBattle
    // Size: 0x1
    // Offset: 0x118
    bool teamBattle;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: teamBattle and: countDownTime
    char __padding9[0x3] = {};
    // public System.Int32 countDownTime
    // Size: 0x4
    // Offset: 0x11C
    int countDownTime;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single timeBattleEnded
    // Size: 0x4
    // Offset: 0x120
    float timeBattleEnded;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single hitCooldown
    // Size: 0x4
    // Offset: 0x124
    float hitCooldown;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single stunGracePeriod
    // Size: 0x4
    // Offset: 0x128
    float stunGracePeriod;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: stunGracePeriod and: objRef
    char __padding13[0x4] = {};
    // public System.Object objRef
    // Size: 0x8
    // Offset: 0x130
    ::Il2CppObject* objRef;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Boolean playerInList
    // Size: 0x1
    // Offset: 0x138
    bool playerInList;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean coroutineRunning
    // Size: 0x1
    // Offset: 0x139
    bool coroutineRunning;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: coroutineRunning and: lives
    char __padding16[0x2] = {};
    // private System.Int32 lives
    // Size: 0x4
    // Offset: 0x13C
    int lives;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 outLives
    // Size: 0x4
    // Offset: 0x140
    int outLives;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 bcount
    // Size: 0x4
    // Offset: 0x144
    int bcount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 rcount
    // Size: 0x4
    // Offset: 0x148
    int rcount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 randInt
    // Size: 0x4
    // Offset: 0x14C
    int randInt;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single outHitTime
    // Size: 0x4
    // Offset: 0x150
    float outHitTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: outHitTime and: tempView
    char __padding22[0x4] = {};
    // private Photon.Pun.PhotonView tempView
    // Size: 0x8
    // Offset: 0x158
    ::Photon::Pun::PhotonView* tempView;
    // Field size check
    static_assert(sizeof(::Photon::Pun::PhotonView*) == 0x8);
    // private System.Collections.Generic.KeyValuePair`2<System.Int32,System.Int32>[] keyValuePairs
    // Size: 0x8
    // Offset: 0x160
    ::ArrayW<::System::Collections::Generic::KeyValuePair_2<int, int>> keyValuePairs;
    // Field size check
    static_assert(sizeof(::ArrayW<::System::Collections::Generic::KeyValuePair_2<int, int>>) == 0x8);
    // private System.Collections.Generic.KeyValuePair`2<System.Int32,GorillaBattleManager/BattleStatus>[] keyValuePairsStatus
    // Size: 0x8
    // Offset: 0x168
    ::ArrayW<::System::Collections::Generic::KeyValuePair_2<int, ::GlobalNamespace::GorillaBattleManager::BattleStatus>> keyValuePairsStatus;
    // Field size check
    static_assert(sizeof(::ArrayW<::System::Collections::Generic::KeyValuePair_2<int, ::GlobalNamespace::GorillaBattleManager::BattleStatus>>) == 0x8);
    // private GorillaBattleManager/BattleStatus tempStatus
    // Size: 0x4
    // Offset: 0x170
    ::GlobalNamespace::GorillaBattleManager::BattleStatus tempStatus;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::GorillaBattleManager::BattleStatus) == 0x4);
    // private GorillaBattleManager/BattleState currentState
    // Size: 0x4
    // Offset: 0x174
    ::GlobalNamespace::GorillaBattleManager::BattleState currentState;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::GorillaBattleManager::BattleState) == 0x4);
    public:
    // Get static field: static System.String ssString
    static ::StringW _get_ssString();
    // Set static field: static System.String ssString
    static void _set_ssString(::StringW value);
    // Get instance field reference: private System.Single playerMin
    [[deprecated("Use field access instead!")]] float& dyn_playerMin();
    // Get instance field reference: public System.Single tagCoolDown
    [[deprecated("Use field access instead!")]] float& dyn_tagCoolDown();
    // Get instance field reference: public System.Collections.Generic.Dictionary`2<System.Int32,System.Int32> playerLives
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::Dictionary_2<int, int>*& dyn_playerLives();
