// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: GorillaGameManager
#include "GlobalNamespace/GorillaGameManager.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: Photon::Realtime
namespace Photon::Realtime {
  // Forward declaring type: Player
  class Player;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Forward declaring namespace: GorillaGameModes
namespace GorillaGameModes {
  // Forward declaring type: GameModeType
  struct GameModeType;
}
// Forward declaring namespace: Photon::Pun
namespace Photon::Pun {
  // Forward declaring type: PhotonStream
  class PhotonStream;
  // Forward declaring type: PhotonMessageInfo
  struct PhotonMessageInfo;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: GorillaHuntManager
  class GorillaHuntManager;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::GorillaHuntManager);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::GorillaHuntManager*, "", "GorillaHuntManager");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x150
  #pragma pack(push, 1)
  // Autogenerated type: GorillaHuntManager
  // [TokenAttribute] Offset: FFFFFFFF
  class GorillaHuntManager : public ::GlobalNamespace::GorillaGameManager {
    public:
    // Nested type: ::GlobalNamespace::GorillaHuntManager::$HuntEnd$d__31
    class $HuntEnd$d__31;
    // Nested type: ::GlobalNamespace::GorillaHuntManager::$StartHuntCountdown$d__28
    class $StartHuntCountdown$d__28;
    public:
    // public System.Single tagCoolDown
    // Size: 0x4
    // Offset: 0xD8
    float tagCoolDown;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: tagCoolDown and: currentHuntedArray
    char __padding0[0x4] = {};
    // public System.Int32[] currentHuntedArray
    // Size: 0x8
    // Offset: 0xE0
    ::ArrayW<int> currentHuntedArray;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // public System.Collections.Generic.List`1<Photon.Realtime.Player> currentHunted
    // Size: 0x8
    // Offset: 0xE8
    ::System::Collections::Generic::List_1<::Photon::Realtime::Player*>* currentHunted;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Photon::Realtime::Player*>*) == 0x8);
    // public System.Int32[] currentTargetArray
    // Size: 0x8
    // Offset: 0xF0
    ::ArrayW<int> currentTargetArray;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // public System.Collections.Generic.List`1<Photon.Realtime.Player> currentTarget
    // Size: 0x8
    // Offset: 0xF8
    ::System::Collections::Generic::List_1<::Photon::Realtime::Player*>* currentTarget;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Photon::Realtime::Player*>*) == 0x8);
    // public System.Boolean huntStarted
    // Size: 0x1
    // Offset: 0x100
    bool huntStarted;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean waitingToStartNextHuntGame
    // Size: 0x1
    // Offset: 0x101
    bool waitingToStartNextHuntGame;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean inStartCountdown
    // Size: 0x1
    // Offset: 0x102
    bool inStartCountdown;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: inStartCountdown and: countDownTime
    char __padding7[0x1] = {};
    // public System.Int32 countDownTime
    // Size: 0x4
    // Offset: 0x104
    int countDownTime;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Double timeHuntGameEnded
    // Size: 0x8
    // Offset: 0x108
    double timeHuntGameEnded;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // public System.Single timeLastSlowTagged
    // Size: 0x4
    // Offset: 0x110
    float timeLastSlowTagged;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: timeLastSlowTagged and: objRef
    char __padding10[0x4] = {};
    // public System.Object objRef
    // Size: 0x8
    // Offset: 0x118
    ::Il2CppObject* objRef;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Int32 iterator1
    // Size: 0x4
    // Offset: 0x120
    int iterator1;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: iterator1 and: tempRandPlayer
    char __padding12[0x4] = {};
    // private Photon.Realtime.Player tempRandPlayer
    // Size: 0x8
    // Offset: 0x128
    ::Photon::Realtime::Player* tempRandPlayer;
    // Field size check
    static_assert(sizeof(::Photon::Realtime::Player*) == 0x8);
    // private System.Int32 tempRandIndex
    // Size: 0x4
    // Offset: 0x130
    int tempRandIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 notHuntedCount
    // Size: 0x4
    // Offset: 0x134
    int notHuntedCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 tempTargetIndex
    // Size: 0x4
    // Offset: 0x138
    int tempTargetIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: tempTargetIndex and: tempPlayer
    char __padding16[0x4] = {};
    // private Photon.Realtime.Player tempPlayer
    // Size: 0x8
    // Offset: 0x140
    ::Photon::Realtime::Player* tempPlayer;
    // Field size check
    static_assert(sizeof(::Photon::Realtime::Player*) == 0x8);
    // private System.Int32 copyListToArrayIndex
    // Size: 0x4
    // Offset: 0x148
    int copyListToArrayIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 copyArrayToListIndex
    // Size: 0x4
    // Offset: 0x14C
    int copyArrayToListIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Get instance field reference: public System.Single tagCoolDown
    [[deprecated("Use field access instead!")]] float& dyn_tagCoolDown();
    // Get instance field reference: public System.Int32[] currentHuntedArray
    [[deprecated("Use field access instead!")]] ::ArrayW<int>& dyn_currentHuntedArray();
    // Get instance field reference: public System.Collections.Generic.List`1<Photon.Realtime.Player> currentHunted
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::Photon::Realtime::Player*>*& dyn_currentHunted();
    // Get instance field reference: public System.Int32[] currentTargetArray
    [[deprecated("Use field access instead!")]] ::ArrayW<int>& dyn_currentTargetArray();
    // Get instance field reference: public System.Collections.Generic.List`1<Photon.Realtime.Player> currentTarget
