// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: GorillaTag.GuidedRefs.IGuidedRefReceiverMono
#include "GorillaTag/GuidedRefs/IGuidedRefReceiverMono.hpp"
// Including type: GorillaTag.GuidedRefs.GuidedRefReceiverFieldInfo
#include "GorillaTag/GuidedRefs/GuidedRefReceiverFieldInfo.hpp"
// Including type: UnityEngine.XR.InputDevice
#include "UnityEngine/XR/InputDevice.hpp"
// Including type: UnityEngine.RaycastHit
#include "UnityEngine/RaycastHit.hpp"
// Including type: UnityEngine.LayerMask
#include "UnityEngine/LayerMask.hpp"
// Including type: System.Nullable`1
#include "System/Nullable_1.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Photon::Voice::Unity
namespace Photon::Voice::Unity {
  // Forward declaring type: Recorder
  class Recorder;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: VRRig
  class VRRig;
  // Forward declaring type: Watchable`1<T>
  template<typename T>
  class Watchable_1;
  // Forward declaring type: VRRigSerializer
  class VRRigSerializer;
  // Skipping declaration: StatusEffect because it is already included!
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: SphereCollider
  class SphereCollider;
  // Forward declaring type: CapsuleCollider
  class CapsuleCollider;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: AudioSource
  class AudioSource;
  // Forward declaring type: Rigidbody
  class Rigidbody;
  // Forward declaring type: Collider
  class Collider;
  // Forward declaring type: Color
  struct Color;
  // Skipping declaration: Object because it is already included!
}
// Forward declaring namespace: Photon::Realtime
namespace Photon::Realtime {
  // Forward declaring type: Player
  class Player;
}
// Forward declaring namespace: Photon::Pun
namespace Photon::Pun {
  // Forward declaring type: PhotonView
  class PhotonView;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Forward declaring namespace: UnityEngine::XR
namespace UnityEngine::XR {
  // Forward declaring type: XRNode
  struct XRNode;
}
// Forward declaring namespace: GorillaTag::GuidedRefs
namespace GorillaTag::GuidedRefs {
  // Forward declaring type: GuidedRefTryResolveInfo
  struct GuidedRefTryResolveInfo;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: GorillaTagger
  class GorillaTagger;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::GorillaTagger);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::GorillaTagger*, "", "GorillaTagger");
// Type namespace: 
namespace GlobalNamespace {
  // WARNING Size may be invalid!
  // Autogenerated type: GorillaTagger
  // [TokenAttribute] Offset: FFFFFFFF
  class GorillaTagger : public ::UnityEngine::MonoBehaviour/*, public ::GorillaTag::GuidedRefs::IGuidedRefReceiverMono*/ {
    public:
    // Nested type: ::GlobalNamespace::GorillaTagger::StatusEffect
    struct StatusEffect;
    // Nested type: ::GlobalNamespace::GorillaTagger::$HapticPulses$d__102
    class $HapticPulses$d__102;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: GorillaTagger/StatusEffect
    // [TokenAttribute] Offset: FFFFFFFF
    struct StatusEffect/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: StatusEffect
      constexpr StatusEffect(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public GorillaTagger/StatusEffect None
      static constexpr const int None = 0;
      // Get static field: static public GorillaTagger/StatusEffect None
      static ::GlobalNamespace::GorillaTagger::StatusEffect _get_None();
      // Set static field: static public GorillaTagger/StatusEffect None
      static void _set_None(::GlobalNamespace::GorillaTagger::StatusEffect value);
      // static field const value: static public GorillaTagger/StatusEffect Frozen
      static constexpr const int Frozen = 1;
      // Get static field: static public GorillaTagger/StatusEffect Frozen
      static ::GlobalNamespace::GorillaTagger::StatusEffect _get_Frozen();
      // Set static field: static public GorillaTagger/StatusEffect Frozen
      static void _set_Frozen(::GlobalNamespace::GorillaTagger::StatusEffect value);
      // static field const value: static public GorillaTagger/StatusEffect Slowed
      static constexpr const int Slowed = 2;
      // Get static field: static public GorillaTagger/StatusEffect Slowed
      static ::GlobalNamespace::GorillaTagger::StatusEffect _get_Slowed();
      // Set static field: static public GorillaTagger/StatusEffect Slowed
      static void _set_Slowed(::GlobalNamespace::GorillaTagger::StatusEffect value);
      // static field const value: static public GorillaTagger/StatusEffect Dead
      static constexpr const int Dead = 3;
      // Get static field: static public GorillaTagger/StatusEffect Dead
      static ::GlobalNamespace::GorillaTagger::StatusEffect _get_Dead();
      // Set static field: static public GorillaTagger/StatusEffect Dead
      static void _set_Dead(::GlobalNamespace::GorillaTagger::StatusEffect value);
      // static field const value: static public GorillaTagger/StatusEffect Infected
      static constexpr const int Infected = 4;
      // Get static field: static public GorillaTagger/StatusEffect Infected
      static ::GlobalNamespace::GorillaTagger::StatusEffect _get_Infected();
      // Set static field: static public GorillaTagger/StatusEffect Infected
      static void _set_Infected(::GlobalNamespace::GorillaTagger::StatusEffect value);
      // static field const value: static public GorillaTagger/StatusEffect It
      static constexpr const int It = 5;
      // Get static field: static public GorillaTagger/StatusEffect It
      static ::GlobalNamespace::GorillaTagger::StatusEffect _get_It();
      // Set static field: static public GorillaTagger/StatusEffect It
      static void _set_It(::GlobalNamespace::GorillaTagger::StatusEffect value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // GorillaTagger/StatusEffect
    #pragma pack(pop)
    static check_size<sizeof(GorillaTagger::StatusEffect), 0 + sizeof(int)> __GlobalNamespace_GorillaTagger_StatusEffectSizeCheck;
    static_assert(sizeof(GorillaTagger::StatusEffect) == 0x4);
    public:
    // public System.Boolean inCosmeticsRoom
    // Size: 0x1
    // Offset: 0x20
    bool inCosmeticsRoom;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public UnityEngine.SphereCollider headCollider
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::SphereCollider* headCollider;
    // Field size check
    static_assert(sizeof(::UnityEngine::SphereCollider*) == 0x8);
    // public UnityEngine.CapsuleCollider bodyCollider
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::CapsuleCollider* bodyCollider;
    // Field size check
    static_assert(sizeof(::UnityEngine::CapsuleCollider*) == 0x8);
    // private UnityEngine.Vector3 lastLeftHandPositionForTag
    // Size: 0xC
    // Offset: 0x38
    ::UnityEngine::Vector3 lastLeftHandPositionForTag;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 lastRightHandPositionForTag
    // Size: 0xC
    // Offset: 0x44
    ::UnityEngine::Vector3 lastRightHandPositionForTag;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 lastBodyPositionForTag
    // Size: 0xC
    // Offset: 0x50
    ::UnityEngine::Vector3 lastBodyPositionForTag;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 lastHeadPositionForTag
    // Size: 0xC
    // Offset: 0x5C
    ::UnityEngine::Vector3 lastHeadPositionForTag;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Transform rightHandTransform
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::Transform* rightHandTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Transform leftHandTransform
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::Transform* leftHandTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public System.Single hapticWaitSeconds
    // Size: 0x4
    // Offset: 0x78
    float hapticWaitSeconds;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single handTapVolume
    // Size: 0x4
    // Offset: 0x7C
    float handTapVolume;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single tapCoolDown
    // Size: 0x4
    // Offset: 0x80
    float tapCoolDown;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single lastLeftTap
    // Size: 0x4
    // Offset: 0x84
    float lastLeftTap;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single lastRightTap
    // Size: 0x4
    // Offset: 0x88
    float lastRightTap;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single tapHapticDuration
    // Size: 0x4
    // Offset: 0x8C
    float tapHapticDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single tapHapticStrength
    // Size: 0x4
    // Offset: 0x90
    float tapHapticStrength;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single tagHapticDuration
    // Size: 0x4
    // Offset: 0x94
    float tagHapticDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single tagHapticStrength
    // Size: 0x4
    // Offset: 0x98
    float tagHapticStrength;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single taggedHapticDuration
    // Size: 0x4
    // Offset: 0x9C
    float taggedHapticDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single taggedHapticStrength
    // Size: 0x4
    // Offset: 0xA0
    float taggedHapticStrength;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean leftHandTouching
    // Size: 0x1
    // Offset: 0xA4
    bool leftHandTouching;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean rightHandTouching
    // Size: 0x1
    // Offset: 0xA5
    bool rightHandTouching;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Single taggedTime
    // Size: 0x4
    // Offset: 0xA8
    float taggedTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single tagCooldown
    // Size: 0x4
    // Offset: 0xAC
    float tagCooldown;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single slowCooldown
    // Size: 0x4
    // Offset: 0xB0
    float slowCooldown;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public VRRig offlineVRRig
    // Size: 0x8
    // Offset: 0xB8
    ::GlobalNamespace::VRRig* offlineVRRig;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::VRRig*) == 0x8);
    // public GorillaTag.GuidedRefs.GuidedRefReceiverFieldInfo offlineVRRig_gRef
    // Size: 0x1C
    // Offset: 0xC0
    ::GorillaTag::GuidedRefs::GuidedRefReceiverFieldInfo offlineVRRig_gRef;
    // Field size check
    static_assert(sizeof(::GorillaTag::GuidedRefs::GuidedRefReceiverFieldInfo) == 0x1C);
    // public UnityEngine.GameObject thirdPersonCamera
    // Size: 0x8
    // Offset: 0xE0
    ::UnityEngine::GameObject* thirdPersonCamera;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject mainCamera
    // Size: 0x8
    // Offset: 0xE8
    ::UnityEngine::GameObject* mainCamera;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public System.Boolean testTutorial
    // Size: 0x1
    // Offset: 0xF0
    bool testTutorial;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean disableTutorial
    // Size: 0x1
    // Offset: 0xF1
    bool disableTutorial;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean frameRateUpdated
    // Size: 0x1
    // Offset: 0xF2
    bool frameRateUpdated;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public UnityEngine.GameObject leftHandTriggerCollider
    // Size: 0x8
    // Offset: 0xF8
    ::UnityEngine::GameObject* leftHandTriggerCollider;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject rightHandTriggerCollider
    // Size: 0x8
    // Offset: 0x100
    ::UnityEngine::GameObject* rightHandTriggerCollider;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.AudioSource leftHandSlideSource
    // Size: 0x8
    // Offset: 0x108
    ::UnityEngine::AudioSource* leftHandSlideSource;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // public UnityEngine.AudioSource rightHandSlideSource
    // Size: 0x8
    // Offset: 0x110
    ::UnityEngine::AudioSource* rightHandSlideSource;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // public System.Boolean overrideNotInFocus
    // Size: 0x1
    // Offset: 0x118
    bool overrideNotInFocus;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private UnityEngine.Rigidbody <rigidbody>k__BackingField
    // Size: 0x8
    // Offset: 0x120
    ::UnityEngine::Rigidbody* rigidbody;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rigidbody*) == 0x8);
    // private UnityEngine.Vector3 leftRaycastSweep
    // Size: 0xC
    // Offset: 0x128
    ::UnityEngine::Vector3 leftRaycastSweep;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 leftHeadRaycastSweep
    // Size: 0xC
    // Offset: 0x134
    ::UnityEngine::Vector3 leftHeadRaycastSweep;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 rightRaycastSweep
    // Size: 0xC
    // Offset: 0x140
    ::UnityEngine::Vector3 rightRaycastSweep;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 rightHeadRaycastSweep
    // Size: 0xC
    // Offset: 0x14C
    ::UnityEngine::Vector3 rightHeadRaycastSweep;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 headRaycastSweep
    // Size: 0xC
    // Offset: 0x158
    ::UnityEngine::Vector3 headRaycastSweep;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 bodyRaycastSweep
    // Size: 0xC
    // Offset: 0x164
    ::UnityEngine::Vector3 bodyRaycastSweep;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.XR.InputDevice rightDevice
    // Size: 0x9
    // Offset: 0x170
    ::UnityEngine::XR::InputDevice rightDevice;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::InputDevice) == 0x9);
    // private UnityEngine.XR.InputDevice leftDevice
    // Size: 0x9
    // Offset: 0x180
    ::UnityEngine::XR::InputDevice leftDevice;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::InputDevice) == 0x9);
    // private System.Boolean primaryButtonPressRight
    // Size: 0x1
    // Offset: 0x190
    bool primaryButtonPressRight;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean secondaryButtonPressRight
    // Size: 0x1
    // Offset: 0x191
    bool secondaryButtonPressRight;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean primaryButtonPressLeft
    // Size: 0x1
    // Offset: 0x192
    bool primaryButtonPressLeft;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean secondaryButtonPressLeft
    // Size: 0x1
    // Offset: 0x193
    bool secondaryButtonPressLeft;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private UnityEngine.RaycastHit hitInfo
    // Size: 0x2C
    // Offset: 0x194
    ::UnityEngine::RaycastHit hitInfo;
    // Field size check
    static_assert(sizeof(::UnityEngine::RaycastHit) == 0x2C);
    // public Photon.Realtime.Player otherPlayer
    // Size: 0x8
    // Offset: 0x1C0
    ::Photon::Realtime::Player* otherPlayer;
    // Field size check
    static_assert(sizeof(::Photon::Realtime::Player*) == 0x8);
    // private Photon.Realtime.Player tryPlayer
    // Size: 0x8
    // Offset: 0x1C8
    ::Photon::Realtime::Player* tryPlayer;
    // Field size check
    static_assert(sizeof(::Photon::Realtime::Player*) == 0x8);
    // private Photon.Realtime.Player touchedPlayer
    // Size: 0x8
    // Offset: 0x1D0
    ::Photon::Realtime::Player* touchedPlayer;
    // Field size check
    static_assert(sizeof(::Photon::Realtime::Player*) == 0x8);
    // private UnityEngine.Vector3 topVector
    // Size: 0xC
    // Offset: 0x1D8
    ::UnityEngine::Vector3 topVector;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 bottomVector
    // Size: 0xC
    // Offset: 0x1E4
    ::UnityEngine::Vector3 bottomVector;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 bodyVector
    // Size: 0xC
    // Offset: 0x1F0
    ::UnityEngine::Vector3 bodyVector;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Int32 tempInt
    // Size: 0x4
    // Offset: 0x1FC
    int tempInt;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.XR.InputDevice inputDevice
    // Size: 0x9
    // Offset: 0x200
    ::UnityEngine::XR::InputDevice inputDevice;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::InputDevice) == 0x9);
    // private System.Boolean wasInOverlay
    // Size: 0x1
    // Offset: 0x210
    bool wasInOverlay;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private Photon.Pun.PhotonView tempView
    // Size: 0x8
    // Offset: 0x218
    ::Photon::Pun::PhotonView* tempView;
    // Field size check
    static_assert(sizeof(::Photon::Pun::PhotonView*) == 0x8);
    // private Photon.Realtime.Player tempCreator
    // Size: 0x8
    // Offset: 0x220
    ::Photon::Realtime::Player* tempCreator;
    // Field size check
    static_assert(sizeof(::Photon::Realtime::Player*) == 0x8);
    // public GorillaTagger/StatusEffect currentStatus
    // Size: 0x4
    // Offset: 0x228
    ::GlobalNamespace::GorillaTagger::StatusEffect currentStatus;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::GorillaTagger::StatusEffect) == 0x4);
    // public System.Single statusStartTime
    // Size: 0x4
    // Offset: 0x22C
    float statusStartTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single statusEndTime
    // Size: 0x4
    // Offset: 0x230
    float statusEndTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single refreshRate
    // Size: 0x4
    // Offset: 0x234
    float refreshRate;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single baseSlideControl
    // Size: 0x4
    // Offset: 0x238
    float baseSlideControl;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 gorillaTagColliderLayerMask
    // Size: 0x4
    // Offset: 0x23C
    int gorillaTagColliderLayerMask;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.RaycastHit[] nonAllocRaycastHits
    // Size: 0x8
    // Offset: 0x240
    ::ArrayW<::UnityEngine::RaycastHit> nonAllocRaycastHits;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::RaycastHit>) == 0x8);
    // private System.Int32 nonAllocHits
    // Size: 0x4
    // Offset: 0x248
    int nonAllocHits;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private Photon.Voice.Unity.Recorder <myRecorder>k__BackingField
    // Size: 0x8
    // Offset: 0x250
    ::Photon::Voice::Unity::Recorder* myRecorder;
    // Field size check
    static_assert(sizeof(::Photon::Voice::Unity::Recorder*) == 0x8);
    // private System.Boolean xrSubsystemIsActive
    // Size: 0x1
    // Offset: 0x258
    bool xrSubsystemIsActive;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.String loadedDeviceName
    // Size: 0x8
    // Offset: 0x260
    ::StringW loadedDeviceName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private UnityEngine.LayerMask BaseMirrorCameraCullingMask
    // Size: 0x4
    // Offset: 0x268
    ::UnityEngine::LayerMask BaseMirrorCameraCullingMask;
    // Field size check
    static_assert(sizeof(::UnityEngine::LayerMask) == 0x4);
    // public Watchable`1<System.Int32> MirrorCameraCullingMask
    // Size: 0x8
    // Offset: 0x270
    ::GlobalNamespace::Watchable_1<int>* MirrorCameraCullingMask;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::Watchable_1<int>*) == 0x8);
    // private System.Nullable`1<System.Single> tagRadiusOverride
    // Size: 0xFFFFFFFF
    // Offset: 0x278
    ::System::Nullable_1<float> tagRadiusOverride;
    // private System.Int32 tagRadiusOverrideFrame
    // Size: 0x4
    // Offset: 0x280
    int tagRadiusOverrideFrame;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 <GorillaTag.GuidedRefs.IGuidedRefReceiverMono.GuidedRefsWaitingToResolveCount>k__BackingField
    // Size: 0x4
    // Offset: 0x284
    int GuidedRefsWaitingToResolveCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Creating interface conversion operator: operator ::GorillaTag::GuidedRefs::IGuidedRefReceiverMono
    operator ::GorillaTag::GuidedRefs::IGuidedRefReceiverMono() noexcept {
      return *reinterpret_cast<::GorillaTag::GuidedRefs::IGuidedRefReceiverMono*>(this);
    }
    // Get static field: static private GorillaTagger _instance
    static ::GlobalNamespace::GorillaTagger* _get__instance();
    // Set static field: static private GorillaTagger _instance
    static void _set__instance(::GlobalNamespace::GorillaTagger* value);
    // Get static field: static public System.Boolean hasInstance
    static bool _get_hasInstance();
    // Set static field: static public System.Boolean hasInstance
    static void _set_hasInstance(bool value);
    // Get static field: static private System.Action onPlayerSpawnedRootCallback
