// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: GorillaGameManager
#include "GlobalNamespace/GorillaGameManager.hpp"
// Including type: System.Byte
#include "System/Byte.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: VRRig
  class VRRig;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: Photon::Realtime
namespace Photon::Realtime {
  // Forward declaring type: Player
  class Player;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Forward declaring namespace: Photon::Pun
namespace Photon::Pun {
  // Forward declaring type: PhotonStream
  class PhotonStream;
  // Forward declaring type: PhotonMessageInfo
  struct PhotonMessageInfo;
}
// Forward declaring namespace: GorillaGameModes
namespace GorillaGameModes {
  // Forward declaring type: GameModeType
  struct GameModeType;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: GorillaTagManager
  class GorillaTagManager;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::GorillaTagManager);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::GorillaTagManager*, "", "GorillaTagManager");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x148
  #pragma pack(push, 1)
  // Autogenerated type: GorillaTagManager
  // [TokenAttribute] Offset: FFFFFFFF
  class GorillaTagManager : public ::GlobalNamespace::GorillaGameManager {
    public:
    // Nested type: ::GlobalNamespace::GorillaTagManager::$InfectionEnd$d__24
    class $InfectionEnd$d__24;
    public:
    // public System.Single tagCoolDown
    // Size: 0x4
    // Offset: 0xD8
    float tagCoolDown;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Int32 infectedModeThreshold
    // Size: 0x4
    // Offset: 0xDC
    int infectedModeThreshold;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Collections.Generic.List`1<Photon.Realtime.Player> currentInfected
    // Size: 0x8
    // Offset: 0xE0
    ::System::Collections::Generic::List_1<::Photon::Realtime::Player*>* currentInfected;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Photon::Realtime::Player*>*) == 0x8);
    // public System.Int32[] currentInfectedArray
    // Size: 0x8
    // Offset: 0xE8
    ::ArrayW<int> currentInfectedArray;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // public Photon.Realtime.Player currentIt
    // Size: 0x8
    // Offset: 0xF0
    ::Photon::Realtime::Player* currentIt;
    // Field size check
    static_assert(sizeof(::Photon::Realtime::Player*) == 0x8);
    // public Photon.Realtime.Player lastInfectedPlayer
    // Size: 0x8
    // Offset: 0xF8
    ::Photon::Realtime::Player* lastInfectedPlayer;
    // Field size check
    static_assert(sizeof(::Photon::Realtime::Player*) == 0x8);
    // public System.Double lastTag
    // Size: 0x8
    // Offset: 0x100
    double lastTag;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // public System.Double timeInfectedGameEnded
    // Size: 0x8
    // Offset: 0x108
    double timeInfectedGameEnded;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // public System.Boolean waitingToStartNextInfectionGame
    // Size: 0x1
    // Offset: 0x110
    bool waitingToStartNextInfectionGame;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean isCurrentlyTag
    // Size: 0x1
    // Offset: 0x111
    bool isCurrentlyTag;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isCurrentlyTag and: tempItInt
    char __padding9[0x2] = {};
    // private System.Int32 tempItInt
    // Size: 0x4
    // Offset: 0x114
    int tempItInt;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 iterator1
    // Size: 0x4
    // Offset: 0x118
    int iterator1;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: iterator1 and: tempPlayer
    char __padding11[0x4] = {};
    // private Photon.Realtime.Player tempPlayer
    // Size: 0x8
    // Offset: 0x120
    ::Photon::Realtime::Player* tempPlayer;
    // Field size check
    static_assert(sizeof(::Photon::Realtime::Player*) == 0x8);
    // private System.Boolean allInfected
    // Size: 0x1
    // Offset: 0x128
    bool allInfected;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: allInfected and: inspectorLocalPlayerSpeed
    char __padding13[0x7] = {};
    // public System.Single[] inspectorLocalPlayerSpeed
    // Size: 0x8
    // Offset: 0x130
    ::ArrayW<float> inspectorLocalPlayerSpeed;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    // private VRRig taggingRig
    // Size: 0x8
    // Offset: 0x138
    ::GlobalNamespace::VRRig* taggingRig;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::VRRig*) == 0x8);
    // private VRRig taggedRig
    // Size: 0x8
    // Offset: 0x140
    ::GlobalNamespace::VRRig* taggedRig;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::VRRig*) == 0x8);
    public:
    // static field const value: static public System.Byte ReportTagEvent
    static constexpr const uint8_t ReportTagEvent = 1u;
    // Get static field: static public System.Byte ReportTagEvent
    static uint8_t _get_ReportTagEvent();
    // Set static field: static public System.Byte ReportTagEvent
    static void _set_ReportTagEvent(uint8_t value);
    // static field const value: static public System.Byte ReportInfectionTagEvent
    static constexpr const uint8_t ReportInfectionTagEvent = 2u;
    // Get static field: static public System.Byte ReportInfectionTagEvent
    static uint8_t _get_ReportInfectionTagEvent();
    // Set static field: static public System.Byte ReportInfectionTagEvent
    static void _set_ReportInfectionTagEvent(uint8_t value);
    // Get instance field reference: public System.Single tagCoolDown
