// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Photon.Pun.MonoBehaviourPunCallbacks
#include "Photon/Pun/MonoBehaviourPunCallbacks.hpp"
// Including type: Photon.Pun.IPunObservable
#include "Photon/Pun/IPunObservable.hpp"
// Including type: Photon.Pun.IOnPhotonViewOwnerChange
#include "Photon/Pun/IOnPhotonViewOwnerChange.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: AudioSource
  class AudioSource;
  // Forward declaring type: AudioClip
  class AudioClip;
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Skipping declaration: ChaseState because it is already included!
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: Photon::Realtime
namespace Photon::Realtime {
  // Forward declaring type: Player
  class Player;
}
// Forward declaring namespace: UnityEngine::AI
namespace UnityEngine::AI {
  // Forward declaring type: NavMeshPath
  class NavMeshPath;
}
// Forward declaring namespace: Photon::Pun
namespace Photon::Pun {
  // Forward declaring type: PhotonStream
  class PhotonStream;
  // Forward declaring type: PhotonMessageInfo
  struct PhotonMessageInfo;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: HalloweenGhostChaser
  class HalloweenGhostChaser;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::HalloweenGhostChaser);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::HalloweenGhostChaser*, "", "HalloweenGhostChaser");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x208
  #pragma pack(push, 1)
  // Autogenerated type: HalloweenGhostChaser
  // [TokenAttribute] Offset: FFFFFFFF
  class HalloweenGhostChaser : public ::Photon::Pun::MonoBehaviourPunCallbacks/*, public ::Photon::Pun::IPunObservable, public ::Photon::Pun::IOnPhotonViewOwnerChange*/ {
    public:
    // Nested type: ::GlobalNamespace::HalloweenGhostChaser::ChaseState
    struct ChaseState;
    // Nested type: ::GlobalNamespace::HalloweenGhostChaser::$$c__DisplayClass73_0
    class $$c__DisplayClass73_0;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: HalloweenGhostChaser/ChaseState
    // [TokenAttribute] Offset: FFFFFFFF
    struct ChaseState/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: ChaseState
      constexpr ChaseState(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public HalloweenGhostChaser/ChaseState Dormant
      static constexpr const int Dormant = 1;
      // Get static field: static public HalloweenGhostChaser/ChaseState Dormant
      static ::GlobalNamespace::HalloweenGhostChaser::ChaseState _get_Dormant();
      // Set static field: static public HalloweenGhostChaser/ChaseState Dormant
      static void _set_Dormant(::GlobalNamespace::HalloweenGhostChaser::ChaseState value);
      // static field const value: static public HalloweenGhostChaser/ChaseState InitialRise
      static constexpr const int InitialRise = 2;
      // Get static field: static public HalloweenGhostChaser/ChaseState InitialRise
      static ::GlobalNamespace::HalloweenGhostChaser::ChaseState _get_InitialRise();
      // Set static field: static public HalloweenGhostChaser/ChaseState InitialRise
      static void _set_InitialRise(::GlobalNamespace::HalloweenGhostChaser::ChaseState value);
      // static field const value: static public HalloweenGhostChaser/ChaseState Gong
      static constexpr const int Gong = 4;
      // Get static field: static public HalloweenGhostChaser/ChaseState Gong
      static ::GlobalNamespace::HalloweenGhostChaser::ChaseState _get_Gong();
      // Set static field: static public HalloweenGhostChaser/ChaseState Gong
      static void _set_Gong(::GlobalNamespace::HalloweenGhostChaser::ChaseState value);
      // static field const value: static public HalloweenGhostChaser/ChaseState Chasing
      static constexpr const int Chasing = 8;
      // Get static field: static public HalloweenGhostChaser/ChaseState Chasing
      static ::GlobalNamespace::HalloweenGhostChaser::ChaseState _get_Chasing();
      // Set static field: static public HalloweenGhostChaser/ChaseState Chasing
      static void _set_Chasing(::GlobalNamespace::HalloweenGhostChaser::ChaseState value);
      // static field const value: static public HalloweenGhostChaser/ChaseState Grabbing
      static constexpr const int Grabbing = 16;
      // Get static field: static public HalloweenGhostChaser/ChaseState Grabbing
      static ::GlobalNamespace::HalloweenGhostChaser::ChaseState _get_Grabbing();
      // Set static field: static public HalloweenGhostChaser/ChaseState Grabbing
      static void _set_Grabbing(::GlobalNamespace::HalloweenGhostChaser::ChaseState value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // HalloweenGhostChaser/ChaseState
    #pragma pack(pop)
    static check_size<sizeof(HalloweenGhostChaser::ChaseState), 0 + sizeof(int)> __GlobalNamespace_HalloweenGhostChaser_ChaseStateSizeCheck;
    static_assert(sizeof(HalloweenGhostChaser::ChaseState) == 0x4);
    public:
    // public System.Single heightAboveNavmesh
    // Size: 0x4
    // Offset: 0x28
    float heightAboveNavmesh;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: heightAboveNavmesh and: followTarget
    char __padding0[0x4] = {};
    // public UnityEngine.Transform followTarget
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Transform* followTarget;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Transform childGhost
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::Transform* childGhost;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public System.Single velocityStep
    // Size: 0x4
    // Offset: 0x40
    float velocityStep;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single currentSpeed
    // Size: 0x4
    // Offset: 0x44
    float currentSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single velocityIncreaseTime
    // Size: 0x4
    // Offset: 0x48
    float velocityIncreaseTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single riseDistance
    // Size: 0x4
    // Offset: 0x4C
    float riseDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single summonDistance
    // Size: 0x4
    // Offset: 0x50
    float summonDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single timeEncircled
    // Size: 0x4
    // Offset: 0x54
    float timeEncircled;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single lastSummonCheck
    // Size: 0x4
    // Offset: 0x58
    float lastSummonCheck;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single timeGongStarted
    // Size: 0x4
    // Offset: 0x5C
    float timeGongStarted;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single summoningDuration
    // Size: 0x4
    // Offset: 0x60
    float summoningDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single summoningCheckCountdown
    // Size: 0x4
    // Offset: 0x64
    float summoningCheckCountdown;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single gongDuration
    // Size: 0x4
    // Offset: 0x68
    float gongDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Int32 summonCount
    // Size: 0x4
    // Offset: 0x6C
    int summonCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Boolean wasSurroundedLastCheck
    // Size: 0x1
    // Offset: 0x70
    bool wasSurroundedLastCheck;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: wasSurroundedLastCheck and: laugh
    char __padding15[0x7] = {};
    // public UnityEngine.AudioSource laugh
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::AudioSource* laugh;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // public System.Collections.Generic.List`1<Photon.Realtime.Player> possibleTarget
    // Size: 0x8
    // Offset: 0x80
    ::System::Collections::Generic::List_1<::Photon::Realtime::Player*>* possibleTarget;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Photon::Realtime::Player*>*) == 0x8);
    // public UnityEngine.AudioClip defaultLaugh
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::AudioClip* defaultLaugh;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // public UnityEngine.AudioClip deepLaugh
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::AudioClip* deepLaugh;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // public UnityEngine.AudioClip gong
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::AudioClip* gong;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // public UnityEngine.Vector3 noisyOffset
    // Size: 0xC
    // Offset: 0xA0
    ::UnityEngine::Vector3 noisyOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 leftArmGrabbingLocal
    // Size: 0xC
    // Offset: 0xAC
    ::UnityEngine::Vector3 leftArmGrabbingLocal;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 rightArmGrabbingLocal
    // Size: 0xC
    // Offset: 0xB8
    ::UnityEngine::Vector3 rightArmGrabbingLocal;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 leftHandGrabbingLocal
    // Size: 0xC
    // Offset: 0xC4
    ::UnityEngine::Vector3 leftHandGrabbingLocal;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 rightHandGrabbingLocal
    // Size: 0xC
    // Offset: 0xD0
    ::UnityEngine::Vector3 rightHandGrabbingLocal;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 leftHandStartingLocal
    // Size: 0xC
    // Offset: 0xDC
    ::UnityEngine::Vector3 leftHandStartingLocal;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 rightHandStartingLocal
    // Size: 0xC
    // Offset: 0xE8
    ::UnityEngine::Vector3 rightHandStartingLocal;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 ghostOffsetGrabbingLocal
    // Size: 0xC
    // Offset: 0xF4
    ::UnityEngine::Vector3 ghostOffsetGrabbingLocal;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 ghostStartingEulerRotation
    // Size: 0xC
    // Offset: 0x100
    ::UnityEngine::Vector3 ghostStartingEulerRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 ghostGrabbingEulerRotation
    // Size: 0xC
    // Offset: 0x10C
    ::UnityEngine::Vector3 ghostGrabbingEulerRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public System.Single maxTimeToNextHeadAngle
    // Size: 0x4
    // Offset: 0x118
    float maxTimeToNextHeadAngle;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single lastHeadAngleTime
    // Size: 0x4
    // Offset: 0x11C
    float lastHeadAngleTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single nextHeadAngleTime
    // Size: 0x4
    // Offset: 0x120
    float nextHeadAngleTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single nextTimeToChasePlayer
    // Size: 0x4
    // Offset: 0x124
    float nextTimeToChasePlayer;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single maxNextTimeToChasePlayer
    // Size: 0x4
    // Offset: 0x128
    float maxNextTimeToChasePlayer;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single timeRiseStarted
    // Size: 0x4
    // Offset: 0x12C
    float timeRiseStarted;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single totalTimeToRise
    // Size: 0x4
    // Offset: 0x130
    float totalTimeToRise;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single catchDistance
    // Size: 0x4
    // Offset: 0x134
    float catchDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single grabTime
    // Size: 0x4
    // Offset: 0x138
    float grabTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single grabDuration
    // Size: 0x4
    // Offset: 0x13C
    float grabDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single grabSpeed
    // Size: 0x4
    // Offset: 0x140
    float grabSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single minGrabCooldown
    // Size: 0x4
    // Offset: 0x144
    float minGrabCooldown;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single lastSpeedIncreased
    // Size: 0x4
    // Offset: 0x148
    float lastSpeedIncreased;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: lastSpeedIncreased and: headEulerAngles
    char __padding43[0x4] = {};
    // public UnityEngine.Vector3[] headEulerAngles
    // Size: 0x8
    // Offset: 0x150
    ::ArrayW<::UnityEngine::Vector3> headEulerAngles;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector3>) == 0x8);
    // public UnityEngine.Transform skullTransform
    // Size: 0x8
    // Offset: 0x158
    ::UnityEngine::Transform* skullTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Transform leftArm
    // Size: 0x8
    // Offset: 0x160
    ::UnityEngine::Transform* leftArm;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Transform rightArm
    // Size: 0x8
    // Offset: 0x168
    ::UnityEngine::Transform* rightArm;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Transform leftHand
    // Size: 0x8
    // Offset: 0x170
    ::UnityEngine::Transform* leftHand;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Transform rightHand
    // Size: 0x8
    // Offset: 0x178
    ::UnityEngine::Transform* rightHand;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Transform[] spawnTransforms
    // Size: 0x8
    // Offset: 0x180
    ::ArrayW<::UnityEngine::Transform*> spawnTransforms;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Transform*>) == 0x8);
    // public UnityEngine.Transform[] spawnTransformOffsets
    // Size: 0x8
    // Offset: 0x188
    ::ArrayW<::UnityEngine::Transform*> spawnTransformOffsets;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Transform*>) == 0x8);
    // public Photon.Realtime.Player targetPlayer
    // Size: 0x8
    // Offset: 0x190
    ::Photon::Realtime::Player* targetPlayer;
    // Field size check
    static_assert(sizeof(::Photon::Realtime::Player*) == 0x8);
    // public UnityEngine.GameObject ghostBody
    // Size: 0x8
    // Offset: 0x198
    ::UnityEngine::GameObject* ghostBody;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public HalloweenGhostChaser/ChaseState currentState
    // Size: 0x4
    // Offset: 0x1A0
    ::GlobalNamespace::HalloweenGhostChaser::ChaseState currentState;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::HalloweenGhostChaser::ChaseState) == 0x4);
    // public HalloweenGhostChaser/ChaseState lastState
    // Size: 0x4
    // Offset: 0x1A4
    ::GlobalNamespace::HalloweenGhostChaser::ChaseState lastState;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::HalloweenGhostChaser::ChaseState) == 0x4);
    // public System.Int32 spawnIndex
    // Size: 0x4
    // Offset: 0x1A8
    int spawnIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: spawnIndex and: grabbedPlayer
    char __padding56[0x4] = {};
    // public Photon.Realtime.Player grabbedPlayer
    // Size: 0x8
    // Offset: 0x1B0
    ::Photon::Realtime::Player* grabbedPlayer;
    // Field size check
    static_assert(sizeof(::Photon::Realtime::Player*) == 0x8);
    // public UnityEngine.Material ghostMaterial
    // Size: 0x8
    // Offset: 0x1B8
    ::UnityEngine::Material* ghostMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // public UnityEngine.Color defaultColor
    // Size: 0x10
    // Offset: 0x1C0
    ::UnityEngine::Color defaultColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // public UnityEngine.Color summonedColor
    // Size: 0x10
    // Offset: 0x1D0
    ::UnityEngine::Color summonedColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // public System.Boolean isSummoned
    // Size: 0x1
    // Offset: 0x1E0
    bool isSummoned;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean targetIsOnNavMesh
    // Size: 0x1
    // Offset: 0x1E1
    bool targetIsOnNavMesh;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: targetIsOnNavMesh and: hapticStrength
    char __padding62[0x2] = {};
    // public System.Single hapticStrength
    // Size: 0x4
    // Offset: 0x1E4
    float hapticStrength;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single hapticDuration
    // Size: 0x4
    // Offset: 0x1E8
    float hapticDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: hapticDuration and: path
    char __padding64[0x4] = {};
    // private UnityEngine.AI.NavMeshPath path
    // Size: 0x8
    // Offset: 0x1F0
    ::UnityEngine::AI::NavMeshPath* path;
    // Field size check
    static_assert(sizeof(::UnityEngine::AI::NavMeshPath*) == 0x8);
    // public System.Collections.Generic.List`1<UnityEngine.Vector3> points
    // Size: 0x8
    // Offset: 0x1F8
    ::System::Collections::Generic::List_1<::UnityEngine::Vector3>* points;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Vector3>*) == 0x8);
    // public System.Int32 currentTargetIdx
    // Size: 0x4
    // Offset: 0x200
    int currentTargetIdx;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single nextPathTimestamp
    // Size: 0x4
    // Offset: 0x204
    float nextPathTimestamp;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Creating interface conversion operator: operator ::Photon::Pun::IPunObservable
    operator ::Photon::Pun::IPunObservable() noexcept {
      return *reinterpret_cast<::Photon::Pun::IPunObservable*>(this);
    }
    // Creating interface conversion operator: operator ::Photon::Pun::IOnPhotonViewOwnerChange
    operator ::Photon::Pun::IOnPhotonViewOwnerChange() noexcept {
      return *reinterpret_cast<::Photon::Pun::IOnPhotonViewOwnerChange*>(this);
    }
    // static field const value: static private System.Single navMeshSampleRange
    static constexpr const float navMeshSampleRange = 5;
    // Get static field: static private System.Single navMeshSampleRange
    static float _get_navMeshSampleRange();
    // Set static field: static private System.Single navMeshSampleRange
    static void _set_navMeshSampleRange(float value);
