// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: HoldableObject
#include "GlobalNamespace/HoldableObject.hpp"
// Including type: TransferrableObject/PositionState
#include "GlobalNamespace/TransferrableObject.hpp"
// Including type: TransferrableObject/ItemStates
// Already included the same include: GlobalNamespace/TransferrableObject.hpp
// Including type: BodyDockPositions/DropPositions
#include "GlobalNamespace/BodyDockPositions_DropPositions.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Photon::Realtime
namespace Photon::Realtime {
  // Forward declaring type: Player
  class Player;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: EquipmentInteractor
  class EquipmentInteractor;
  // Forward declaring type: VRRig
  class VRRig;
  // Skipping declaration: BodyDockPositions because it is already included!
  // Forward declaring type: VRRigAnchorOverrides
  class VRRigAnchorOverrides;
  // Forward declaring type: InteractionPoint
  class InteractionPoint;
  // Forward declaring type: DropZone
  class DropZone;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: GameObject
  class GameObject;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: LegacyTransferrableObject
  class LegacyTransferrableObject;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::LegacyTransferrableObject);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::LegacyTransferrableObject*, "", "LegacyTransferrableObject");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x110
  #pragma pack(push, 1)
  // Autogenerated type: LegacyTransferrableObject
  // [TokenAttribute] Offset: FFFFFFFF
  class LegacyTransferrableObject : public ::GlobalNamespace::HoldableObject {
    public:
    // Nested type: ::GlobalNamespace::LegacyTransferrableObject::InterpolateState
    struct InterpolateState;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: LegacyTransferrableObject/InterpolateState
    // [TokenAttribute] Offset: FFFFFFFF
    struct InterpolateState/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: InterpolateState
      constexpr InterpolateState(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public LegacyTransferrableObject/InterpolateState None
      static constexpr const int None = 0;
      // Get static field: static public LegacyTransferrableObject/InterpolateState None
      static ::GlobalNamespace::LegacyTransferrableObject::InterpolateState _get_None();
      // Set static field: static public LegacyTransferrableObject/InterpolateState None
      static void _set_None(::GlobalNamespace::LegacyTransferrableObject::InterpolateState value);
      // static field const value: static public LegacyTransferrableObject/InterpolateState Interpolating
      static constexpr const int Interpolating = 1;
      // Get static field: static public LegacyTransferrableObject/InterpolateState Interpolating
      static ::GlobalNamespace::LegacyTransferrableObject::InterpolateState _get_Interpolating();
      // Set static field: static public LegacyTransferrableObject/InterpolateState Interpolating
      static void _set_Interpolating(::GlobalNamespace::LegacyTransferrableObject::InterpolateState value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // LegacyTransferrableObject/InterpolateState
    #pragma pack(pop)
    static check_size<sizeof(LegacyTransferrableObject::InterpolateState), 0 + sizeof(int)> __GlobalNamespace_LegacyTransferrableObject_InterpolateStateSizeCheck;
    static_assert(sizeof(LegacyTransferrableObject::InterpolateState) == 0x4);
    public:
    // protected EquipmentInteractor interactor
    // Size: 0x8
    // Offset: 0x28
    ::GlobalNamespace::EquipmentInteractor* interactor;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::EquipmentInteractor*) == 0x8);
    // public VRRig myRig
    // Size: 0x8
    // Offset: 0x30
    ::GlobalNamespace::VRRig* myRig;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::VRRig*) == 0x8);
    // public VRRig myOnlineRig
    // Size: 0x8
    // Offset: 0x38
    ::GlobalNamespace::VRRig* myOnlineRig;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::VRRig*) == 0x8);
    // public System.Boolean latched
    // Size: 0x1
    // Offset: 0x40
    bool latched;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: latched and: indexTrigger
    char __padding3[0x3] = {};
    // private System.Single indexTrigger
    // Size: 0x4
    // Offset: 0x44
    float indexTrigger;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean testActivate
    // Size: 0x1
    // Offset: 0x48
    bool testActivate;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean testDeactivate
    // Size: 0x1
    // Offset: 0x49
    bool testDeactivate;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: testDeactivate and: myThreshold
    char __padding6[0x2] = {};
    // public System.Single myThreshold
    // Size: 0x4
    // Offset: 0x4C
    float myThreshold;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single hysterisis
    // Size: 0x4
    // Offset: 0x50
    float hysterisis;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean flipOnXForLeftHand
    // Size: 0x1
    // Offset: 0x54
    bool flipOnXForLeftHand;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean flipOnYForLeftHand
    // Size: 0x1
    // Offset: 0x55
    bool flipOnYForLeftHand;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean flipOnXForLeftArm
    // Size: 0x1
    // Offset: 0x56
    bool flipOnXForLeftArm;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean disableStealing
    // Size: 0x1
    // Offset: 0x57
    bool disableStealing;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private TransferrableObject/PositionState initState
    // Size: 0x4
    // Offset: 0x58
    ::GlobalNamespace::TransferrableObject::PositionState initState;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::TransferrableObject::PositionState) == 0x4);
    // public TransferrableObject/ItemStates itemState
    // Size: 0x4
    // Offset: 0x5C
    ::GlobalNamespace::TransferrableObject::ItemStates itemState;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::TransferrableObject::ItemStates) == 0x4);
    // public BodyDockPositions/DropPositions storedZone
    // Size: 0x4
    // Offset: 0x60
    ::GlobalNamespace::BodyDockPositions::DropPositions storedZone;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BodyDockPositions::DropPositions) == 0x4);
    // protected TransferrableObject/PositionState previousState
    // Size: 0x4
    // Offset: 0x64
    ::GlobalNamespace::TransferrableObject::PositionState previousState;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::TransferrableObject::PositionState) == 0x4);
    // public TransferrableObject/PositionState currentState
    // Size: 0x4
    // Offset: 0x68
    ::GlobalNamespace::TransferrableObject::PositionState currentState;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::TransferrableObject::PositionState) == 0x4);
    // public BodyDockPositions/DropPositions dockPositions
    // Size: 0x4
    // Offset: 0x6C
    ::GlobalNamespace::BodyDockPositions::DropPositions dockPositions;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BodyDockPositions::DropPositions) == 0x4);
    // public VRRig targetRig
    // Size: 0x8
    // Offset: 0x70
    ::GlobalNamespace::VRRig* targetRig;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::VRRig*) == 0x8);
    // public BodyDockPositions targetDock
    // Size: 0x8
    // Offset: 0x78
    ::GlobalNamespace::BodyDockPositions* targetDock;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BodyDockPositions*) == 0x8);
    // private VRRigAnchorOverrides anchorOverrides
    // Size: 0x8
    // Offset: 0x80
    ::GlobalNamespace::VRRigAnchorOverrides* anchorOverrides;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::VRRigAnchorOverrides*) == 0x8);
    // public System.Boolean canAutoGrabLeft
    // Size: 0x1
    // Offset: 0x88
    bool canAutoGrabLeft;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean canAutoGrabRight
    // Size: 0x1
    // Offset: 0x89
    bool canAutoGrabRight;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: canAutoGrabRight and: objectIndex
    char __padding23[0x2] = {};
    // public System.Int32 objectIndex
    // Size: 0x4
    // Offset: 0x8C
    int objectIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public UnityEngine.Transform anchor
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::Transform* anchor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public InteractionPoint gripInteractor
    // Size: 0x8
    // Offset: 0x98
    ::GlobalNamespace::InteractionPoint* gripInteractor;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::InteractionPoint*) == 0x8);
    // public UnityEngine.Transform grabAnchor
    // Size: 0x8
    // Offset: 0xA0
    ::UnityEngine::Transform* grabAnchor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public System.Int32 myIndex
    // Size: 0x4
    // Offset: 0xA8
    int myIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: myIndex and: gameObjectsActiveOnlyWhileHeld
    char __padding28[0x4] = {};
    // public UnityEngine.GameObject[] gameObjectsActiveOnlyWhileHeld
    // Size: 0x8
    // Offset: 0xB0
    ::ArrayW<::UnityEngine::GameObject*> gameObjectsActiveOnlyWhileHeld;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // protected UnityEngine.GameObject worldShareableInstance
    // Size: 0x8
    // Offset: 0xB8
    ::UnityEngine::GameObject* worldShareableInstance;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Single interpTime
    // Size: 0x4
    // Offset: 0xC0
    float interpTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single interpDt
    // Size: 0x4
    // Offset: 0xC4
    float interpDt;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector3 interpStartPos
    // Size: 0xC
    // Offset: 0xC8
    ::UnityEngine::Vector3 interpStartPos;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Quaternion interpStartRot
    // Size: 0x10
    // Offset: 0xD4
    ::UnityEngine::Quaternion interpStartRot;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // protected System.Int32 enabledOnFrame
    // Size: 0x4
    // Offset: 0xE4
    int enabledOnFrame;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.Vector3 initOffset
    // Size: 0xC
    // Offset: 0xE8
    ::UnityEngine::Vector3 initOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Quaternion initRotation
    // Size: 0x10
    // Offset: 0xF4
    ::UnityEngine::Quaternion initRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // public System.Boolean canDrop
    // Size: 0x1
    // Offset: 0x104
    bool canDrop;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean shareable
    // Size: 0x1
    // Offset: 0x105
    bool shareable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean detatchOnGrab
    // Size: 0x1
    // Offset: 0x106
    bool detatchOnGrab;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean wasHover
    // Size: 0x1
    // Offset: 0x107
    bool wasHover;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean isHover
    // Size: 0x1
    // Offset: 0x108
    bool isHover;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean disableItem
    // Size: 0x1
    // Offset: 0x109
    bool disableItem;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: disableItem and: interpState
    char __padding43[0x2] = {};
    // public LegacyTransferrableObject/InterpolateState interpState
    // Size: 0x4
    // Offset: 0x10C
    ::GlobalNamespace::LegacyTransferrableObject::InterpolateState interpState;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::LegacyTransferrableObject::InterpolateState) == 0x4);
    public:
    // static field const value: static public System.Int32 kPositionStateCount
    static constexpr const int kPositionStateCount = 8;
    // Get static field: static public System.Int32 kPositionStateCount
    static int _get_kPositionStateCount();
    // Set static field: static public System.Int32 kPositionStateCount
    static void _set_kPositionStateCount(int value);
    // Get instance field reference: protected EquipmentInteractor interactor
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::EquipmentInteractor*& dyn_interactor();
    // Get instance field reference: public VRRig myRig
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::VRRig*& dyn_myRig();
