// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.RaycastHit
#include "UnityEngine/RaycastHit.hpp"
// Including type: UnityEngine.LayerMask
#include "UnityEngine/LayerMask.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: MonkeyeAI_ReplState
#include "GlobalNamespace/MonkeyeAI_ReplState.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: MaterialPropertyBlock
  class MaterialPropertyBlock;
  // Forward declaring type: Renderer
  class Renderer;
  // Forward declaring type: Animator
  class Animator;
  // Forward declaring type: SkinnedMeshRenderer
  class SkinnedMeshRenderer;
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: AudioSource
  class AudioSource;
  // Forward declaring type: AudioClip
  class AudioClip;
}
// Forward declaring namespace: Pathfinding
namespace Pathfinding {
  // Forward declaring type: AIDestinationSetter
  class AIDestinationSetter;
  // Forward declaring type: AIPath
  class AIPath;
  // Forward declaring type: AILerp
  class AILerp;
  // Forward declaring type: Seeker
  class Seeker;
  // Forward declaring type: Path
  class Path;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: Monkeye_LazerFX
  class Monkeye_LazerFX;
  // Forward declaring type: MazePlayerCollection
  class MazePlayerCollection;
  // Forward declaring type: PlayerCollection
  class PlayerCollection;
  // Forward declaring type: VRRig
  class VRRig;
}
// Forward declaring namespace: Photon::Pun
namespace Photon::Pun {
  // Forward declaring type: PhotonView
  class PhotonView;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: MonkeyeAI
  class MonkeyeAI;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::MonkeyeAI);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::MonkeyeAI*, "", "MonkeyeAI");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x1F5
  #pragma pack(push, 1)
  // Autogenerated type: MonkeyeAI
  // [TokenAttribute] Offset: FFFFFFFF
  class MonkeyeAI : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // public System.Collections.Generic.List`1<UnityEngine.Transform> patrolPts
    // Size: 0x8
    // Offset: 0x20
    ::System::Collections::Generic::List_1<::UnityEngine::Transform*>* patrolPts;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Transform*>*) == 0x8);
    // public UnityEngine.Transform sleepPt
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::Transform* sleepPt;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private System.Int32 patrolIdx
    // Size: 0x4
    // Offset: 0x30
    int patrolIdx;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 patrolCount
    // Size: 0x4
    // Offset: 0x34
    int patrolCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.Vector3 targetPosition
    // Size: 0xC
    // Offset: 0x38
    ::UnityEngine::Vector3 targetPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // Padding between fields: targetPosition and: portalMatPropBlock
    char __padding4[0x4] = {};
    // private UnityEngine.MaterialPropertyBlock portalMatPropBlock
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::MaterialPropertyBlock* portalMatPropBlock;
    // Field size check
    static_assert(sizeof(::UnityEngine::MaterialPropertyBlock*) == 0x8);
    // private UnityEngine.MaterialPropertyBlock monkEyeMatPropBlock
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::MaterialPropertyBlock* monkEyeMatPropBlock;
    // Field size check
    static_assert(sizeof(::UnityEngine::MaterialPropertyBlock*) == 0x8);
    // private UnityEngine.Renderer renderer
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::Renderer* renderer;
    // Field size check
    static_assert(sizeof(::UnityEngine::Renderer*) == 0x8);
    // private Pathfinding.AIDestinationSetter aiDest
    // Size: 0x8
    // Offset: 0x60
    ::Pathfinding::AIDestinationSetter* aiDest;
    // Field size check
    static_assert(sizeof(::Pathfinding::AIDestinationSetter*) == 0x8);
    // private Pathfinding.AIPath aiPath
    // Size: 0x8
    // Offset: 0x68
    ::Pathfinding::AIPath* aiPath;
    // Field size check
    static_assert(sizeof(::Pathfinding::AIPath*) == 0x8);
    // private Pathfinding.AILerp aiLerp
    // Size: 0x8
    // Offset: 0x70
    ::Pathfinding::AILerp* aiLerp;
    // Field size check
    static_assert(sizeof(::Pathfinding::AILerp*) == 0x8);
    // private Pathfinding.Seeker seeker
    // Size: 0x8
    // Offset: 0x78
    ::Pathfinding::Seeker* seeker;
    // Field size check
    static_assert(sizeof(::Pathfinding::Seeker*) == 0x8);
    // private Pathfinding.Path path
    // Size: 0x8
    // Offset: 0x80
    ::Pathfinding::Path* path;
    // Field size check
    static_assert(sizeof(::Pathfinding::Path*) == 0x8);
    // private System.Int32 currentWaypoint
    // Size: 0x4
    // Offset: 0x88
    int currentWaypoint;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single nextWaypointDistance
    // Size: 0x4
    // Offset: 0x8C
    float nextWaypointDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean reachedEndOfPath
    // Size: 0x1
    // Offset: 0x90
    bool reachedEndOfPath;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean calculatingPath
    // Size: 0x1
    // Offset: 0x91
    bool calculatingPath;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: calculatingPath and: lazerFx
    char __padding16[0x6] = {};
    // private Monkeye_LazerFX lazerFx
    // Size: 0x8
    // Offset: 0x98
    ::GlobalNamespace::Monkeye_LazerFX* lazerFx;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::Monkeye_LazerFX*) == 0x8);
    // private UnityEngine.Animator animController
    // Size: 0x8
    // Offset: 0xA0
    ::UnityEngine::Animator* animController;
    // Field size check
    static_assert(sizeof(::UnityEngine::Animator*) == 0x8);
    // private UnityEngine.RaycastHit[] rayResults
    // Size: 0x8
    // Offset: 0xA8
    ::ArrayW<::UnityEngine::RaycastHit> rayResults;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::RaycastHit>) == 0x8);
    // private UnityEngine.LayerMask layerMask
    // Size: 0x4
    // Offset: 0xB0
    ::UnityEngine::LayerMask layerMask;
    // Field size check
    static_assert(sizeof(::UnityEngine::LayerMask) == 0x4);
    // private System.Boolean wasConnectedToRoom
    // Size: 0x1
    // Offset: 0xB4
    bool wasConnectedToRoom;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: wasConnectedToRoom and: skinnedMeshRenderer
    char __padding21[0x3] = {};
    // public UnityEngine.SkinnedMeshRenderer skinnedMeshRenderer
    // Size: 0x8
    // Offset: 0xB8
    ::UnityEngine::SkinnedMeshRenderer* skinnedMeshRenderer;
    // Field size check
    static_assert(sizeof(::UnityEngine::SkinnedMeshRenderer*) == 0x8);
    // public MazePlayerCollection playerCollection
    // Size: 0x8
    // Offset: 0xC0
    ::GlobalNamespace::MazePlayerCollection* playerCollection;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::MazePlayerCollection*) == 0x8);
    // public PlayerCollection playersInRoomCollection
    // Size: 0x8
    // Offset: 0xC8
    ::GlobalNamespace::PlayerCollection* playersInRoomCollection;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::PlayerCollection*) == 0x8);
    // private System.Collections.Generic.List`1<VRRig> validRigs
    // Size: 0x8
    // Offset: 0xD0
    ::System::Collections::Generic::List_1<::GlobalNamespace::VRRig*>* validRigs;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GlobalNamespace::VRRig*>*) == 0x8);
    // public UnityEngine.GameObject portalFx
    // Size: 0x8
    // Offset: 0xD8
    ::UnityEngine::GameObject* portalFx;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.Transform[] eyeBones
    // Size: 0x8
    // Offset: 0xE0
    ::ArrayW<::UnityEngine::Transform*> eyeBones;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Transform*>) == 0x8);
    // public System.Single speed
    // Size: 0x4
    // Offset: 0xE8
    float speed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single rotationSpeed
    // Size: 0x4
    // Offset: 0xEC
    float rotationSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single wakeDistance
    // Size: 0x4
    // Offset: 0xF0
    float wakeDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single chaseDistance
    // Size: 0x4
    // Offset: 0xF4
    float chaseDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single sleepDuration
    // Size: 0x4
    // Offset: 0xF8
    float sleepDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single attackDistance
    // Size: 0x4
    // Offset: 0xFC
    float attackDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single beginAttackTime
    // Size: 0x4
    // Offset: 0x100
    float beginAttackTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single openFloorTime
    // Size: 0x4
    // Offset: 0x104
    float openFloorTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single dropPlayerTime
    // Size: 0x4
    // Offset: 0x108
    float dropPlayerTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single closeFloorTime
    // Size: 0x4
    // Offset: 0x10C
    float closeFloorTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.Color portalColor
    // Size: 0x10
    // Offset: 0x110
    ::UnityEngine::Color portalColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // public UnityEngine.Color gorillaPortalColor
    // Size: 0x10
    // Offset: 0x120
    ::UnityEngine::Color gorillaPortalColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // public UnityEngine.Color monkEyeColor
    // Size: 0x10
    // Offset: 0x130
    ::UnityEngine::Color monkEyeColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // public UnityEngine.Color monkEyeEyeColorNormal
    // Size: 0x10
    // Offset: 0x140
    ::UnityEngine::Color monkEyeEyeColorNormal;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // public UnityEngine.Color monkEyeEyeColorAttacking
    // Size: 0x10
    // Offset: 0x150
    ::UnityEngine::Color monkEyeEyeColorAttacking;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // public System.Int32 maxPatrols
    // Size: 0x4
    // Offset: 0x160
    int maxPatrols;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: maxPatrols and: targetRig
    char __padding43[0x4] = {};
    // private VRRig targetRig
    // Size: 0x8
    // Offset: 0x168
    ::GlobalNamespace::VRRig* targetRig;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::VRRig*) == 0x8);
    // public MonkeyeAI_ReplState replState
    // Size: 0x8
    // Offset: 0x170
    ::GlobalNamespace::MonkeyeAI_ReplState* replState;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::MonkeyeAI_ReplState*) == 0x8);
    // private System.Int32 layerBase
    // Size: 0x4
    // Offset: 0x178
    int layerBase;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 layerForward
    // Size: 0x4
    // Offset: 0x17C
    int layerForward;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 layerLeft
    // Size: 0x4
    // Offset: 0x180
    int layerLeft;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 layerRight
    // Size: 0x4
    // Offset: 0x184
    int layerRight;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.Vector3 prevPosition
    // Size: 0xC
    // Offset: 0x188
    ::UnityEngine::Vector3 prevPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 velocity
    // Size: 0xC
    // Offset: 0x194
    ::UnityEngine::Vector3 velocity;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.AudioSource audioSource
    // Size: 0x8
    // Offset: 0x1A0
    ::UnityEngine::AudioSource* audioSource;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // public UnityEngine.AudioClip sleepLoopSound
    // Size: 0x8
    // Offset: 0x1A8
    ::UnityEngine::AudioClip* sleepLoopSound;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // public System.Single sleepLoopVolume
    // Size: 0x4
    // Offset: 0x1B0
    float sleepLoopVolume;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: sleepLoopVolume and: patrolLoopSound
    char __padding54[0x4] = {};
    // public UnityEngine.AudioClip patrolLoopSound
    // Size: 0x8
    // Offset: 0x1B8
    ::UnityEngine::AudioClip* patrolLoopSound;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // public System.Single patrolLoopVolume
    // Size: 0x4
    // Offset: 0x1C0
    float patrolLoopVolume;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single patrolLoopFadeInTime
    // Size: 0x4
    // Offset: 0x1C4
    float patrolLoopFadeInTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.AudioClip chaseLoopSound
    // Size: 0x8
    // Offset: 0x1C8
    ::UnityEngine::AudioClip* chaseLoopSound;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // public System.Single chaseLoopVolume
    // Size: 0x4
    // Offset: 0x1D0
    float chaseLoopVolume;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single chaseLoopFadeInTime
    // Size: 0x4
    // Offset: 0x1D4
    float chaseLoopFadeInTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.AudioClip attackSound
    // Size: 0x8
    // Offset: 0x1D8
    ::UnityEngine::AudioClip* attackSound;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // public System.Single attackVolume
    // Size: 0x4
    // Offset: 0x1E0
    float attackVolume;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: attackVolume and: view
    char __padding62[0x4] = {};
    // private Photon.Pun.PhotonView _view
    // Size: 0x8
    // Offset: 0x1E8
    ::Photon::Pun::PhotonView* view;
    // Field size check
    static_assert(sizeof(::Photon::Pun::PhotonView*) == 0x8);
    // public System.Single overlapRadius
    // Size: 0x4
    // Offset: 0x1F0
    float overlapRadius;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean lockedOn
    // Size: 0x1
    // Offset: 0x1F4
    bool lockedOn;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get static field: static private readonly System.Int32 EmissionColorShaderProp
    static int _get_EmissionColorShaderProp();
    // Set static field: static private readonly System.Int32 EmissionColorShaderProp
    static void _set_EmissionColorShaderProp(int value);
    // Get static field: static private readonly System.Int32 ColorShaderProp
    static int _get_ColorShaderProp();
    // Set static field: static private readonly System.Int32 ColorShaderProp
    static void _set_ColorShaderProp(int value);
    // Get static field: static private readonly System.Int32 EyeColorShaderProp
    static int _get_EyeColorShaderProp();
    // Set static field: static private readonly System.Int32 EyeColorShaderProp
    static void _set_EyeColorShaderProp(int value);
    // Get static field: static private readonly System.Int32 tintColorShaderProp
