// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: NetworkSystemConfig
#include "GlobalNamespace/NetworkSystemConfig.hpp"
// Including type: NetSystemState
#include "GlobalNamespace/NetSystemState.hpp"
// Including type: NetJoinResult
#include "GlobalNamespace/NetJoinResult.hpp"
// Including type: RPCArgBuffer`1
#include "GlobalNamespace/RPCArgBuffer_1.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: NetPlayer
  class NetPlayer;
  // Forward declaring type: RoomConfig
  class RoomConfig;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: Photon::Voice::Unity
namespace Photon::Voice::Unity {
  // Forward declaring type: Recorder
  class Recorder;
  // Forward declaring type: Speaker
  class Speaker;
  // Forward declaring type: RemoteVoiceLink
  class RemoteVoiceLink;
  // Forward declaring type: VoiceConnection
  class VoiceConnection;
}
// Forward declaring namespace: GorillaNetworking
namespace GorillaNetworking {
  // Forward declaring type: SO_NetworkVoiceSettings
  class SO_NetworkVoiceSettings;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: String
  class String;
  // Forward declaring type: Nullable`1<T>
  template<typename T>
  struct Nullable_1;
  // Skipping declaration: ValueType because it is already included!
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: StringBuilder
  class StringBuilder;
}
// Forward declaring namespace: System::Threading::Tasks
namespace System::Threading::Tasks {
  // Forward declaring type: Task`1<TResult>
  template<typename TResult>
  class Task_1;
  // Forward declaring type: Task
  class Task;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Skipping declaration: Vector3 because it is already included!
  // Skipping declaration: Quaternion because it is already included!
}
// Forward declaring namespace: Oculus::Platform
namespace Oculus::Platform {
  // Forward declaring type: Message`1<T>
  template<typename T>
  class Message_1;
}
// Forward declaring namespace: Oculus::Platform::Models
namespace Oculus::Platform::Models {
  // Forward declaring type: UserProof
  class UserProof;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: NetworkSystem
  class NetworkSystem;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::NetworkSystem);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::NetworkSystem*, "", "NetworkSystem");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0xA0
  #pragma pack(push, 1)
  // Autogenerated type: NetworkSystem
  // [TokenAttribute] Offset: FFFFFFFF
  class NetworkSystem : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::GlobalNamespace::NetworkSystem::RPC
    class RPC;
    // Nested type: ::GlobalNamespace::NetworkSystem::StringRPC
    class StringRPC;
    // Nested type: ::GlobalNamespace::NetworkSystem::StaticRPC
    class StaticRPC;
    // Nested type: ::GlobalNamespace::NetworkSystem::StaticRPCPlaceholder
    class StaticRPCPlaceholder;
    // Nested type: ::GlobalNamespace::NetworkSystem::$$c
    class $$c;
    // Nested type: ::GlobalNamespace::NetworkSystem::$$c__DisplayClass82_0
    class $$c__DisplayClass82_0;
    // Nested type: ::GlobalNamespace::NetworkSystem::$$c__DisplayClass83_0
    class $$c__DisplayClass83_0;
    // Nested type: ::GlobalNamespace::NetworkSystem::$ReGetNonce$d__80
    class $ReGetNonce$d__80;
    // Nested type: ::GlobalNamespace::NetworkSystem::$RefreshOculusNonce$d__78
    struct $RefreshOculusNonce$d__78;
    public:
    // public NetworkSystemConfig config
    // Size: 0x4
    // Offset: 0x20
    ::GlobalNamespace::NetworkSystemConfig config;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::NetworkSystemConfig) == 0x4);
    // public System.Boolean changingSceneManually
    // Size: 0x1
    // Offset: 0x24
    bool changingSceneManually;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: changingSceneManually and: regionNames
    char __padding1[0x3] = {};
    // public System.String[] regionNames
    // Size: 0x8
    // Offset: 0x28
    ::ArrayW<::StringW> regionNames;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // public System.Int32 currentRegionIndex
    // Size: 0x4
    // Offset: 0x30
    int currentRegionIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean <groupJoinInProgress>k__BackingField
    // Size: 0x1
    // Offset: 0x34
    bool groupJoinInProgress;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean nonceRefreshed
    // Size: 0x1
    // Offset: 0x35
    bool nonceRefreshed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean isWrongVersion
    // Size: 0x1
    // Offset: 0x36
    bool isWrongVersion;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isWrongVersion and: testState
    char __padding6[0x1] = {};
    // private NetSystemState testState
    // Size: 0x4
    // Offset: 0x38
    ::GlobalNamespace::NetSystemState testState;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::NetSystemState) == 0x4);
    // Padding between fields: testState and: playerIDCache
    char __padding7[0x4] = {};
    // protected System.Int32[] playerIDCache
    // Size: 0x8
    // Offset: 0x40
    ::ArrayW<int> playerIDCache;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // protected System.Collections.Generic.List`1<NetPlayer> netPlayerCache
    // Size: 0x8
    // Offset: 0x48
    ::System::Collections::Generic::List_1<::GlobalNamespace::NetPlayer*>* netPlayerCache;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GlobalNamespace::NetPlayer*>*) == 0x8);
    // protected Photon.Voice.Unity.Recorder localRecorder
    // Size: 0x8
    // Offset: 0x50
    ::Photon::Voice::Unity::Recorder* localRecorder;
    // Field size check
    static_assert(sizeof(::Photon::Voice::Unity::Recorder*) == 0x8);
    // protected Photon.Voice.Unity.Speaker localSpeaker
    // Size: 0x8
    // Offset: 0x58
    ::Photon::Voice::Unity::Speaker* localSpeaker;
    // Field size check
    static_assert(sizeof(::Photon::Voice::Unity::Speaker*) == 0x8);
    // private Photon.Voice.Unity.Speaker <LocalSpeaker>k__BackingField
    // Size: 0x8
    // Offset: 0x60
    ::Photon::Voice::Unity::Speaker* LocalSpeaker;
    // Field size check
    static_assert(sizeof(::Photon::Voice::Unity::Speaker*) == 0x8);
    // protected GorillaNetworking.SO_NetworkVoiceSettings VoiceSettings
    // Size: 0x8
    // Offset: 0x68
    ::GorillaNetworking::SO_NetworkVoiceSettings* VoiceSettings;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::SO_NetworkVoiceSettings*) == 0x8);
    // protected System.Collections.Generic.List`1<System.Action`1<Photon.Voice.Unity.RemoteVoiceLink>> remoteVoiceAddedCallbacks
    // Size: 0x8
    // Offset: 0x70
    ::System::Collections::Generic::List_1<::System::Action_1<::Photon::Voice::Unity::RemoteVoiceLink*>*>* remoteVoiceAddedCallbacks;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::System::Action_1<::Photon::Voice::Unity::RemoteVoiceLink*>*>*) == 0x8);
    // private System.Action OnMultiplayerStarted
    // Size: 0x8
    // Offset: 0x78
    ::System::Action* OnMultiplayerStarted;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private System.Action OnReturnedToSinglePlayer
    // Size: 0x8
    // Offset: 0x80
    ::System::Action* OnReturnedToSinglePlayer;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private System.Action`1<System.Int32> OnPlayerJoined
    // Size: 0x8
    // Offset: 0x88
    ::System::Action_1<int>* OnPlayerJoined;
    // Field size check
    static_assert(sizeof(::System::Action_1<int>*) == 0x8);
    // private System.Action`1<System.Int32> OnPlayerLeft
    // Size: 0x8
    // Offset: 0x90
    ::System::Action_1<int>* OnPlayerLeft;
    // Field size check
    static_assert(sizeof(::System::Action_1<int>*) == 0x8);
    // private RoomConfig <CurrentRoom>k__BackingField
    // Size: 0x8
    // Offset: 0x98
    ::GlobalNamespace::RoomConfig* CurrentRoom;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::RoomConfig*) == 0x8);
    public:
    // Get static field: static public NetworkSystem Instance
    static ::GlobalNamespace::NetworkSystem* _get_Instance();
    // Set static field: static public NetworkSystem Instance
    static void _set_Instance(::GlobalNamespace::NetworkSystem* value);
    // Get static field: static protected readonly System.Byte[] EmptyArgs
    static ::ArrayW<uint8_t> _get_EmptyArgs();
    // Set static field: static protected readonly System.Byte[] EmptyArgs
    static void _set_EmptyArgs(::ArrayW<uint8_t> value);
    // static field const value: static public System.String roomCharacters
    static constexpr const char* roomCharacters = "ABCDEFGHIJKLMNPQRSTUVWXYZ123456789";
    // Get static field: static public System.String roomCharacters
    static ::StringW _get_roomCharacters();
