// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Fusion.Behaviour
#include "Fusion/Behaviour.hpp"
// Including type: Fusion.GameMode
#include "Fusion/GameMode.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Fusion
namespace Fusion {
  // Forward declaring type: SceneRef
  struct SceneRef;
  // Forward declaring type: NetworkRunner
  class NetworkRunner;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Skipping declaration: Stage because it is already included!
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Forward declaring namespace: System::Threading::Tasks
namespace System::Threading::Tasks {
  // Forward declaring type: Task
  class Task;
}
// Forward declaring namespace: Fusion::Sockets
namespace Fusion::Sockets {
  // Forward declaring type: NetAddress
  struct NetAddress;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: NetworkDebugStart
  class NetworkDebugStart;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::NetworkDebugStart);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::NetworkDebugStart*, "", "NetworkDebugStart");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x6C
  #pragma pack(push, 1)
  // Autogenerated type: NetworkDebugStart
  // [TokenAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: FFFFFFFF
  // [DisallowMultipleComponent] Offset: FFFFFFFF
  // [ScriptHelpAttribute] Offset: FFFFFFFF
  class NetworkDebugStart : public ::Fusion::Behaviour {
    public:
    // Nested type: ::GlobalNamespace::NetworkDebugStart::StartModes
    struct StartModes;
    // Nested type: ::GlobalNamespace::NetworkDebugStart::Stage
    struct Stage;
    // Nested type: ::GlobalNamespace::NetworkDebugStart::$$c
    class $$c;
    // Nested type: ::GlobalNamespace::NetworkDebugStart::$StartClients$d__58
    class $StartClients$d__58;
    // Nested type: ::GlobalNamespace::NetworkDebugStart::$StartWithClients$d__54
    class $StartWithClients$d__54;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: NetworkDebugStart/StartModes
    // [TokenAttribute] Offset: FFFFFFFF
    struct StartModes/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: StartModes
      constexpr StartModes(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public NetworkDebugStart/StartModes UserInterface
      static constexpr const int UserInterface = 0;
      // Get static field: static public NetworkDebugStart/StartModes UserInterface
      static ::GlobalNamespace::NetworkDebugStart::StartModes _get_UserInterface();
      // Set static field: static public NetworkDebugStart/StartModes UserInterface
      static void _set_UserInterface(::GlobalNamespace::NetworkDebugStart::StartModes value);
      // static field const value: static public NetworkDebugStart/StartModes Automatic
      static constexpr const int Automatic = 1;
      // Get static field: static public NetworkDebugStart/StartModes Automatic
      static ::GlobalNamespace::NetworkDebugStart::StartModes _get_Automatic();
      // Set static field: static public NetworkDebugStart/StartModes Automatic
      static void _set_Automatic(::GlobalNamespace::NetworkDebugStart::StartModes value);
      // static field const value: static public NetworkDebugStart/StartModes Manual
      static constexpr const int Manual = 2;
      // Get static field: static public NetworkDebugStart/StartModes Manual
      static ::GlobalNamespace::NetworkDebugStart::StartModes _get_Manual();
      // Set static field: static public NetworkDebugStart/StartModes Manual
      static void _set_Manual(::GlobalNamespace::NetworkDebugStart::StartModes value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // NetworkDebugStart/StartModes
    #pragma pack(pop)
    static check_size<sizeof(NetworkDebugStart::StartModes), 0 + sizeof(int)> __GlobalNamespace_NetworkDebugStart_StartModesSizeCheck;
    static_assert(sizeof(NetworkDebugStart::StartModes) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: NetworkDebugStart/Stage
    // [TokenAttribute] Offset: FFFFFFFF
    struct Stage/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: Stage
      constexpr Stage(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public NetworkDebugStart/Stage Disconnected
      static constexpr const int Disconnected = 0;
      // Get static field: static public NetworkDebugStart/Stage Disconnected
      static ::GlobalNamespace::NetworkDebugStart::Stage _get_Disconnected();
      // Set static field: static public NetworkDebugStart/Stage Disconnected
      static void _set_Disconnected(::GlobalNamespace::NetworkDebugStart::Stage value);
      // static field const value: static public NetworkDebugStart/Stage StartingUp
      static constexpr const int StartingUp = 1;
      // Get static field: static public NetworkDebugStart/Stage StartingUp
      static ::GlobalNamespace::NetworkDebugStart::Stage _get_StartingUp();
      // Set static field: static public NetworkDebugStart/Stage StartingUp
      static void _set_StartingUp(::GlobalNamespace::NetworkDebugStart::Stage value);
      // static field const value: static public NetworkDebugStart/Stage UnloadOriginalScene
      static constexpr const int UnloadOriginalScene = 2;
      // Get static field: static public NetworkDebugStart/Stage UnloadOriginalScene
      static ::GlobalNamespace::NetworkDebugStart::Stage _get_UnloadOriginalScene();
      // Set static field: static public NetworkDebugStart/Stage UnloadOriginalScene
      static void _set_UnloadOriginalScene(::GlobalNamespace::NetworkDebugStart::Stage value);
      // static field const value: static public NetworkDebugStart/Stage ConnectingServer
      static constexpr const int ConnectingServer = 3;
      // Get static field: static public NetworkDebugStart/Stage ConnectingServer
      static ::GlobalNamespace::NetworkDebugStart::Stage _get_ConnectingServer();
      // Set static field: static public NetworkDebugStart/Stage ConnectingServer
      static void _set_ConnectingServer(::GlobalNamespace::NetworkDebugStart::Stage value);
      // static field const value: static public NetworkDebugStart/Stage ConnectingClients
      static constexpr const int ConnectingClients = 4;
      // Get static field: static public NetworkDebugStart/Stage ConnectingClients
      static ::GlobalNamespace::NetworkDebugStart::Stage _get_ConnectingClients();
      // Set static field: static public NetworkDebugStart/Stage ConnectingClients
      static void _set_ConnectingClients(::GlobalNamespace::NetworkDebugStart::Stage value);
      // static field const value: static public NetworkDebugStart/Stage AllConnected
      static constexpr const int AllConnected = 5;
      // Get static field: static public NetworkDebugStart/Stage AllConnected
      static ::GlobalNamespace::NetworkDebugStart::Stage _get_AllConnected();
      // Set static field: static public NetworkDebugStart/Stage AllConnected
      static void _set_AllConnected(::GlobalNamespace::NetworkDebugStart::Stage value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // NetworkDebugStart/Stage
    #pragma pack(pop)
    static check_size<sizeof(NetworkDebugStart::Stage), 0 + sizeof(int)> __GlobalNamespace_NetworkDebugStart_StageSizeCheck;
    static_assert(sizeof(NetworkDebugStart::Stage) == 0x4);
    public:
    // public Fusion.NetworkRunner RunnerPrefab
    // Size: 0x8
    // Offset: 0x20
    ::Fusion::NetworkRunner* RunnerPrefab;
    // Field size check
    static_assert(sizeof(::Fusion::NetworkRunner*) == 0x8);
    // public NetworkDebugStart/StartModes StartMode
    // Size: 0x4
    // Offset: 0x28
    ::GlobalNamespace::NetworkDebugStart::StartModes StartMode;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::NetworkDebugStart::StartModes) == 0x4);
    // public Fusion.GameMode AutoStartAs
    // Size: 0x4
    // Offset: 0x2C
    ::Fusion::GameMode AutoStartAs;
    // Field size check
    static_assert(sizeof(::Fusion::GameMode) == 0x4);
    // public System.Boolean AutoHideGUI
    // Size: 0x1
    // Offset: 0x30
    bool AutoHideGUI;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: AutoHideGUI and: AutoClients
    char __padding3[0x3] = {};
    // public System.Int32 AutoClients
    // Size: 0x4
    // Offset: 0x34
    int AutoClients;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.UInt16 ServerPort
    // Size: 0x2
    // Offset: 0x38
    uint16_t ServerPort;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // Padding between fields: ServerPort and: DefaultRoomName
    char __padding5[0x6] = {};
    // public System.String DefaultRoomName
    // Size: 0x8
    // Offset: 0x40
    ::StringW DefaultRoomName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Boolean AlwaysShowStats
    // Size: 0x1
    // Offset: 0x48
    bool AlwaysShowStats;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: AlwaysShowStats and: server
    char __padding7[0x7] = {};
    // private Fusion.NetworkRunner _server
    // Size: 0x8
    // Offset: 0x50
    ::Fusion::NetworkRunner* server;
    // Field size check
    static_assert(sizeof(::Fusion::NetworkRunner*) == 0x8);
    // public System.String InitialScenePath
    // Size: 0x8
    // Offset: 0x58
    ::StringW InitialScenePath;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // protected NetworkDebugStart/Stage _currentStage
    // Size: 0x4
    // Offset: 0x60
    ::GlobalNamespace::NetworkDebugStart::Stage currentStage;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::NetworkDebugStart::Stage) == 0x4);
    // private System.Int32 <LastCreatedClientIndex>k__BackingField
    // Size: 0x4
    // Offset: 0x64
    int LastCreatedClientIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private Fusion.GameMode <CurrentServerMode>k__BackingField
    // Size: 0x4
    // Offset: 0x68
    ::Fusion::GameMode CurrentServerMode;
    // Field size check
    static_assert(sizeof(::Fusion::GameMode) == 0x4);
    public:
    // Get static field: static private System.String _initialScenePath
    static ::StringW _get__initialScenePath();
    // Set static field: static private System.String _initialScenePath
    static void _set__initialScenePath(::StringW value);
    // Get instance field reference: public Fusion.NetworkRunner RunnerPrefab
    [[deprecated("Use field access instead!")]] ::Fusion::NetworkRunner*& dyn_RunnerPrefab();
    // Get instance field reference: public NetworkDebugStart/StartModes StartMode
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::NetworkDebugStart::StartModes& dyn_StartMode();
    // Get instance field reference: public Fusion.GameMode AutoStartAs
    [[deprecated("Use field access instead!")]] ::Fusion::GameMode& dyn_AutoStartAs();
    // Get instance field reference: public System.Boolean AutoHideGUI
