// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: TransferrableObject
#include "GlobalNamespace/TransferrableObject.hpp"
// Including type: UnityEngine.RaycastHit
#include "UnityEngine/RaycastHit.hpp"
// Including type: UnityEngine.LayerMask
#include "UnityEngine/LayerMask.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: VRRig
  class VRRig;
  // Forward declaring type: GorillaTriggerColliderHandIndicator
  class GorillaTriggerColliderHandIndicator;
  // Forward declaring type: DropZone
  class DropZone;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Collider
  class Collider;
  // Forward declaring type: AudioSource
  class AudioSource;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: AudioClip
  class AudioClip;
  // Skipping declaration: Matrix4x4 because it is already included!
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: OneStringGuitar
  class OneStringGuitar;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::OneStringGuitar);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::OneStringGuitar*, "", "OneStringGuitar");
// Type namespace: 
namespace GlobalNamespace {
  // WARNING Size may be invalid!
  // Autogenerated type: OneStringGuitar
  // [TokenAttribute] Offset: FFFFFFFF
  class OneStringGuitar : public ::GlobalNamespace::TransferrableObject {
    public:
    // Nested type: ::GlobalNamespace::OneStringGuitar::GuitarStates
    struct GuitarStates;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: OneStringGuitar/GuitarStates
    // [TokenAttribute] Offset: FFFFFFFF
    struct GuitarStates/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: GuitarStates
      constexpr GuitarStates(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public OneStringGuitar/GuitarStates Club
      static constexpr const int Club = 1;
      // Get static field: static public OneStringGuitar/GuitarStates Club
      static ::GlobalNamespace::OneStringGuitar::GuitarStates _get_Club();
      // Set static field: static public OneStringGuitar/GuitarStates Club
      static void _set_Club(::GlobalNamespace::OneStringGuitar::GuitarStates value);
      // static field const value: static public OneStringGuitar/GuitarStates HeldReverseGrip
      static constexpr const int HeldReverseGrip = 2;
      // Get static field: static public OneStringGuitar/GuitarStates HeldReverseGrip
      static ::GlobalNamespace::OneStringGuitar::GuitarStates _get_HeldReverseGrip();
      // Set static field: static public OneStringGuitar/GuitarStates HeldReverseGrip
      static void _set_HeldReverseGrip(::GlobalNamespace::OneStringGuitar::GuitarStates value);
      // static field const value: static public OneStringGuitar/GuitarStates Playing
      static constexpr const int Playing = 4;
      // Get static field: static public OneStringGuitar/GuitarStates Playing
      static ::GlobalNamespace::OneStringGuitar::GuitarStates _get_Playing();
      // Set static field: static public OneStringGuitar/GuitarStates Playing
      static void _set_Playing(::GlobalNamespace::OneStringGuitar::GuitarStates value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // OneStringGuitar/GuitarStates
    #pragma pack(pop)
    static check_size<sizeof(OneStringGuitar::GuitarStates), 0 + sizeof(int)> __GlobalNamespace_OneStringGuitar_GuitarStatesSizeCheck;
    static_assert(sizeof(OneStringGuitar::GuitarStates) == 0x4);
    public:
    // public UnityEngine.Vector3 chestOffsetLeft
    // Size: 0xC
    // Offset: 0x2CC
    ::UnityEngine::Vector3 chestOffsetLeft;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 chestOffsetRight
    // Size: 0xC
    // Offset: 0x2D8
    ::UnityEngine::Vector3 chestOffsetRight;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Quaternion holdingOffsetRotationLeft
    // Size: 0x10
    // Offset: 0x2E4
    ::UnityEngine::Quaternion holdingOffsetRotationLeft;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // public UnityEngine.Quaternion holdingOffsetRotationRight
    // Size: 0x10
    // Offset: 0x2F4
    ::UnityEngine::Quaternion holdingOffsetRotationRight;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // public UnityEngine.Quaternion chestRotationOffset
    // Size: 0x10
    // Offset: 0x304
    ::UnityEngine::Quaternion chestRotationOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // public UnityEngine.Collider currentChestCollider
    // Size: 0x8
    // Offset: 0x318
    ::UnityEngine::Collider* currentChestCollider;
    // Field size check
    static_assert(sizeof(::UnityEngine::Collider*) == 0x8);
    // public UnityEngine.Collider chestColliderLeft
    // Size: 0x8
    // Offset: 0x320
    ::UnityEngine::Collider* chestColliderLeft;
    // Field size check
    static_assert(sizeof(::UnityEngine::Collider*) == 0x8);
    // public UnityEngine.Collider chestColliderRight
    // Size: 0x8
    // Offset: 0x328
    ::UnityEngine::Collider* chestColliderRight;
    // Field size check
    static_assert(sizeof(::UnityEngine::Collider*) == 0x8);
    // public System.Single lerpValue
    // Size: 0x4
    // Offset: 0x330
    float lerpValue;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.AudioSource audioSource
    // Size: 0x8
    // Offset: 0x338
    ::UnityEngine::AudioSource* audioSource;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // private UnityEngine.Transform parentHand
    // Size: 0x8
    // Offset: 0x340
    ::UnityEngine::Transform* parentHand;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform parentHandLeft
    // Size: 0x8
    // Offset: 0x348
    ::UnityEngine::Transform* parentHandLeft;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform parentHandRight
    // Size: 0x8
    // Offset: 0x350
    ::UnityEngine::Transform* parentHandRight;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public System.Single unsnapDistance
    // Size: 0x4
    // Offset: 0x358
    float unsnapDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single snapDistance
    // Size: 0x4
    // Offset: 0x35C
    float snapDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.Vector3 startPositionLeft
    // Size: 0xC
    // Offset: 0x360
    ::UnityEngine::Vector3 startPositionLeft;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Quaternion startQuatLeft
    // Size: 0x10
    // Offset: 0x36C
    ::UnityEngine::Quaternion startQuatLeft;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // public UnityEngine.Vector3 reverseGripPositionLeft
    // Size: 0xC
    // Offset: 0x37C
    ::UnityEngine::Vector3 reverseGripPositionLeft;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Quaternion reverseGripQuatLeft
    // Size: 0x10
    // Offset: 0x388
    ::UnityEngine::Quaternion reverseGripQuatLeft;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // public UnityEngine.Vector3 startPositionRight
    // Size: 0xC
    // Offset: 0x398
    ::UnityEngine::Vector3 startPositionRight;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Quaternion startQuatRight
    // Size: 0x10
    // Offset: 0x3A4
    ::UnityEngine::Quaternion startQuatRight;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // public UnityEngine.Vector3 reverseGripPositionRight
    // Size: 0xC
    // Offset: 0x3B4
    ::UnityEngine::Vector3 reverseGripPositionRight;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Quaternion reverseGripQuatRight
    // Size: 0x10
    // Offset: 0x3C0
    ::UnityEngine::Quaternion reverseGripQuatRight;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // public System.Single angleLerpSnap
    // Size: 0x4
    // Offset: 0x3D0
    float angleLerpSnap;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single vectorLerpSnap
    // Size: 0x4
    // Offset: 0x3D4
    float vectorLerpSnap;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean angleSnapped
    // Size: 0x1
    // Offset: 0x3D8
    bool angleSnapped;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean positionSnapped
    // Size: 0x1
    // Offset: 0x3D9
    bool positionSnapped;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public UnityEngine.Transform chestTouch
    // Size: 0x8
    // Offset: 0x3E0
    ::UnityEngine::Transform* chestTouch;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private System.Int32 collidersHitCount
    // Size: 0x4
    // Offset: 0x3E8
    int collidersHitCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.Collider[] collidersHit
    // Size: 0x8
    // Offset: 0x3F0
    ::ArrayW<::UnityEngine::Collider*> collidersHit;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Collider*>) == 0x8);
    // private UnityEngine.RaycastHit[] raycastHits
    // Size: 0x8
    // Offset: 0x3F8
    ::ArrayW<::UnityEngine::RaycastHit> raycastHits;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::RaycastHit>) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.RaycastHit> raycastHitList
    // Size: 0x8
    // Offset: 0x400
    ::System::Collections::Generic::List_1<::UnityEngine::RaycastHit>* raycastHitList;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::RaycastHit>*) == 0x8);
    // private UnityEngine.RaycastHit nullHit
    // Size: 0x2C
    // Offset: 0x408
    ::UnityEngine::RaycastHit nullHit;
    // Field size check
    static_assert(sizeof(::UnityEngine::RaycastHit) == 0x2C);
    // public UnityEngine.Collider[] collidersToBeIn
    // Size: 0x8
    // Offset: 0x438
    ::ArrayW<::UnityEngine::Collider*> collidersToBeIn;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Collider*>) == 0x8);
    // public UnityEngine.LayerMask interactableMask
    // Size: 0x4
    // Offset: 0x440
    ::UnityEngine::LayerMask interactableMask;
    // Field size check
    static_assert(sizeof(::UnityEngine::LayerMask) == 0x4);
    // public System.Int32 currentFretIndex
    // Size: 0x4
    // Offset: 0x444
    int currentFretIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 lastFretIndex
    // Size: 0x4
    // Offset: 0x448
    int lastFretIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public UnityEngine.Collider[] frets
    // Size: 0x8
    // Offset: 0x450
    ::ArrayW<::UnityEngine::Collider*> frets;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Collider*>) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.Collider> fretsList
    // Size: 0x8
    // Offset: 0x458
    ::System::Collections::Generic::List_1<::UnityEngine::Collider*>* fretsList;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Collider*>*) == 0x8);
    // public UnityEngine.AudioClip[] audioClips
    // Size: 0x8
    // Offset: 0x460
    ::ArrayW<::UnityEngine::AudioClip*> audioClips;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::AudioClip*>) == 0x8);
    // private GorillaTriggerColliderHandIndicator leftHandIndicator
    // Size: 0x8
    // Offset: 0x468
    ::GlobalNamespace::GorillaTriggerColliderHandIndicator* leftHandIndicator;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::GorillaTriggerColliderHandIndicator*) == 0x8);
    // private GorillaTriggerColliderHandIndicator rightHandIndicator
    // Size: 0x8
    // Offset: 0x470
    ::GlobalNamespace::GorillaTriggerColliderHandIndicator* rightHandIndicator;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::GorillaTriggerColliderHandIndicator*) == 0x8);
    // private GorillaTriggerColliderHandIndicator fretHandIndicator
    // Size: 0x8
    // Offset: 0x478
    ::GlobalNamespace::GorillaTriggerColliderHandIndicator* fretHandIndicator;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::GorillaTriggerColliderHandIndicator*) == 0x8);
    // private GorillaTriggerColliderHandIndicator strumHandIndicator
    // Size: 0x8
    // Offset: 0x480
    ::GlobalNamespace::GorillaTriggerColliderHandIndicator* strumHandIndicator;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::GorillaTriggerColliderHandIndicator*) == 0x8);
    // private System.Single sphereRadius
    // Size: 0x4
    // Offset: 0x488
    float sphereRadius;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean anyHit
    // Size: 0x1
    // Offset: 0x48C
    bool anyHit;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean handIn
    // Size: 0x1
    // Offset: 0x48D
    bool handIn;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private UnityEngine.Vector3 spherecastSweep
    // Size: 0xC
    // Offset: 0x490
    ::UnityEngine::Vector3 spherecastSweep;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Collider strumCollider
    // Size: 0x8
    // Offset: 0x4A0
    ::UnityEngine::Collider* strumCollider;
    // Field size check
    static_assert(sizeof(::UnityEngine::Collider*) == 0x8);
    // public System.Single maxVolume
    // Size: 0x4
    // Offset: 0x4A8
    float maxVolume;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single minVolume
    // Size: 0x4
    // Offset: 0x4AC
    float minVolume;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single maxVelocity
    // Size: 0x4
    // Offset: 0x4B0
    float maxVelocity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Collections.Generic.List`1<UnityEngine.Collider> strumList
    // Size: 0x8
    // Offset: 0x4B8
    ::System::Collections::Generic::List_1<::UnityEngine::Collider*>* strumList;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Collider*>*) == 0x8);
    // public System.Int32 selfInstrumentIndex
    // Size: 0x4
    // Offset: 0x4C0
    int selfInstrumentIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private OneStringGuitar/GuitarStates lastState
    // Size: 0x4
    // Offset: 0x4C4
    ::GlobalNamespace::OneStringGuitar::GuitarStates lastState;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OneStringGuitar::GuitarStates) == 0x4);
    // private UnityEngine.Vector3 startingLeftChestOffset
    // Size: 0xC
    // Offset: 0x4C8
    ::UnityEngine::Vector3 startingLeftChestOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 startingRightChestOffset
    // Size: 0xC
    // Offset: 0x4D4
    ::UnityEngine::Vector3 startingRightChestOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Single startingUnsnapDistance
    // Size: 0x4
    // Offset: 0x4E0
    float startingUnsnapDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Get instance field reference: public UnityEngine.Vector3 chestOffsetLeft
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_chestOffsetLeft();
    // Get instance field reference: public UnityEngine.Vector3 chestOffsetRight
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_chestOffsetRight();
    // Get instance field reference: public UnityEngine.Quaternion holdingOffsetRotationLeft
    [[deprecated("Use field access instead!")]] ::UnityEngine::Quaternion& dyn_holdingOffsetRotationLeft();
    // Get instance field reference: public UnityEngine.Quaternion holdingOffsetRotationRight
    [[deprecated("Use field access instead!")]] ::UnityEngine::Quaternion& dyn_holdingOffsetRotationRight();
    // Get instance field reference: public UnityEngine.Quaternion chestRotationOffset
