// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Matrix4x4
#include "UnityEngine/Matrix4x4.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: Camera
  class Camera;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: OVRCameraRig
  class OVRCameraRig;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::OVRCameraRig);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::OVRCameraRig*, "", "OVRCameraRig");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x180
  #pragma pack(push, 1)
  // Autogenerated type: OVRCameraRig
  // [TokenAttribute] Offset: FFFFFFFF
  // [HelpURLAttribute] Offset: FFFFFFFF
  // [ExecuteInEditMode] Offset: FFFFFFFF
  class OVRCameraRig : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private UnityEngine.Transform <trackingSpace>k__BackingField
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::Transform* trackingSpace;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform <leftEyeAnchor>k__BackingField
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::Transform* leftEyeAnchor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform <centerEyeAnchor>k__BackingField
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Transform* centerEyeAnchor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform <rightEyeAnchor>k__BackingField
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::Transform* rightEyeAnchor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform <leftHandAnchor>k__BackingField
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::Transform* leftHandAnchor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform <rightHandAnchor>k__BackingField
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::Transform* rightHandAnchor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform <leftHandAnchorDetached>k__BackingField
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::Transform* leftHandAnchorDetached;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform <rightHandAnchorDetached>k__BackingField
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::Transform* rightHandAnchorDetached;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform <leftControllerInHandAnchor>k__BackingField
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::Transform* leftControllerInHandAnchor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform <leftHandOnControllerAnchor>k__BackingField
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::Transform* leftHandOnControllerAnchor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform <rightControllerInHandAnchor>k__BackingField
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::Transform* rightControllerInHandAnchor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform <rightHandOnControllerAnchor>k__BackingField
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::Transform* rightHandOnControllerAnchor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform <leftControllerAnchor>k__BackingField
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::Transform* leftControllerAnchor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform <rightControllerAnchor>k__BackingField
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::Transform* rightControllerAnchor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform <trackerAnchor>k__BackingField
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::Transform* trackerAnchor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private System.Action`1<OVRCameraRig> UpdatedAnchors
    // Size: 0x8
    // Offset: 0x98
    ::System::Action_1<::GlobalNamespace::OVRCameraRig*>* UpdatedAnchors;
    // Field size check
    static_assert(sizeof(::System::Action_1<::GlobalNamespace::OVRCameraRig*>*) == 0x8);
    // private System.Action`1<UnityEngine.Transform> TrackingSpaceChanged
    // Size: 0x8
    // Offset: 0xA0
    ::System::Action_1<::UnityEngine::Transform*>* TrackingSpaceChanged;
    // Field size check
    static_assert(sizeof(::System::Action_1<::UnityEngine::Transform*>*) == 0x8);
    // public System.Boolean usePerEyeCameras
    // Size: 0x1
    // Offset: 0xA8
    bool usePerEyeCameras;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean useFixedUpdateForTracking
    // Size: 0x1
    // Offset: 0xA9
    bool useFixedUpdateForTracking;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean disableEyeAnchorCameras
    // Size: 0x1
    // Offset: 0xAA
    bool disableEyeAnchorCameras;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean _skipUpdate
    // Size: 0x1
    // Offset: 0xAB
    bool skipUpdate;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: skipUpdate and: trackingSpaceName
    char __padding20[0x4] = {};
    // protected readonly System.String trackingSpaceName
    // Size: 0x8
    // Offset: 0xB0
    ::StringW trackingSpaceName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // protected readonly System.String trackerAnchorName
    // Size: 0x8
    // Offset: 0xB8
    ::StringW trackerAnchorName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // protected readonly System.String leftEyeAnchorName
    // Size: 0x8
    // Offset: 0xC0
    ::StringW leftEyeAnchorName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // protected readonly System.String centerEyeAnchorName
    // Size: 0x8
    // Offset: 0xC8
    ::StringW centerEyeAnchorName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // protected readonly System.String rightEyeAnchorName
    // Size: 0x8
    // Offset: 0xD0
    ::StringW rightEyeAnchorName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // protected readonly System.String leftHandAnchorName
    // Size: 0x8
    // Offset: 0xD8
    ::StringW leftHandAnchorName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // protected readonly System.String rightHandAnchorName
    // Size: 0x8
    // Offset: 0xE0
    ::StringW rightHandAnchorName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // protected readonly System.String leftControllerAnchorName
    // Size: 0x8
    // Offset: 0xE8
    ::StringW leftControllerAnchorName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // protected readonly System.String rightControllerAnchorName
    // Size: 0x8
    // Offset: 0xF0
    ::StringW rightControllerAnchorName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // protected readonly System.String leftHandAnchorDetachedName
    // Size: 0x8
    // Offset: 0xF8
    ::StringW leftHandAnchorDetachedName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // protected readonly System.String rightHandAnchorDetachedName
    // Size: 0x8
    // Offset: 0x100
    ::StringW rightHandAnchorDetachedName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // protected readonly System.String leftControllerInHandAnchorName
    // Size: 0x8
    // Offset: 0x108
    ::StringW leftControllerInHandAnchorName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // protected readonly System.String leftHandOnControllerAnchorName
    // Size: 0x8
    // Offset: 0x110
    ::StringW leftHandOnControllerAnchorName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // protected readonly System.String rightControllerInHandAnchorName
    // Size: 0x8
    // Offset: 0x118
    ::StringW rightControllerInHandAnchorName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // protected readonly System.String rightHandOnControllerAnchorName
    // Size: 0x8
    // Offset: 0x120
    ::StringW rightHandOnControllerAnchorName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // protected UnityEngine.Camera _centerEyeCamera
    // Size: 0x8
    // Offset: 0x128
    ::UnityEngine::Camera* centerEyeCamera;
    // Field size check
    static_assert(sizeof(::UnityEngine::Camera*) == 0x8);
    // protected UnityEngine.Camera _leftEyeCamera
    // Size: 0x8
    // Offset: 0x130
    ::UnityEngine::Camera* leftEyeCamera;
    // Field size check
    static_assert(sizeof(::UnityEngine::Camera*) == 0x8);
    // protected UnityEngine.Camera _rightEyeCamera
    // Size: 0x8
    // Offset: 0x138
    ::UnityEngine::Camera* rightEyeCamera;
    // Field size check
    static_assert(sizeof(::UnityEngine::Camera*) == 0x8);
    // private UnityEngine.Matrix4x4 _previousTrackingSpaceTransform
    // Size: 0x40
    // Offset: 0x140
    ::UnityEngine::Matrix4x4 previousTrackingSpaceTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Matrix4x4) == 0x40);
    public:
    // Get instance field reference: private UnityEngine.Transform <trackingSpace>k__BackingField
    [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_$trackingSpace$k__BackingField();
    // Get instance field reference: private UnityEngine.Transform <leftEyeAnchor>k__BackingField
    [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_$leftEyeAnchor$k__BackingField();
    // Get instance field reference: private UnityEngine.Transform <centerEyeAnchor>k__BackingField
    [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_$centerEyeAnchor$k__BackingField();
    // Get instance field reference: private UnityEngine.Transform <rightEyeAnchor>k__BackingField
