// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: OVRDeserialize
#include "GlobalNamespace/OVRDeserialize.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: System.Guid
#include "System/Guid.hpp"
// Including type: OVRPlugin/SpaceStorageLocation
#include "GlobalNamespace/OVRPlugin_SpaceStorageLocation.hpp"
// Completed includes
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::OVRDeserialize::SpaceEraseCompleteData, "", "OVRDeserialize/SpaceEraseCompleteData");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x20
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: OVRDeserialize/SpaceEraseCompleteData
  // [TokenAttribute] Offset: FFFFFFFF
  struct OVRDeserialize::SpaceEraseCompleteData/*, public ::System::ValueType*/ {
    public:
    public:
    // public System.UInt64 RequestId
    // Size: 0x8
    // Offset: 0x0
    uint64_t RequestId;
    // Field size check
    static_assert(sizeof(uint64_t) == 0x8);
    // public System.Int32 Result
    // Size: 0x4
    // Offset: 0x8
    int Result;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Guid Uuid
    // Size: 0x10
    // Offset: 0xC
    ::System::Guid Uuid;
    // Field size check
    static_assert(sizeof(::System::Guid) == 0x10);
    // public OVRPlugin/SpaceStorageLocation Location
    // Size: 0x4
    // Offset: 0x1C
    ::GlobalNamespace::OVRPlugin::SpaceStorageLocation Location;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRPlugin::SpaceStorageLocation) == 0x4);
    public:
    // Creating value type constructor for type: SpaceEraseCompleteData
    constexpr SpaceEraseCompleteData(uint64_t RequestId_ = {}, int Result_ = {}, ::System::Guid Uuid_ = {}, ::GlobalNamespace::OVRPlugin::SpaceStorageLocation Location_ = {}) noexcept : RequestId{RequestId_}, Result{Result_}, Uuid{Uuid_}, Location{Location_} {}
    // Creating interface conversion operator: operator ::System::ValueType
    operator ::System::ValueType() noexcept {
      return *reinterpret_cast<::System::ValueType*>(this);
    }
    // Get instance field reference: public System.UInt64 RequestId
    [[deprecated("Use field access instead!")]] uint64_t& dyn_RequestId();
    // Get instance field reference: public System.Int32 Result
    [[deprecated("Use field access instead!")]] int& dyn_Result();
    // Get instance field reference: public System.Guid Uuid
    [[deprecated("Use field access instead!")]] ::System::Guid& dyn_Uuid();
    // Get instance field reference: public OVRPlugin/SpaceStorageLocation Location
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::OVRPlugin::SpaceStorageLocation& dyn_Location();
  }; // OVRDeserialize/SpaceEraseCompleteData
  #pragma pack(pop)
  static check_size<sizeof(OVRDeserialize::SpaceEraseCompleteData), 28 + sizeof(::GlobalNamespace::OVRPlugin::SpaceStorageLocation)> __GlobalNamespace_OVRDeserialize_SpaceEraseCompleteDataSizeCheck;
  static_assert(sizeof(OVRDeserialize::SpaceEraseCompleteData) == 0x20);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
