// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: OVRGLTFInputNode
#include "GlobalNamespace/OVRGLTFInputNode.hpp"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: OVRGLTFAnimatinonNode
  class OVRGLTFAnimatinonNode;
  // Forward declaring type: OVRGLTFAnimationNodeMorphTargetHandler
  class OVRGLTFAnimationNodeMorphTargetHandler;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: OVRGLTFScene
  struct OVRGLTFScene;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::OVRGLTFScene, "", "OVRGLTFScene");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x28
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: OVRGLTFScene
  // [TokenAttribute] Offset: FFFFFFFF
  struct OVRGLTFScene/*, public ::System::ValueType*/ {
    public:
    public:
    // public UnityEngine.GameObject root
    // Size: 0x8
    // Offset: 0x0
    ::UnityEngine::GameObject* root;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public System.Collections.Generic.List`1<UnityEngine.GameObject> nodes
    // Size: 0x8
    // Offset: 0x8
    ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>* nodes;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*) == 0x8);
    // public System.Collections.Generic.Dictionary`2<OVRGLTFInputNode,OVRGLTFAnimatinonNode> animationNodes
    // Size: 0x8
    // Offset: 0x10
    ::System::Collections::Generic::Dictionary_2<::GlobalNamespace::OVRGLTFInputNode, ::GlobalNamespace::OVRGLTFAnimatinonNode*>* animationNodes;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::GlobalNamespace::OVRGLTFInputNode, ::GlobalNamespace::OVRGLTFAnimatinonNode*>*) == 0x8);
    // public System.Collections.Generic.Dictionary`2<System.Int32,OVRGLTFAnimatinonNode[]> animationNodeLookup
    // Size: 0x8
    // Offset: 0x18
    ::System::Collections::Generic::Dictionary_2<int, ::ArrayW<::GlobalNamespace::OVRGLTFAnimatinonNode*>>* animationNodeLookup;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<int, ::ArrayW<::GlobalNamespace::OVRGLTFAnimatinonNode*>>*) == 0x8);
    // public System.Collections.Generic.List`1<OVRGLTFAnimationNodeMorphTargetHandler> morphTargetHandlers
    // Size: 0x8
    // Offset: 0x20
    ::System::Collections::Generic::List_1<::GlobalNamespace::OVRGLTFAnimationNodeMorphTargetHandler*>* morphTargetHandlers;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GlobalNamespace::OVRGLTFAnimationNodeMorphTargetHandler*>*) == 0x8);
    public:
    // Creating value type constructor for type: OVRGLTFScene
    constexpr OVRGLTFScene(::UnityEngine::GameObject* root_ = {}, ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>* nodes_ = {}, ::System::Collections::Generic::Dictionary_2<::GlobalNamespace::OVRGLTFInputNode, ::GlobalNamespace::OVRGLTFAnimatinonNode*>* animationNodes_ = {}, ::System::Collections::Generic::Dictionary_2<int, ::ArrayW<::GlobalNamespace::OVRGLTFAnimatinonNode*>>* animationNodeLookup_ = {}, ::System::Collections::Generic::List_1<::GlobalNamespace::OVRGLTFAnimationNodeMorphTargetHandler*>* morphTargetHandlers_ = {}) noexcept : root{root_}, nodes{nodes_}, animationNodes{animationNodes_}, animationNodeLookup{animationNodeLookup_}, morphTargetHandlers{morphTargetHandlers_} {}
    // Creating interface conversion operator: operator ::System::ValueType
    operator ::System::ValueType() noexcept {
      return *reinterpret_cast<::System::ValueType*>(this);
    }
    // Get instance field reference: public UnityEngine.GameObject root
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_root();
    // Get instance field reference: public System.Collections.Generic.List`1<UnityEngine.GameObject> nodes
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*& dyn_nodes();
    // Get instance field reference: public System.Collections.Generic.Dictionary`2<OVRGLTFInputNode,OVRGLTFAnimatinonNode> animationNodes
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::Dictionary_2<::GlobalNamespace::OVRGLTFInputNode, ::GlobalNamespace::OVRGLTFAnimatinonNode*>*& dyn_animationNodes();
    // Get instance field reference: public System.Collections.Generic.Dictionary`2<System.Int32,OVRGLTFAnimatinonNode[]> animationNodeLookup
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::Dictionary_2<int, ::ArrayW<::GlobalNamespace::OVRGLTFAnimatinonNode*>>*& dyn_animationNodeLookup();
    // Get instance field reference: public System.Collections.Generic.List`1<OVRGLTFAnimationNodeMorphTargetHandler> morphTargetHandlers
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::GlobalNamespace::OVRGLTFAnimationNodeMorphTargetHandler*>*& dyn_morphTargetHandlers();
  }; // OVRGLTFScene
  #pragma pack(pop)
  static check_size<sizeof(OVRGLTFScene), 32 + sizeof(::System::Collections::Generic::List_1<::GlobalNamespace::OVRGLTFAnimationNodeMorphTargetHandler*>*)> __GlobalNamespace_OVRGLTFSceneSizeCheck;
  static_assert(sizeof(OVRGLTFScene) == 0x28);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
