// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: OVRGLTFInputNode
#include "GlobalNamespace/OVRGLTFInputNode.hpp"
// Including type: OVRBinaryChunk
#include "GlobalNamespace/OVRBinaryChunk.hpp"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
// Including type: UnityEngine.Quaternion
#include "UnityEngine/Quaternion.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: OVRGLTFAnimationNodeMorphTargetHandler
  class OVRGLTFAnimationNodeMorphTargetHandler;
}
// Forward declaring namespace: OVRSimpleJSON
namespace OVRSimpleJSON {
  // Forward declaring type: JSONNode
  class JSONNode;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Tuple`2<T1, T2>
  template<typename T1, typename T2>
  class Tuple_2;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: OVRGLTFAnimatinonNode
  class OVRGLTFAnimatinonNode;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::OVRGLTFAnimatinonNode);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::OVRGLTFAnimatinonNode*, "", "OVRGLTFAnimatinonNode");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x7C
  #pragma pack(push, 1)
  // Autogenerated type: OVRGLTFAnimatinonNode
  // [TokenAttribute] Offset: FFFFFFFF
  class OVRGLTFAnimatinonNode : public ::Il2CppObject {
    public:
    // Nested type: ::GlobalNamespace::OVRGLTFAnimatinonNode::ThumbstickDirection
    struct ThumbstickDirection;
    // Nested type: ::GlobalNamespace::OVRGLTFAnimatinonNode::OVRGLTFTransformType
    struct OVRGLTFTransformType;
    // Nested type: ::GlobalNamespace::OVRGLTFAnimatinonNode::OVRInterpolationType
    struct OVRInterpolationType;
    // Nested type: ::GlobalNamespace::OVRGLTFAnimatinonNode::InputNodeState
    struct InputNodeState;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: OVRGLTFAnimatinonNode/ThumbstickDirection
    // [TokenAttribute] Offset: FFFFFFFF
    struct ThumbstickDirection/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: ThumbstickDirection
      constexpr ThumbstickDirection(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public OVRGLTFAnimatinonNode/ThumbstickDirection None
      static constexpr const int None = 0;
      // Get static field: static public OVRGLTFAnimatinonNode/ThumbstickDirection None
      static ::GlobalNamespace::OVRGLTFAnimatinonNode::ThumbstickDirection _get_None();
      // Set static field: static public OVRGLTFAnimatinonNode/ThumbstickDirection None
      static void _set_None(::GlobalNamespace::OVRGLTFAnimatinonNode::ThumbstickDirection value);
      // static field const value: static public OVRGLTFAnimatinonNode/ThumbstickDirection North
      static constexpr const int North = 1;
      // Get static field: static public OVRGLTFAnimatinonNode/ThumbstickDirection North
      static ::GlobalNamespace::OVRGLTFAnimatinonNode::ThumbstickDirection _get_North();
      // Set static field: static public OVRGLTFAnimatinonNode/ThumbstickDirection North
      static void _set_North(::GlobalNamespace::OVRGLTFAnimatinonNode::ThumbstickDirection value);
      // static field const value: static public OVRGLTFAnimatinonNode/ThumbstickDirection NorthEast
      static constexpr const int NorthEast = 2;
      // Get static field: static public OVRGLTFAnimatinonNode/ThumbstickDirection NorthEast
      static ::GlobalNamespace::OVRGLTFAnimatinonNode::ThumbstickDirection _get_NorthEast();
      // Set static field: static public OVRGLTFAnimatinonNode/ThumbstickDirection NorthEast
      static void _set_NorthEast(::GlobalNamespace::OVRGLTFAnimatinonNode::ThumbstickDirection value);
      // static field const value: static public OVRGLTFAnimatinonNode/ThumbstickDirection East
      static constexpr const int East = 3;
      // Get static field: static public OVRGLTFAnimatinonNode/ThumbstickDirection East
      static ::GlobalNamespace::OVRGLTFAnimatinonNode::ThumbstickDirection _get_East();
      // Set static field: static public OVRGLTFAnimatinonNode/ThumbstickDirection East
      static void _set_East(::GlobalNamespace::OVRGLTFAnimatinonNode::ThumbstickDirection value);
      // static field const value: static public OVRGLTFAnimatinonNode/ThumbstickDirection SouthEast
      static constexpr const int SouthEast = 4;
      // Get static field: static public OVRGLTFAnimatinonNode/ThumbstickDirection SouthEast
      static ::GlobalNamespace::OVRGLTFAnimatinonNode::ThumbstickDirection _get_SouthEast();
      // Set static field: static public OVRGLTFAnimatinonNode/ThumbstickDirection SouthEast
      static void _set_SouthEast(::GlobalNamespace::OVRGLTFAnimatinonNode::ThumbstickDirection value);
      // static field const value: static public OVRGLTFAnimatinonNode/ThumbstickDirection South
      static constexpr const int South = 5;
      // Get static field: static public OVRGLTFAnimatinonNode/ThumbstickDirection South
      static ::GlobalNamespace::OVRGLTFAnimatinonNode::ThumbstickDirection _get_South();
      // Set static field: static public OVRGLTFAnimatinonNode/ThumbstickDirection South
      static void _set_South(::GlobalNamespace::OVRGLTFAnimatinonNode::ThumbstickDirection value);
      // static field const value: static public OVRGLTFAnimatinonNode/ThumbstickDirection SouthWest
      static constexpr const int SouthWest = 6;
      // Get static field: static public OVRGLTFAnimatinonNode/ThumbstickDirection SouthWest
      static ::GlobalNamespace::OVRGLTFAnimatinonNode::ThumbstickDirection _get_SouthWest();
      // Set static field: static public OVRGLTFAnimatinonNode/ThumbstickDirection SouthWest
      static void _set_SouthWest(::GlobalNamespace::OVRGLTFAnimatinonNode::ThumbstickDirection value);
      // static field const value: static public OVRGLTFAnimatinonNode/ThumbstickDirection West
      static constexpr const int West = 7;
      // Get static field: static public OVRGLTFAnimatinonNode/ThumbstickDirection West
      static ::GlobalNamespace::OVRGLTFAnimatinonNode::ThumbstickDirection _get_West();
      // Set static field: static public OVRGLTFAnimatinonNode/ThumbstickDirection West
      static void _set_West(::GlobalNamespace::OVRGLTFAnimatinonNode::ThumbstickDirection value);
      // static field const value: static public OVRGLTFAnimatinonNode/ThumbstickDirection NorthWest
      static constexpr const int NorthWest = 8;
      // Get static field: static public OVRGLTFAnimatinonNode/ThumbstickDirection NorthWest
      static ::GlobalNamespace::OVRGLTFAnimatinonNode::ThumbstickDirection _get_NorthWest();
      // Set static field: static public OVRGLTFAnimatinonNode/ThumbstickDirection NorthWest
      static void _set_NorthWest(::GlobalNamespace::OVRGLTFAnimatinonNode::ThumbstickDirection value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // OVRGLTFAnimatinonNode/ThumbstickDirection
    #pragma pack(pop)
    static check_size<sizeof(OVRGLTFAnimatinonNode::ThumbstickDirection), 0 + sizeof(int)> __GlobalNamespace_OVRGLTFAnimatinonNode_ThumbstickDirectionSizeCheck;
    static_assert(sizeof(OVRGLTFAnimatinonNode::ThumbstickDirection) == 0x4);
    // Size: 0x10
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: OVRGLTFAnimatinonNode/InputNodeState
    // [TokenAttribute] Offset: FFFFFFFF
    struct InputNodeState/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.Boolean down
      // Size: 0x1
      // Offset: 0x0
      bool down;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // Padding between fields: down and: t
      char __padding0[0x3] = {};
      // public System.Single t
      // Size: 0x4
      // Offset: 0x4
      float t;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public UnityEngine.Vector2 vecT
      // Size: 0x8
      // Offset: 0x8
      ::UnityEngine::Vector2 vecT;
      // Field size check
      static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
      public:
      // Creating value type constructor for type: InputNodeState
      constexpr InputNodeState(bool down_ = {}, float t_ = {}, ::UnityEngine::Vector2 vecT_ = {}) noexcept : down{down_}, t{t_}, vecT{vecT_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public System.Boolean down
      [[deprecated("Use field access instead!")]] bool& dyn_down();
      // Get instance field reference: public System.Single t
      [[deprecated("Use field access instead!")]] float& dyn_t();
      // Get instance field reference: public UnityEngine.Vector2 vecT
      [[deprecated("Use field access instead!")]] ::UnityEngine::Vector2& dyn_vecT();
    }; // OVRGLTFAnimatinonNode/InputNodeState
    #pragma pack(pop)
    static check_size<sizeof(OVRGLTFAnimatinonNode::InputNodeState), 8 + sizeof(::UnityEngine::Vector2)> __GlobalNamespace_OVRGLTFAnimatinonNode_InputNodeStateSizeCheck;
    static_assert(sizeof(OVRGLTFAnimatinonNode::InputNodeState) == 0x10);
    public:
    // private OVRGLTFInputNode m_intputNodeType
    // Size: 0x4
    // Offset: 0x10
    ::GlobalNamespace::OVRGLTFInputNode m_intputNodeType;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRGLTFInputNode) == 0x4);
    // Padding between fields: m_intputNodeType and: m_jsonData
    char __padding0[0x4] = {};
    // private OVRSimpleJSON.JSONNode m_jsonData
    // Size: 0x8
    // Offset: 0x18
    ::OVRSimpleJSON::JSONNode* m_jsonData;
    // Field size check
    static_assert(sizeof(::OVRSimpleJSON::JSONNode*) == 0x8);
    // private OVRBinaryChunk m_binaryChunk
    // Size: 0x18
    // Offset: 0x20
    ::GlobalNamespace::OVRBinaryChunk m_binaryChunk;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRBinaryChunk) == 0x18);
    // private UnityEngine.GameObject m_gameObj
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::GameObject* m_gameObj;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private OVRGLTFAnimatinonNode/InputNodeState m_inputNodeState
    // Size: 0x10
    // Offset: 0x40
    ::GlobalNamespace::OVRGLTFAnimatinonNode::InputNodeState m_inputNodeState;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRGLTFAnimatinonNode::InputNodeState) == 0x10);
    // private OVRGLTFAnimationNodeMorphTargetHandler m_morphTargetHandler
    // Size: 0x8
    // Offset: 0x50
    ::GlobalNamespace::OVRGLTFAnimationNodeMorphTargetHandler* m_morphTargetHandler;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRGLTFAnimationNodeMorphTargetHandler*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.Vector3> m_translations
    // Size: 0x8
    // Offset: 0x58
    ::System::Collections::Generic::List_1<::UnityEngine::Vector3>* m_translations;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Vector3>*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.Quaternion> m_rotations
    // Size: 0x8
    // Offset: 0x60
    ::System::Collections::Generic::List_1<::UnityEngine::Quaternion>* m_rotations;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Quaternion>*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.Vector3> m_scales
    // Size: 0x8
    // Offset: 0x68
    ::System::Collections::Generic::List_1<::UnityEngine::Vector3>* m_scales;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Vector3>*) == 0x8);
    // private System.Collections.Generic.List`1<System.Single> m_weights
    // Size: 0x8
    // Offset: 0x70
    ::System::Collections::Generic::List_1<float>* m_weights;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<float>*) == 0x8);
    // private System.Int32 m_additiveWeightIndex
    // Size: 0x4
    // Offset: 0x78
    int m_additiveWeightIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Get static field: static private System.Collections.Generic.Dictionary`2<OVRGLTFInputNode,System.Int32> InputNodeKeyFrames
    static ::System::Collections::Generic::Dictionary_2<::GlobalNamespace::OVRGLTFInputNode, int>* _get_InputNodeKeyFrames();
    // Set static field: static private System.Collections.Generic.Dictionary`2<OVRGLTFInputNode,System.Int32> InputNodeKeyFrames
    static void _set_InputNodeKeyFrames(::System::Collections::Generic::Dictionary_2<::GlobalNamespace::OVRGLTFInputNode, int>* value);
    // Get static field: static private System.Collections.Generic.List`1<System.Int32> ThumbStickKeyFrames
    static ::System::Collections::Generic::List_1<int>* _get_ThumbStickKeyFrames();
    // Set static field: static private System.Collections.Generic.List`1<System.Int32> ThumbStickKeyFrames
