// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: OVRBinaryChunk
#include "GlobalNamespace/OVRBinaryChunk.hpp"
// Including type: OVRGLTFInputNode
#include "GlobalNamespace/OVRGLTFInputNode.hpp"
// Including type: OVRTextureQualityFiltering
#include "GlobalNamespace/OVRTextureQualityFiltering.hpp"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
// Including type: UnityEngine.Vector4
#include "UnityEngine/Vector4.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: OVRGLTFAnimatinonNode
  class OVRGLTFAnimatinonNode;
  // Forward declaring type: OVRGLTFAnimationNodeMorphTargetHandler
  class OVRGLTFAnimationNodeMorphTargetHandler;
  // Forward declaring type: OVRGLTFScene
  struct OVRGLTFScene;
  // Forward declaring type: OVRChunkType
  struct OVRChunkType;
  // Forward declaring type: OVRMeshData
  struct OVRMeshData;
  // Forward declaring type: OVRMeshAttributes
  struct OVRMeshAttributes;
  // Forward declaring type: OVRMaterialData
  struct OVRMaterialData;
  // Forward declaring type: OVRTextureData
  struct OVRTextureData;
}
// Forward declaring namespace: OVRSimpleJSON
namespace OVRSimpleJSON {
  // Forward declaring type: JSONNode
  class JSONNode;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: Stream
  class Stream;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Shader
  class Shader;
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: Texture2D
  class Texture2D;
  // Forward declaring type: SkinnedMeshRenderer
  class SkinnedMeshRenderer;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Func`3<T1, T2, TResult>
  template<typename T1, typename T2, typename TResult>
  class Func_3;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: OVRGLTFLoader
  class OVRGLTFLoader;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::OVRGLTFLoader);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::OVRGLTFLoader*, "", "OVRGLTFLoader");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x78
  #pragma pack(push, 1)
  // Autogenerated type: OVRGLTFLoader
  // [TokenAttribute] Offset: FFFFFFFF
  class OVRGLTFLoader : public ::Il2CppObject {
    public:
    // Nested type: ::GlobalNamespace::OVRGLTFLoader::$$c__DisplayClass30_0
    class $$c__DisplayClass30_0;
    public:
    // private OVRSimpleJSON.JSONNode m_jsonData
    // Size: 0x8
    // Offset: 0x10
    ::OVRSimpleJSON::JSONNode* m_jsonData;
    // Field size check
    static_assert(sizeof(::OVRSimpleJSON::JSONNode*) == 0x8);
    // private System.IO.Stream m_glbStream
    // Size: 0x8
    // Offset: 0x18
    ::System::IO::Stream* m_glbStream;
    // Field size check
    static_assert(sizeof(::System::IO::Stream*) == 0x8);
    // private OVRBinaryChunk m_binaryChunk
    // Size: 0x18
    // Offset: 0x20
    ::GlobalNamespace::OVRBinaryChunk m_binaryChunk;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRBinaryChunk) == 0x18);
    // private System.Collections.Generic.List`1<UnityEngine.GameObject> m_Nodes
    // Size: 0x8
    // Offset: 0x38
    ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>* m_Nodes;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<OVRGLTFInputNode,OVRGLTFAnimatinonNode> m_InputAnimationNodes
    // Size: 0x8
    // Offset: 0x40
    ::System::Collections::Generic::Dictionary_2<::GlobalNamespace::OVRGLTFInputNode, ::GlobalNamespace::OVRGLTFAnimatinonNode*>* m_InputAnimationNodes;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::GlobalNamespace::OVRGLTFInputNode, ::GlobalNamespace::OVRGLTFAnimatinonNode*>*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.Int32,OVRGLTFAnimatinonNode[]> m_AnimationLookup
    // Size: 0x8
    // Offset: 0x48
    ::System::Collections::Generic::Dictionary_2<int, ::ArrayW<::GlobalNamespace::OVRGLTFAnimatinonNode*>>* m_AnimationLookup;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<int, ::ArrayW<::GlobalNamespace::OVRGLTFAnimatinonNode*>>*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.Int32,OVRGLTFAnimationNodeMorphTargetHandler> m_morphTargetHandlers
    // Size: 0x8
    // Offset: 0x50
    ::System::Collections::Generic::Dictionary_2<int, ::GlobalNamespace::OVRGLTFAnimationNodeMorphTargetHandler*>* m_morphTargetHandlers;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<int, ::GlobalNamespace::OVRGLTFAnimationNodeMorphTargetHandler*>*) == 0x8);
    // private UnityEngine.Shader m_Shader
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::Shader* m_Shader;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // private UnityEngine.Shader m_AlphaBlendShader
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::Shader* m_AlphaBlendShader;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // private OVRTextureQualityFiltering m_TextureQuality
    // Size: 0x4
    // Offset: 0x68
    ::GlobalNamespace::OVRTextureQualityFiltering m_TextureQuality;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRTextureQualityFiltering) == 0x4);
    // private System.Single m_TextureMipmapBias
    // Size: 0x4
    // Offset: 0x6C
    float m_TextureMipmapBias;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Func`3<System.String,UnityEngine.Material,UnityEngine.Texture2D> textureUriHandler
    // Size: 0x8
    // Offset: 0x70
    ::System::Func_3<::StringW, ::UnityEngine::Material*, ::UnityEngine::Texture2D*>* textureUriHandler;
    // Field size check
    static_assert(sizeof(::System::Func_3<::StringW, ::UnityEngine::Material*, ::UnityEngine::Texture2D*>*) == 0x8);
    public:
    // Get static field: static public readonly UnityEngine.Vector3 GLTFToUnitySpace
    static ::UnityEngine::Vector3 _get_GLTFToUnitySpace();
    // Set static field: static public readonly UnityEngine.Vector3 GLTFToUnitySpace
    static void _set_GLTFToUnitySpace(::UnityEngine::Vector3 value);
    // Get static field: static public readonly UnityEngine.Vector3 GLTFToUnityTangent
    static ::UnityEngine::Vector3 _get_GLTFToUnityTangent();
    // Set static field: static public readonly UnityEngine.Vector3 GLTFToUnityTangent
    static void _set_GLTFToUnityTangent(::UnityEngine::Vector3 value);
    // Get static field: static public readonly UnityEngine.Vector4 GLTFToUnitySpace_Rotation
