// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: OVRInput/OVRControllerBase
#include "GlobalNamespace/OVRInput_OVRControllerBase.hpp"
// Including type: OVRInput/RawAxis1D
#include "GlobalNamespace/OVRInput_RawAxis1D.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::OVRInput::OVRControllerBase::VirtualAxis1DMap);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::OVRInput::OVRControllerBase::VirtualAxis1DMap*, "", "OVRInput/OVRControllerBase/VirtualAxis1DMap");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x4C
  #pragma pack(push, 1)
  // Autogenerated type: OVRInput/OVRControllerBase/VirtualAxis1DMap
  // [TokenAttribute] Offset: FFFFFFFF
  class OVRInput::OVRControllerBase::VirtualAxis1DMap : public ::Il2CppObject {
    public:
    public:
    // public OVRInput/RawAxis1D None
    // Size: 0x4
    // Offset: 0x10
    ::GlobalNamespace::OVRInput::RawAxis1D None;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRInput::RawAxis1D) == 0x4);
    // public OVRInput/RawAxis1D PrimaryIndexTrigger
    // Size: 0x4
    // Offset: 0x14
    ::GlobalNamespace::OVRInput::RawAxis1D PrimaryIndexTrigger;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRInput::RawAxis1D) == 0x4);
    // public OVRInput/RawAxis1D PrimaryHandTrigger
    // Size: 0x4
    // Offset: 0x18
    ::GlobalNamespace::OVRInput::RawAxis1D PrimaryHandTrigger;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRInput::RawAxis1D) == 0x4);
    // public OVRInput/RawAxis1D SecondaryIndexTrigger
    // Size: 0x4
    // Offset: 0x1C
    ::GlobalNamespace::OVRInput::RawAxis1D SecondaryIndexTrigger;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRInput::RawAxis1D) == 0x4);
    // public OVRInput/RawAxis1D SecondaryHandTrigger
    // Size: 0x4
    // Offset: 0x20
    ::GlobalNamespace::OVRInput::RawAxis1D SecondaryHandTrigger;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRInput::RawAxis1D) == 0x4);
    // public OVRInput/RawAxis1D PrimaryIndexTriggerCurl
    // Size: 0x4
    // Offset: 0x24
    ::GlobalNamespace::OVRInput::RawAxis1D PrimaryIndexTriggerCurl;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRInput::RawAxis1D) == 0x4);
    // public OVRInput/RawAxis1D PrimaryIndexTriggerSlide
    // Size: 0x4
    // Offset: 0x28
    ::GlobalNamespace::OVRInput::RawAxis1D PrimaryIndexTriggerSlide;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRInput::RawAxis1D) == 0x4);
    // public OVRInput/RawAxis1D PrimaryThumbRestForce
    // Size: 0x4
    // Offset: 0x2C
    ::GlobalNamespace::OVRInput::RawAxis1D PrimaryThumbRestForce;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRInput::RawAxis1D) == 0x4);
    // public OVRInput/RawAxis1D PrimaryStylusForce
    // Size: 0x4
    // Offset: 0x30
    ::GlobalNamespace::OVRInput::RawAxis1D PrimaryStylusForce;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRInput::RawAxis1D) == 0x4);
    // public OVRInput/RawAxis1D SecondaryIndexTriggerCurl
    // Size: 0x4
    // Offset: 0x34
    ::GlobalNamespace::OVRInput::RawAxis1D SecondaryIndexTriggerCurl;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRInput::RawAxis1D) == 0x4);
    // public OVRInput/RawAxis1D SecondaryIndexTriggerSlide
    // Size: 0x4
    // Offset: 0x38
    ::GlobalNamespace::OVRInput::RawAxis1D SecondaryIndexTriggerSlide;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRInput::RawAxis1D) == 0x4);
    // public OVRInput/RawAxis1D SecondaryThumbRestForce
    // Size: 0x4
    // Offset: 0x3C
    ::GlobalNamespace::OVRInput::RawAxis1D SecondaryThumbRestForce;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRInput::RawAxis1D) == 0x4);
    // public OVRInput/RawAxis1D SecondaryStylusForce
    // Size: 0x4
    // Offset: 0x40
    ::GlobalNamespace::OVRInput::RawAxis1D SecondaryStylusForce;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRInput::RawAxis1D) == 0x4);
    // public OVRInput/RawAxis1D PrimaryIndexTriggerForce
    // Size: 0x4
    // Offset: 0x44
    ::GlobalNamespace::OVRInput::RawAxis1D PrimaryIndexTriggerForce;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRInput::RawAxis1D) == 0x4);
    // public OVRInput/RawAxis1D SecondaryIndexTriggerForce
    // Size: 0x4
    // Offset: 0x48
    ::GlobalNamespace::OVRInput::RawAxis1D SecondaryIndexTriggerForce;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRInput::RawAxis1D) == 0x4);
    public:
    // Get instance field reference: public OVRInput/RawAxis1D None
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::OVRInput::RawAxis1D& dyn_None();
    // Get instance field reference: public OVRInput/RawAxis1D PrimaryIndexTrigger
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::OVRInput::RawAxis1D& dyn_PrimaryIndexTrigger();
    // Get instance field reference: public OVRInput/RawAxis1D PrimaryHandTrigger
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::OVRInput::RawAxis1D& dyn_PrimaryHandTrigger();
    // Get instance field reference: public OVRInput/RawAxis1D SecondaryIndexTrigger
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::OVRInput::RawAxis1D& dyn_SecondaryIndexTrigger();
    // Get instance field reference: public OVRInput/RawAxis1D SecondaryHandTrigger
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::OVRInput::RawAxis1D& dyn_SecondaryHandTrigger();
    // Get instance field reference: public OVRInput/RawAxis1D PrimaryIndexTriggerCurl
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::OVRInput::RawAxis1D& dyn_PrimaryIndexTriggerCurl();
    // Get instance field reference: public OVRInput/RawAxis1D PrimaryIndexTriggerSlide
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::OVRInput::RawAxis1D& dyn_PrimaryIndexTriggerSlide();
    // Get instance field reference: public OVRInput/RawAxis1D PrimaryThumbRestForce
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::OVRInput::RawAxis1D& dyn_PrimaryThumbRestForce();
    // Get instance field reference: public OVRInput/RawAxis1D PrimaryStylusForce
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::OVRInput::RawAxis1D& dyn_PrimaryStylusForce();
    // Get instance field reference: public OVRInput/RawAxis1D SecondaryIndexTriggerCurl
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::OVRInput::RawAxis1D& dyn_SecondaryIndexTriggerCurl();
    // Get instance field reference: public OVRInput/RawAxis1D SecondaryIndexTriggerSlide
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::OVRInput::RawAxis1D& dyn_SecondaryIndexTriggerSlide();
    // Get instance field reference: public OVRInput/RawAxis1D SecondaryThumbRestForce
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::OVRInput::RawAxis1D& dyn_SecondaryThumbRestForce();
    // Get instance field reference: public OVRInput/RawAxis1D SecondaryStylusForce
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::OVRInput::RawAxis1D& dyn_SecondaryStylusForce();
    // Get instance field reference: public OVRInput/RawAxis1D PrimaryIndexTriggerForce
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::OVRInput::RawAxis1D& dyn_PrimaryIndexTriggerForce();
    // Get instance field reference: public OVRInput/RawAxis1D SecondaryIndexTriggerForce
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::OVRInput::RawAxis1D& dyn_SecondaryIndexTriggerForce();
    // public OVRInput/RawAxis1D ToRawMask(OVRInput/Axis1D virtualMask)
    // Offset: 0x48D34B0
    ::GlobalNamespace::OVRInput::RawAxis1D ToRawMask(::GlobalNamespace::OVRInput::Axis1D virtualMask);
    // public System.Void .ctor()
    // Offset: 0x48D2420
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static OVRInput::OVRControllerBase::VirtualAxis1DMap* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::GlobalNamespace::OVRInput::OVRControllerBase::VirtualAxis1DMap::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<OVRInput::OVRControllerBase::VirtualAxis1DMap*, creationType>()));
    }
  }; // OVRInput/OVRControllerBase/VirtualAxis1DMap
  #pragma pack(pop)
  static check_size<sizeof(OVRInput::OVRControllerBase::VirtualAxis1DMap), 72 + sizeof(::GlobalNamespace::OVRInput::RawAxis1D)> __GlobalNamespace_OVRInput_OVRControllerBase_VirtualAxis1DMapSizeCheck;
  static_assert(sizeof(OVRInput::OVRControllerBase::VirtualAxis1DMap) == 0x4C);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: GlobalNamespace::OVRInput::OVRControllerBase::VirtualAxis1DMap::ToRawMask
// Il2CppName: ToRawMask
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::GlobalNamespace::OVRInput::RawAxis1D (GlobalNamespace::OVRInput::OVRControllerBase::VirtualAxis1DMap::*)(::GlobalNamespace::OVRInput::Axis1D)>(&GlobalNamespace::OVRInput::OVRControllerBase::VirtualAxis1DMap::ToRawMask)> {
  static const MethodInfo* get() {
    static auto* virtualMask = &::il2cpp_utils::GetClassFromName("", "OVRInput/Axis1D")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::OVRInput::OVRControllerBase::VirtualAxis1DMap*), "ToRawMask", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{virtualMask});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::OVRInput::OVRControllerBase::VirtualAxis1DMap::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
