// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: OVRMixedRealityCaptureConfiguration
#include "GlobalNamespace/OVRMixedRealityCaptureConfiguration.hpp"
// Including type: OVRPlugin/LayerSharpenType
#include "GlobalNamespace/OVRPlugin_LayerSharpenType.hpp"
// Including type: OVRManager/ColorSpace
#include "GlobalNamespace/OVRManager_ColorSpace.hpp"
// Including type: OVRManager/CompositionMethod
#include "GlobalNamespace/OVRManager_CompositionMethod.hpp"
// Including type: UnityEngine.LayerMask
#include "UnityEngine/LayerMask.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: OVRManager/CameraDevice
#include "GlobalNamespace/OVRManager_CameraDevice.hpp"
// Including type: OVRManager/DepthQuality
#include "GlobalNamespace/OVRManager_DepthQuality.hpp"
// Including type: OVRManager/VirtualGreenScreenType
#include "GlobalNamespace/OVRManager_VirtualGreenScreenType.hpp"
// Including type: OVRManager/MrcActivationMode
#include "GlobalNamespace/OVRManager_MrcActivationMode.hpp"
// Including type: OVRManager/TrackingOrigin
#include "GlobalNamespace/OVRManager_TrackingOrigin.hpp"

  // Forward declaring type: EventListener
  class OVRManager_EventListener;
  // Forward declaring type: OVRDisplay
  class OVRDisplay;
  // Forward declaring type: OVRTracker
  class OVRTracker;
  // Forward declaring type: OVRBoundary
  class OVRBoundary;
  // Forward declaring type: OVRRuntimeSettings
  class OVRRuntimeSettings;
  // Forward declaring type: OVRProfile
  class OVRProfile;
  // Forward declaring type: OVRMixedRealityCaptureSettings
  class OVRMixedRealityCaptureSettings;
  // Forward declaring type: Observable`1<T>
  template<typename T>
  class OVRManager_Observable_1;
  // Forward declaring type: PassthroughCapabilities
  class OVRManager_PassthroughCapabilities;
  // Forward declaring type: XrApi
  struct OVRManager_XrApi;
  // Forward declaring type: ProcessorPerformanceLevel
  struct OVRManager_ProcessorPerformanceLevel;
  // Forward declaring type: EyeTextureFormat
  struct OVRManager_EyeTextureFormat;
  // Forward declaring type: FoveatedRenderingLevel
  struct OVRManager_FoveatedRenderingLevel;
  // Forward declaring type: FixedFoveatedRenderingLevel
  struct OVRManager_FixedFoveatedRenderingLevel;
  // Forward declaring type: TiledMultiResLevel
  struct OVRManager_TiledMultiResLevel;
  // Forward declaring type: SystemHeadsetType
  struct OVRManager_SystemHeadsetType;
  // Forward declaring type: OVRPose
  struct OVRPose;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
  // Forward declaring type: Action`4<T1, T2, T3, T4>
  template<typename T1, typename T2, typename T3, typename T4>
  class Action_4;
  // Forward declaring type: Action`6<T1, T2, T3, T4, T5, T6>
  template<typename T1, typename T2, typename T3, typename T4, typename T5, typename T6>
  class Action_6;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: WeakReference`1<T>
  template<typename T>
  class WeakReference_1;
  // Forward declaring type: Version
  class Version;
}
// Forward declaring namespace: UnityEngine::XR
namespace UnityEngine::XR {
  // Forward declaring type: XRDisplaySubsystem
  class XRDisplaySubsystem;
  // Forward declaring type: XRDisplaySubsystemDescriptor
  class XRDisplaySubsystemDescriptor;
  // Forward declaring type: XRInputSubsystem
  class XRInputSubsystem;
  // Forward declaring type: XRNode
  struct XRNode;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: OVRManager
  class OVRManager;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::OVRManager);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::OVRManager*, "", "OVRManager");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x128
  #pragma pack(push, 1)
  // Autogenerated type: OVRManager
  // [TokenAttribute] Offset: FFFFFFFF
  // [HelpURLAttribute] Offset: FFFFFFFF
  class OVRManager : public ::UnityEngine::MonoBehaviour/*, public ::GlobalNamespace::OVRMixedRealityCaptureConfiguration*/ {
    public:
    public:
    // private System.Collections.Generic.IEnumerable`1<UnityEngine.Camera> disabledCameras
    // Size: 0x8
    // Offset: 0x20
    ::System::Collections::Generic::IEnumerable_1<::UnityEngine::Camera*>* disabledCameras;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::IEnumerable_1<::UnityEngine::Camera*>*) == 0x8);
    // private System.Single prevTimeScale
    // Size: 0x4
    // Offset: 0x28
    float prevTimeScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean useRecommendedMSAALevel
    // Size: 0x1
    // Offset: 0x2C
    bool useRecommendedMSAALevel;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _monoscopic
    // Size: 0x1
    // Offset: 0x2D
    bool monoscopic;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: monoscopic and: sharpenType
    char __padding3[0x2] = {};
    // private OVRPlugin/LayerSharpenType _sharpenType
    // Size: 0x4
    // Offset: 0x30
    ::GlobalNamespace::OVRPlugin::LayerSharpenType sharpenType;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRPlugin::LayerSharpenType) == 0x4);
    // private OVRManager/ColorSpace _colorGamut
    // Size: 0x4
    // Offset: 0x34
    ::GlobalNamespace::OVRManager_ColorSpace colorGamut;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRManager_ColorSpace) == 0x4);
    // public System.Boolean enableDynamicResolution
    // Size: 0x1
    // Offset: 0x38
    bool enableDynamicResolution;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: enableDynamicResolution and: minDynamicResolutionScale
    char __padding6[0x3] = {};
    // public System.Single minDynamicResolutionScale
    // Size: 0x4
    // Offset: 0x3C
    float minDynamicResolutionScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single maxDynamicResolutionScale
    // Size: 0x4
    // Offset: 0x40
    float maxDynamicResolutionScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single minRenderScale
    // Size: 0x4
    // Offset: 0x44
    float minRenderScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single maxRenderScale
    // Size: 0x4
    // Offset: 0x48
    float maxRenderScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector3 _headPoseRelativeOffsetRotation
    // Size: 0xC
    // Offset: 0x4C
    ::UnityEngine::Vector3 headPoseRelativeOffsetRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 _headPoseRelativeOffsetTranslation
    // Size: 0xC
    // Offset: 0x58
    ::UnityEngine::Vector3 headPoseRelativeOffsetTranslation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public System.Int32 profilerTcpPort
    // Size: 0x4
    // Offset: 0x64
    int profilerTcpPort;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Boolean expandMixedRealityCapturePropertySheet
    // Size: 0x1
    // Offset: 0x68
    bool expandMixedRealityCapturePropertySheet;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean enableMixedReality
    // Size: 0x1
    // Offset: 0x69
    bool enableMixedReality;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: enableMixedReality and: compositionMethod
    char __padding15[0x2] = {};
    // public OVRManager/CompositionMethod compositionMethod
    // Size: 0x4
    // Offset: 0x6C
    ::GlobalNamespace::OVRManager_CompositionMethod compositionMethod;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRManager_CompositionMethod) == 0x4);
    // public UnityEngine.LayerMask extraHiddenLayers
    // Size: 0x4
    // Offset: 0x70
    ::UnityEngine::LayerMask extraHiddenLayers;
    // Field size check
    static_assert(sizeof(::UnityEngine::LayerMask) == 0x4);
    // public UnityEngine.LayerMask extraVisibleLayers
    // Size: 0x4
    // Offset: 0x74
    ::UnityEngine::LayerMask extraVisibleLayers;
    // Field size check
    static_assert(sizeof(::UnityEngine::LayerMask) == 0x4);
    // public System.Boolean dynamicCullingMask
    // Size: 0x1
    // Offset: 0x78
    bool dynamicCullingMask;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: dynamicCullingMask and: externalCompositionBackdropColorRift
    char __padding19[0x3] = {};
    // public UnityEngine.Color externalCompositionBackdropColorRift
    // Size: 0x10
    // Offset: 0x7C
    ::UnityEngine::Color externalCompositionBackdropColorRift;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // public UnityEngine.Color externalCompositionBackdropColorQuest
    // Size: 0x10
    // Offset: 0x8C
    ::UnityEngine::Color externalCompositionBackdropColorQuest;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // public OVRManager/CameraDevice capturingCameraDevice
    // Size: 0x4
    // Offset: 0x9C
    ::GlobalNamespace::OVRManager_CameraDevice capturingCameraDevice;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRManager_CameraDevice) == 0x4);
    // public System.Boolean flipCameraFrameHorizontally
    // Size: 0x1
    // Offset: 0xA0
    bool flipCameraFrameHorizontally;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean flipCameraFrameVertically
    // Size: 0x1
    // Offset: 0xA1
    bool flipCameraFrameVertically;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: flipCameraFrameVertically and: handPoseStateLatency
    char __padding24[0x2] = {};
    // public System.Single handPoseStateLatency
    // Size: 0x4
    // Offset: 0xA4
    float handPoseStateLatency;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single sandwichCompositionRenderLatency
    // Size: 0x4
    // Offset: 0xA8
    float sandwichCompositionRenderLatency;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Int32 sandwichCompositionBufferedFrames
    // Size: 0x4
    // Offset: 0xAC
    int sandwichCompositionBufferedFrames;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public UnityEngine.Color chromaKeyColor
    // Size: 0x10
    // Offset: 0xB0
    ::UnityEngine::Color chromaKeyColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // public System.Single chromaKeySimilarity
    // Size: 0x4
    // Offset: 0xC0
    float chromaKeySimilarity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single chromaKeySmoothRange
    // Size: 0x4
    // Offset: 0xC4
    float chromaKeySmoothRange;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single chromaKeySpillRange
    // Size: 0x4
    // Offset: 0xC8
    float chromaKeySpillRange;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean useDynamicLighting
    // Size: 0x1
    // Offset: 0xCC
    bool useDynamicLighting;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: useDynamicLighting and: depthQuality
    char __padding32[0x3] = {};
    // public OVRManager/DepthQuality depthQuality
    // Size: 0x4
    // Offset: 0xD0
    ::GlobalNamespace::OVRManager_DepthQuality depthQuality;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRManager_DepthQuality) == 0x4);
    // public System.Single dynamicLightingSmoothFactor
    // Size: 0x4
    // Offset: 0xD4
    float dynamicLightingSmoothFactor;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single dynamicLightingDepthVariationClampingValue
    // Size: 0x4
    // Offset: 0xD8
    float dynamicLightingDepthVariationClampingValue;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public OVRManager/VirtualGreenScreenType virtualGreenScreenType
    // Size: 0x4
    // Offset: 0xDC
    ::GlobalNamespace::OVRManager_VirtualGreenScreenType virtualGreenScreenType;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRManager_VirtualGreenScreenType) == 0x4);
    // public System.Single virtualGreenScreenTopY
    // Size: 0x4
    // Offset: 0xE0
    float virtualGreenScreenTopY;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single virtualGreenScreenBottomY
    // Size: 0x4
    // Offset: 0xE4
    float virtualGreenScreenBottomY;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean virtualGreenScreenApplyDepthCulling
    // Size: 0x1
    // Offset: 0xE8
    bool virtualGreenScreenApplyDepthCulling;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: virtualGreenScreenApplyDepthCulling and: virtualGreenScreenDepthTolerance
    char __padding39[0x3] = {};
    // public System.Single virtualGreenScreenDepthTolerance
    // Size: 0x4
    // Offset: 0xEC
    float virtualGreenScreenDepthTolerance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public OVRManager/MrcActivationMode mrcActivationMode
    // Size: 0x4
    // Offset: 0xF0
    ::GlobalNamespace::OVRManager_MrcActivationMode mrcActivationMode;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRManager_MrcActivationMode) == 0x4);
    // Padding between fields: mrcActivationMode and: instantiateMixedRealityCameraGameObject
    char __padding41[0x4] = {};
    // public OVRManager/InstantiateMrcCameraDelegate instantiateMixedRealityCameraGameObject
    // Size: 0x8
    // Offset: 0xF8
    ::GlobalNamespace::OVRManager_InstantiateMrcCameraDelegate* instantiateMixedRealityCameraGameObject;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRManager_InstantiateMrcCameraDelegate*) == 0x8);
    // public System.Boolean launchMultimodalHandsControllersOnStartup
    // Size: 0x1
    // Offset: 0x100
    bool launchMultimodalHandsControllersOnStartup;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean isInsightPassthroughEnabled
    // Size: 0x1
    // Offset: 0x101
    bool isInsightPassthroughEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // System.Boolean requestBodyTrackingPermissionOnStartup
    // Size: 0x1
    // Offset: 0x102
    bool requestBodyTrackingPermissionOnStartup;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // System.Boolean requestFaceTrackingPermissionOnStartup
    // Size: 0x1
    // Offset: 0x103
    bool requestFaceTrackingPermissionOnStartup;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // System.Boolean requestEyeTrackingPermissionOnStartup
    // Size: 0x1
    // Offset: 0x104
    bool requestEyeTrackingPermissionOnStartup;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // System.Boolean requestScenePermissionOnStartup
    // Size: 0x1
    // Offset: 0x105
    bool requestScenePermissionOnStartup;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _localDimming
    // Size: 0x1
    // Offset: 0x106
    bool localDimming;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: localDimming and: trackingOriginType
    char __padding49[0x1] = {};
    // private OVRManager/TrackingOrigin _trackingOriginType
    // Size: 0x4
    // Offset: 0x108
    ::GlobalNamespace::OVRManager_TrackingOrigin trackingOriginType;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRManager_TrackingOrigin) == 0x4);
    // public System.Boolean usePositionTracking
    // Size: 0x1
    // Offset: 0x10C
    bool usePositionTracking;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean useRotationTracking
    // Size: 0x1
    // Offset: 0x10D
    bool useRotationTracking;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean useIPDInPositionTracking
    // Size: 0x1
    // Offset: 0x10E
    bool useIPDInPositionTracking;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean resetTrackerOnLoad
    // Size: 0x1
    // Offset: 0x10F
    bool resetTrackerOnLoad;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean AllowRecenter
    // Size: 0x1
    // Offset: 0x110
    bool AllowRecenter;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean LateControllerUpdate
    // Size: 0x1
    // Offset: 0x111
    bool LateControllerUpdate;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean LateLatching
    // Size: 0x1
    // Offset: 0x112
    bool LateLatching;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: LateLatching and: readOnlyControllerDrivenHandPosesType
    char __padding57[0x1] = {};
    // private OVRManager/ControllerDrivenHandPosesType _readOnlyControllerDrivenHandPosesType
    // Size: 0x4
    // Offset: 0x114
    ::GlobalNamespace::OVRManager_ControllerDrivenHandPosesType readOnlyControllerDrivenHandPosesType;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRManager_ControllerDrivenHandPosesType) == 0x4);
    // public OVRManager/ControllerDrivenHandPosesType controllerDrivenHandPosesType
    // Size: 0x4
    // Offset: 0x118
    ::GlobalNamespace::OVRManager_ControllerDrivenHandPosesType controllerDrivenHandPosesType;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRManager_ControllerDrivenHandPosesType) == 0x4);
    // private System.Boolean <isSupportedPlatform>k__BackingField
    // Size: 0x1
    // Offset: 0x11C
    bool isSupportedPlatform;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isSupportedPlatform and: eventListeners
    char __padding60[0x3] = {};
    // private System.Collections.Generic.HashSet`1<OVRManager/EventListener> eventListeners
    // Size: 0x8
    // Offset: 0x120
    ::System::Collections::Generic::HashSet_1<::GlobalNamespace::OVRManager_EventListener*>* eventListeners;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::HashSet_1<::GlobalNamespace::OVRManager_EventListener*>*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::GlobalNamespace::OVRMixedRealityCaptureConfiguration
    operator ::GlobalNamespace::OVRMixedRealityCaptureConfiguration() noexcept {
      return *reinterpret_cast<::GlobalNamespace::OVRMixedRealityCaptureConfiguration*>(this);
    }
    // Get static field: static private OVRManager <instance>k__BackingField
    static ::GlobalNamespace::OVRManager* _get_$instance$k__BackingField();
    // Set static field: static private OVRManager <instance>k__BackingField
    static void _set_$instance$k__BackingField(::GlobalNamespace::OVRManager* value);
    // Get static field: static private OVRDisplay <display>k__BackingField
