// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
// Including type: UnityEngine.Vector4
#include "UnityEngine/Vector4.hpp"
// Including type: UnityEngine.Rect
#include "UnityEngine/Rect.hpp"
// Including type: UnityEngine.Rendering.TextureDimension
#include "UnityEngine/Rendering/TextureDimension.hpp"
// Including type: OVROverlay/OverlayShape
#include "GlobalNamespace/OVROverlay.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Skipping declaration: OVROverlay because it is already included!
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: Mesh
  class Mesh;
  // Forward declaring type: MeshCollider
  class MeshCollider;
  // Forward declaring type: MeshFilter
  class MeshFilter;
  // Forward declaring type: MeshRenderer
  class MeshRenderer;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: OVROverlayMeshGenerator
  class OVROverlayMeshGenerator;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::OVROverlayMeshGenerator);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::OVROverlayMeshGenerator*, "", "OVROverlayMeshGenerator");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0xD8
  #pragma pack(push, 1)
  // Autogenerated type: OVROverlayMeshGenerator
  // [TokenAttribute] Offset: FFFFFFFF
  // [RequireComponent] Offset: FFFFFFFF
  // [RequireComponent] Offset: FFFFFFFF
  // [ExecuteInEditMode] Offset: FFFFFFFF
  // [HelpURLAttribute] Offset: FFFFFFFF
  class OVROverlayMeshGenerator : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::GlobalNamespace::OVROverlayMeshGenerator::CubeFace
    struct CubeFace;
    public:
    // private readonly System.Collections.Generic.List`1<System.Int32> _Tris
    // Size: 0x8
    // Offset: 0x20
    ::System::Collections::Generic::List_1<int>* Tris;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<int>*) == 0x8);
    // private readonly System.Collections.Generic.List`1<UnityEngine.Vector2> _UV
    // Size: 0x8
    // Offset: 0x28
    ::System::Collections::Generic::List_1<::UnityEngine::Vector2>* UV;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Vector2>*) == 0x8);
    // private readonly System.Collections.Generic.List`1<UnityEngine.Vector4> _CubeUV
    // Size: 0x8
    // Offset: 0x30
    ::System::Collections::Generic::List_1<::UnityEngine::Vector4>* CubeUV;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Vector4>*) == 0x8);
    // private readonly System.Collections.Generic.List`1<UnityEngine.Vector3> _Verts
    // Size: 0x8
    // Offset: 0x38
    ::System::Collections::Generic::List_1<::UnityEngine::Vector3>* Verts;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Vector3>*) == 0x8);
    // private UnityEngine.Transform _CameraRoot
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::Transform* CameraRoot;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Rect _LastDestRectLeft
    // Size: 0x10
    // Offset: 0x48
    ::UnityEngine::Rect LastDestRectLeft;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rect) == 0x10);
    // private UnityEngine.Rect _LastDestRectRight
    // Size: 0x10
    // Offset: 0x58
    ::UnityEngine::Rect LastDestRectRight;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rect) == 0x10);
    // private UnityEngine.Vector3 _LastPosition
    // Size: 0xC
    // Offset: 0x68
    ::UnityEngine::Vector3 LastPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Quaternion _LastRotation
    // Size: 0x10
    // Offset: 0x74
    ::UnityEngine::Quaternion LastRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.Vector3 _LastScale
    // Size: 0xC
    // Offset: 0x84
    ::UnityEngine::Vector3 LastScale;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Rendering.TextureDimension _LastTextureDimension
    // Size: 0x4
    // Offset: 0x90
    ::UnityEngine::Rendering::TextureDimension LastTextureDimension;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::TextureDimension) == 0x4);
    // private OVROverlay/OverlayShape _LastShape
    // Size: 0x4
    // Offset: 0x94
    ::GlobalNamespace::OVROverlay::OverlayShape LastShape;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVROverlay::OverlayShape) == 0x4);
    // private UnityEngine.Rect _LastSrcRectLeft
    // Size: 0x10
    // Offset: 0x98
    ::UnityEngine::Rect LastSrcRectLeft;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rect) == 0x10);
    // private UnityEngine.Mesh _Mesh
    // Size: 0x8
    // Offset: 0xA8
    ::UnityEngine::Mesh* Mesh;
    // Field size check
    static_assert(sizeof(::UnityEngine::Mesh*) == 0x8);
    // private UnityEngine.MeshCollider _MeshCollider
    // Size: 0x8
    // Offset: 0xB0
    ::UnityEngine::MeshCollider* MeshCollider;
    // Field size check
    static_assert(sizeof(::UnityEngine::MeshCollider*) == 0x8);
    // private UnityEngine.MeshFilter _MeshFilter
    // Size: 0x8
    // Offset: 0xB8
    ::UnityEngine::MeshFilter* MeshFilter;
    // Field size check
    static_assert(sizeof(::UnityEngine::MeshFilter*) == 0x8);
    // private UnityEngine.MeshRenderer _MeshRenderer
    // Size: 0x8
    // Offset: 0xC0
    ::UnityEngine::MeshRenderer* MeshRenderer;
    // Field size check
    static_assert(sizeof(::UnityEngine::MeshRenderer*) == 0x8);
    // private OVROverlay _Overlay
    // Size: 0x8
    // Offset: 0xC8
    ::GlobalNamespace::OVROverlay* Overlay;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVROverlay*) == 0x8);
    // private UnityEngine.Transform _Transform
    // Size: 0x8
    // Offset: 0xD0
    ::UnityEngine::Transform* Transform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    public:
    // Get instance field reference: private readonly System.Collections.Generic.List`1<System.Int32> _Tris
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<int>*& dyn__Tris();
    // Get instance field reference: private readonly System.Collections.Generic.List`1<UnityEngine.Vector2> _UV
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::UnityEngine::Vector2>*& dyn__UV();
    // Get instance field reference: private readonly System.Collections.Generic.List`1<UnityEngine.Vector4> _CubeUV
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::UnityEngine::Vector4>*& dyn__CubeUV();
    // Get instance field reference: private readonly System.Collections.Generic.List`1<UnityEngine.Vector3> _Verts
