// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: OVROverlay/OverlayType
#include "GlobalNamespace/OVROverlay.hpp"
// Including type: UnityEngine.Vector4
#include "UnityEngine/Vector4.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: OVRPlugin/InsightPassthroughColorMapType
#include "GlobalNamespace/OVRPlugin_InsightPassthroughColorMapType.hpp"
// Including type: UnityEngine.Matrix4x4
#include "UnityEngine/Matrix4x4.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Texture2D
  class Texture2D;
  // Forward declaring type: Gradient
  class Gradient;
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: MeshFilter
  class MeshFilter;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: OVRCameraRig
  class OVRCameraRig;
  // Forward declaring type: OVRPassthroughColorLut
  class OVRPassthroughColorLut;
  // Skipping declaration: ColorMapEditorType because it is already included!
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: OVRPassthroughLayer
  class OVRPassthroughLayer;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::OVRPassthroughLayer);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::OVRPassthroughLayer*, "", "OVRPassthroughLayer");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x118
  #pragma pack(push, 1)
  // Autogenerated type: OVRPassthroughLayer
  // [TokenAttribute] Offset: FFFFFFFF
  // [HelpURLAttribute] Offset: FFFFFFFF
  class OVRPassthroughLayer : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::GlobalNamespace::OVRPassthroughLayer::ProjectionSurfaceType
    struct ProjectionSurfaceType;
    // Nested type: ::GlobalNamespace::OVRPassthroughLayer::ColorMapEditorType
    struct ColorMapEditorType;
    // Nested type: ::GlobalNamespace::OVRPassthroughLayer::Settings
    struct Settings;
    // Nested type: ::GlobalNamespace::OVRPassthroughLayer::PassthroughMeshInstance
    struct PassthroughMeshInstance;
    // Nested type: ::GlobalNamespace::OVRPassthroughLayer::SerializedSurfaceGeometry
    struct SerializedSurfaceGeometry;
    // Nested type: ::GlobalNamespace::OVRPassthroughLayer::DeferredPassthroughMeshAddition
    struct DeferredPassthroughMeshAddition;
    // Nested type: ::GlobalNamespace::OVRPassthroughLayer::IStyleHandler
    class IStyleHandler;
    // Nested type: ::GlobalNamespace::OVRPassthroughLayer::StylesHandler
    class StylesHandler;
    // Nested type: ::GlobalNamespace::OVRPassthroughLayer::NoneStyleHandler
    class NoneStyleHandler;
    // Nested type: ::GlobalNamespace::OVRPassthroughLayer::BaseGeneratedStyleHandler
    class BaseGeneratedStyleHandler;
    // Nested type: ::GlobalNamespace::OVRPassthroughLayer::MonoToRgbaStyleHandler
    class MonoToRgbaStyleHandler;
    // Nested type: ::GlobalNamespace::OVRPassthroughLayer::MonoToMonoStyleHandler
    class MonoToMonoStyleHandler;
    // Nested type: ::GlobalNamespace::OVRPassthroughLayer::BCSStyleHandler
    class BCSStyleHandler;
    // Nested type: ::GlobalNamespace::OVRPassthroughLayer::ColorLutHandler
    class ColorLutHandler;
    // Nested type: ::GlobalNamespace::OVRPassthroughLayer::InterpolatedColorLutHandler
    class InterpolatedColorLutHandler;
    // Nested type: ::GlobalNamespace::OVRPassthroughLayer::$$c__DisplayClass10_0
    class $$c__DisplayClass10_0;
    // Nested type: ::GlobalNamespace::OVRPassthroughLayer::$$c__DisplayClass9_0
    class $$c__DisplayClass9_0;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: OVRPassthroughLayer/ProjectionSurfaceType
    // [TokenAttribute] Offset: FFFFFFFF
    struct ProjectionSurfaceType/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: ProjectionSurfaceType
      constexpr ProjectionSurfaceType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public OVRPassthroughLayer/ProjectionSurfaceType Reconstructed
      static constexpr const int Reconstructed = 0;
      // Get static field: static public OVRPassthroughLayer/ProjectionSurfaceType Reconstructed
      static ::GlobalNamespace::OVRPassthroughLayer::ProjectionSurfaceType _get_Reconstructed();
      // Set static field: static public OVRPassthroughLayer/ProjectionSurfaceType Reconstructed
      static void _set_Reconstructed(::GlobalNamespace::OVRPassthroughLayer::ProjectionSurfaceType value);
      // static field const value: static public OVRPassthroughLayer/ProjectionSurfaceType UserDefined
      static constexpr const int UserDefined = 1;
      // Get static field: static public OVRPassthroughLayer/ProjectionSurfaceType UserDefined
      static ::GlobalNamespace::OVRPassthroughLayer::ProjectionSurfaceType _get_UserDefined();
      // Set static field: static public OVRPassthroughLayer/ProjectionSurfaceType UserDefined
      static void _set_UserDefined(::GlobalNamespace::OVRPassthroughLayer::ProjectionSurfaceType value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // OVRPassthroughLayer/ProjectionSurfaceType
    #pragma pack(pop)
    static check_size<sizeof(OVRPassthroughLayer::ProjectionSurfaceType), 0 + sizeof(int)> __GlobalNamespace_OVRPassthroughLayer_ProjectionSurfaceTypeSizeCheck;
    static_assert(sizeof(OVRPassthroughLayer::ProjectionSurfaceType) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: OVRPassthroughLayer/ColorMapEditorType
    // [TokenAttribute] Offset: FFFFFFFF
    struct ColorMapEditorType/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: ColorMapEditorType
      constexpr ColorMapEditorType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public OVRPassthroughLayer/ColorMapEditorType None
      static constexpr const int None = 0;
      // Get static field: static public OVRPassthroughLayer/ColorMapEditorType None
      static ::GlobalNamespace::OVRPassthroughLayer::ColorMapEditorType _get_None();
      // Set static field: static public OVRPassthroughLayer/ColorMapEditorType None
      static void _set_None(::GlobalNamespace::OVRPassthroughLayer::ColorMapEditorType value);
      // static field const value: static public OVRPassthroughLayer/ColorMapEditorType GrayscaleToColor
      static constexpr const int GrayscaleToColor = 1;
      // Get static field: static public OVRPassthroughLayer/ColorMapEditorType GrayscaleToColor
      static ::GlobalNamespace::OVRPassthroughLayer::ColorMapEditorType _get_GrayscaleToColor();
      // Set static field: static public OVRPassthroughLayer/ColorMapEditorType GrayscaleToColor
      static void _set_GrayscaleToColor(::GlobalNamespace::OVRPassthroughLayer::ColorMapEditorType value);
      // static field const value: static public OVRPassthroughLayer/ColorMapEditorType Controls
      static constexpr const int Controls = 1;
      // Get static field: static public OVRPassthroughLayer/ColorMapEditorType Controls
      static ::GlobalNamespace::OVRPassthroughLayer::ColorMapEditorType _get_Controls();
      // Set static field: static public OVRPassthroughLayer/ColorMapEditorType Controls
      static void _set_Controls(::GlobalNamespace::OVRPassthroughLayer::ColorMapEditorType value);
      // static field const value: static public OVRPassthroughLayer/ColorMapEditorType Custom
      static constexpr const int Custom = 2;
      // Get static field: static public OVRPassthroughLayer/ColorMapEditorType Custom
      static ::GlobalNamespace::OVRPassthroughLayer::ColorMapEditorType _get_Custom();
      // Set static field: static public OVRPassthroughLayer/ColorMapEditorType Custom
      static void _set_Custom(::GlobalNamespace::OVRPassthroughLayer::ColorMapEditorType value);
      // static field const value: static public OVRPassthroughLayer/ColorMapEditorType Grayscale
      static constexpr const int Grayscale = 3;
      // Get static field: static public OVRPassthroughLayer/ColorMapEditorType Grayscale
      static ::GlobalNamespace::OVRPassthroughLayer::ColorMapEditorType _get_Grayscale();
      // Set static field: static public OVRPassthroughLayer/ColorMapEditorType Grayscale
      static void _set_Grayscale(::GlobalNamespace::OVRPassthroughLayer::ColorMapEditorType value);
      // static field const value: static public OVRPassthroughLayer/ColorMapEditorType ColorAdjustment
      static constexpr const int ColorAdjustment = 4;
      // Get static field: static public OVRPassthroughLayer/ColorMapEditorType ColorAdjustment
      static ::GlobalNamespace::OVRPassthroughLayer::ColorMapEditorType _get_ColorAdjustment();
      // Set static field: static public OVRPassthroughLayer/ColorMapEditorType ColorAdjustment
      static void _set_ColorAdjustment(::GlobalNamespace::OVRPassthroughLayer::ColorMapEditorType value);
      // static field const value: static public OVRPassthroughLayer/ColorMapEditorType ColorLut
      static constexpr const int ColorLut = 5;
      // Get static field: static public OVRPassthroughLayer/ColorMapEditorType ColorLut
      static ::GlobalNamespace::OVRPassthroughLayer::ColorMapEditorType _get_ColorLut();
      // Set static field: static public OVRPassthroughLayer/ColorMapEditorType ColorLut
      static void _set_ColorLut(::GlobalNamespace::OVRPassthroughLayer::ColorMapEditorType value);
      // static field const value: static public OVRPassthroughLayer/ColorMapEditorType InterpolatedColorLut
      static constexpr const int InterpolatedColorLut = 6;
      // Get static field: static public OVRPassthroughLayer/ColorMapEditorType InterpolatedColorLut
      static ::GlobalNamespace::OVRPassthroughLayer::ColorMapEditorType _get_InterpolatedColorLut();
      // Set static field: static public OVRPassthroughLayer/ColorMapEditorType InterpolatedColorLut
      static void _set_InterpolatedColorLut(::GlobalNamespace::OVRPassthroughLayer::ColorMapEditorType value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // OVRPassthroughLayer/ColorMapEditorType
    #pragma pack(pop)
    static check_size<sizeof(OVRPassthroughLayer::ColorMapEditorType), 0 + sizeof(int)> __GlobalNamespace_OVRPassthroughLayer_ColorMapEditorTypeSizeCheck;
    static_assert(sizeof(OVRPassthroughLayer::ColorMapEditorType) == 0x4);
    // Size: 0x2D
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: OVRPassthroughLayer/Settings
    // [TokenAttribute] Offset: FFFFFFFF
    struct Settings/*, public ::System::ValueType*/ {
      public:
      public:
      // public UnityEngine.Texture2D colorLutTargetTexture
      // Size: 0x8
      // Offset: 0x0
      ::UnityEngine::Texture2D* colorLutTargetTexture;
      // Field size check
      static_assert(sizeof(::UnityEngine::Texture2D*) == 0x8);
      // public UnityEngine.Texture2D colorLutSourceTexture
      // Size: 0x8
      // Offset: 0x8
      ::UnityEngine::Texture2D* colorLutSourceTexture;
      // Field size check
      static_assert(sizeof(::UnityEngine::Texture2D*) == 0x8);
      // public System.Single saturation
      // Size: 0x4
      // Offset: 0x10
      float saturation;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Single posterize
      // Size: 0x4
      // Offset: 0x14
      float posterize;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Single brightness
      // Size: 0x4
      // Offset: 0x18
      float brightness;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Single contrast
      // Size: 0x4
      // Offset: 0x1C
      float contrast;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public UnityEngine.Gradient gradient
      // Size: 0x8
      // Offset: 0x20
      ::UnityEngine::Gradient* gradient;
      // Field size check
      static_assert(sizeof(::UnityEngine::Gradient*) == 0x8);
      // public System.Single lutWeight
      // Size: 0x4
      // Offset: 0x28
      float lutWeight;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Boolean flipLutY
      // Size: 0x1
      // Offset: 0x2C
      bool flipLutY;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      public:
      // Creating value type constructor for type: Settings
      constexpr Settings(::UnityEngine::Texture2D* colorLutTargetTexture_ = {}, ::UnityEngine::Texture2D* colorLutSourceTexture_ = {}, float saturation_ = {}, float posterize_ = {}, float brightness_ = {}, float contrast_ = {}, ::UnityEngine::Gradient* gradient_ = {}, float lutWeight_ = {}, bool flipLutY_ = {}) noexcept : colorLutTargetTexture{colorLutTargetTexture_}, colorLutSourceTexture{colorLutSourceTexture_}, saturation{saturation_}, posterize{posterize_}, brightness{brightness_}, contrast{contrast_}, gradient{gradient_}, lutWeight{lutWeight_}, flipLutY{flipLutY_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public UnityEngine.Texture2D colorLutTargetTexture
      [[deprecated("Use field access instead!")]] ::UnityEngine::Texture2D*& dyn_colorLutTargetTexture();
      // Get instance field reference: public UnityEngine.Texture2D colorLutSourceTexture
      [[deprecated("Use field access instead!")]] ::UnityEngine::Texture2D*& dyn_colorLutSourceTexture();
      // Get instance field reference: public System.Single saturation
      [[deprecated("Use field access instead!")]] float& dyn_saturation();
      // Get instance field reference: public System.Single posterize
      [[deprecated("Use field access instead!")]] float& dyn_posterize();
      // Get instance field reference: public System.Single brightness
      [[deprecated("Use field access instead!")]] float& dyn_brightness();
      // Get instance field reference: public System.Single contrast
      [[deprecated("Use field access instead!")]] float& dyn_contrast();
      // Get instance field reference: public UnityEngine.Gradient gradient
      [[deprecated("Use field access instead!")]] ::UnityEngine::Gradient*& dyn_gradient();
      // Get instance field reference: public System.Single lutWeight
      [[deprecated("Use field access instead!")]] float& dyn_lutWeight();
      // Get instance field reference: public System.Boolean flipLutY
      [[deprecated("Use field access instead!")]] bool& dyn_flipLutY();
      // public System.Void .ctor(UnityEngine.Texture2D colorLutTargetTexture, UnityEngine.Texture2D colorLutSourceTexture, System.Single saturation, System.Single posterize, System.Single brightness, System.Single contrast, UnityEngine.Gradient gradient, System.Single lutWeight, System.Boolean flipLutY)
      // Offset: 0x48EB864
      // ABORTED: conflicts with another method.  Settings(::UnityEngine::Texture2D* colorLutTargetTexture, ::UnityEngine::Texture2D* colorLutSourceTexture, float saturation, float posterize, float brightness, float contrast, ::UnityEngine::Gradient* gradient, float lutWeight, bool flipLutY);
    }; // OVRPassthroughLayer/Settings
    #pragma pack(pop)
    static check_size<sizeof(OVRPassthroughLayer::Settings), 44 + sizeof(bool)> __GlobalNamespace_OVRPassthroughLayer_SettingsSizeCheck;
    static_assert(sizeof(OVRPassthroughLayer::Settings) == 0x2D);
    // Size: 0x54
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: OVRPassthroughLayer/PassthroughMeshInstance
    // [TokenAttribute] Offset: FFFFFFFF
    struct PassthroughMeshInstance/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.UInt64 meshHandle
      // Size: 0x8
      // Offset: 0x0
      uint64_t meshHandle;
      // Field size check
      static_assert(sizeof(uint64_t) == 0x8);
      // public System.UInt64 instanceHandle
      // Size: 0x8
      // Offset: 0x8
      uint64_t instanceHandle;
      // Field size check
      static_assert(sizeof(uint64_t) == 0x8);
      // public System.Boolean updateTransform
      // Size: 0x1
      // Offset: 0x10
      bool updateTransform;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // Padding between fields: updateTransform and: localToWorld
      char __padding2[0x3] = {};
      // public UnityEngine.Matrix4x4 localToWorld
      // Size: 0x40
      // Offset: 0x14
      ::UnityEngine::Matrix4x4 localToWorld;
      // Field size check
      static_assert(sizeof(::UnityEngine::Matrix4x4) == 0x40);
      public:
      // Creating value type constructor for type: PassthroughMeshInstance
      constexpr PassthroughMeshInstance(uint64_t meshHandle_ = {}, uint64_t instanceHandle_ = {}, bool updateTransform_ = {}, ::UnityEngine::Matrix4x4 localToWorld_ = {}) noexcept : meshHandle{meshHandle_}, instanceHandle{instanceHandle_}, updateTransform{updateTransform_}, localToWorld{localToWorld_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public System.UInt64 meshHandle
      [[deprecated("Use field access instead!")]] uint64_t& dyn_meshHandle();
      // Get instance field reference: public System.UInt64 instanceHandle
      [[deprecated("Use field access instead!")]] uint64_t& dyn_instanceHandle();
      // Get instance field reference: public System.Boolean updateTransform
      [[deprecated("Use field access instead!")]] bool& dyn_updateTransform();
      // Get instance field reference: public UnityEngine.Matrix4x4 localToWorld
      [[deprecated("Use field access instead!")]] ::UnityEngine::Matrix4x4& dyn_localToWorld();
    }; // OVRPassthroughLayer/PassthroughMeshInstance
    #pragma pack(pop)
    static check_size<sizeof(OVRPassthroughLayer::PassthroughMeshInstance), 20 + sizeof(::UnityEngine::Matrix4x4)> __GlobalNamespace_OVRPassthroughLayer_PassthroughMeshInstanceSizeCheck;
    static_assert(sizeof(OVRPassthroughLayer::PassthroughMeshInstance) == 0x54);
    // Size: 0x9
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: OVRPassthroughLayer/SerializedSurfaceGeometry
    // [TokenAttribute] Offset: FFFFFFFF
    struct SerializedSurfaceGeometry/*, public ::System::ValueType*/ {
      public:
      public:
      // public UnityEngine.MeshFilter meshFilter
      // Size: 0x8
      // Offset: 0x0
      ::UnityEngine::MeshFilter* meshFilter;
      // Field size check
      static_assert(sizeof(::UnityEngine::MeshFilter*) == 0x8);
      // public System.Boolean updateTransform
      // Size: 0x1
      // Offset: 0x8
      bool updateTransform;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      public:
      // Creating value type constructor for type: SerializedSurfaceGeometry
      constexpr SerializedSurfaceGeometry(::UnityEngine::MeshFilter* meshFilter_ = {}, bool updateTransform_ = {}) noexcept : meshFilter{meshFilter_}, updateTransform{updateTransform_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public UnityEngine.MeshFilter meshFilter
      [[deprecated("Use field access instead!")]] ::UnityEngine::MeshFilter*& dyn_meshFilter();
      // Get instance field reference: public System.Boolean updateTransform
      [[deprecated("Use field access instead!")]] bool& dyn_updateTransform();
    }; // OVRPassthroughLayer/SerializedSurfaceGeometry
    #pragma pack(pop)
    static check_size<sizeof(OVRPassthroughLayer::SerializedSurfaceGeometry), 8 + sizeof(bool)> __GlobalNamespace_OVRPassthroughLayer_SerializedSurfaceGeometrySizeCheck;
    static_assert(sizeof(OVRPassthroughLayer::SerializedSurfaceGeometry) == 0x9);
    // Size: 0x9
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: OVRPassthroughLayer/DeferredPassthroughMeshAddition
    // [TokenAttribute] Offset: FFFFFFFF
    struct DeferredPassthroughMeshAddition/*, public ::System::ValueType*/ {
      public:
      public:
      // public UnityEngine.GameObject gameObject
      // Size: 0x8
      // Offset: 0x0
      ::UnityEngine::GameObject* gameObject;
      // Field size check
      static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
      // public System.Boolean updateTransform
      // Size: 0x1
      // Offset: 0x8
      bool updateTransform;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      public:
      // Creating value type constructor for type: DeferredPassthroughMeshAddition
      constexpr DeferredPassthroughMeshAddition(::UnityEngine::GameObject* gameObject_ = {}, bool updateTransform_ = {}) noexcept : gameObject{gameObject_}, updateTransform{updateTransform_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public UnityEngine.GameObject gameObject
      [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_gameObject();
      // Get instance field reference: public System.Boolean updateTransform
      [[deprecated("Use field access instead!")]] bool& dyn_updateTransform();
    }; // OVRPassthroughLayer/DeferredPassthroughMeshAddition
    #pragma pack(pop)
    static check_size<sizeof(OVRPassthroughLayer::DeferredPassthroughMeshAddition), 8 + sizeof(bool)> __GlobalNamespace_OVRPassthroughLayer_DeferredPassthroughMeshAdditionSizeCheck;
    static_assert(sizeof(OVRPassthroughLayer::DeferredPassthroughMeshAddition) == 0x9);
    public:
    // public OVRPassthroughLayer/ProjectionSurfaceType projectionSurfaceType
    // Size: 0x4
    // Offset: 0x20
    ::GlobalNamespace::OVRPassthroughLayer::ProjectionSurfaceType projectionSurfaceType;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRPassthroughLayer::ProjectionSurfaceType) == 0x4);
    // public OVROverlay/OverlayType overlayType
    // Size: 0x4
    // Offset: 0x24
    ::GlobalNamespace::OVROverlay::OverlayType overlayType;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVROverlay::OverlayType) == 0x4);
    // public System.Int32 compositionDepth
    // Size: 0x4
    // Offset: 0x28
    int compositionDepth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Boolean hidden
    // Size: 0x1
    // Offset: 0x2C
    bool hidden;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean overridePerLayerColorScaleAndOffset
    // Size: 0x1
    // Offset: 0x2D
    bool overridePerLayerColorScaleAndOffset;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: overridePerLayerColorScaleAndOffset and: colorScale
    char __padding4[0x2] = {};
    // public UnityEngine.Vector4 colorScale
    // Size: 0x10
    // Offset: 0x30
    ::UnityEngine::Vector4 colorScale;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector4) == 0x10);
    // public UnityEngine.Vector4 colorOffset
    // Size: 0x10
    // Offset: 0x40
    ::UnityEngine::Vector4 colorOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector4) == 0x10);
    // OVRPassthroughLayer/ColorMapEditorType colorMapEditorType_
    // Size: 0x4
    // Offset: 0x50
    ::GlobalNamespace::OVRPassthroughLayer::ColorMapEditorType colorMapEditorType;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRPassthroughLayer::ColorMapEditorType) == 0x4);
    // Padding between fields: colorMapEditorType and: colorMapEditorGradient
    char __padding7[0x4] = {};
    // public UnityEngine.Gradient colorMapEditorGradient
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::Gradient* colorMapEditorGradient;
    // Field size check
    static_assert(sizeof(::UnityEngine::Gradient*) == 0x8);
    // public System.Single colorMapEditorContrast
    // Size: 0x4
    // Offset: 0x60
    float colorMapEditorContrast;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single colorMapEditorBrightness
    // Size: 0x4
    // Offset: 0x64
    float colorMapEditorBrightness;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single colorMapEditorPosterize
    // Size: 0x4
    // Offset: 0x68
    float colorMapEditorPosterize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single colorMapEditorSaturation
    // Size: 0x4
    // Offset: 0x6C
    float colorMapEditorSaturation;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // UnityEngine.Texture2D _colorLutSourceTexture
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::Texture2D* colorLutSourceTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture2D*) == 0x8);
    // UnityEngine.Texture2D _colorLutTargetTexture
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::Texture2D* colorLutTargetTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture2D*) == 0x8);
    // System.Single _lutWeight
    // Size: 0x4
    // Offset: 0x80
    float lutWeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // System.Boolean _flipLutY
    // Size: 0x1
    // Offset: 0x84
    bool flipLutY;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: flipLutY and: settings
    char __padding16[0x3] = {};
    // private OVRPassthroughLayer/Settings _settings
    // Size: 0x2D
    // Offset: 0x88
    ::GlobalNamespace::OVRPassthroughLayer::Settings settings;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRPassthroughLayer::Settings) == 0x2D);
    // Padding between fields: settings and: cameraRig
    char __padding17[0x3] = {};
    // private OVRCameraRig cameraRig
    // Size: 0x8
    // Offset: 0xB8
    ::GlobalNamespace::OVRCameraRig* cameraRig;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRCameraRig*) == 0x8);
    // private System.Boolean cameraRigInitialized
    // Size: 0x1
    // Offset: 0xC0
    bool cameraRigInitialized;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: cameraRigInitialized and: auxGameObject
    char __padding19[0x7] = {};
    // private UnityEngine.GameObject auxGameObject
    // Size: 0x8
    // Offset: 0xC8
    ::UnityEngine::GameObject* auxGameObject;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private OVROverlay passthroughOverlay
    // Size: 0x8
    // Offset: 0xD0
    ::GlobalNamespace::OVROverlay* passthroughOverlay;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVROverlay*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<UnityEngine.GameObject,OVRPassthroughLayer/PassthroughMeshInstance> surfaceGameObjects
    // Size: 0x8
    // Offset: 0xD8
    ::System::Collections::Generic::Dictionary_2<::UnityEngine::GameObject*, ::GlobalNamespace::OVRPassthroughLayer::PassthroughMeshInstance>* surfaceGameObjects;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::UnityEngine::GameObject*, ::GlobalNamespace::OVRPassthroughLayer::PassthroughMeshInstance>*) == 0x8);
    // private System.Collections.Generic.List`1<OVRPassthroughLayer/DeferredPassthroughMeshAddition> deferredSurfaceGameObjects
    // Size: 0x8
    // Offset: 0xE0
    ::System::Collections::Generic::List_1<::GlobalNamespace::OVRPassthroughLayer::DeferredPassthroughMeshAddition>* deferredSurfaceGameObjects;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GlobalNamespace::OVRPassthroughLayer::DeferredPassthroughMeshAddition>*) == 0x8);
    // System.Collections.Generic.List`1<OVRPassthroughLayer/SerializedSurfaceGeometry> serializedSurfaceGeometry
    // Size: 0x8
    // Offset: 0xE8
    ::System::Collections::Generic::List_1<::GlobalNamespace::OVRPassthroughLayer::SerializedSurfaceGeometry>* serializedSurfaceGeometry;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GlobalNamespace::OVRPassthroughLayer::SerializedSurfaceGeometry>*) == 0x8);
    // System.Single textureOpacity_
    // Size: 0x4
    // Offset: 0xF0
    float textureOpacity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // System.Boolean edgeRenderingEnabled_
    // Size: 0x1
    // Offset: 0xF4
    bool edgeRenderingEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: edgeRenderingEnabled and: edgeColor
    char __padding26[0x3] = {};
    // UnityEngine.Color edgeColor_
    // Size: 0x10
    // Offset: 0xF8
    ::UnityEngine::Color edgeColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private OVRPlugin/InsightPassthroughColorMapType colorMapType
    // Size: 0x4
    // Offset: 0x108
    ::GlobalNamespace::OVRPlugin::InsightPassthroughColorMapType colorMapType;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRPlugin::InsightPassthroughColorMapType) == 0x4);
    // private System.Boolean styleDirty
    // Size: 0x1
    // Offset: 0x10C
    bool styleDirty;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: styleDirty and: stylesHandler
    char __padding29[0x3] = {};
    // private OVRPassthroughLayer/StylesHandler _stylesHandler
    // Size: 0x8
    // Offset: 0x110
    ::GlobalNamespace::OVRPassthroughLayer::StylesHandler* stylesHandler;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRPassthroughLayer::StylesHandler*) == 0x8);
    public:
    // Get static field: static private System.Collections.Generic.Dictionary`2<OVRPassthroughLayer/ColorMapEditorType,OVRPlugin/InsightPassthroughColorMapType> _editorToColorMapType
    static ::System::Collections::Generic::Dictionary_2<::GlobalNamespace::OVRPassthroughLayer::ColorMapEditorType, ::GlobalNamespace::OVRPlugin::InsightPassthroughColorMapType>* _get__editorToColorMapType();
    // Set static field: static private System.Collections.Generic.Dictionary`2<OVRPassthroughLayer/ColorMapEditorType,OVRPlugin/InsightPassthroughColorMapType> _editorToColorMapType
