// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: OVRPlugin
#include "GlobalNamespace/OVRPlugin.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: System.IntPtr
#include "System/IntPtr.hpp"
// Including type: OVRPlugin/Bool
// Already included the same include: GlobalNamespace/OVRPlugin.hpp
// Completed includes
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::OVRPlugin::HapticsPcmVibration, "", "OVRPlugin/HapticsPcmVibration");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x20
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: OVRPlugin/HapticsPcmVibration
  // [TokenAttribute] Offset: FFFFFFFF
  struct OVRPlugin::HapticsPcmVibration/*, public ::System::ValueType*/ {
    public:
    public:
    // public System.UInt32 BufferSize
    // Size: 0x4
    // Offset: 0x0
    uint BufferSize;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // Padding between fields: BufferSize and: Buffer
    char __padding0[0x4] = {};
    // public System.IntPtr Buffer
    // Size: 0x8
    // Offset: 0x8
    ::System::IntPtr Buffer;
    // Field size check
    static_assert(sizeof(::System::IntPtr) == 0x8);
    // public System.Single SampleRateHz
    // Size: 0x4
    // Offset: 0x10
    float SampleRateHz;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public OVRPlugin/Bool Append
    // Size: 0x4
    // Offset: 0x14
    ::GlobalNamespace::OVRPlugin::Bool Append;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRPlugin::Bool) == 0x4);
    // public System.IntPtr SamplesConsumed
    // Size: 0x8
    // Offset: 0x18
    ::System::IntPtr SamplesConsumed;
    // Field size check
    static_assert(sizeof(::System::IntPtr) == 0x8);
    public:
    // Creating value type constructor for type: HapticsPcmVibration
    constexpr HapticsPcmVibration(uint BufferSize_ = {}, ::System::IntPtr Buffer_ = {}, float SampleRateHz_ = {}, ::GlobalNamespace::OVRPlugin::Bool Append_ = {}, ::System::IntPtr SamplesConsumed_ = {}) noexcept : BufferSize{BufferSize_}, Buffer{Buffer_}, SampleRateHz{SampleRateHz_}, Append{Append_}, SamplesConsumed{SamplesConsumed_} {}
    // Creating interface conversion operator: operator ::System::ValueType
    operator ::System::ValueType() noexcept {
      return *reinterpret_cast<::System::ValueType*>(this);
    }
    // Get instance field reference: public System.UInt32 BufferSize
    [[deprecated("Use field access instead!")]] uint& dyn_BufferSize();
    // Get instance field reference: public System.IntPtr Buffer
    [[deprecated("Use field access instead!")]] ::System::IntPtr& dyn_Buffer();
    // Get instance field reference: public System.Single SampleRateHz
    [[deprecated("Use field access instead!")]] float& dyn_SampleRateHz();
    // Get instance field reference: public OVRPlugin/Bool Append
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::OVRPlugin::Bool& dyn_Append();
    // Get instance field reference: public System.IntPtr SamplesConsumed
    [[deprecated("Use field access instead!")]] ::System::IntPtr& dyn_SamplesConsumed();
  }; // OVRPlugin/HapticsPcmVibration
  #pragma pack(pop)
  static check_size<sizeof(OVRPlugin::HapticsPcmVibration), 24 + sizeof(::System::IntPtr)> __GlobalNamespace_OVRPlugin_HapticsPcmVibrationSizeCheck;
  static_assert(sizeof(OVRPlugin::HapticsPcmVibration) == 0x20);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
