// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.IDisposable
#include "System/IDisposable.hpp"
// Including type: System.Runtime.InteropServices.GCHandle
#include "System/Runtime/InteropServices/GCHandle.hpp"
// Including type: OVRPlugin/PassthroughColorLutData
#include "GlobalNamespace/OVRPlugin_PassthroughColorLutData.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: UnityEngine.Color32
#include "UnityEngine/Color32.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Texture2D
  class Texture2D;
  // Forward declaring type: TextureFormat
  struct TextureFormat;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Skipping declaration: ColorChannels because it is already included!
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: OVRPassthroughColorLut
  class OVRPassthroughColorLut;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::OVRPassthroughColorLut);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::OVRPassthroughColorLut*, "", "OVRPassthroughColorLut");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x54
  #pragma pack(push, 1)
  // Autogenerated type: OVRPassthroughColorLut
  // [TokenAttribute] Offset: FFFFFFFF
  // [HelpURLAttribute] Offset: FFFFFFFF
  class OVRPassthroughColorLut : public ::Il2CppObject/*, public ::System::IDisposable*/ {
    public:
    // Nested type: ::GlobalNamespace::OVRPassthroughColorLut::ColorChannels
    struct ColorChannels;
    // Nested type: ::GlobalNamespace::OVRPassthroughColorLut::WriteColorsAsBytesJob
    struct WriteColorsAsBytesJob;
    // Nested type: ::GlobalNamespace::OVRPassthroughColorLut::ColorLutTextureConverter
    class ColorLutTextureConverter;
    // Nested type: ::GlobalNamespace::OVRPassthroughColorLut::CreateState
    struct CreateState;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: OVRPassthroughColorLut/ColorChannels
    // [TokenAttribute] Offset: FFFFFFFF
    struct ColorChannels/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: ColorChannels
      constexpr ColorChannels(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public OVRPassthroughColorLut/ColorChannels Rgb
      static constexpr const int Rgb = 1;
      // Get static field: static public OVRPassthroughColorLut/ColorChannels Rgb
      static ::GlobalNamespace::OVRPassthroughColorLut::ColorChannels _get_Rgb();
      // Set static field: static public OVRPassthroughColorLut/ColorChannels Rgb
      static void _set_Rgb(::GlobalNamespace::OVRPassthroughColorLut::ColorChannels value);
      // static field const value: static public OVRPassthroughColorLut/ColorChannels Rgba
      static constexpr const int Rgba = 2;
      // Get static field: static public OVRPassthroughColorLut/ColorChannels Rgba
      static ::GlobalNamespace::OVRPassthroughColorLut::ColorChannels _get_Rgba();
      // Set static field: static public OVRPassthroughColorLut/ColorChannels Rgba
      static void _set_Rgba(::GlobalNamespace::OVRPassthroughColorLut::ColorChannels value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // OVRPassthroughColorLut/ColorChannels
    #pragma pack(pop)
    static check_size<sizeof(OVRPassthroughColorLut::ColorChannels), 0 + sizeof(int)> __GlobalNamespace_OVRPassthroughColorLut_ColorChannelsSizeCheck;
    static_assert(sizeof(OVRPassthroughColorLut::ColorChannels) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: OVRPassthroughColorLut/CreateState
    // [TokenAttribute] Offset: FFFFFFFF
    struct CreateState/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: CreateState
      constexpr CreateState(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public OVRPassthroughColorLut/CreateState Invalid
      static constexpr const int Invalid = 0;
      // Get static field: static public OVRPassthroughColorLut/CreateState Invalid
      static ::GlobalNamespace::OVRPassthroughColorLut::CreateState _get_Invalid();
      // Set static field: static public OVRPassthroughColorLut/CreateState Invalid
      static void _set_Invalid(::GlobalNamespace::OVRPassthroughColorLut::CreateState value);
      // static field const value: static public OVRPassthroughColorLut/CreateState Pending
      static constexpr const int Pending = 1;
      // Get static field: static public OVRPassthroughColorLut/CreateState Pending
      static ::GlobalNamespace::OVRPassthroughColorLut::CreateState _get_Pending();
      // Set static field: static public OVRPassthroughColorLut/CreateState Pending
      static void _set_Pending(::GlobalNamespace::OVRPassthroughColorLut::CreateState value);
      // static field const value: static public OVRPassthroughColorLut/CreateState Created
      static constexpr const int Created = 2;
      // Get static field: static public OVRPassthroughColorLut/CreateState Created
      static ::GlobalNamespace::OVRPassthroughColorLut::CreateState _get_Created();
      // Set static field: static public OVRPassthroughColorLut/CreateState Created
      static void _set_Created(::GlobalNamespace::OVRPassthroughColorLut::CreateState value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // OVRPassthroughColorLut/CreateState
    #pragma pack(pop)
    static check_size<sizeof(OVRPassthroughColorLut::CreateState), 0 + sizeof(int)> __GlobalNamespace_OVRPassthroughColorLut_CreateStateSizeCheck;
    static_assert(sizeof(OVRPassthroughColorLut::CreateState) == 0x4);
    public:
    // private System.UInt32 <Resolution>k__BackingField
    // Size: 0x4
    // Offset: 0x10
    uint Resolution;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private OVRPassthroughColorLut/ColorChannels <Channels>k__BackingField
    // Size: 0x4
    // Offset: 0x14
    ::GlobalNamespace::OVRPassthroughColorLut::ColorChannels Channels;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRPassthroughColorLut::ColorChannels) == 0x4);
    // System.UInt64 _colorLutHandle
    // Size: 0x8
    // Offset: 0x18
    uint64_t colorLutHandle;
    // Field size check
    static_assert(sizeof(uint64_t) == 0x8);
    // private System.Runtime.InteropServices.GCHandle _allocHandle
    // Size: 0x8
    // Offset: 0x20
    ::System::Runtime::InteropServices::GCHandle allocHandle;
    // Field size check
    static_assert(sizeof(::System::Runtime::InteropServices::GCHandle) == 0x8);
    // private OVRPlugin/PassthroughColorLutData _lutData
    // Size: 0x10
    // Offset: 0x28
    ::GlobalNamespace::OVRPlugin::PassthroughColorLutData lutData;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRPlugin::PassthroughColorLutData) == 0x10);
    // private System.Int32 _channelCount
    // Size: 0x4
    // Offset: 0x38
    int channelCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: channelCount and: colorBytes
    char __padding5[0x4] = {};
    // private System.Byte[] _colorBytes
    // Size: 0x8
    // Offset: 0x40
    ::ArrayW<uint8_t> colorBytes;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // private System.Object _locker
    // Size: 0x8
    // Offset: 0x48
    ::Il2CppObject* locker;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private OVRPassthroughColorLut/CreateState _createState
    // Size: 0x4
    // Offset: 0x50
    ::GlobalNamespace::OVRPassthroughColorLut::CreateState createState;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRPassthroughColorLut::CreateState) == 0x4);
    public:
    // Creating interface conversion operator: operator ::System::IDisposable
    operator ::System::IDisposable() noexcept {
      return *reinterpret_cast<::System::IDisposable*>(this);
    }
    // static field const value: static private System.Int32 RecomendedBatchSize
    static constexpr const int RecomendedBatchSize = 128;
    // Get static field: static private System.Int32 RecomendedBatchSize
    static int _get_RecomendedBatchSize();
    // Set static field: static private System.Int32 RecomendedBatchSize
    static void _set_RecomendedBatchSize(int value);
    // Get instance field reference: private System.UInt32 <Resolution>k__BackingField
    [[deprecated("Use field access instead!")]] uint& dyn_$Resolution$k__BackingField();
