// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: OVRPlugin
#include "GlobalNamespace/OVRPlugin.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Completed includes
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::OVRPlugin::FaceState2Internal, "", "OVRPlugin/FaceState2Internal");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x118
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: OVRPlugin/FaceState2Internal
  // [TokenAttribute] Offset: FFFFFFFF
  struct OVRPlugin::FaceState2Internal/*, public ::System::ValueType*/ {
    public:
    public:
    // public System.Single ExpressionWeights_0
    // Size: 0x4
    // Offset: 0x0
    float ExpressionWeights_0;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_1
    // Size: 0x4
    // Offset: 0x4
    float ExpressionWeights_1;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_2
    // Size: 0x4
    // Offset: 0x8
    float ExpressionWeights_2;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_3
    // Size: 0x4
    // Offset: 0xC
    float ExpressionWeights_3;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_4
    // Size: 0x4
    // Offset: 0x10
    float ExpressionWeights_4;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_5
    // Size: 0x4
    // Offset: 0x14
    float ExpressionWeights_5;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_6
    // Size: 0x4
    // Offset: 0x18
    float ExpressionWeights_6;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_7
    // Size: 0x4
    // Offset: 0x1C
    float ExpressionWeights_7;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_8
    // Size: 0x4
    // Offset: 0x20
    float ExpressionWeights_8;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_9
    // Size: 0x4
    // Offset: 0x24
    float ExpressionWeights_9;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_10
    // Size: 0x4
    // Offset: 0x28
    float ExpressionWeights_10;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_11
    // Size: 0x4
    // Offset: 0x2C
    float ExpressionWeights_11;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_12
    // Size: 0x4
    // Offset: 0x30
    float ExpressionWeights_12;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_13
    // Size: 0x4
    // Offset: 0x34
    float ExpressionWeights_13;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_14
    // Size: 0x4
    // Offset: 0x38
    float ExpressionWeights_14;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_15
    // Size: 0x4
    // Offset: 0x3C
    float ExpressionWeights_15;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_16
    // Size: 0x4
    // Offset: 0x40
    float ExpressionWeights_16;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_17
    // Size: 0x4
    // Offset: 0x44
    float ExpressionWeights_17;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_18
    // Size: 0x4
    // Offset: 0x48
    float ExpressionWeights_18;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_19
    // Size: 0x4
    // Offset: 0x4C
    float ExpressionWeights_19;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_20
    // Size: 0x4
    // Offset: 0x50
    float ExpressionWeights_20;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_21
    // Size: 0x4
    // Offset: 0x54
    float ExpressionWeights_21;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_22
    // Size: 0x4
    // Offset: 0x58
    float ExpressionWeights_22;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_23
    // Size: 0x4
    // Offset: 0x5C
    float ExpressionWeights_23;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_24
    // Size: 0x4
    // Offset: 0x60
    float ExpressionWeights_24;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_25
    // Size: 0x4
    // Offset: 0x64
    float ExpressionWeights_25;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_26
    // Size: 0x4
    // Offset: 0x68
    float ExpressionWeights_26;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_27
    // Size: 0x4
    // Offset: 0x6C
    float ExpressionWeights_27;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_28
    // Size: 0x4
    // Offset: 0x70
    float ExpressionWeights_28;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_29
    // Size: 0x4
    // Offset: 0x74
    float ExpressionWeights_29;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_30
    // Size: 0x4
    // Offset: 0x78
    float ExpressionWeights_30;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_31
    // Size: 0x4
    // Offset: 0x7C
    float ExpressionWeights_31;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_32
    // Size: 0x4
    // Offset: 0x80
    float ExpressionWeights_32;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_33
    // Size: 0x4
    // Offset: 0x84
    float ExpressionWeights_33;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_34
    // Size: 0x4
    // Offset: 0x88
    float ExpressionWeights_34;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_35
    // Size: 0x4
    // Offset: 0x8C
    float ExpressionWeights_35;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_36
    // Size: 0x4
    // Offset: 0x90
    float ExpressionWeights_36;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_37
    // Size: 0x4
    // Offset: 0x94
    float ExpressionWeights_37;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_38
    // Size: 0x4
    // Offset: 0x98
    float ExpressionWeights_38;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_39
    // Size: 0x4
    // Offset: 0x9C
    float ExpressionWeights_39;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_40
    // Size: 0x4
    // Offset: 0xA0
    float ExpressionWeights_40;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_41
    // Size: 0x4
    // Offset: 0xA4
    float ExpressionWeights_41;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_42
    // Size: 0x4
    // Offset: 0xA8
    float ExpressionWeights_42;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_43
    // Size: 0x4
    // Offset: 0xAC
    float ExpressionWeights_43;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_44
    // Size: 0x4
    // Offset: 0xB0
    float ExpressionWeights_44;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_45
    // Size: 0x4
    // Offset: 0xB4
    float ExpressionWeights_45;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_46
    // Size: 0x4
    // Offset: 0xB8
    float ExpressionWeights_46;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_47
    // Size: 0x4
    // Offset: 0xBC
    float ExpressionWeights_47;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_48
    // Size: 0x4
    // Offset: 0xC0
    float ExpressionWeights_48;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_49
    // Size: 0x4
    // Offset: 0xC4
    float ExpressionWeights_49;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_50
    // Size: 0x4
    // Offset: 0xC8
    float ExpressionWeights_50;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_51
    // Size: 0x4
    // Offset: 0xCC
    float ExpressionWeights_51;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_52
    // Size: 0x4
    // Offset: 0xD0
    float ExpressionWeights_52;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_53
    // Size: 0x4
    // Offset: 0xD4
    float ExpressionWeights_53;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_54
    // Size: 0x4
    // Offset: 0xD8
    float ExpressionWeights_54;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_55
    // Size: 0x4
    // Offset: 0xDC
    float ExpressionWeights_55;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_56
    // Size: 0x4
    // Offset: 0xE0
    float ExpressionWeights_56;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_57
    // Size: 0x4
    // Offset: 0xE4
    float ExpressionWeights_57;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_58
    // Size: 0x4
    // Offset: 0xE8
    float ExpressionWeights_58;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_59
    // Size: 0x4
    // Offset: 0xEC
    float ExpressionWeights_59;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_60
    // Size: 0x4
    // Offset: 0xF0
    float ExpressionWeights_60;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_61
    // Size: 0x4
    // Offset: 0xF4
    float ExpressionWeights_61;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeights_62
    // Size: 0x4
    // Offset: 0xF8
    float ExpressionWeights_62;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeightConfidences_0
    // Size: 0x4
    // Offset: 0xFC
    float ExpressionWeightConfidences_0;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ExpressionWeightConfidences_1
    // Size: 0x4
    // Offset: 0x100
    float ExpressionWeightConfidences_1;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public OVRPlugin/FaceExpressionStatusInternal Status
    // Size: 0x8
    // Offset: 0x104
    ::GlobalNamespace::OVRPlugin::FaceExpressionStatusInternal Status;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRPlugin::FaceExpressionStatusInternal) == 0x8);
    // Padding between fields: Status and: Time
    char __padding65[0x4] = {};
    // public System.Double Time
    // Size: 0x8
    // Offset: 0x110
    double Time;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    public:
    // Creating value type constructor for type: FaceState2Internal
