// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: OVRAnchor
#include "GlobalNamespace/OVRAnchor.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: OVRSceneAnchor
  class OVRSceneAnchor;
  // Forward declaring type: OVRScenePrefabOverride
  class OVRScenePrefabOverride;
  // Forward declaring type: OVRCameraRig
  class OVRCameraRig;
  // Skipping declaration: OVRTask`1 because it is already included!
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: IEnumerable`1<T>
  template<typename T>
  class IEnumerable_1;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: HashSet`1<T>
  template<typename T>
  class HashSet_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Nullable`1<T>
  template<typename T>
  struct Nullable_1;
}
// Forward declaring namespace: Unity::Collections
namespace Unity::Collections {
  // Forward declaring type: NativeArray`1<T>
  template<typename T>
  struct NativeArray_1;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: OVRSceneManager
  class OVRSceneManager;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::OVRSceneManager);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::OVRSceneManager*, "", "OVRSceneManager");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0xD0
  #pragma pack(push, 1)
  // Autogenerated type: OVRSceneManager
  // [TokenAttribute] Offset: FFFFFFFF
  // [HelpURLAttribute] Offset: FFFFFFFF
  class OVRSceneManager : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::GlobalNamespace::OVRSceneManager::Classification
    class Classification;
    // Nested type: ::GlobalNamespace::OVRSceneManager::RoomLayoutInformation
    class RoomLayoutInformation;
    // Nested type: ::GlobalNamespace::OVRSceneManager::LogForwarder
    struct LogForwarder;
    // Nested type: ::GlobalNamespace::OVRSceneManager::Development
    class Development;
    // Nested type: ::GlobalNamespace::OVRSceneManager::$$c__DisplayClass48_0
    class $$c__DisplayClass48_0;
    // Nested type: ::GlobalNamespace::OVRSceneManager::$$c__DisplayClass51_0
    class $$c__DisplayClass51_0;
    // Nested type: ::GlobalNamespace::OVRSceneManager::$OnApplicationPause$d__35
    struct $OnApplicationPause$d__35;
    // Nested type: ::GlobalNamespace::OVRSceneManager::$QueryForExistingAnchorsTransform$d__36
    struct $QueryForExistingAnchorsTransform$d__36;
    // Size: 0x0
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: OVRSceneManager/LogForwarder
    // [TokenAttribute] Offset: FFFFFFFF
    struct LogForwarder/*, public ::System::ValueType*/ {
      public:
      // Creating value type constructor for type: LogForwarder
      constexpr LogForwarder() noexcept {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // public System.Void Log(System.String context, System.String message, UnityEngine.GameObject gameObject)
      // Offset: 0x491E7AC
      void Log(::StringW context, ::StringW message, ::UnityEngine::GameObject* gameObject);
      // public System.Void LogWarning(System.String context, System.String message, UnityEngine.GameObject gameObject)
      // Offset: 0x491DEA0
      void LogWarning(::StringW context, ::StringW message, ::UnityEngine::GameObject* gameObject);
      // public System.Void LogError(System.String context, System.String message, UnityEngine.GameObject gameObject)
      // Offset: 0x491CFD8
      void LogError(::StringW context, ::StringW message, ::UnityEngine::GameObject* gameObject);
    }; // OVRSceneManager/LogForwarder
    #pragma pack(pop)
    public:
    // public OVRSceneAnchor PlanePrefab
    // Size: 0x8
    // Offset: 0x20
    ::GlobalNamespace::OVRSceneAnchor* PlanePrefab;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRSceneAnchor*) == 0x8);
    // public OVRSceneAnchor VolumePrefab
    // Size: 0x8
    // Offset: 0x28
    ::GlobalNamespace::OVRSceneAnchor* VolumePrefab;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRSceneAnchor*) == 0x8);
    // public System.Collections.Generic.List`1<OVRScenePrefabOverride> PrefabOverrides
    // Size: 0x8
    // Offset: 0x30
    ::System::Collections::Generic::List_1<::GlobalNamespace::OVRScenePrefabOverride*>* PrefabOverrides;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GlobalNamespace::OVRScenePrefabOverride*>*) == 0x8);
    // public System.Boolean ActiveRoomsOnly
    // Size: 0x1
    // Offset: 0x38
    bool ActiveRoomsOnly;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean VerboseLogging
    // Size: 0x1
    // Offset: 0x39
    bool VerboseLogging;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: VerboseLogging and: MaxSceneAnchorUpdatesPerFrame
    char __padding4[0x2] = {};
    // public System.Int32 MaxSceneAnchorUpdatesPerFrame
    // Size: 0x4
    // Offset: 0x3C
    int MaxSceneAnchorUpdatesPerFrame;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // UnityEngine.Transform _initialAnchorParent
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::Transform* initialAnchorParent;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public System.Action SceneModelLoadedSuccessfully
    // Size: 0x8
    // Offset: 0x48
    ::System::Action* SceneModelLoadedSuccessfully;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // public System.Action NoSceneModelToLoad
    // Size: 0x8
    // Offset: 0x50
    ::System::Action* NoSceneModelToLoad;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // public System.Action SceneCaptureReturnedWithoutError
    // Size: 0x8
    // Offset: 0x58
    ::System::Action* SceneCaptureReturnedWithoutError;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // public System.Action UnexpectedErrorWithSceneCapture
    // Size: 0x8
    // Offset: 0x60
    ::System::Action* UnexpectedErrorWithSceneCapture;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // public System.Action NewSceneModelAvailable
    // Size: 0x8
    // Offset: 0x68
    ::System::Action* NewSceneModelAvailable;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // public OVRSceneManager/RoomLayoutInformation RoomLayout
    // Size: 0x8
    // Offset: 0x70
    ::GlobalNamespace::OVRSceneManager::RoomLayoutInformation* RoomLayout;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRSceneManager::RoomLayoutInformation*) == 0x8);
    // private System.UInt64 _sceneCaptureRequestId
    // Size: 0x8
    // Offset: 0x78
    uint64_t sceneCaptureRequestId;
    // Field size check
    static_assert(sizeof(uint64_t) == 0x8);
    // private OVRCameraRig _cameraRig
    // Size: 0x8
    // Offset: 0x80
    ::GlobalNamespace::OVRCameraRig* cameraRig;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRCameraRig*) == 0x8);
    // private System.Int32 _sceneAnchorUpdateIndex
    // Size: 0x4
    // Offset: 0x88
    int sceneAnchorUpdateIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _roomCounter
    // Size: 0x4
    // Offset: 0x8C
    int roomCounter;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Action`2<System.Boolean,System.Collections.Generic.List`1<OVRAnchor>> _onAnchorsFetchCompleted
    // Size: 0x8
    // Offset: 0x90
    ::System::Action_2<bool, ::System::Collections::Generic::List_1<::GlobalNamespace::OVRAnchor>*>* onAnchorsFetchCompleted;
    // Field size check
    static_assert(sizeof(::System::Action_2<bool, ::System::Collections::Generic::List_1<::GlobalNamespace::OVRAnchor>*>*) == 0x8);
    // private System.Boolean _hasLoadedScene
    // Size: 0x1
    // Offset: 0x98
    bool hasLoadedScene;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: hasLoadedScene and: onFloorAnchorsFetchCompleted
    char __padding18[0x7] = {};
    // private System.Action`1<System.Boolean> _onFloorAnchorsFetchCompleted
    // Size: 0x8
    // Offset: 0xA0
    ::System::Action_1<bool>* onFloorAnchorsFetchCompleted;
    // Field size check
    static_assert(sizeof(::System::Action_1<bool>*) == 0x8);
    // private System.Action`2<System.Boolean,OVRAnchor> _onFloorAnchorLocalizationCompleted
    // Size: 0x8
    // Offset: 0xA8
    ::System::Action_2<bool, ::GlobalNamespace::OVRAnchor>* onFloorAnchorLocalizationCompleted;
    // Field size check
    static_assert(sizeof(::System::Action_2<bool, ::GlobalNamespace::OVRAnchor>*) == 0x8);
    // private System.Collections.Generic.List`1<OVRAnchor> _floorAnchors
    // Size: 0x8
    // Offset: 0xB0
    ::System::Collections::Generic::List_1<::GlobalNamespace::OVRAnchor>* floorAnchors;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GlobalNamespace::OVRAnchor>*) == 0x8);
    // private readonly System.Collections.Generic.HashSet`1<System.Guid> _pendingLocatable
    // Size: 0x8
    // Offset: 0xB8
    ::System::Collections::Generic::HashSet_1<::System::Guid>* pendingLocatable;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::HashSet_1<::System::Guid>*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.Guid,OVRAnchor> _roomAndFloorPairs
    // Size: 0x8
    // Offset: 0xC0
    ::System::Collections::Generic::Dictionary_2<::System::Guid, ::GlobalNamespace::OVRAnchor>* roomAndFloorPairs;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::System::Guid, ::GlobalNamespace::OVRAnchor>*) == 0x8);
    // private System.Collections.Generic.List`1<OVRAnchor> _roomLayoutAnchors
    // Size: 0x8
    // Offset: 0xC8
    ::System::Collections::Generic::List_1<::GlobalNamespace::OVRAnchor>* roomLayoutAnchors;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GlobalNamespace::OVRAnchor>*) == 0x8);
    public:
    // Get instance field reference: public OVRSceneAnchor PlanePrefab
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::OVRSceneAnchor*& dyn_PlanePrefab();
    // Get instance field reference: public OVRSceneAnchor VolumePrefab
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::OVRSceneAnchor*& dyn_VolumePrefab();
    // Get instance field reference: public System.Collections.Generic.List`1<OVRScenePrefabOverride> PrefabOverrides
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::GlobalNamespace::OVRScenePrefabOverride*>*& dyn_PrefabOverrides();
    // Get instance field reference: public System.Boolean ActiveRoomsOnly
