// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: System.Nullable`1
#include "System/Nullable_1.hpp"
// Including type: OVRTrackedKeyboard
#include "GlobalNamespace/OVRTrackedKeyboard.hpp"
// Including type: OVRSkeleton/BoneId
#include "GlobalNamespace/OVRSkeleton_BoneId.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: SkinnedMeshRenderer
  class SkinnedMeshRenderer;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: OVRCameraRig
  class OVRCameraRig;
  // Forward declaring type: OVRHand
  class OVRHand;
  // Skipping declaration: OVRSkeleton because it is already included!
  // Forward declaring type: OVRSkeletonRenderer
  class OVRSkeletonRenderer;
  // Forward declaring type: OVRMeshRenderer
  class OVRMeshRenderer;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: OVRTrackedKeyboardHands
  class OVRTrackedKeyboardHands;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::OVRTrackedKeyboardHands);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::OVRTrackedKeyboardHands*, "", "OVRTrackedKeyboardHands");
// Type namespace: 
namespace GlobalNamespace {
  // WARNING Size may be invalid!
  // Autogenerated type: OVRTrackedKeyboardHands
  // [TokenAttribute] Offset: FFFFFFFF
  class OVRTrackedKeyboardHands : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::GlobalNamespace::OVRTrackedKeyboardHands::HandBoneMapping
    struct HandBoneMapping;
    // Nested type: ::GlobalNamespace::OVRTrackedKeyboardHands::TrackedKeyboardHandsVisibilityChangedEvent
    struct TrackedKeyboardHandsVisibilityChangedEvent;
    // Size: 0x38
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: OVRTrackedKeyboardHands/HandBoneMapping
    // [TokenAttribute] Offset: FFFFFFFF
    struct HandBoneMapping/*, public ::System::ValueType*/ {
      public:
      public:
      // public UnityEngine.Transform LeftHandTransform
      // Size: 0x8
      // Offset: 0x0
      ::UnityEngine::Transform* LeftHandTransform;
      // Field size check
      static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
      // public UnityEngine.Transform LeftPresenceTransform
      // Size: 0x8
      // Offset: 0x8
      ::UnityEngine::Transform* LeftPresenceTransform;
      // Field size check
      static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
      // public UnityEngine.Transform RightHandTransform
      // Size: 0x8
      // Offset: 0x10
      ::UnityEngine::Transform* RightHandTransform;
      // Field size check
      static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
      // public UnityEngine.Transform RightPresenceTransform
      // Size: 0x8
      // Offset: 0x18
      ::UnityEngine::Transform* RightPresenceTransform;
      // Field size check
      static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
      // public OVRSkeleton/BoneId BoneName
      // Size: 0x4
      // Offset: 0x20
      ::GlobalNamespace::OVRSkeleton::BoneId BoneName;
      // Field size check
      static_assert(sizeof(::GlobalNamespace::OVRSkeleton::BoneId) == 0x4);
      // Padding between fields: BoneName and: HandPresenceLeftBoneName
      char __padding4[0x4] = {};
      // public System.String HandPresenceLeftBoneName
      // Size: 0x8
      // Offset: 0x28
      ::StringW HandPresenceLeftBoneName;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      // public System.String HandPresenceRightBoneName
      // Size: 0x8
      // Offset: 0x30
      ::StringW HandPresenceRightBoneName;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      public:
      // Creating value type constructor for type: HandBoneMapping
      constexpr HandBoneMapping(::UnityEngine::Transform* LeftHandTransform_ = {}, ::UnityEngine::Transform* LeftPresenceTransform_ = {}, ::UnityEngine::Transform* RightHandTransform_ = {}, ::UnityEngine::Transform* RightPresenceTransform_ = {}, ::GlobalNamespace::OVRSkeleton::BoneId BoneName_ = {}, ::StringW HandPresenceLeftBoneName_ = {}, ::StringW HandPresenceRightBoneName_ = {}) noexcept : LeftHandTransform{LeftHandTransform_}, LeftPresenceTransform{LeftPresenceTransform_}, RightHandTransform{RightHandTransform_}, RightPresenceTransform{RightPresenceTransform_}, BoneName{BoneName_}, HandPresenceLeftBoneName{HandPresenceLeftBoneName_}, HandPresenceRightBoneName{HandPresenceRightBoneName_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public UnityEngine.Transform LeftHandTransform
      [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_LeftHandTransform();
      // Get instance field reference: public UnityEngine.Transform LeftPresenceTransform
      [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_LeftPresenceTransform();
      // Get instance field reference: public UnityEngine.Transform RightHandTransform
      [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_RightHandTransform();
      // Get instance field reference: public UnityEngine.Transform RightPresenceTransform
      [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_RightPresenceTransform();
      // Get instance field reference: public OVRSkeleton/BoneId BoneName
      [[deprecated("Use field access instead!")]] ::GlobalNamespace::OVRSkeleton::BoneId& dyn_BoneName();
      // Get instance field reference: public System.String HandPresenceLeftBoneName
      [[deprecated("Use field access instead!")]] ::StringW& dyn_HandPresenceLeftBoneName();
      // Get instance field reference: public System.String HandPresenceRightBoneName
      [[deprecated("Use field access instead!")]] ::StringW& dyn_HandPresenceRightBoneName();
    }; // OVRTrackedKeyboardHands/HandBoneMapping
    #pragma pack(pop)
    static check_size<sizeof(OVRTrackedKeyboardHands::HandBoneMapping), 48 + sizeof(::StringW)> __GlobalNamespace_OVRTrackedKeyboardHands_HandBoneMappingSizeCheck;
    static_assert(sizeof(OVRTrackedKeyboardHands::HandBoneMapping) == 0x38);
    // Size: 0x2
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: OVRTrackedKeyboardHands/TrackedKeyboardHandsVisibilityChangedEvent
    // [TokenAttribute] Offset: FFFFFFFF
    struct TrackedKeyboardHandsVisibilityChangedEvent/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.Boolean leftVisible
      // Size: 0x1
      // Offset: 0x0
      bool leftVisible;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // public System.Boolean rightVisible
      // Size: 0x1
      // Offset: 0x1
      bool rightVisible;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      public:
      // Creating value type constructor for type: TrackedKeyboardHandsVisibilityChangedEvent
      constexpr TrackedKeyboardHandsVisibilityChangedEvent(bool leftVisible_ = {}, bool rightVisible_ = {}) noexcept : leftVisible{leftVisible_}, rightVisible{rightVisible_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public System.Boolean leftVisible
      [[deprecated("Use field access instead!")]] bool& dyn_leftVisible();
      // Get instance field reference: public System.Boolean rightVisible
      [[deprecated("Use field access instead!")]] bool& dyn_rightVisible();
    }; // OVRTrackedKeyboardHands/TrackedKeyboardHandsVisibilityChangedEvent
    #pragma pack(pop)
    static check_size<sizeof(OVRTrackedKeyboardHands::TrackedKeyboardHandsVisibilityChangedEvent), 1 + sizeof(bool)> __GlobalNamespace_OVRTrackedKeyboardHands_TrackedKeyboardHandsVisibilityChangedEventSizeCheck;
    static_assert(sizeof(OVRTrackedKeyboardHands::TrackedKeyboardHandsVisibilityChangedEvent) == 0x2);
    public:
    // public UnityEngine.GameObject LeftHandPresence
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::GameObject* LeftHandPresence;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject RightHandPresence
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::GameObject* RightHandPresence;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Boolean handPresenceInitialized_
    // Size: 0x1
    // Offset: 0x30
    bool handPresenceInitialized;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private UnityEngine.Transform leftHandRoot_
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::Transform* leftHandRoot;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform rightHandRoot_
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::Transform* rightHandRoot;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public OVRTrackedKeyboard KeyboardTracker
    // Size: 0x8
    // Offset: 0x48
    ::GlobalNamespace::OVRTrackedKeyboard* KeyboardTracker;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRTrackedKeyboard*) == 0x8);
    // private OVRCameraRig cameraRig_
    // Size: 0x8
    // Offset: 0x50
    ::GlobalNamespace::OVRCameraRig* cameraRig;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRCameraRig*) == 0x8);
    // private OVRHand leftHand_
    // Size: 0x8
    // Offset: 0x58
    ::GlobalNamespace::OVRHand* leftHand;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRHand*) == 0x8);
    // private OVRSkeleton leftHandSkeleton_
    // Size: 0x8
    // Offset: 0x60
    ::GlobalNamespace::OVRSkeleton* leftHandSkeleton;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRSkeleton*) == 0x8);
    // private OVRSkeletonRenderer leftHandSkeletonRenderer_
    // Size: 0x8
    // Offset: 0x68
    ::GlobalNamespace::OVRSkeletonRenderer* leftHandSkeletonRenderer;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRSkeletonRenderer*) == 0x8);
    // private UnityEngine.GameObject leftHandSkeletonRendererGO_
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::GameObject* leftHandSkeletonRendererGO;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.SkinnedMeshRenderer leftHandSkinnedMeshRenderer_
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::SkinnedMeshRenderer* leftHandSkinnedMeshRenderer;
    // Field size check
    static_assert(sizeof(::UnityEngine::SkinnedMeshRenderer*) == 0x8);
    // private OVRMeshRenderer leftHandMeshRenderer_
    // Size: 0x8
    // Offset: 0x80
    ::GlobalNamespace::OVRMeshRenderer* leftHandMeshRenderer;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRMeshRenderer*) == 0x8);
    // private OVRHand rightHand_
    // Size: 0x8
    // Offset: 0x88
    ::GlobalNamespace::OVRHand* rightHand;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRHand*) == 0x8);
    // private OVRSkeleton rightHandSkeleton_
    // Size: 0x8
    // Offset: 0x90
    ::GlobalNamespace::OVRSkeleton* rightHandSkeleton;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRSkeleton*) == 0x8);
    // private OVRSkeletonRenderer rightHandSkeletonRenderer_
    // Size: 0x8
    // Offset: 0x98
    ::GlobalNamespace::OVRSkeletonRenderer* rightHandSkeletonRenderer;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRSkeletonRenderer*) == 0x8);
    // private UnityEngine.GameObject rightHandSkeletonRendererGO_
    // Size: 0x8
    // Offset: 0xA0
    ::UnityEngine::GameObject* rightHandSkeletonRendererGO;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private OVRMeshRenderer rightHandMeshRenderer_
    // Size: 0x8
    // Offset: 0xA8
    ::GlobalNamespace::OVRMeshRenderer* rightHandMeshRenderer;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRMeshRenderer*) == 0x8);
    // private UnityEngine.SkinnedMeshRenderer rightHandSkinnedMeshRenderer_
    // Size: 0x8
    // Offset: 0xB0
    ::UnityEngine::SkinnedMeshRenderer* rightHandSkinnedMeshRenderer;
    // Field size check
    static_assert(sizeof(::UnityEngine::SkinnedMeshRenderer*) == 0x8);
    // private System.Boolean <RightHandOverKeyboard>k__BackingField
    // Size: 0x1
    // Offset: 0xB8
    bool RightHandOverKeyboard;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <LeftHandOverKeyboard>k__BackingField
    // Size: 0x1
    // Offset: 0xB9
    bool LeftHandOverKeyboard;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Nullable`1<OVRTrackedKeyboardHands/TrackedKeyboardHandsVisibilityChangedEvent> lastVisibilityEvent_
    // Size: 0xFFFFFFFF
    // Offset: 0xBA
    ::System::Nullable_1<::GlobalNamespace::OVRTrackedKeyboardHands::TrackedKeyboardHandsVisibilityChangedEvent> lastVisibilityEvent;
    // private readonly OVRTrackedKeyboardHands/HandBoneMapping[] boneMappings_
    // Size: 0x8
    // Offset: 0xC0
    ::ArrayW<::GlobalNamespace::OVRTrackedKeyboardHands::HandBoneMapping> boneMappings;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::OVRTrackedKeyboardHands::HandBoneMapping>) == 0x8);
    // public UnityEngine.Material HandsMaterial
    // Size: 0x8
    // Offset: 0xC8
    ::UnityEngine::Material* HandsMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private System.Int32 keyboardPositionID_
    // Size: 0x4
    // Offset: 0xD0
    int keyboardPositionID;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 keyboardRotationID_
    // Size: 0x4
    // Offset: 0xD4
    int keyboardRotationID;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 keyboardScaleID_
    // Size: 0x4
    // Offset: 0xD8
    int keyboardScaleID;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Get static field: static private readonly System.Single handInnerAlphaThreshold_
    static float _get_handInnerAlphaThreshold_();
    // Set static field: static private readonly System.Single handInnerAlphaThreshold_
    static void _set_handInnerAlphaThreshold_(float value);
    // Get static field: static private readonly System.Single handOuterAlphaThreshold_
    static float _get_handOuterAlphaThreshold_();
    // Set static field: static private readonly System.Single handOuterAlphaThreshold_
    static void _set_handOuterAlphaThreshold_(float value);
    // Get static field: static private readonly System.Single maximumPassthroughHandsDistance_
    static float _get_maximumPassthroughHandsDistance_();
    // Set static field: static private readonly System.Single maximumPassthroughHandsDistance_
