// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: OVRKeyboard/TrackedKeyboardInfo
#include "GlobalNamespace/OVRKeyboard_TrackedKeyboardInfo.hpp"
// Including type: OVRPlugin/TrackedKeyboardQueryFlags
#include "GlobalNamespace/OVRPlugin_TrackedKeyboardQueryFlags.hpp"
// Including type: OVRTextureQualityFiltering
#include "GlobalNamespace/OVRTextureQualityFiltering.hpp"
// Including type: System.Nullable`1
#include "System/Nullable_1.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: OVROverlay
  class OVROverlay;
  // Forward declaring type: OVRCameraRig
  class OVRCameraRig;
  // Forward declaring type: OVRPassthroughLayer
  class OVRPassthroughLayer;
  // Skipping declaration: TrackedKeyboardState because it is already included!
  // Skipping declaration: KeyboardPresentation because it is already included!
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Shader
  class Shader;
  // Forward declaring type: Coroutine
  class Coroutine;
  // Forward declaring type: MeshRenderer
  class MeshRenderer;
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Texture2D
  class Texture2D;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: MeshFilter
  class MeshFilter;
  // Forward declaring type: BoxCollider
  class BoxCollider;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: OVRTrackedKeyboard
  class OVRTrackedKeyboard;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::OVRTrackedKeyboard);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::OVRTrackedKeyboard*, "", "OVRTrackedKeyboard");
// Type namespace: 
namespace GlobalNamespace {
  // WARNING Size may be invalid!
  // Autogenerated type: OVRTrackedKeyboard
  // [TokenAttribute] Offset: FFFFFFFF
  class OVRTrackedKeyboard : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::GlobalNamespace::OVRTrackedKeyboard::TrackedKeyboardState
    struct TrackedKeyboardState;
    // Nested type: ::GlobalNamespace::OVRTrackedKeyboard::KeyboardPresentation
    struct KeyboardPresentation;
    // Nested type: ::GlobalNamespace::OVRTrackedKeyboard::TrackedKeyboardVisibilityChangedEvent
    struct TrackedKeyboardVisibilityChangedEvent;
    // Nested type: ::GlobalNamespace::OVRTrackedKeyboard::TrackedKeyboardSetActiveEvent
    struct TrackedKeyboardSetActiveEvent;
    // Nested type: ::GlobalNamespace::OVRTrackedKeyboard::$$c
    class $$c;
    // Nested type: ::GlobalNamespace::OVRTrackedKeyboard::$InitializeHandPresenceData$d__86
    class $InitializeHandPresenceData$d__86;
    // Nested type: ::GlobalNamespace::OVRTrackedKeyboard::$Start$d__85
    class $Start$d__85;
    // Nested type: ::GlobalNamespace::OVRTrackedKeyboard::$StartKeyboardTrackingCoroutine$d__93
    class $StartKeyboardTrackingCoroutine$d__93;
    // Nested type: ::GlobalNamespace::OVRTrackedKeyboard::$UpdateKeyboardPose$d__95
    class $UpdateKeyboardPose$d__95;
    // Nested type: ::GlobalNamespace::OVRTrackedKeyboard::$UpdateTrackingStateCoroutine$d__92
    class $UpdateTrackingStateCoroutine$d__92;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: OVRTrackedKeyboard/TrackedKeyboardState
    // [TokenAttribute] Offset: FFFFFFFF
    struct TrackedKeyboardState/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: TrackedKeyboardState
      constexpr TrackedKeyboardState(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public OVRTrackedKeyboard/TrackedKeyboardState Uninitialized
      static constexpr const int Uninitialized = 0;
      // Get static field: static public OVRTrackedKeyboard/TrackedKeyboardState Uninitialized
      static ::GlobalNamespace::OVRTrackedKeyboard::TrackedKeyboardState _get_Uninitialized();
      // Set static field: static public OVRTrackedKeyboard/TrackedKeyboardState Uninitialized
      static void _set_Uninitialized(::GlobalNamespace::OVRTrackedKeyboard::TrackedKeyboardState value);
      // static field const value: static public OVRTrackedKeyboard/TrackedKeyboardState NoTrackableKeyboard
      static constexpr const int NoTrackableKeyboard = 1;
      // Get static field: static public OVRTrackedKeyboard/TrackedKeyboardState NoTrackableKeyboard
      static ::GlobalNamespace::OVRTrackedKeyboard::TrackedKeyboardState _get_NoTrackableKeyboard();
      // Set static field: static public OVRTrackedKeyboard/TrackedKeyboardState NoTrackableKeyboard
      static void _set_NoTrackableKeyboard(::GlobalNamespace::OVRTrackedKeyboard::TrackedKeyboardState value);
      // static field const value: static public OVRTrackedKeyboard/TrackedKeyboardState Offline
      static constexpr const int Offline = 2;
      // Get static field: static public OVRTrackedKeyboard/TrackedKeyboardState Offline
      static ::GlobalNamespace::OVRTrackedKeyboard::TrackedKeyboardState _get_Offline();
      // Set static field: static public OVRTrackedKeyboard/TrackedKeyboardState Offline
      static void _set_Offline(::GlobalNamespace::OVRTrackedKeyboard::TrackedKeyboardState value);
      // static field const value: static public OVRTrackedKeyboard/TrackedKeyboardState StartedNotTracked
      static constexpr const int StartedNotTracked = 3;
      // Get static field: static public OVRTrackedKeyboard/TrackedKeyboardState StartedNotTracked
      static ::GlobalNamespace::OVRTrackedKeyboard::TrackedKeyboardState _get_StartedNotTracked();
      // Set static field: static public OVRTrackedKeyboard/TrackedKeyboardState StartedNotTracked
      static void _set_StartedNotTracked(::GlobalNamespace::OVRTrackedKeyboard::TrackedKeyboardState value);
      // static field const value: static public OVRTrackedKeyboard/TrackedKeyboardState Stale
      static constexpr const int Stale = 4;
      // Get static field: static public OVRTrackedKeyboard/TrackedKeyboardState Stale
      static ::GlobalNamespace::OVRTrackedKeyboard::TrackedKeyboardState _get_Stale();
      // Set static field: static public OVRTrackedKeyboard/TrackedKeyboardState Stale
      static void _set_Stale(::GlobalNamespace::OVRTrackedKeyboard::TrackedKeyboardState value);
      // static field const value: static public OVRTrackedKeyboard/TrackedKeyboardState Valid
      static constexpr const int Valid = 5;
      // Get static field: static public OVRTrackedKeyboard/TrackedKeyboardState Valid
      static ::GlobalNamespace::OVRTrackedKeyboard::TrackedKeyboardState _get_Valid();
      // Set static field: static public OVRTrackedKeyboard/TrackedKeyboardState Valid
      static void _set_Valid(::GlobalNamespace::OVRTrackedKeyboard::TrackedKeyboardState value);
      // static field const value: static public OVRTrackedKeyboard/TrackedKeyboardState Error
      static constexpr const int Error = 6;
      // Get static field: static public OVRTrackedKeyboard/TrackedKeyboardState Error
      static ::GlobalNamespace::OVRTrackedKeyboard::TrackedKeyboardState _get_Error();
      // Set static field: static public OVRTrackedKeyboard/TrackedKeyboardState Error
      static void _set_Error(::GlobalNamespace::OVRTrackedKeyboard::TrackedKeyboardState value);
      // static field const value: static public OVRTrackedKeyboard/TrackedKeyboardState ErrorExtensionFailed
      static constexpr const int ErrorExtensionFailed = 7;
      // Get static field: static public OVRTrackedKeyboard/TrackedKeyboardState ErrorExtensionFailed
      static ::GlobalNamespace::OVRTrackedKeyboard::TrackedKeyboardState _get_ErrorExtensionFailed();
      // Set static field: static public OVRTrackedKeyboard/TrackedKeyboardState ErrorExtensionFailed
      static void _set_ErrorExtensionFailed(::GlobalNamespace::OVRTrackedKeyboard::TrackedKeyboardState value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // OVRTrackedKeyboard/TrackedKeyboardState
    #pragma pack(pop)
    static check_size<sizeof(OVRTrackedKeyboard::TrackedKeyboardState), 0 + sizeof(int)> __GlobalNamespace_OVRTrackedKeyboard_TrackedKeyboardStateSizeCheck;
    static_assert(sizeof(OVRTrackedKeyboard::TrackedKeyboardState) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: OVRTrackedKeyboard/KeyboardPresentation
    // [TokenAttribute] Offset: FFFFFFFF
    struct KeyboardPresentation/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: KeyboardPresentation
      constexpr KeyboardPresentation(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public OVRTrackedKeyboard/KeyboardPresentation PreferOpaque
      static constexpr const int PreferOpaque = 0;
      // Get static field: static public OVRTrackedKeyboard/KeyboardPresentation PreferOpaque
      static ::GlobalNamespace::OVRTrackedKeyboard::KeyboardPresentation _get_PreferOpaque();
      // Set static field: static public OVRTrackedKeyboard/KeyboardPresentation PreferOpaque
      static void _set_PreferOpaque(::GlobalNamespace::OVRTrackedKeyboard::KeyboardPresentation value);
      // static field const value: static public OVRTrackedKeyboard/KeyboardPresentation PreferMR
      static constexpr const int PreferMR = 1;
      // Get static field: static public OVRTrackedKeyboard/KeyboardPresentation PreferMR
      static ::GlobalNamespace::OVRTrackedKeyboard::KeyboardPresentation _get_PreferMR();
      // Set static field: static public OVRTrackedKeyboard/KeyboardPresentation PreferMR
      static void _set_PreferMR(::GlobalNamespace::OVRTrackedKeyboard::KeyboardPresentation value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // OVRTrackedKeyboard/KeyboardPresentation
    #pragma pack(pop)
    static check_size<sizeof(OVRTrackedKeyboard::KeyboardPresentation), 0 + sizeof(int)> __GlobalNamespace_OVRTrackedKeyboard_KeyboardPresentationSizeCheck;
    static_assert(sizeof(OVRTrackedKeyboard::KeyboardPresentation) == 0x4);
    // Size: 0xD
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: OVRTrackedKeyboard/TrackedKeyboardVisibilityChangedEvent
    // [TokenAttribute] Offset: FFFFFFFF
    struct TrackedKeyboardVisibilityChangedEvent/*, public ::System::ValueType*/ {
      public:
      public:
      // public readonly System.String ActiveKeyboardName
      // Size: 0x8
      // Offset: 0x0
      ::StringW ActiveKeyboardName;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      // public readonly OVRTrackedKeyboard/TrackedKeyboardState State
      // Size: 0x4
      // Offset: 0x8
      ::GlobalNamespace::OVRTrackedKeyboard::TrackedKeyboardState State;
      // Field size check
      static_assert(sizeof(::GlobalNamespace::OVRTrackedKeyboard::TrackedKeyboardState) == 0x4);
      // public readonly System.Boolean TrackingTimeout
      // Size: 0x1
      // Offset: 0xC
      bool TrackingTimeout;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      public:
      // Creating value type constructor for type: TrackedKeyboardVisibilityChangedEvent
      constexpr TrackedKeyboardVisibilityChangedEvent(::StringW ActiveKeyboardName_ = {}, ::GlobalNamespace::OVRTrackedKeyboard::TrackedKeyboardState State_ = {}, bool TrackingTimeout_ = {}) noexcept : ActiveKeyboardName{ActiveKeyboardName_}, State{State_}, TrackingTimeout{TrackingTimeout_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public readonly System.String ActiveKeyboardName
      [[deprecated("Use field access instead!")]] ::StringW& dyn_ActiveKeyboardName();
      // Get instance field reference: public readonly OVRTrackedKeyboard/TrackedKeyboardState State
      [[deprecated("Use field access instead!")]] ::GlobalNamespace::OVRTrackedKeyboard::TrackedKeyboardState& dyn_State();
      // Get instance field reference: public readonly System.Boolean TrackingTimeout
      [[deprecated("Use field access instead!")]] bool& dyn_TrackingTimeout();
      // public System.Void .ctor(System.String keyboardModel, OVRTrackedKeyboard/TrackedKeyboardState state, System.Boolean timeout)
      // Offset: 0x4931A28
      // ABORTED: conflicts with another method.  TrackedKeyboardVisibilityChangedEvent(::StringW keyboardModel, ::GlobalNamespace::OVRTrackedKeyboard::TrackedKeyboardState state, bool timeout);
    }; // OVRTrackedKeyboard/TrackedKeyboardVisibilityChangedEvent
    #pragma pack(pop)
    static check_size<sizeof(OVRTrackedKeyboard::TrackedKeyboardVisibilityChangedEvent), 12 + sizeof(bool)> __GlobalNamespace_OVRTrackedKeyboard_TrackedKeyboardVisibilityChangedEventSizeCheck;
    static_assert(sizeof(OVRTrackedKeyboard::TrackedKeyboardVisibilityChangedEvent) == 0xD);
    // Size: 0x1
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: OVRTrackedKeyboard/TrackedKeyboardSetActiveEvent
    // [TokenAttribute] Offset: FFFFFFFF
    struct TrackedKeyboardSetActiveEvent/*, public ::System::ValueType*/ {
      public:
      public:
      // public readonly System.Boolean IsEnabled
      // Size: 0x1
      // Offset: 0x0
      bool IsEnabled;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      public:
      // Creating value type constructor for type: TrackedKeyboardSetActiveEvent
      constexpr TrackedKeyboardSetActiveEvent(bool IsEnabled_ = {}) noexcept : IsEnabled{IsEnabled_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Creating conversion operator: operator bool
      constexpr operator bool() const noexcept {
        return IsEnabled;
      }
      // Get instance field reference: public readonly System.Boolean IsEnabled
      [[deprecated("Use field access instead!")]] bool& dyn_IsEnabled();
      // public System.Void .ctor(System.Boolean isEnabled)
      // Offset: 0x4931C80
      // ABORTED: conflicts with another method.  TrackedKeyboardSetActiveEvent(bool isEnabled);
    }; // OVRTrackedKeyboard/TrackedKeyboardSetActiveEvent
    #pragma pack(pop)
    static check_size<sizeof(OVRTrackedKeyboard::TrackedKeyboardSetActiveEvent), 0 + sizeof(bool)> __GlobalNamespace_OVRTrackedKeyboard_TrackedKeyboardSetActiveEventSizeCheck;
    static_assert(sizeof(OVRTrackedKeyboard::TrackedKeyboardSetActiveEvent) == 0x1);
    public:
    // private System.Single <CurrentKeyboardAngleFromUp>k__BackingField
    // Size: 0x4
    // Offset: 0x20
    float CurrentKeyboardAngleFromUp;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private OVRTrackedKeyboard/TrackedKeyboardState <TrackingState>k__BackingField
    // Size: 0x4
    // Offset: 0x24
    ::GlobalNamespace::OVRTrackedKeyboard::TrackedKeyboardState TrackingState;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRTrackedKeyboard::TrackedKeyboardState) == 0x4);
    // private OVRKeyboard/TrackedKeyboardInfo <ActiveKeyboardInfo>k__BackingField
    // Size: 0x24
    // Offset: 0x28
    ::GlobalNamespace::OVRKeyboard::TrackedKeyboardInfo ActiveKeyboardInfo;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRKeyboard::TrackedKeyboardInfo) == 0x24);
    // private OVRKeyboard/TrackedKeyboardInfo <SystemKeyboardInfo>k__BackingField
    // Size: 0x24
    // Offset: 0x50
    ::GlobalNamespace::OVRKeyboard::TrackedKeyboardInfo SystemKeyboardInfo;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRKeyboard::TrackedKeyboardInfo) == 0x24);
    // private System.Boolean trackingEnabled
    // Size: 0x1
    // Offset: 0x78
    bool trackingEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean connectionRequired
    // Size: 0x1
    // Offset: 0x79
    bool connectionRequired;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean showUntracked
    // Size: 0x1
    // Offset: 0x7A
    bool showUntracked;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private OVRPlugin/TrackedKeyboardQueryFlags keyboardQueryFlags
    // Size: 0x4
    // Offset: 0x7C
    ::GlobalNamespace::OVRPlugin::TrackedKeyboardQueryFlags keyboardQueryFlags;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRPlugin::TrackedKeyboardQueryFlags) == 0x4);
    // private OVRTrackedKeyboard/KeyboardPresentation presentation
    // Size: 0x4
    // Offset: 0x80
    ::GlobalNamespace::OVRTrackedKeyboard::KeyboardPresentation presentation;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRTrackedKeyboard::KeyboardPresentation) == 0x4);
    // public OVRTextureQualityFiltering textureFiltering
    // Size: 0x4
    // Offset: 0x84
    ::GlobalNamespace::OVRTextureQualityFiltering textureFiltering;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRTextureQualityFiltering) == 0x4);
    // public System.Single mipmapBias
    // Size: 0x4
    // Offset: 0x88
    float mipmapBias;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single PassthroughBorderMultiplier
    // Size: 0x4
    // Offset: 0x8C
    float PassthroughBorderMultiplier;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.Shader keyboardModelShader
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::Shader* keyboardModelShader;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // public UnityEngine.Shader keyboardModelAlphaBlendShader
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::Shader* keyboardModelAlphaBlendShader;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // private OVRPlugin/TrackedKeyboardPresentationStyles currentKeyboardPresentationStyles
    // Size: 0x4
    // Offset: 0xA0
    ::GlobalNamespace::OVRPlugin::TrackedKeyboardPresentationStyles currentKeyboardPresentationStyles;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRPlugin::TrackedKeyboardPresentationStyles) == 0x4);
    // private OVROverlay projectedPassthroughOpaque_
    // Size: 0x8
    // Offset: 0xA8
    ::GlobalNamespace::OVROverlay* projectedPassthroughOpaque;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVROverlay*) == 0x8);
    // private UnityEngine.MeshRenderer[] activeKeyboardRenderers_
    // Size: 0x8
    // Offset: 0xB0
    ::ArrayW<::UnityEngine::MeshRenderer*> activeKeyboardRenderers;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::MeshRenderer*>) == 0x8);
    // private UnityEngine.GameObject activeKeyboardMesh_
    // Size: 0x8
    // Offset: 0xB8
    ::UnityEngine::GameObject* activeKeyboardMesh;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.MeshRenderer activeKeyboardMeshRenderer_
    // Size: 0x8
    // Offset: 0xC0
    ::UnityEngine::MeshRenderer* activeKeyboardMeshRenderer;
    // Field size check
    static_assert(sizeof(::UnityEngine::MeshRenderer*) == 0x8);
    // private UnityEngine.GameObject passthroughQuad_
    // Size: 0x8
    // Offset: 0xC8
    ::UnityEngine::GameObject* passthroughQuad;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.Texture2D dynamicQualityTexture_
    // Size: 0x8
    // Offset: 0xD0
    ::UnityEngine::Texture2D* dynamicQualityTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture2D*) == 0x8);
    // private UnityEngine.Vector3 untrackedPosition_
    // Size: 0xC
    // Offset: 0xD8
    ::UnityEngine::Vector3 untrackedPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Shader PassthroughShader
    // Size: 0x8
    // Offset: 0xE8
    ::UnityEngine::Shader* PassthroughShader;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // private UnityEngine.Transform projectedPassthroughRoot
    // Size: 0x8
    // Offset: 0xF0
    ::UnityEngine::Transform* projectedPassthroughRoot;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.MeshFilter projectedPassthroughMesh
    // Size: 0x8
    // Offset: 0xF8
    ::UnityEngine::MeshFilter* projectedPassthroughMesh;
    // Field size check
    static_assert(sizeof(::UnityEngine::MeshFilter*) == 0x8);
    // public OVRPassthroughLayer ProjectedPassthroughMR
    // Size: 0x8
    // Offset: 0x100
    ::GlobalNamespace::OVRPassthroughLayer* ProjectedPassthroughMR;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRPassthroughLayer*) == 0x8);
    // public System.Action`1<OVRTrackedKeyboard/TrackedKeyboardSetActiveEvent> TrackedKeyboardActiveChanged
    // Size: 0x8
    // Offset: 0x108
    ::System::Action_1<::GlobalNamespace::OVRTrackedKeyboard::TrackedKeyboardSetActiveEvent>* TrackedKeyboardActiveChanged;
    // Field size check
    static_assert(sizeof(::System::Action_1<::GlobalNamespace::OVRTrackedKeyboard::TrackedKeyboardSetActiveEvent>*) == 0x8);
    // public System.Action`1<OVRTrackedKeyboard/TrackedKeyboardVisibilityChangedEvent> TrackedKeyboardVisibilityChanged
    // Size: 0x8
    // Offset: 0x110
    ::System::Action_1<::GlobalNamespace::OVRTrackedKeyboard::TrackedKeyboardVisibilityChangedEvent>* TrackedKeyboardVisibilityChanged;
    // Field size check
    static_assert(sizeof(::System::Action_1<::GlobalNamespace::OVRTrackedKeyboard::TrackedKeyboardVisibilityChangedEvent>*) == 0x8);
    // public UnityEngine.Transform ActiveKeyboardTransform
    // Size: 0x8
    // Offset: 0x118
    ::UnityEngine::Transform* ActiveKeyboardTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public System.Boolean HandsOverKeyboard
    // Size: 0x1
    // Offset: 0x120
    bool HandsOverKeyboard;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private OVRCameraRig cameraRig_
    // Size: 0x8
    // Offset: 0x128
    ::GlobalNamespace::OVRCameraRig* cameraRig;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRCameraRig*) == 0x8);
    // private UnityEngine.Coroutine updateKeyboardRoutine_
    // Size: 0x8
    // Offset: 0x130
    ::UnityEngine::Coroutine* updateKeyboardRoutine;
    // Field size check
    static_assert(sizeof(::UnityEngine::Coroutine*) == 0x8);
    // private UnityEngine.BoxCollider keyboardBoundingBox_
    // Size: 0x8
    // Offset: 0x138
    ::UnityEngine::BoxCollider* keyboardBoundingBox;
    // Field size check
    static_assert(sizeof(::UnityEngine::BoxCollider*) == 0x8);
    // private System.Single staleTimeoutCounter_
    // Size: 0x4
    // Offset: 0x140
    float staleTimeoutCounter;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single reacquisitionTimer_
    // Size: 0x4
    // Offset: 0x144
    float reacquisitionTimer;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single sendFilteredPoseEventTimer_
    // Size: 0x4
    // Offset: 0x148
    float sendFilteredPoseEventTimer;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 skippedPoseCount_
    // Size: 0x4
    // Offset: 0x14C
    int skippedPoseCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Nullable`1<UnityEngine.Vector3> EWAPosition
    // Size: 0xFFFFFFFF
    // Offset: 0x150
    ::System::Nullable_1<::UnityEngine::Vector3> EWAPosition;
    // private System.Nullable`1<UnityEngine.Quaternion> EWARotation
    // Size: 0xFFFFFFFF
    // Offset: 0x160
    ::System::Nullable_1<::UnityEngine::Quaternion> EWARotation;
    // private System.Single HAND_HEIGHT_TUNING
    // Size: 0x4
    // Offset: 0x174
    float HAND_HEIGHT_TUNING;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean UseHeuristicRollback
    // Size: 0x1
    // Offset: 0x178
    bool UseHeuristicRollback;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get static field: static private readonly System.Single underlayScaleMultX_
    static float _get_underlayScaleMultX_();
    // Set static field: static private readonly System.Single underlayScaleMultX_
    static void _set_underlayScaleMultX_(float value);
    // Get static field: static private readonly System.Single underlayScaleConstY_
    static float _get_underlayScaleConstY_();
    // Set static field: static private readonly System.Single underlayScaleConstY_
    static void _set_underlayScaleConstY_(float value);
    // Get static field: static private readonly System.Single underlayScaleMultZ_
    static float _get_underlayScaleMultZ_();
    // Set static field: static private readonly System.Single underlayScaleMultZ_
    static void _set_underlayScaleMultZ_(float value);
