// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: OVRUnityHumanoidSkeletonRetargeter
#include "GlobalNamespace/OVRUnityHumanoidSkeletonRetargeter.hpp"
// Including type: UnityEngine.HumanBodyBones
#include "UnityEngine/HumanBodyBones.hpp"
// Including type: UnityEngine.Quaternion
#include "UnityEngine/Quaternion.hpp"
// Including type: OVRUnityHumanoidSkeletonRetargeter/OVRHumanBodyBonesMappings/BodyTrackingBoneId
#include "GlobalNamespace/OVRUnityHumanoidSkeletonRetargeter_OVRHumanBodyBonesMappings_BodyTrackingBoneId.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::OVRUnityHumanoidSkeletonRetargeter::JointAdjustment);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::OVRUnityHumanoidSkeletonRetargeter::JointAdjustment*, "", "OVRUnityHumanoidSkeletonRetargeter/JointAdjustment");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x2C
  #pragma pack(push, 1)
  // Autogenerated type: OVRUnityHumanoidSkeletonRetargeter/JointAdjustment
  // [TokenAttribute] Offset: FFFFFFFF
  class OVRUnityHumanoidSkeletonRetargeter::JointAdjustment : public ::Il2CppObject {
    public:
    public:
    // public UnityEngine.HumanBodyBones Joint
    // Size: 0x4
    // Offset: 0x10
    ::UnityEngine::HumanBodyBones Joint;
    // Field size check
    static_assert(sizeof(::UnityEngine::HumanBodyBones) == 0x4);
    // public UnityEngine.Quaternion RotationChange
    // Size: 0x10
    // Offset: 0x14
    ::UnityEngine::Quaternion RotationChange;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // public System.Boolean DisableRotationTransform
    // Size: 0x1
    // Offset: 0x24
    bool DisableRotationTransform;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean DisablePositionTransform
    // Size: 0x1
    // Offset: 0x25
    bool DisablePositionTransform;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: DisablePositionTransform and: BoneIdOverrideValue
    char __padding3[0x2] = {};
    // public OVRUnityHumanoidSkeletonRetargeter/OVRHumanBodyBonesMappings/BodyTrackingBoneId BoneIdOverrideValue
    // Size: 0x4
    // Offset: 0x28
    ::GlobalNamespace::OVRUnityHumanoidSkeletonRetargeter::OVRHumanBodyBonesMappings::BodyTrackingBoneId BoneIdOverrideValue;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRUnityHumanoidSkeletonRetargeter::OVRHumanBodyBonesMappings::BodyTrackingBoneId) == 0x4);
    public:
    // Get instance field reference: public UnityEngine.HumanBodyBones Joint
    [[deprecated("Use field access instead!")]] ::UnityEngine::HumanBodyBones& dyn_Joint();
    // Get instance field reference: public UnityEngine.Quaternion RotationChange
    [[deprecated("Use field access instead!")]] ::UnityEngine::Quaternion& dyn_RotationChange();
    // Get instance field reference: public System.Boolean DisableRotationTransform
    [[deprecated("Use field access instead!")]] bool& dyn_DisableRotationTransform();
    // Get instance field reference: public System.Boolean DisablePositionTransform
    [[deprecated("Use field access instead!")]] bool& dyn_DisablePositionTransform();
    // Get instance field reference: public OVRUnityHumanoidSkeletonRetargeter/OVRHumanBodyBonesMappings/BodyTrackingBoneId BoneIdOverrideValue
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::OVRUnityHumanoidSkeletonRetargeter::OVRHumanBodyBonesMappings::BodyTrackingBoneId& dyn_BoneIdOverrideValue();
    // public System.Void .ctor()
    // Offset: 0x48C6844
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static OVRUnityHumanoidSkeletonRetargeter::JointAdjustment* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::GlobalNamespace::OVRUnityHumanoidSkeletonRetargeter::JointAdjustment::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<OVRUnityHumanoidSkeletonRetargeter::JointAdjustment*, creationType>()));
    }
  }; // OVRUnityHumanoidSkeletonRetargeter/JointAdjustment
  #pragma pack(pop)
  static check_size<sizeof(OVRUnityHumanoidSkeletonRetargeter::JointAdjustment), 40 + sizeof(::GlobalNamespace::OVRUnityHumanoidSkeletonRetargeter::OVRHumanBodyBonesMappings::BodyTrackingBoneId)> __GlobalNamespace_OVRUnityHumanoidSkeletonRetargeter_JointAdjustmentSizeCheck;
  static_assert(sizeof(OVRUnityHumanoidSkeletonRetargeter::JointAdjustment) == 0x2C);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: GlobalNamespace::OVRUnityHumanoidSkeletonRetargeter::JointAdjustment::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
