// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: OVRVirtualKeyboard
#include "GlobalNamespace/OVRVirtualKeyboard.hpp"
// Including type: OVRVirtualKeyboard/BaseInputSource
#include "GlobalNamespace/OVRVirtualKeyboard_BaseInputSource.hpp"
// Including type: OVRVirtualKeyboard/InputSource
#include "GlobalNamespace/OVRVirtualKeyboard_InputSource.hpp"
// Including type: OVRInput/Controller
#include "GlobalNamespace/OVRInput.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
}
// Completed forward declares
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::OVRVirtualKeyboard::ControllerInputSource);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::OVRVirtualKeyboard::ControllerInputSource*, "", "OVRVirtualKeyboard/ControllerInputSource");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x44
  #pragma pack(push, 1)
  // Autogenerated type: OVRVirtualKeyboard/ControllerInputSource
  // [TokenAttribute] Offset: FFFFFFFF
  class OVRVirtualKeyboard::ControllerInputSource : public ::GlobalNamespace::OVRVirtualKeyboard::BaseInputSource {
    public:
    public:
    // private readonly UnityEngine.Transform _rootTransform
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::Transform* rootTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private readonly UnityEngine.Transform _directTransform
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::Transform* directTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private readonly OVRVirtualKeyboard/InputSource _inputSource
    // Size: 0x4
    // Offset: 0x30
    ::GlobalNamespace::OVRVirtualKeyboard::InputSource inputSource;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRVirtualKeyboard::InputSource) == 0x4);
    // private readonly OVRInput/Controller _controllerType
    // Size: 0x4
    // Offset: 0x34
    ::GlobalNamespace::OVRInput::Controller controllerType;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRInput::Controller) == 0x4);
    // private readonly OVRVirtualKeyboard _keyboard
    // Size: 0x8
    // Offset: 0x38
    ::GlobalNamespace::OVRVirtualKeyboard* keyboard;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRVirtualKeyboard*) == 0x8);
    // private System.Int32 _lastFrameCount
    // Size: 0x4
    // Offset: 0x40
    int lastFrameCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Get instance field reference: private readonly UnityEngine.Transform _rootTransform
    [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn__rootTransform();
    // Get instance field reference: private readonly UnityEngine.Transform _directTransform
    [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn__directTransform();
    // Get instance field reference: private readonly OVRVirtualKeyboard/InputSource _inputSource
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::OVRVirtualKeyboard::InputSource& dyn__inputSource();
    // Get instance field reference: private readonly OVRInput/Controller _controllerType
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::OVRInput::Controller& dyn__controllerType();
    // Get instance field reference: private readonly OVRVirtualKeyboard _keyboard
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::OVRVirtualKeyboard*& dyn__keyboard();
    // Get instance field reference: private System.Int32 _lastFrameCount
    [[deprecated("Use field access instead!")]] int& dyn__lastFrameCount();
    // private System.Boolean get_TriggerIsPressed()
    // Offset: 0x493B6FC
    bool get_TriggerIsPressed();
    // public System.Void .ctor(OVRVirtualKeyboard keyboard, OVRVirtualKeyboard/InputSource inputSource, OVRInput/Controller controllerType, UnityEngine.Transform rootTransform, UnityEngine.Transform directTransform)
    // Offset: 0x493A584
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static OVRVirtualKeyboard::ControllerInputSource* New_ctor(::GlobalNamespace::OVRVirtualKeyboard* keyboard, ::GlobalNamespace::OVRVirtualKeyboard::InputSource inputSource, ::GlobalNamespace::OVRInput::Controller controllerType, ::UnityEngine::Transform* rootTransform, ::UnityEngine::Transform* directTransform) {
      static auto ___internal__logger = ::Logger::get().WithContext("::GlobalNamespace::OVRVirtualKeyboard::ControllerInputSource::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<OVRVirtualKeyboard::ControllerInputSource*, creationType>(keyboard, inputSource, controllerType, rootTransform, directTransform)));
    }
    // protected override System.Void UpdateInput()
    // Offset: 0x493B770
    // Implemented from: OVRVirtualKeyboard/BaseInputSource
    // Base method: System.Void BaseInputSource::UpdateInput()
    void UpdateInput();
  }; // OVRVirtualKeyboard/ControllerInputSource
  #pragma pack(pop)
  static check_size<sizeof(OVRVirtualKeyboard::ControllerInputSource), 64 + sizeof(int)> __GlobalNamespace_OVRVirtualKeyboard_ControllerInputSourceSizeCheck;
  static_assert(sizeof(OVRVirtualKeyboard::ControllerInputSource) == 0x44);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: GlobalNamespace::OVRVirtualKeyboard::ControllerInputSource::get_TriggerIsPressed
// Il2CppName: get_TriggerIsPressed
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (GlobalNamespace::OVRVirtualKeyboard::ControllerInputSource::*)()>(&GlobalNamespace::OVRVirtualKeyboard::ControllerInputSource::get_TriggerIsPressed)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::OVRVirtualKeyboard::ControllerInputSource*), "get_TriggerIsPressed", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::OVRVirtualKeyboard::ControllerInputSource::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: GlobalNamespace::OVRVirtualKeyboard::ControllerInputSource::UpdateInput
// Il2CppName: UpdateInput
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::OVRVirtualKeyboard::ControllerInputSource::*)()>(&GlobalNamespace::OVRVirtualKeyboard::ControllerInputSource::UpdateInput)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::OVRVirtualKeyboard::ControllerInputSource*), "UpdateInput", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
