// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: OVRGLTFScene
#include "GlobalNamespace/OVRGLTFScene.hpp"
// Including type: OVRPlugin
#include "GlobalNamespace/OVRPlugin.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: InputField
  class InputField;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: OVRHand
  class OVRHand;
  // Skipping declaration: KeyboardPosition because it is already included!
  // Forward declaring type: OVRPose
  struct OVRPose;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Action
  class Action;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Collider
  class Collider;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: Shader
  class Shader;
  // Forward declaring type: Material
  class Material;
  // Skipping declaration: Vector3 because it is already included!
  // Forward declaring type: Texture2D
  class Texture2D;
}
// Forward declaring namespace: UnityEngine::EventSystems
namespace UnityEngine::EventSystems {
  // Forward declaring type: OVRPhysicsRaycaster
  class OVRPhysicsRaycaster;
}
// Forward declaring namespace: UnityEngine::Events
namespace UnityEngine::Events {
  // Forward declaring type: UnityEvent
  class UnityEvent;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: OVRVirtualKeyboard
  class OVRVirtualKeyboard;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::OVRVirtualKeyboard);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::OVRVirtualKeyboard*, "", "OVRVirtualKeyboard");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x168
  #pragma pack(push, 1)
  // Autogenerated type: OVRVirtualKeyboard
  // [TokenAttribute] Offset: FFFFFFFF
  // [DisallowMultipleComponent] Offset: FFFFFFFF
  // [HelpURLAttribute] Offset: FFFFFFFF
  class OVRVirtualKeyboard : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::GlobalNamespace::OVRVirtualKeyboard::KeyboardPosition
    struct KeyboardPosition;
    // Nested type: ::GlobalNamespace::OVRVirtualKeyboard::InteractorRootTransformOverride
    class InteractorRootTransformOverride;
    // Nested type: ::GlobalNamespace::OVRVirtualKeyboard::InputSource
    struct InputSource;
    // Nested type: ::GlobalNamespace::OVRVirtualKeyboard::IInputSource
    class IInputSource;
    // Nested type: ::GlobalNamespace::OVRVirtualKeyboard::BaseInputSource
    class BaseInputSource;
    // Nested type: ::GlobalNamespace::OVRVirtualKeyboard::ControllerInputSource
    class ControllerInputSource;
    // Nested type: ::GlobalNamespace::OVRVirtualKeyboard::HandInputSource
    class HandInputSource;
    // Nested type: ::GlobalNamespace::OVRVirtualKeyboard::KeyboardEventListener
    class KeyboardEventListener;
    // Nested type: ::GlobalNamespace::OVRVirtualKeyboard::CommitTextUnityEvent
    class CommitTextUnityEvent;
    // Nested type: ::GlobalNamespace::OVRVirtualKeyboard::$$c
    class $$c;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: OVRVirtualKeyboard/KeyboardPosition
    // [TokenAttribute] Offset: FFFFFFFF
    struct KeyboardPosition/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: KeyboardPosition
      constexpr KeyboardPosition(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public OVRVirtualKeyboard/KeyboardPosition Far
      static constexpr const int Far = 0;
      // Get static field: static public OVRVirtualKeyboard/KeyboardPosition Far
      static ::GlobalNamespace::OVRVirtualKeyboard::KeyboardPosition _get_Far();
      // Set static field: static public OVRVirtualKeyboard/KeyboardPosition Far
      static void _set_Far(::GlobalNamespace::OVRVirtualKeyboard::KeyboardPosition value);
      // static field const value: static public OVRVirtualKeyboard/KeyboardPosition Near
      static constexpr const int Near = 1;
      // Get static field: static public OVRVirtualKeyboard/KeyboardPosition Near
      static ::GlobalNamespace::OVRVirtualKeyboard::KeyboardPosition _get_Near();
      // Set static field: static public OVRVirtualKeyboard/KeyboardPosition Near
      static void _set_Near(::GlobalNamespace::OVRVirtualKeyboard::KeyboardPosition value);
      // static field const value: static public OVRVirtualKeyboard/KeyboardPosition Direct
      static constexpr const int Direct = 1;
      // Get static field: static public OVRVirtualKeyboard/KeyboardPosition Direct
      static ::GlobalNamespace::OVRVirtualKeyboard::KeyboardPosition _get_Direct();
      // Set static field: static public OVRVirtualKeyboard/KeyboardPosition Direct
      static void _set_Direct(::GlobalNamespace::OVRVirtualKeyboard::KeyboardPosition value);
      // static field const value: static public OVRVirtualKeyboard/KeyboardPosition Custom
      static constexpr const int Custom = 2;
      // Get static field: static public OVRVirtualKeyboard/KeyboardPosition Custom
      static ::GlobalNamespace::OVRVirtualKeyboard::KeyboardPosition _get_Custom();
      // Set static field: static public OVRVirtualKeyboard/KeyboardPosition Custom
      static void _set_Custom(::GlobalNamespace::OVRVirtualKeyboard::KeyboardPosition value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // OVRVirtualKeyboard/KeyboardPosition
    #pragma pack(pop)
    static check_size<sizeof(OVRVirtualKeyboard::KeyboardPosition), 0 + sizeof(int)> __GlobalNamespace_OVRVirtualKeyboard_KeyboardPositionSizeCheck;
    static_assert(sizeof(OVRVirtualKeyboard::KeyboardPosition) == 0x4);
    public:
    // private System.Action`1<System.String> CommitText
    // Size: 0x8
    // Offset: 0x20
    ::System::Action_1<::StringW>* CommitText;
    // Field size check
    static_assert(sizeof(::System::Action_1<::StringW>*) == 0x8);
    // private System.Action Backspace
    // Size: 0x8
    // Offset: 0x28
    ::System::Action* Backspace;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private System.Action Enter
    // Size: 0x8
    // Offset: 0x30
    ::System::Action* Enter;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private System.Action KeyboardShown
    // Size: 0x8
    // Offset: 0x38
    ::System::Action* KeyboardShown;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private System.Action KeyboardHidden
    // Size: 0x8
    // Offset: 0x40
    ::System::Action* KeyboardHidden;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private UnityEngine.Collider <Collider>k__BackingField
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::Collider* Collider;
    // Field size check
    static_assert(sizeof(::UnityEngine::Collider*) == 0x8);
    // private OVRVirtualKeyboard/KeyboardPosition InitialPosition
    // Size: 0x4
    // Offset: 0x50
    ::GlobalNamespace::OVRVirtualKeyboard::KeyboardPosition InitialPosition;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRVirtualKeyboard::KeyboardPosition) == 0x4);
    // Padding between fields: InitialPosition and: textCommitField
    char __padding6[0x4] = {};
    // private UnityEngine.UI.InputField textCommitField
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::UI::InputField* textCommitField;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::InputField*) == 0x8);
    // public UnityEngine.Transform leftControllerRootTransform
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::Transform* leftControllerRootTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Transform leftControllerDirectTransform
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::Transform* leftControllerDirectTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Transform rightControllerRootTransform
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::Transform* rightControllerRootTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Transform rightControllerDirectTransform
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::Transform* rightControllerDirectTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public System.Boolean controllerDirectInteraction
    // Size: 0x1
    // Offset: 0x80
    bool controllerDirectInteraction;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean controllerRayInteraction
    // Size: 0x1
    // Offset: 0x81
    bool controllerRayInteraction;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: controllerRayInteraction and: controllerRaycaster
    char __padding13[0x6] = {};
    // public UnityEngine.EventSystems.OVRPhysicsRaycaster controllerRaycaster
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::EventSystems::OVRPhysicsRaycaster* controllerRaycaster;
    // Field size check
    static_assert(sizeof(::UnityEngine::EventSystems::OVRPhysicsRaycaster*) == 0x8);
    // public OVRHand handLeft
    // Size: 0x8
    // Offset: 0x90
    ::GlobalNamespace::OVRHand* handLeft;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRHand*) == 0x8);
    // public OVRHand handRight
    // Size: 0x8
    // Offset: 0x98
    ::GlobalNamespace::OVRHand* handRight;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRHand*) == 0x8);
    // public System.Boolean handDirectInteraction
    // Size: 0x1
    // Offset: 0xA0
    bool handDirectInteraction;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean handRayInteraction
    // Size: 0x1
    // Offset: 0xA1
    bool handRayInteraction;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: handRayInteraction and: handRaycaster
    char __padding18[0x6] = {};
    // public UnityEngine.EventSystems.OVRPhysicsRaycaster handRaycaster
    // Size: 0x8
    // Offset: 0xA8
    ::UnityEngine::EventSystems::OVRPhysicsRaycaster* handRaycaster;
    // Field size check
    static_assert(sizeof(::UnityEngine::EventSystems::OVRPhysicsRaycaster*) == 0x8);
    // public UnityEngine.Shader keyboardModelShader
    // Size: 0x8
    // Offset: 0xB0
    ::UnityEngine::Shader* keyboardModelShader;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // public UnityEngine.Shader keyboardModelAlphaBlendShader
    // Size: 0x8
    // Offset: 0xB8
    ::UnityEngine::Shader* keyboardModelAlphaBlendShader;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // public System.Boolean InputEnabled
    // Size: 0x1
    // Offset: 0xC0
    bool InputEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: InputEnabled and: CommitTextEvent
    char __padding22[0x7] = {};
    // public OVRVirtualKeyboard/CommitTextUnityEvent CommitTextEvent
    // Size: 0x8
    // Offset: 0xC8
    ::GlobalNamespace::OVRVirtualKeyboard::CommitTextUnityEvent* CommitTextEvent;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRVirtualKeyboard::CommitTextUnityEvent*) == 0x8);
    // public UnityEngine.Events.UnityEvent BackspaceEvent
    // Size: 0x8
    // Offset: 0xD0
    ::UnityEngine::Events::UnityEvent* BackspaceEvent;
    // Field size check
    static_assert(sizeof(::UnityEngine::Events::UnityEvent*) == 0x8);
    // public UnityEngine.Events.UnityEvent EnterEvent
    // Size: 0x8
    // Offset: 0xD8
    ::UnityEngine::Events::UnityEvent* EnterEvent;
    // Field size check
    static_assert(sizeof(::UnityEngine::Events::UnityEvent*) == 0x8);
    // public UnityEngine.Events.UnityEvent KeyboardShownEvent
    // Size: 0x8
    // Offset: 0xE0
    ::UnityEngine::Events::UnityEvent* KeyboardShownEvent;
    // Field size check
    static_assert(sizeof(::UnityEngine::Events::UnityEvent*) == 0x8);
    // public UnityEngine.Events.UnityEvent KeyboardHiddenEvent
    // Size: 0x8
    // Offset: 0xE8
    ::UnityEngine::Events::UnityEvent* KeyboardHiddenEvent;
    // Field size check
    static_assert(sizeof(::UnityEngine::Events::UnityEvent*) == 0x8);
    // private System.Boolean isKeyboardCreated_
    // Size: 0x1
    // Offset: 0xF0
    bool isKeyboardCreated;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isKeyboardCreated and: keyboardSpace
    char __padding28[0x7] = {};
    // private System.UInt64 keyboardSpace_
    // Size: 0x8
    // Offset: 0xF8
    uint64_t keyboardSpace;
    // Field size check
    static_assert(sizeof(uint64_t) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.UInt64,System.Collections.Generic.List`1<UnityEngine.Material>> virtualKeyboardTextures_
    // Size: 0x8
    // Offset: 0x100
    ::System::Collections::Generic::Dictionary_2<uint64_t, ::System::Collections::Generic::List_1<::UnityEngine::Material*>*>* virtualKeyboardTextures;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<uint64_t, ::System::Collections::Generic::List_1<::UnityEngine::Material*>*>*) == 0x8);
    // private OVRGLTFScene virtualKeyboardScene_
    // Size: 0x28
    // Offset: 0x108
    ::GlobalNamespace::OVRGLTFScene virtualKeyboardScene;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRGLTFScene) == 0x28);
    // private System.UInt64 virtualKeyboardModelKey_
    // Size: 0x8
    // Offset: 0x130
    uint64_t virtualKeyboardModelKey;
    // Field size check
    static_assert(sizeof(uint64_t) == 0x8);
    // private System.Boolean modelInitialized_
    // Size: 0x1
    // Offset: 0x138
    bool modelInitialized;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean modelAvailable_
    // Size: 0x1
    // Offset: 0x139
    bool modelAvailable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean keyboardVisible_
    // Size: 0x1
    // Offset: 0x13A
    bool keyboardVisible;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: keyboardVisible and: interactorRootTransformOverride
    char __padding35[0x5] = {};
    // private OVRVirtualKeyboard/InteractorRootTransformOverride _interactorRootTransformOverride
    // Size: 0x8
    // Offset: 0x140
    ::GlobalNamespace::OVRVirtualKeyboard::InteractorRootTransformOverride* interactorRootTransformOverride;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRVirtualKeyboard::InteractorRootTransformOverride*) == 0x8);
    // private System.Collections.Generic.List`1<OVRVirtualKeyboard/IInputSource> _inputSources
    // Size: 0x8
    // Offset: 0x148
    ::System::Collections::Generic::List_1<::GlobalNamespace::OVRVirtualKeyboard::IInputSource*>* inputSources;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GlobalNamespace::OVRVirtualKeyboard::IInputSource*>*) == 0x8);
    // private System.Boolean ignoreTextCommmitFieldOnValueChanged_
    // Size: 0x1
    // Offset: 0x150
    bool ignoreTextCommmitFieldOnValueChanged;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: ignoreTextCommmitFieldOnValueChanged and: runtimeInputField
    char __padding38[0x7] = {};
    // private UnityEngine.UI.InputField runtimeInputField_
    // Size: 0x8
    // Offset: 0x158
    ::UnityEngine::UI::InputField* runtimeInputField;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::InputField*) == 0x8);
    // private OVRVirtualKeyboard/KeyboardEventListener keyboardEventListener_
    // Size: 0x8
    // Offset: 0x160
    ::GlobalNamespace::OVRVirtualKeyboard::KeyboardEventListener* keyboardEventListener;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRVirtualKeyboard::KeyboardEventListener*) == 0x8);
    public:
    // Get static field: static private OVRVirtualKeyboard singleton_
    static ::GlobalNamespace::OVRVirtualKeyboard* _get_singleton_();
    // Set static field: static private OVRVirtualKeyboard singleton_
    static void _set_singleton_(::GlobalNamespace::OVRVirtualKeyboard* value);
    // Get instance field reference: private System.Action`1<System.String> CommitText
    [[deprecated("Use field access instead!")]] ::System::Action_1<::StringW>*& dyn_CommitText();
    // Get instance field reference: private System.Action Backspace
    [[deprecated("Use field access instead!")]] ::System::Action*& dyn_Backspace();
    // Get instance field reference: private System.Action Enter
