// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: SRand
#include "GlobalNamespace/SRand.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: LightningDispatcherEvent
  class LightningDispatcherEvent;
}
// Forward declaring namespace: NetSynchrony
namespace NetSynchrony {
  // Forward declaring type: RandomDispatcher
  class RandomDispatcher;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: ReportForwardHit
  class ReportForwardHit;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::ReportForwardHit);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::ReportForwardHit*, "", "ReportForwardHit");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x49
  #pragma pack(push, 1)
  // Autogenerated type: ReportForwardHit
  // [TokenAttribute] Offset: FFFFFFFF
  class ReportForwardHit : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private System.Single minseekFreq
    // Size: 0x4
    // Offset: 0x20
    float minseekFreq;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single maxseekFreq
    // Size: 0x4
    // Offset: 0x24
    float maxseekFreq;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single maxRadias
    // Size: 0x4
    // Offset: 0x28
    float maxRadias;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: maxRadias and: colliderFound
    char __padding2[0x4] = {};
    // private LightningDispatcherEvent colliderFound
    // Size: 0x8
    // Offset: 0x30
    ::GlobalNamespace::LightningDispatcherEvent* colliderFound;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::LightningDispatcherEvent*) == 0x8);
    // private NetSynchrony.RandomDispatcher nsRand
    // Size: 0x8
    // Offset: 0x38
    ::NetSynchrony::RandomDispatcher* nsRand;
    // Field size check
    static_assert(sizeof(::NetSynchrony::RandomDispatcher*) == 0x8);
    // private System.Single timeSinceSeek
    // Size: 0x4
    // Offset: 0x40
    float timeSinceSeek;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single seekFreq
    // Size: 0x4
    // Offset: 0x44
    float seekFreq;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean seekOnEnable
    // Size: 0x1
    // Offset: 0x48
    bool seekOnEnable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get static field: static private SRand rand
    static ::GlobalNamespace::SRand _get_rand();
    // Set static field: static private SRand rand
    static void _set_rand(::GlobalNamespace::SRand value);
    // Get instance field reference: private System.Single minseekFreq
    [[deprecated("Use field access instead!")]] float& dyn_minseekFreq();
    // Get instance field reference: private System.Single maxseekFreq
    [[deprecated("Use field access instead!")]] float& dyn_maxseekFreq();
    // Get instance field reference: private System.Single maxRadias
    [[deprecated("Use field access instead!")]] float& dyn_maxRadias();
    // Get instance field reference: private LightningDispatcherEvent colliderFound
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::LightningDispatcherEvent*& dyn_colliderFound();
    // Get instance field reference: private NetSynchrony.RandomDispatcher nsRand
    [[deprecated("Use field access instead!")]] ::NetSynchrony::RandomDispatcher*& dyn_nsRand();
    // Get instance field reference: private System.Single timeSinceSeek
    [[deprecated("Use field access instead!")]] float& dyn_timeSinceSeek();
    // Get instance field reference: private System.Single seekFreq
    [[deprecated("Use field access instead!")]] float& dyn_seekFreq();
    // Get instance field reference: private System.Boolean seekOnEnable
    [[deprecated("Use field access instead!")]] bool& dyn_seekOnEnable();
    // private System.Void Start()
    // Offset: 0x27A19FC
    void Start();
    // private System.Void OnEnable()
    // Offset: 0x27A1A64
    void OnEnable();
    // private System.Void OnDisable()
    // Offset: 0x27A1D7C
    void OnDisable();
    // private System.Void NsRand_Dispatch(NetSynchrony.RandomDispatcher randomDispatcher)
    // Offset: 0x27A1E4C
    void NsRand_Dispatch(::NetSynchrony::RandomDispatcher* randomDispatcher);
    // private System.Void Update()
    // Offset: 0x27A1E50
    void Update();
    // private System.Void seek()
    // Offset: 0x27A1B44
    void seek();
    // public System.Void .ctor()
    // Offset: 0x27A1F28
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static ReportForwardHit* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::GlobalNamespace::ReportForwardHit::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<ReportForwardHit*, creationType>()));
    }
    // static private System.Void .cctor()
    // Offset: 0x27A1F44
    static void _cctor();
  }; // ReportForwardHit
  #pragma pack(pop)
  static check_size<sizeof(ReportForwardHit), 72 + sizeof(bool)> __GlobalNamespace_ReportForwardHitSizeCheck;
  static_assert(sizeof(ReportForwardHit) == 0x49);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: GlobalNamespace::ReportForwardHit::Start
// Il2CppName: Start
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::ReportForwardHit::*)()>(&GlobalNamespace::ReportForwardHit::Start)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::ReportForwardHit*), "Start", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::ReportForwardHit::OnEnable
// Il2CppName: OnEnable
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::ReportForwardHit::*)()>(&GlobalNamespace::ReportForwardHit::OnEnable)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::ReportForwardHit*), "OnEnable", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::ReportForwardHit::OnDisable
// Il2CppName: OnDisable
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::ReportForwardHit::*)()>(&GlobalNamespace::ReportForwardHit::OnDisable)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::ReportForwardHit*), "OnDisable", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::ReportForwardHit::NsRand_Dispatch
// Il2CppName: NsRand_Dispatch
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::ReportForwardHit::*)(::NetSynchrony::RandomDispatcher*)>(&GlobalNamespace::ReportForwardHit::NsRand_Dispatch)> {
  static const MethodInfo* get() {
    static auto* randomDispatcher = &::il2cpp_utils::GetClassFromName("NetSynchrony", "RandomDispatcher")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::ReportForwardHit*), "NsRand_Dispatch", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{randomDispatcher});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::ReportForwardHit::Update
// Il2CppName: Update
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::ReportForwardHit::*)()>(&GlobalNamespace::ReportForwardHit::Update)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::ReportForwardHit*), "Update", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::ReportForwardHit::seek
// Il2CppName: seek
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::ReportForwardHit::*)()>(&GlobalNamespace::ReportForwardHit::seek)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::ReportForwardHit*), "seek", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::ReportForwardHit::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: GlobalNamespace::ReportForwardHit::_cctor
// Il2CppName: .cctor
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (*)()>(&GlobalNamespace::ReportForwardHit::_cctor)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::ReportForwardHit*), ".cctor", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
