// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: VRRig
  class VRRig;
  // Forward declaring type: VRRigReliableState
  class VRRigReliableState;
  // Forward declaring type: NetPlayer
  class NetPlayer;
  // Forward declaring type: VRRigSerializer
  class VRRigSerializer;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: AudioSource
  class AudioSource;
}
// Forward declaring namespace: Photon::Voice::PUN
namespace Photon::Voice::PUN {
  // Forward declaring type: PhotonVoiceView
  class PhotonVoiceView;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: Photon::Realtime
namespace Photon::Realtime {
  // Forward declaring type: Player
  class Player;
}
// Forward declaring namespace: Photon::Pun
namespace Photon::Pun {
  // Forward declaring type: PhotonView
  class PhotonView;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: RigContainer
  class RigContainer;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::RigContainer);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::RigContainer*, "", "RigContainer");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x58
  #pragma pack(push, 1)
  // Autogenerated type: RigContainer
  // [TokenAttribute] Offset: FFFFFFFF
  // [RequireComponent] Offset: FFFFFFFF
  class RigContainer : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::GlobalNamespace::RigContainer::$$c
    class $$c;
    // Nested type: ::GlobalNamespace::RigContainer::$QueueAutomute$d__49
    class $QueueAutomute$d__49;
    public:
    // private System.Boolean <Initialized>k__BackingField
    // Size: 0x1
    // Offset: 0x20
    bool Initialized;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: Initialized and: vrrig
    char __padding0[0x7] = {};
    // private VRRig vrrig
    // Size: 0x8
    // Offset: 0x28
    ::GlobalNamespace::VRRig* vrrig;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::VRRig*) == 0x8);
    // private VRRigReliableState reliableState
    // Size: 0x8
    // Offset: 0x30
    ::GlobalNamespace::VRRigReliableState* reliableState;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::VRRigReliableState*) == 0x8);
    // private UnityEngine.Transform speakerHead
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::Transform* speakerHead;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.AudioSource replacementVoiceSource
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::AudioSource* replacementVoiceSource;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // private Photon.Voice.PUN.PhotonVoiceView voiceView
    // Size: 0x8
    // Offset: 0x48
    ::Photon::Voice::PUN::PhotonVoiceView* voiceView;
    // Field size check
    static_assert(sizeof(::Photon::Voice::PUN::PhotonVoiceView*) == 0x8);
    // private System.Boolean enableVoice
    // Size: 0x1
    // Offset: 0x50
    bool enableVoice;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean forceMute
    // Size: 0x1
    // Offset: 0x51
    bool forceMute;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean hasManualMute
    // Size: 0x1
    // Offset: 0x52
    bool hasManualMute;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean bPlayerAutoMuted
    // Size: 0x1
    // Offset: 0x53
    bool bPlayerAutoMuted;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Int32 playerChatQuality
    // Size: 0x4
    // Offset: 0x54
    int playerChatQuality;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Get static field: static private System.Collections.Generic.List`1<Photon.Realtime.Player> playersToCheckAutomute
    static ::System::Collections::Generic::List_1<::Photon::Realtime::Player*>* _get_playersToCheckAutomute();
    // Set static field: static private System.Collections.Generic.List`1<Photon.Realtime.Player> playersToCheckAutomute
    static void _set_playersToCheckAutomute(::System::Collections::Generic::List_1<::Photon::Realtime::Player*>* value);
    // Get static field: static private System.Boolean automuteQueued
    static bool _get_automuteQueued();
    // Set static field: static private System.Boolean automuteQueued
    static void _set_automuteQueued(bool value);
    // Get static field: static private System.Collections.Generic.List`1<Photon.Realtime.Player> requestedAutomutePlayers
