// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: PhotonEvent
  class PhotonEvent;
}
// Forward declaring namespace: Photon::Realtime
namespace Photon::Realtime {
  // Forward declaring type: Player
  class Player;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: RubberDuckEvents
  class RubberDuckEvents;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::RubberDuckEvents);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::RubberDuckEvents*, "", "RubberDuckEvents");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x40
  #pragma pack(push, 1)
  // Autogenerated type: RubberDuckEvents
  // [TokenAttribute] Offset: FFFFFFFF
  class RubberDuckEvents : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // public System.Int32 PlayerId
    // Size: 0x4
    // Offset: 0x20
    int PlayerId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: PlayerId and: PlayerIdString
    char __padding0[0x4] = {};
    // public System.String PlayerIdString
    // Size: 0x8
    // Offset: 0x28
    ::StringW PlayerIdString;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public PhotonEvent Activate
    // Size: 0x8
    // Offset: 0x30
    ::GlobalNamespace::PhotonEvent* Activate;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::PhotonEvent*) == 0x8);
    // public PhotonEvent Deactivate
    // Size: 0x8
    // Offset: 0x38
    ::GlobalNamespace::PhotonEvent* Deactivate;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::PhotonEvent*) == 0x8);
    public:
    // Get instance field reference: public System.Int32 PlayerId
    [[deprecated("Use field access instead!")]] int& dyn_PlayerId();
    // Get instance field reference: public System.String PlayerIdString
    [[deprecated("Use field access instead!")]] ::StringW& dyn_PlayerIdString();
    // Get instance field reference: public PhotonEvent Activate
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::PhotonEvent*& dyn_Activate();
    // Get instance field reference: public PhotonEvent Deactivate
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::PhotonEvent*& dyn_Deactivate();
    // public System.Void Init(Photon.Realtime.Player player)
    // Offset: 0x26DABF0
    void Init(::Photon::Realtime::Player* player);
    // private System.Void OnEnable()
    // Offset: 0x26DBDBC
    void OnEnable();
    // private System.Void OnDisable()
    // Offset: 0x26DBDF0
    void OnDisable();
    // private System.Void OnDestroy()
    // Offset: 0x26DBE24
    void OnDestroy();
    // private System.Void Dispose()
    // Offset: 0x26DBD64
    void Dispose();
    // public System.Void .ctor()
    // Offset: 0x26DBE28
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static RubberDuckEvents* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::GlobalNamespace::RubberDuckEvents::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<RubberDuckEvents*, creationType>()));
    }
  }; // RubberDuckEvents
  #pragma pack(pop)
  static check_size<sizeof(RubberDuckEvents), 56 + sizeof(::GlobalNamespace::PhotonEvent*)> __GlobalNamespace_RubberDuckEventsSizeCheck;
  static_assert(sizeof(RubberDuckEvents) == 0x40);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: GlobalNamespace::RubberDuckEvents::Init
// Il2CppName: Init
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::RubberDuckEvents::*)(::Photon::Realtime::Player*)>(&GlobalNamespace::RubberDuckEvents::Init)> {
  static const MethodInfo* get() {
    static auto* player = &::il2cpp_utils::GetClassFromName("Photon.Realtime", "Player")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::RubberDuckEvents*), "Init", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{player});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::RubberDuckEvents::OnEnable
// Il2CppName: OnEnable
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::RubberDuckEvents::*)()>(&GlobalNamespace::RubberDuckEvents::OnEnable)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::RubberDuckEvents*), "OnEnable", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::RubberDuckEvents::OnDisable
// Il2CppName: OnDisable
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::RubberDuckEvents::*)()>(&GlobalNamespace::RubberDuckEvents::OnDisable)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::RubberDuckEvents*), "OnDisable", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::RubberDuckEvents::OnDestroy
// Il2CppName: OnDestroy
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::RubberDuckEvents::*)()>(&GlobalNamespace::RubberDuckEvents::OnDestroy)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::RubberDuckEvents*), "OnDestroy", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::RubberDuckEvents::Dispose
// Il2CppName: Dispose
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::RubberDuckEvents::*)()>(&GlobalNamespace::RubberDuckEvents::Dispose)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::RubberDuckEvents*), "Dispose", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::RubberDuckEvents::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
