// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: RectTransform
  class RectTransform;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: SampleUI
  class SampleUI;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::SampleUI);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::SampleUI*, "", "SampleUI");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x39
  #pragma pack(push, 1)
  // Autogenerated type: SampleUI
  // [TokenAttribute] Offset: FFFFFFFF
  class SampleUI : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private UnityEngine.RectTransform collectionButton
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::RectTransform* collectionButton;
    // Field size check
    static_assert(sizeof(::UnityEngine::RectTransform*) == 0x8);
    // private UnityEngine.RectTransform inputText
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::RectTransform* inputText;
    // Field size check
    static_assert(sizeof(::UnityEngine::RectTransform*) == 0x8);
    // private UnityEngine.RectTransform valueText
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::RectTransform* valueText;
    // Field size check
    static_assert(sizeof(::UnityEngine::RectTransform*) == 0x8);
    // private System.Boolean inMenu
    // Size: 0x1
    // Offset: 0x38
    bool inMenu;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get instance field reference: private UnityEngine.RectTransform collectionButton
    [[deprecated("Use field access instead!")]] ::UnityEngine::RectTransform*& dyn_collectionButton();
    // Get instance field reference: private UnityEngine.RectTransform inputText
    [[deprecated("Use field access instead!")]] ::UnityEngine::RectTransform*& dyn_inputText();
    // Get instance field reference: private UnityEngine.RectTransform valueText
    [[deprecated("Use field access instead!")]] ::UnityEngine::RectTransform*& dyn_valueText();
    // Get instance field reference: private System.Boolean inMenu
    [[deprecated("Use field access instead!")]] bool& dyn_inMenu();
    // private System.Void Start()
    // Offset: 0x292CDF0
    void Start();
    // private System.Void Update()
    // Offset: 0x292CE80
    void Update();
    // public System.Void .ctor()
    // Offset: 0x292CF50
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static SampleUI* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::GlobalNamespace::SampleUI::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<SampleUI*, creationType>()));
    }
  }; // SampleUI
  #pragma pack(pop)
  static check_size<sizeof(SampleUI), 56 + sizeof(bool)> __GlobalNamespace_SampleUISizeCheck;
  static_assert(sizeof(SampleUI) == 0x39);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: GlobalNamespace::SampleUI::Start
// Il2CppName: Start
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::SampleUI::*)()>(&GlobalNamespace::SampleUI::Start)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::SampleUI*), "Start", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::SampleUI::Update
// Il2CppName: Update
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::SampleUI::*)()>(&GlobalNamespace::SampleUI::Update)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::SampleUI*), "Update", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::SampleUI::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
