// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.RaycastHit
#include "UnityEngine/RaycastHit.hpp"
// Including type: UnityEngine.LayerMask
#include "UnityEngine/LayerMask.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Animator
  class Animator;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: AudioSource
  class AudioSource;
  // Forward declaring type: AudioClip
  class AudioClip;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: SkeletonPathingNode
  class SkeletonPathingNode;
  // Forward declaring type: SecondLookSkeletonSynchValues
  class SecondLookSkeletonSynchValues;
  // Forward declaring type: NetPlayer
  class NetPlayer;
  // Skipping declaration: GhostState because it is already included!
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: SecondLookSkeleton
  class SecondLookSkeleton;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::SecondLookSkeleton);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::SecondLookSkeleton*, "", "SecondLookSkeleton");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x180
  #pragma pack(push, 1)
  // Autogenerated type: SecondLookSkeleton
  // [TokenAttribute] Offset: FFFFFFFF
  class SecondLookSkeleton : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::GlobalNamespace::SecondLookSkeleton::GhostState
    struct GhostState;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: SecondLookSkeleton/GhostState
    // [TokenAttribute] Offset: FFFFFFFF
    struct GhostState/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: GhostState
      constexpr GhostState(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public SecondLookSkeleton/GhostState Unactivated
      static constexpr const int Unactivated = 0;
      // Get static field: static public SecondLookSkeleton/GhostState Unactivated
      static ::GlobalNamespace::SecondLookSkeleton::GhostState _get_Unactivated();
      // Set static field: static public SecondLookSkeleton/GhostState Unactivated
      static void _set_Unactivated(::GlobalNamespace::SecondLookSkeleton::GhostState value);
      // static field const value: static public SecondLookSkeleton/GhostState Activated
      static constexpr const int Activated = 1;
      // Get static field: static public SecondLookSkeleton/GhostState Activated
      static ::GlobalNamespace::SecondLookSkeleton::GhostState _get_Activated();
      // Set static field: static public SecondLookSkeleton/GhostState Activated
      static void _set_Activated(::GlobalNamespace::SecondLookSkeleton::GhostState value);
      // static field const value: static public SecondLookSkeleton/GhostState Patrolling
      static constexpr const int Patrolling = 2;
      // Get static field: static public SecondLookSkeleton/GhostState Patrolling
      static ::GlobalNamespace::SecondLookSkeleton::GhostState _get_Patrolling();
      // Set static field: static public SecondLookSkeleton/GhostState Patrolling
      static void _set_Patrolling(::GlobalNamespace::SecondLookSkeleton::GhostState value);
      // static field const value: static public SecondLookSkeleton/GhostState Chasing
      static constexpr const int Chasing = 3;
      // Get static field: static public SecondLookSkeleton/GhostState Chasing
      static ::GlobalNamespace::SecondLookSkeleton::GhostState _get_Chasing();
      // Set static field: static public SecondLookSkeleton/GhostState Chasing
      static void _set_Chasing(::GlobalNamespace::SecondLookSkeleton::GhostState value);
      // static field const value: static public SecondLookSkeleton/GhostState CaughtPlayer
      static constexpr const int CaughtPlayer = 4;
      // Get static field: static public SecondLookSkeleton/GhostState CaughtPlayer
      static ::GlobalNamespace::SecondLookSkeleton::GhostState _get_CaughtPlayer();
      // Set static field: static public SecondLookSkeleton/GhostState CaughtPlayer
      static void _set_CaughtPlayer(::GlobalNamespace::SecondLookSkeleton::GhostState value);
      // static field const value: static public SecondLookSkeleton/GhostState PlayerThrown
      static constexpr const int PlayerThrown = 5;
      // Get static field: static public SecondLookSkeleton/GhostState PlayerThrown
      static ::GlobalNamespace::SecondLookSkeleton::GhostState _get_PlayerThrown();
      // Set static field: static public SecondLookSkeleton/GhostState PlayerThrown
      static void _set_PlayerThrown(::GlobalNamespace::SecondLookSkeleton::GhostState value);
      // static field const value: static public SecondLookSkeleton/GhostState Reset
      static constexpr const int Reset = 6;
      // Get static field: static public SecondLookSkeleton/GhostState Reset
      static ::GlobalNamespace::SecondLookSkeleton::GhostState _get_Reset();
      // Set static field: static public SecondLookSkeleton/GhostState Reset
      static void _set_Reset(::GlobalNamespace::SecondLookSkeleton::GhostState value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // SecondLookSkeleton/GhostState
    #pragma pack(pop)
    static check_size<sizeof(SecondLookSkeleton::GhostState), 0 + sizeof(int)> __GlobalNamespace_SecondLookSkeleton_GhostStateSizeCheck;
    static_assert(sizeof(SecondLookSkeleton::GhostState) == 0x4);
    public:
    // public UnityEngine.Transform[] angerPoint
    // Size: 0x8
    // Offset: 0x20
    ::ArrayW<::UnityEngine::Transform*> angerPoint;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Transform*>) == 0x8);
    // public System.Int32 angerPointIndex
    // Size: 0x4
    // Offset: 0x28
    int angerPointIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: angerPointIndex and: pathPoints
    char __padding1[0x4] = {};
    // public SkeletonPathingNode[] pathPoints
    // Size: 0x8
    // Offset: 0x30
    ::ArrayW<::GlobalNamespace::SkeletonPathingNode*> pathPoints;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::SkeletonPathingNode*>) == 0x8);
    // public SkeletonPathingNode[] exitPoints
    // Size: 0x8
    // Offset: 0x38
    ::ArrayW<::GlobalNamespace::SkeletonPathingNode*> exitPoints;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::SkeletonPathingNode*>) == 0x8);
    // public UnityEngine.Transform heightOffset
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::Transform* heightOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private System.Boolean firstLookActivated
    // Size: 0x1
    // Offset: 0x48
    bool firstLookActivated;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean lookedAway
    // Size: 0x1
    // Offset: 0x49
    bool lookedAway;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean currentlyLooking
    // Size: 0x1
    // Offset: 0x4A
    bool currentlyLooking;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: currentlyLooking and: ghostActivationDistance
    char __padding7[0x1] = {};
    // public System.Single ghostActivationDistance
    // Size: 0x4
    // Offset: 0x4C
    float ghostActivationDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.GameObject spookyGhost
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::GameObject* spookyGhost;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public System.Single timeFirstAppeared
    // Size: 0x4
    // Offset: 0x58
    float timeFirstAppeared;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single timeToFirstDisappear
    // Size: 0x4
    // Offset: 0x5C
    float timeToFirstDisappear;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public SecondLookSkeleton/GhostState currentState
    // Size: 0x4
    // Offset: 0x60
    ::GlobalNamespace::SecondLookSkeleton::GhostState currentState;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SecondLookSkeleton::GhostState) == 0x4);
    // Padding between fields: currentState and: spookyText
    char __padding12[0x4] = {};
    // public UnityEngine.GameObject spookyText
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::GameObject* spookyText;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public System.Single patrolSpeed
    // Size: 0x4
    // Offset: 0x70
    float patrolSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single chaseSpeed
    // Size: 0x4
    // Offset: 0x74
    float chaseSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single caughtSpeed
    // Size: 0x4
    // Offset: 0x78
    float caughtSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: caughtSpeed and: firstNode
    char __padding16[0x4] = {};
    // public SkeletonPathingNode firstNode
    // Size: 0x8
    // Offset: 0x80
    ::GlobalNamespace::SkeletonPathingNode* firstNode;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SkeletonPathingNode*) == 0x8);
    // public SkeletonPathingNode currentNode
    // Size: 0x8
    // Offset: 0x88
    ::GlobalNamespace::SkeletonPathingNode* currentNode;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SkeletonPathingNode*) == 0x8);
    // public SkeletonPathingNode nextNode
    // Size: 0x8
    // Offset: 0x90
    ::GlobalNamespace::SkeletonPathingNode* nextNode;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SkeletonPathingNode*) == 0x8);
    // public UnityEngine.Transform lookSource
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::Transform* lookSource;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform playerTransform
    // Size: 0x8
    // Offset: 0xA0
    ::UnityEngine::Transform* playerTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public System.Single reachNodeDist
    // Size: 0x4
    // Offset: 0xA8
    float reachNodeDist;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single maxRotSpeed
    // Size: 0x4
    // Offset: 0xAC
    float maxRotSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single hapticStrength
    // Size: 0x4
    // Offset: 0xB0
    float hapticStrength;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single hapticDuration
    // Size: 0x4
    // Offset: 0xB4
    float hapticDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.Vector3 offsetGrabPosition
    // Size: 0xC
    // Offset: 0xB8
    ::UnityEngine::Vector3 offsetGrabPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public System.Single throwForce
    // Size: 0x4
    // Offset: 0xC4
    float throwForce;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.Animator animator
    // Size: 0x8
    // Offset: 0xC8
    ::UnityEngine::Animator* animator;
    // Field size check
    static_assert(sizeof(::UnityEngine::Animator*) == 0x8);
    // public System.Single bodyHeightOffset
    // Size: 0x4
    // Offset: 0xD0
    float bodyHeightOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single timeThrown
    // Size: 0x4
    // Offset: 0xD4
    float timeThrown;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single timeThrownCooldown
    // Size: 0x4
    // Offset: 0xD8
    float timeThrownCooldown;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single catchDistance
    // Size: 0x4
    // Offset: 0xDC
    float catchDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single maxSeeDistance
    // Size: 0x4
    // Offset: 0xE0
    float maxSeeDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: maxSeeDistance and: rHits
    char __padding33[0x4] = {};
    // private UnityEngine.RaycastHit[] rHits
    // Size: 0x8
    // Offset: 0xE8
    ::ArrayW<::UnityEngine::RaycastHit> rHits;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::RaycastHit>) == 0x8);
    // public UnityEngine.LayerMask mask
    // Size: 0x4
    // Offset: 0xF0
    ::UnityEngine::LayerMask mask;
    // Field size check
    static_assert(sizeof(::UnityEngine::LayerMask) == 0x4);
    // public UnityEngine.LayerMask playerMask
    // Size: 0x4
    // Offset: 0xF4
    ::UnityEngine::LayerMask playerMask;
    // Field size check
    static_assert(sizeof(::UnityEngine::LayerMask) == 0x4);
    // public UnityEngine.AudioSource audioSource
    // Size: 0x8
    // Offset: 0xF8
    ::UnityEngine::AudioSource* audioSource;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // public UnityEngine.AudioClip initialScream
    // Size: 0x8
    // Offset: 0x100
    ::UnityEngine::AudioClip* initialScream;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // public UnityEngine.AudioClip patrolLoop
    // Size: 0x8
    // Offset: 0x108
    ::UnityEngine::AudioClip* patrolLoop;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // public UnityEngine.AudioClip chaseLoop
    // Size: 0x8
    // Offset: 0x110
    ::UnityEngine::AudioClip* chaseLoop;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // public UnityEngine.AudioClip grabbedSound
    // Size: 0x8
    // Offset: 0x118
    ::UnityEngine::AudioClip* grabbedSound;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // public UnityEngine.AudioClip carryingLoop
    // Size: 0x8
    // Offset: 0x120
    ::UnityEngine::AudioClip* carryingLoop;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // public UnityEngine.AudioClip throwSound
    // Size: 0x8
    // Offset: 0x128
    ::UnityEngine::AudioClip* throwSound;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // public System.Collections.Generic.List`1<SkeletonPathingNode> resetChaseHistory
    // Size: 0x8
    // Offset: 0x130
    ::System::Collections::Generic::List_1<::GlobalNamespace::SkeletonPathingNode*>* resetChaseHistory;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GlobalNamespace::SkeletonPathingNode*>*) == 0x8);
    // private SecondLookSkeletonSynchValues synchValues
    // Size: 0x8
    // Offset: 0x138
    ::GlobalNamespace::SecondLookSkeletonSynchValues* synchValues;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SecondLookSkeletonSynchValues*) == 0x8);
    // private System.Boolean localCaught
    // Size: 0x1
    // Offset: 0x140
    bool localCaught;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean localThrown
    // Size: 0x1
    // Offset: 0x141
    bool localThrown;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: localThrown and: playersSeen
    char __padding47[0x6] = {};
    // public System.Collections.Generic.List`1<NetPlayer> playersSeen
    // Size: 0x8
    // Offset: 0x148
    ::System::Collections::Generic::List_1<::GlobalNamespace::NetPlayer*>* playersSeen;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GlobalNamespace::NetPlayer*>*) == 0x8);
    // public System.Boolean tapped
    // Size: 0x1
    // Offset: 0x150
    bool tapped;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean initialized
    // Size: 0x1
    // Offset: 0x151
    bool initialized;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: initialized and: closest
    char __padding50[0x2] = {};
    // private UnityEngine.RaycastHit closest
    // Size: 0x2C
    // Offset: 0x154
    ::UnityEngine::RaycastHit closest;
    // Field size check
    static_assert(sizeof(::UnityEngine::RaycastHit) == 0x2C);
    public:
    // Get instance field reference: public UnityEngine.Transform[] angerPoint
    [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::Transform*>& dyn_angerPoint();
    // Get instance field reference: public System.Int32 angerPointIndex
    [[deprecated("Use field access instead!")]] int& dyn_angerPointIndex();
    // Get instance field reference: public SkeletonPathingNode[] pathPoints
    [[deprecated("Use field access instead!")]] ::ArrayW<::GlobalNamespace::SkeletonPathingNode*>& dyn_pathPoints();
    // Get instance field reference: public SkeletonPathingNode[] exitPoints
    [[deprecated("Use field access instead!")]] ::ArrayW<::GlobalNamespace::SkeletonPathingNode*>& dyn_exitPoints();
    // Get instance field reference: public UnityEngine.Transform heightOffset
