// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: TransferrableObject
#include "GlobalNamespace/TransferrableObject.hpp"
// Including type: RoomSystem
#include "GlobalNamespace/RoomSystem.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: InteractionPoint
  class InteractionPoint;
  // Forward declaring type: SlingshotProjectile
  class SlingshotProjectile;
  // Forward declaring type: DropZone
  class DropZone;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: LineRenderer
  class LineRenderer;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: AudioClip
  class AudioClip;
  // Forward declaring type: AudioSource
  class AudioSource;
  // Forward declaring type: Color
  struct Color;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: Photon::Pun
namespace Photon::Pun {
  // Skipping declaration: PhotonMessageInfo because it is already included!
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: Slingshot
  class Slingshot;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::Slingshot);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::Slingshot*, "", "Slingshot");
// Type namespace: 
namespace GlobalNamespace {
  // WARNING Size may be invalid!
  // Autogenerated type: Slingshot
  // [TokenAttribute] Offset: FFFFFFFF
  class Slingshot : public ::GlobalNamespace::TransferrableObject {
    public:
    // Nested type: ::GlobalNamespace::Slingshot::SlingshotState
    struct SlingshotState;
    // Nested type: ::GlobalNamespace::Slingshot::SlingshotActions
    struct SlingshotActions;
    public:
    // public UnityEngine.LineRenderer elasticLeft
    // Size: 0x8
    // Offset: 0x2D0
    ::UnityEngine::LineRenderer* elasticLeft;
    // Field size check
    static_assert(sizeof(::UnityEngine::LineRenderer*) == 0x8);
    // public UnityEngine.LineRenderer elasticRight
    // Size: 0x8
    // Offset: 0x2D8
    ::UnityEngine::LineRenderer* elasticRight;
    // Field size check
    static_assert(sizeof(::UnityEngine::LineRenderer*) == 0x8);
    // public UnityEngine.Transform leftArm
    // Size: 0x8
    // Offset: 0x2E0
    ::UnityEngine::Transform* leftArm;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Transform rightArm
    // Size: 0x8
    // Offset: 0x2E8
    ::UnityEngine::Transform* rightArm;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Transform center
    // Size: 0x8
    // Offset: 0x2F0
    ::UnityEngine::Transform* center;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Transform centerOrigin
    // Size: 0x8
    // Offset: 0x2F8
    ::UnityEngine::Transform* centerOrigin;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.GameObject dummyProjectile
    // Size: 0x8
    // Offset: 0x300
    ::UnityEngine::GameObject* dummyProjectile;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject drawingHand
    // Size: 0x8
    // Offset: 0x308
    ::UnityEngine::GameObject* drawingHand;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject projectilePrefab
    // Size: 0x8
    // Offset: 0x310
    ::UnityEngine::GameObject* projectilePrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject projectileTrail
    // Size: 0x8
    // Offset: 0x318
    ::UnityEngine::GameObject* projectileTrail;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public InteractionPoint nock
    // Size: 0x8
    // Offset: 0x320
    ::GlobalNamespace::InteractionPoint* nock;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::InteractionPoint*) == 0x8);
    // public InteractionPoint grip
    // Size: 0x8
    // Offset: 0x328
    ::GlobalNamespace::InteractionPoint* grip;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::InteractionPoint*) == 0x8);
    // public System.Single springConstant
    // Size: 0x4
    // Offset: 0x330
    float springConstant;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single maxDraw
    // Size: 0x4
    // Offset: 0x334
    float maxDraw;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.Transform leftHandSnap
    // Size: 0x8
    // Offset: 0x338
    ::UnityEngine::Transform* leftHandSnap;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public System.String _leftHandSnap_path
    // Size: 0x8
    // Offset: 0x340
    ::StringW leftHandSnap_path;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public UnityEngine.Transform rightHandSnap
    // Size: 0x8
    // Offset: 0x348
    ::UnityEngine::Transform* rightHandSnap;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public System.String _rightHandSnap_path
    // Size: 0x8
    // Offset: 0x350
    ::StringW rightHandSnap_path;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public UnityEngine.AudioClip[] shootSfxClips
    // Size: 0x8
    // Offset: 0x358
    ::ArrayW<::UnityEngine::AudioClip*> shootSfxClips;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::AudioClip*>) == 0x8);
    // public UnityEngine.AudioSource shootSfx
    // Size: 0x8
    // Offset: 0x360
    ::UnityEngine::AudioSource* shootSfx;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // public System.Boolean disableWhenNotInRoom
    // Size: 0x1
    // Offset: 0x368
    bool disableWhenNotInRoom;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean hasDummyProjectile
    // Size: 0x1
    // Offset: 0x369
    bool hasDummyProjectile;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Single delayLaunchTime
    // Size: 0x4
    // Offset: 0x36C
    float delayLaunchTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single minTimeToLaunch
    // Size: 0x4
    // Offset: 0x370
    float minTimeToLaunch;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single dummyProjectileColliderRadius
    // Size: 0x4
    // Offset: 0x374
    float dummyProjectileColliderRadius;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single dummyProjectileInitialScale
    // Size: 0x4
    // Offset: 0x378
    float dummyProjectileInitialScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 projectileCount
    // Size: 0x4
    // Offset: 0x37C
    int projectileCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.Vector3[] elasticLeftPoints
    // Size: 0x8
    // Offset: 0x380
    ::ArrayW<::UnityEngine::Vector3> elasticLeftPoints;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector3>) == 0x8);
    // private UnityEngine.Vector3[] elasticRightPoints
    // Size: 0x8
    // Offset: 0x388
    ::ArrayW<::UnityEngine::Vector3> elasticRightPoints;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector3>) == 0x8);
    // private System.Single _elasticIntialWidthMultiplier
    // Size: 0x4
    // Offset: 0x390
    float elasticIntialWidthMultiplier;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Collections.Generic.Dictionary`2<System.Int32,SlingshotProjectile> activeProjectiles
    // Size: 0x8
    // Offset: 0x398
    ::System::Collections::Generic::Dictionary_2<int, ::GlobalNamespace::SlingshotProjectile*>* activeProjectiles;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<int, ::GlobalNamespace::SlingshotProjectile*>*) == 0x8);
    public:
    // Get instance field reference: public UnityEngine.LineRenderer elasticLeft
    [[deprecated("Use field access instead!")]] ::UnityEngine::LineRenderer*& dyn_elasticLeft();
    // Get instance field reference: public UnityEngine.LineRenderer elasticRight
    [[deprecated("Use field access instead!")]] ::UnityEngine::LineRenderer*& dyn_elasticRight();
    // Get instance field reference: public UnityEngine.Transform leftArm
    [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_leftArm();
    // Get instance field reference: public UnityEngine.Transform rightArm
    [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_rightArm();
