// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: TransferrableObject
#include "GlobalNamespace/TransferrableObject.hpp"
// Including type: UnityEngine.LayerMask
#include "UnityEngine/LayerMask.hpp"
// Including type: UnityEngine.RaycastHit
#include "UnityEngine/RaycastHit.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: Animator
  class Animator;
  // Forward declaring type: AudioClip
  class AudioClip;
  // Forward declaring type: AudioSource
  class AudioSource;
  // Forward declaring type: Collision
  class Collision;
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: ThrowableBugBeacon
  class ThrowableBugBeacon;
  // Forward declaring type: ThrowableBugReliableState
  class ThrowableBugReliableState;
  // Forward declaring type: VRRig
  class VRRig;
  // Forward declaring type: DropZone
  class DropZone;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: ThrowableBug
  class ThrowableBug;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::ThrowableBug);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::ThrowableBug*, "", "ThrowableBug");
// Type namespace: 
namespace GlobalNamespace {
  // WARNING Size may be invalid!
  // Autogenerated type: ThrowableBug
  // [TokenAttribute] Offset: FFFFFFFF
  class ThrowableBug : public ::GlobalNamespace::TransferrableObject {
    public:
    // Nested type: ::GlobalNamespace::ThrowableBug::BugName
    struct BugName;
    // Nested type: ::GlobalNamespace::ThrowableBug::AudioState
    struct AudioState;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: ThrowableBug/BugName
    // [TokenAttribute] Offset: FFFFFFFF
    struct BugName/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: BugName
      constexpr BugName(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public ThrowableBug/BugName NONE
      static constexpr const int NONE = 0;
      // Get static field: static public ThrowableBug/BugName NONE
      static ::GlobalNamespace::ThrowableBug::BugName _get_NONE();
      // Set static field: static public ThrowableBug/BugName NONE
      static void _set_NONE(::GlobalNamespace::ThrowableBug::BugName value);
      // static field const value: static public ThrowableBug/BugName DougTheBug
      static constexpr const int DougTheBug = 1;
      // Get static field: static public ThrowableBug/BugName DougTheBug
      static ::GlobalNamespace::ThrowableBug::BugName _get_DougTheBug();
      // Set static field: static public ThrowableBug/BugName DougTheBug
      static void _set_DougTheBug(::GlobalNamespace::ThrowableBug::BugName value);
      // static field const value: static public ThrowableBug/BugName MattTheBat
      static constexpr const int MattTheBat = 2;
      // Get static field: static public ThrowableBug/BugName MattTheBat
      static ::GlobalNamespace::ThrowableBug::BugName _get_MattTheBat();
      // Set static field: static public ThrowableBug/BugName MattTheBat
      static void _set_MattTheBat(::GlobalNamespace::ThrowableBug::BugName value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // ThrowableBug/BugName
    #pragma pack(pop)
    static check_size<sizeof(ThrowableBug::BugName), 0 + sizeof(int)> __GlobalNamespace_ThrowableBug_BugNameSizeCheck;
    static_assert(sizeof(ThrowableBug::BugName) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: ThrowableBug/AudioState
    // [TokenAttribute] Offset: FFFFFFFF
    struct AudioState/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: AudioState
      constexpr AudioState(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public ThrowableBug/AudioState JustGrabbed
      static constexpr const int JustGrabbed = 0;
      // Get static field: static public ThrowableBug/AudioState JustGrabbed
      static ::GlobalNamespace::ThrowableBug::AudioState _get_JustGrabbed();
      // Set static field: static public ThrowableBug/AudioState JustGrabbed
      static void _set_JustGrabbed(::GlobalNamespace::ThrowableBug::AudioState value);
      // static field const value: static public ThrowableBug/AudioState ContinuallyGrabbed
      static constexpr const int ContinuallyGrabbed = 1;
      // Get static field: static public ThrowableBug/AudioState ContinuallyGrabbed
      static ::GlobalNamespace::ThrowableBug::AudioState _get_ContinuallyGrabbed();
      // Set static field: static public ThrowableBug/AudioState ContinuallyGrabbed
      static void _set_ContinuallyGrabbed(::GlobalNamespace::ThrowableBug::AudioState value);
      // static field const value: static public ThrowableBug/AudioState JustReleased
      static constexpr const int JustReleased = 2;
      // Get static field: static public ThrowableBug/AudioState JustReleased
      static ::GlobalNamespace::ThrowableBug::AudioState _get_JustReleased();
      // Set static field: static public ThrowableBug/AudioState JustReleased
      static void _set_JustReleased(::GlobalNamespace::ThrowableBug::AudioState value);
      // static field const value: static public ThrowableBug/AudioState NotHeld
      static constexpr const int NotHeld = 3;
      // Get static field: static public ThrowableBug/AudioState NotHeld
      static ::GlobalNamespace::ThrowableBug::AudioState _get_NotHeld();
      // Set static field: static public ThrowableBug/AudioState NotHeld
      static void _set_NotHeld(::GlobalNamespace::ThrowableBug::AudioState value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // ThrowableBug/AudioState
    #pragma pack(pop)
    static check_size<sizeof(ThrowableBug::AudioState), 0 + sizeof(int)> __GlobalNamespace_ThrowableBug_AudioStateSizeCheck;
    static_assert(sizeof(ThrowableBug::AudioState) == 0x4);
    public:
    // public ThrowableBugReliableState reliableState
    // Size: 0x8
    // Offset: 0x2D0
    ::GlobalNamespace::ThrowableBugReliableState* reliableState;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ThrowableBugReliableState*) == 0x8);
    // public System.Single slowingDownProgress
    // Size: 0x4
    // Offset: 0x2D8
    float slowingDownProgress;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single startingSpeed
    // Size: 0x4
    // Offset: 0x2DC
    float startingSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single bobingSpeed
    // Size: 0x4
    // Offset: 0x2E0
    float bobingSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single bobMagnintude
    // Size: 0x4
    // Offset: 0x2E4
    float bobMagnintude;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean shouldRandomizeFrequency
    // Size: 0x1
    // Offset: 0x2E8
    bool shouldRandomizeFrequency;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Single minRandFrequency
    // Size: 0x4
    // Offset: 0x2EC
    float minRandFrequency;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single maxRandFrequency
    // Size: 0x4
    // Offset: 0x2F0
    float maxRandFrequency;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single bobingFrequency
    // Size: 0x4
    // Offset: 0x2F4
    float bobingFrequency;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single bobingState
    // Size: 0x4
    // Offset: 0x2F8
    float bobingState;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single thrownYVelocity
    // Size: 0x4
    // Offset: 0x2FC
    float thrownYVelocity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single collisionHitRadius
    // Size: 0x4
    // Offset: 0x300
    float collisionHitRadius;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.LayerMask collisionCheckMask
    // Size: 0x4
    // Offset: 0x304
    ::UnityEngine::LayerMask collisionCheckMask;
    // Field size check
    static_assert(sizeof(::UnityEngine::LayerMask) == 0x4);
    // public UnityEngine.Vector3 thrownVeloicity
    // Size: 0xC
    // Offset: 0x308
    ::UnityEngine::Vector3 thrownVeloicity;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 targetVelocity
    // Size: 0xC
    // Offset: 0x314
    ::UnityEngine::Vector3 targetVelocity;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Quaternion bugRotationalVelocity
    // Size: 0x10
    // Offset: 0x320
    ::UnityEngine::Quaternion bugRotationalVelocity;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.RaycastHit[] rayCastNonAllocColliders
    // Size: 0x8
    // Offset: 0x330
    ::ArrayW<::UnityEngine::RaycastHit> rayCastNonAllocColliders;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::RaycastHit>) == 0x8);
    // private UnityEngine.RaycastHit[] rayCastNonAllocColliders2
    // Size: 0x8
    // Offset: 0x338
    ::ArrayW<::UnityEngine::RaycastHit> rayCastNonAllocColliders2;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::RaycastHit>) == 0x8);
    // public VRRig followingRig
    // Size: 0x8
    // Offset: 0x340
    ::GlobalNamespace::VRRig* followingRig;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::VRRig*) == 0x8);
    // public System.Boolean isTooHighTravelingDown
    // Size: 0x1
    // Offset: 0x348
    bool isTooHighTravelingDown;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Single descentSlerp
    // Size: 0x4
    // Offset: 0x34C
    float descentSlerp;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ascentSlerp
    // Size: 0x4
    // Offset: 0x350
    float ascentSlerp;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single maxNaturalSpeed
    // Size: 0x4
    // Offset: 0x354
    float maxNaturalSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single slowdownAcceleration
    // Size: 0x4
    // Offset: 0x358
    float slowdownAcceleration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single maximumHeightOffOfTheGroundBeforeStartingDescent
    // Size: 0x4
    // Offset: 0x35C
    float maximumHeightOffOfTheGroundBeforeStartingDescent;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single minimumHeightOffOfTheGroundBeforeStoppingDescent
    // Size: 0x4
    // Offset: 0x360
    float minimumHeightOffOfTheGroundBeforeStoppingDescent;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single descentRate
    // Size: 0x4
    // Offset: 0x364
    float descentRate;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single descentSlerpRate
    // Size: 0x4
    // Offset: 0x368
    float descentSlerpRate;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single minimumHeightOffOfTheGroundBeforeStartingAscent
    // Size: 0x4
    // Offset: 0x36C
    float minimumHeightOffOfTheGroundBeforeStartingAscent;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single maximumHeightOffOfTheGroundBeforeStoppingAscent
    // Size: 0x4
    // Offset: 0x370
    float maximumHeightOffOfTheGroundBeforeStoppingAscent;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ascentRate
    // Size: 0x4
    // Offset: 0x374
    float ascentRate;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ascentSlerpRate
    // Size: 0x4
    // Offset: 0x378
    float ascentSlerpRate;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean isTooLowTravelingUp
    // Size: 0x1
    // Offset: 0x37C
    bool isTooLowTravelingUp;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public UnityEngine.Animator animator
    // Size: 0x8
    // Offset: 0x380
    ::UnityEngine::Animator* animator;
    // Field size check
    static_assert(sizeof(::UnityEngine::Animator*) == 0x8);
    // public UnityEngine.AudioClip grabBugAudioClip
    // Size: 0x8
    // Offset: 0x388
    ::UnityEngine::AudioClip* grabBugAudioClip;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // public UnityEngine.AudioClip releaseBugAudioClip
    // Size: 0x8
    // Offset: 0x390
    ::UnityEngine::AudioClip* releaseBugAudioClip;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // public UnityEngine.AudioClip flyingBugAudioClip
    // Size: 0x8
    // Offset: 0x398
    ::UnityEngine::AudioClip* flyingBugAudioClip;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // private UnityEngine.AudioSource audioSource
    // Size: 0x8
    // Offset: 0x3A0
    ::UnityEngine::AudioSource* audioSource;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // private System.Single bobbingDefaultFrequency
    // Size: 0x4
    // Offset: 0x3A8
    float bobbingDefaultFrequency;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Int32 updateMultiplier
    // Size: 0x4
    // Offset: 0x3AC
    int updateMultiplier;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private ThrowableBug/AudioState currentAudioState
    // Size: 0x4
    // Offset: 0x3B0
    ::GlobalNamespace::ThrowableBug::AudioState currentAudioState;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ThrowableBug::AudioState) == 0x4);
    // private System.Single speedMultiplier
    // Size: 0x4
    // Offset: 0x3B4
    float speedMultiplier;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private ThrowableBug/BugName bugName
    // Size: 0x4
    // Offset: 0x3B8
    ::GlobalNamespace::ThrowableBug::BugName bugName;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ThrowableBug::BugName) == 0x4);
    // private UnityEngine.Transform lockedTarget
    // Size: 0x8
    // Offset: 0x3C0
    ::UnityEngine::Transform* lockedTarget;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private System.Boolean locked
    // Size: 0x1
    // Offset: 0x3C8
    bool locked;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get instance field reference: public ThrowableBugReliableState reliableState
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::ThrowableBugReliableState*& dyn_reliableState();
    // Get instance field reference: public System.Single slowingDownProgress
    [[deprecated("Use field access instead!")]] float& dyn_slowingDownProgress();
    // Get instance field reference: public System.Single startingSpeed
    [[deprecated("Use field access instead!")]] float& dyn_startingSpeed();
    // Get instance field reference: public System.Single bobingSpeed
    [[deprecated("Use field access instead!")]] float& dyn_bobingSpeed();
    // Get instance field reference: public System.Single bobMagnintude
    [[deprecated("Use field access instead!")]] float& dyn_bobMagnintude();
    // Get instance field reference: public System.Boolean shouldRandomizeFrequency
