// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: HoldableObject
#include "GlobalNamespace/HoldableObject.hpp"
// Including type: Sirenix.OdinInspector.ISelfValidator
#include "Sirenix/OdinInspector/ISelfValidator.hpp"
// Including type: IRequestableOwnershipGuardCallbacks
#include "GlobalNamespace/IRequestableOwnershipGuardCallbacks.hpp"
// Including type: IPreDisable
#include "GlobalNamespace/IPreDisable.hpp"
// Including type: GorillaTag.ISpawnable
#include "GorillaTag/ISpawnable.hpp"
// Including type: UnityEngine.Matrix4x4
#include "UnityEngine/Matrix4x4.hpp"
// Including type: System.Nullable`1
#include "System/Nullable_1.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: AdvancedItemState
  class AdvancedItemState;
  // Forward declaring type: BodyDockPositions
  class BodyDockPositions;
  // Forward declaring type: VRRigAnchorOverrides
  class VRRigAnchorOverrides;
  // Forward declaring type: VRRig
  class VRRig;
  // Forward declaring type: InteractionPoint
  class InteractionPoint;
  // Forward declaring type: TransferrableItemSlotTransformOverride
  class TransferrableItemSlotTransformOverride;
  // Forward declaring type: WorldShareableItem
  class WorldShareableItem;
  // Skipping declaration: PositionState because it is already included!
  // Forward declaring type: DropZone
  class DropZone;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: AudioSource
  class AudioSource;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: GameObject
  class GameObject;
  // Skipping declaration: Behaviour because it is already included!
  // Forward declaring type: Rigidbody
  class Rigidbody;
  // Forward declaring type: AudioClip
  class AudioClip;
}
// Forward declaring namespace: Sirenix::OdinInspector
namespace Sirenix::OdinInspector {
  // Forward declaring type: SelfValidationResult
  class SelfValidationResult;
}
// Forward declaring namespace: Photon::Realtime
namespace Photon::Realtime {
  // Forward declaring type: Player
  class Player;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: TransferrableObject
  class TransferrableObject;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::TransferrableObject);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::TransferrableObject*, "", "TransferrableObject");
// Type namespace: 
namespace GlobalNamespace {
  // WARNING Size may be invalid!
  // Autogenerated type: TransferrableObject
  // [TokenAttribute] Offset: FFFFFFFF
  class TransferrableObject : public ::GlobalNamespace::HoldableObject/*, public ::Sirenix::OdinInspector::ISelfValidator, public ::GlobalNamespace::IRequestableOwnershipGuardCallbacks, public ::GlobalNamespace::IPreDisable, public ::GorillaTag::ISpawnable*/ {
    public:
    // Nested type: ::GlobalNamespace::TransferrableObject::ItemStates
    struct ItemStates;
    // Nested type: ::GlobalNamespace::TransferrableObject::GrabType
    struct GrabType;
    // Nested type: ::GlobalNamespace::TransferrableObject::PositionState
    struct PositionState;
    // Nested type: ::GlobalNamespace::TransferrableObject::InterpolateState
    struct InterpolateState;
    // Nested type: ::GlobalNamespace::TransferrableObject::$$c
    class $$c;
    // Nested type: ::GlobalNamespace::TransferrableObject::$$c__DisplayClass125_0
    class $$c__DisplayClass125_0;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: TransferrableObject/ItemStates
    // [TokenAttribute] Offset: FFFFFFFF
    struct ItemStates/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: ItemStates
      constexpr ItemStates(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public TransferrableObject/ItemStates State0
      static constexpr const int State0 = 1;
      // Get static field: static public TransferrableObject/ItemStates State0
      static ::GlobalNamespace::TransferrableObject::ItemStates _get_State0();
      // Set static field: static public TransferrableObject/ItemStates State0
      static void _set_State0(::GlobalNamespace::TransferrableObject::ItemStates value);
      // static field const value: static public TransferrableObject/ItemStates State1
      static constexpr const int State1 = 2;
      // Get static field: static public TransferrableObject/ItemStates State1
      static ::GlobalNamespace::TransferrableObject::ItemStates _get_State1();
      // Set static field: static public TransferrableObject/ItemStates State1
      static void _set_State1(::GlobalNamespace::TransferrableObject::ItemStates value);
      // static field const value: static public TransferrableObject/ItemStates State2
      static constexpr const int State2 = 4;
      // Get static field: static public TransferrableObject/ItemStates State2
      static ::GlobalNamespace::TransferrableObject::ItemStates _get_State2();
      // Set static field: static public TransferrableObject/ItemStates State2
      static void _set_State2(::GlobalNamespace::TransferrableObject::ItemStates value);
      // static field const value: static public TransferrableObject/ItemStates State3
      static constexpr const int State3 = 8;
      // Get static field: static public TransferrableObject/ItemStates State3
      static ::GlobalNamespace::TransferrableObject::ItemStates _get_State3();
      // Set static field: static public TransferrableObject/ItemStates State3
      static void _set_State3(::GlobalNamespace::TransferrableObject::ItemStates value);
      // static field const value: static public TransferrableObject/ItemStates State4
      static constexpr const int State4 = 16;
      // Get static field: static public TransferrableObject/ItemStates State4
      static ::GlobalNamespace::TransferrableObject::ItemStates _get_State4();
      // Set static field: static public TransferrableObject/ItemStates State4
      static void _set_State4(::GlobalNamespace::TransferrableObject::ItemStates value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // TransferrableObject/ItemStates
    #pragma pack(pop)
    static check_size<sizeof(TransferrableObject::ItemStates), 0 + sizeof(int)> __GlobalNamespace_TransferrableObject_ItemStatesSizeCheck;
    static_assert(sizeof(TransferrableObject::ItemStates) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: TransferrableObject/GrabType
    // [TokenAttribute] Offset: FFFFFFFF
    struct GrabType/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: GrabType
      constexpr GrabType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public TransferrableObject/GrabType Default
      static constexpr const int Default = 0;
      // Get static field: static public TransferrableObject/GrabType Default
      static ::GlobalNamespace::TransferrableObject::GrabType _get_Default();
      // Set static field: static public TransferrableObject/GrabType Default
      static void _set_Default(::GlobalNamespace::TransferrableObject::GrabType value);
      // static field const value: static public TransferrableObject/GrabType Free
      static constexpr const int Free = 1;
      // Get static field: static public TransferrableObject/GrabType Free
      static ::GlobalNamespace::TransferrableObject::GrabType _get_Free();
      // Set static field: static public TransferrableObject/GrabType Free
      static void _set_Free(::GlobalNamespace::TransferrableObject::GrabType value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // TransferrableObject/GrabType
    #pragma pack(pop)
    static check_size<sizeof(TransferrableObject::GrabType), 0 + sizeof(int)> __GlobalNamespace_TransferrableObject_GrabTypeSizeCheck;
    static_assert(sizeof(TransferrableObject::GrabType) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: TransferrableObject/PositionState
    // [TokenAttribute] Offset: FFFFFFFF
    // [FlagsAttribute] Offset: FFFFFFFF
    struct PositionState/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: PositionState
      constexpr PositionState(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public TransferrableObject/PositionState OnLeftArm
      static constexpr const int OnLeftArm = 1;
      // Get static field: static public TransferrableObject/PositionState OnLeftArm
      static ::GlobalNamespace::TransferrableObject::PositionState _get_OnLeftArm();
      // Set static field: static public TransferrableObject/PositionState OnLeftArm
      static void _set_OnLeftArm(::GlobalNamespace::TransferrableObject::PositionState value);
      // static field const value: static public TransferrableObject/PositionState OnRightArm
      static constexpr const int OnRightArm = 2;
      // Get static field: static public TransferrableObject/PositionState OnRightArm
      static ::GlobalNamespace::TransferrableObject::PositionState _get_OnRightArm();
      // Set static field: static public TransferrableObject/PositionState OnRightArm
      static void _set_OnRightArm(::GlobalNamespace::TransferrableObject::PositionState value);
      // static field const value: static public TransferrableObject/PositionState InLeftHand
      static constexpr const int InLeftHand = 4;
      // Get static field: static public TransferrableObject/PositionState InLeftHand
      static ::GlobalNamespace::TransferrableObject::PositionState _get_InLeftHand();
      // Set static field: static public TransferrableObject/PositionState InLeftHand
      static void _set_InLeftHand(::GlobalNamespace::TransferrableObject::PositionState value);
      // static field const value: static public TransferrableObject/PositionState InRightHand
      static constexpr const int InRightHand = 8;
      // Get static field: static public TransferrableObject/PositionState InRightHand
      static ::GlobalNamespace::TransferrableObject::PositionState _get_InRightHand();
      // Set static field: static public TransferrableObject/PositionState InRightHand
      static void _set_InRightHand(::GlobalNamespace::TransferrableObject::PositionState value);
      // static field const value: static public TransferrableObject/PositionState OnChest
      static constexpr const int OnChest = 16;
      // Get static field: static public TransferrableObject/PositionState OnChest
      static ::GlobalNamespace::TransferrableObject::PositionState _get_OnChest();
      // Set static field: static public TransferrableObject/PositionState OnChest
      static void _set_OnChest(::GlobalNamespace::TransferrableObject::PositionState value);
      // static field const value: static public TransferrableObject/PositionState OnLeftShoulder
      static constexpr const int OnLeftShoulder = 32;
      // Get static field: static public TransferrableObject/PositionState OnLeftShoulder
      static ::GlobalNamespace::TransferrableObject::PositionState _get_OnLeftShoulder();
      // Set static field: static public TransferrableObject/PositionState OnLeftShoulder
      static void _set_OnLeftShoulder(::GlobalNamespace::TransferrableObject::PositionState value);
      // static field const value: static public TransferrableObject/PositionState OnRightShoulder
      static constexpr const int OnRightShoulder = 64;
      // Get static field: static public TransferrableObject/PositionState OnRightShoulder
      static ::GlobalNamespace::TransferrableObject::PositionState _get_OnRightShoulder();
      // Set static field: static public TransferrableObject/PositionState OnRightShoulder
      static void _set_OnRightShoulder(::GlobalNamespace::TransferrableObject::PositionState value);
      // static field const value: static public TransferrableObject/PositionState Dropped
      static constexpr const int Dropped = 128;
      // Get static field: static public TransferrableObject/PositionState Dropped
      static ::GlobalNamespace::TransferrableObject::PositionState _get_Dropped();
      // Set static field: static public TransferrableObject/PositionState Dropped
      static void _set_Dropped(::GlobalNamespace::TransferrableObject::PositionState value);
      // static field const value: static public TransferrableObject/PositionState None
      static constexpr const int None = 0;
      // Get static field: static public TransferrableObject/PositionState None
      static ::GlobalNamespace::TransferrableObject::PositionState _get_None();
      // Set static field: static public TransferrableObject/PositionState None
      static void _set_None(::GlobalNamespace::TransferrableObject::PositionState value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // TransferrableObject/PositionState
    #pragma pack(pop)
    static check_size<sizeof(TransferrableObject::PositionState), 0 + sizeof(int)> __GlobalNamespace_TransferrableObject_PositionStateSizeCheck;
    static_assert(sizeof(TransferrableObject::PositionState) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: TransferrableObject/InterpolateState
    // [TokenAttribute] Offset: FFFFFFFF
    struct InterpolateState/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: InterpolateState
      constexpr InterpolateState(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public TransferrableObject/InterpolateState None
      static constexpr const int None = 0;
      // Get static field: static public TransferrableObject/InterpolateState None
      static ::GlobalNamespace::TransferrableObject::InterpolateState _get_None();
      // Set static field: static public TransferrableObject/InterpolateState None
      static void _set_None(::GlobalNamespace::TransferrableObject::InterpolateState value);
      // static field const value: static public TransferrableObject/InterpolateState Interpolating
      static constexpr const int Interpolating = 1;
      // Get static field: static public TransferrableObject/InterpolateState Interpolating
      static ::GlobalNamespace::TransferrableObject::InterpolateState _get_Interpolating();
      // Set static field: static public TransferrableObject/InterpolateState Interpolating
      static void _set_Interpolating(::GlobalNamespace::TransferrableObject::InterpolateState value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // TransferrableObject/InterpolateState
    #pragma pack(pop)
    static check_size<sizeof(TransferrableObject::InterpolateState), 0 + sizeof(int)> __GlobalNamespace_TransferrableObject_InterpolateStateSizeCheck;
    static_assert(sizeof(TransferrableObject::InterpolateState) == 0x4);
    public:
    // private VRRig _myRig
    // Size: 0x8
    // Offset: 0x28
    ::GlobalNamespace::VRRig* myRig;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::VRRig*) == 0x8);
    // private System.Boolean <isMyRigValid>k__BackingField
    // Size: 0x1
    // Offset: 0x30
    bool isMyRigValid;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private VRRig _myOnlineRig
    // Size: 0x8
    // Offset: 0x38
    ::GlobalNamespace::VRRig* myOnlineRig;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::VRRig*) == 0x8);
    // private System.Boolean <isMyOnlineRigValid>k__BackingField
    // Size: 0x1
    // Offset: 0x40
    bool isMyOnlineRigValid;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean latched
    // Size: 0x1
    // Offset: 0x41
    bool latched;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Single indexTrigger
    // Size: 0x4
    // Offset: 0x44
    float indexTrigger;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean testActivate
    // Size: 0x1
    // Offset: 0x48
    bool testActivate;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean testDeactivate
    // Size: 0x1
    // Offset: 0x49
    bool testDeactivate;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Single myThreshold
    // Size: 0x4
    // Offset: 0x4C
    float myThreshold;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single hysterisis
    // Size: 0x4
    // Offset: 0x50
    float hysterisis;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean flipOnXForLeftHand
    // Size: 0x1
    // Offset: 0x54
    bool flipOnXForLeftHand;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean flipOnYForLeftHand
    // Size: 0x1
    // Offset: 0x55
    bool flipOnYForLeftHand;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean flipOnXForLeftArm
    // Size: 0x1
    // Offset: 0x56
    bool flipOnXForLeftArm;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean disableStealing
    // Size: 0x1
    // Offset: 0x57
    bool disableStealing;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean allowPlayerStealing
    // Size: 0x1
    // Offset: 0x58
    bool allowPlayerStealing;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private TransferrableObject/PositionState initState
    // Size: 0x4
    // Offset: 0x5C
    ::GlobalNamespace::TransferrableObject::PositionState initState;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::TransferrableObject::PositionState) == 0x4);
    // public TransferrableObject/ItemStates itemState
    // Size: 0x4
    // Offset: 0x60
    ::GlobalNamespace::TransferrableObject::ItemStates itemState;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::TransferrableObject::ItemStates) == 0x4);
    // public BodyDockPositions/DropPositions storedZone
    // Size: 0x4
    // Offset: 0x64
    ::GlobalNamespace::BodyDockPositions::DropPositions storedZone;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BodyDockPositions::DropPositions) == 0x4);
    // protected TransferrableObject/PositionState previousState
    // Size: 0x4
    // Offset: 0x68
    ::GlobalNamespace::TransferrableObject::PositionState previousState;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::TransferrableObject::PositionState) == 0x4);
    // public TransferrableObject/PositionState currentState
    // Size: 0x4
    // Offset: 0x6C
    ::GlobalNamespace::TransferrableObject::PositionState currentState;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::TransferrableObject::PositionState) == 0x4);
    // public BodyDockPositions/DropPositions dockPositions
    // Size: 0x4
    // Offset: 0x70
    ::GlobalNamespace::BodyDockPositions::DropPositions dockPositions;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BodyDockPositions::DropPositions) == 0x4);
    // public AdvancedItemState advancedGrabState
    // Size: 0x8
    // Offset: 0x78
    ::GlobalNamespace::AdvancedItemState* advancedGrabState;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::AdvancedItemState*) == 0x8);
    // public VRRig targetRig
    // Size: 0x8
    // Offset: 0x80
    ::GlobalNamespace::VRRig* targetRig;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::VRRig*) == 0x8);
    // public System.Boolean targetRigSet
    // Size: 0x1
    // Offset: 0x88
    bool targetRigSet;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public TransferrableObject/GrabType useGrabType
    // Size: 0x4
    // Offset: 0x8C
    ::GlobalNamespace::TransferrableObject::GrabType useGrabType;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::TransferrableObject::GrabType) == 0x4);
    // public VRRig ownerRig
    // Size: 0x8
    // Offset: 0x90
    ::GlobalNamespace::VRRig* ownerRig;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::VRRig*) == 0x8);
    // public BodyDockPositions targetDock
    // Size: 0x8
    // Offset: 0x98
    ::GlobalNamespace::BodyDockPositions* targetDock;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BodyDockPositions*) == 0x8);
    // private VRRigAnchorOverrides anchorOverrides
    // Size: 0x8
    // Offset: 0xA0
    ::GlobalNamespace::VRRigAnchorOverrides* anchorOverrides;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::VRRigAnchorOverrides*) == 0x8);
    // public System.Boolean canAutoGrabLeft
    // Size: 0x1
    // Offset: 0xA8
    bool canAutoGrabLeft;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean canAutoGrabRight
    // Size: 0x1
    // Offset: 0xA9
    bool canAutoGrabRight;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Int32 objectIndex
    // Size: 0x4
    // Offset: 0xAC
    int objectIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public UnityEngine.Transform anchor
    // Size: 0x8
    // Offset: 0xB0
    ::UnityEngine::Transform* anchor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public InteractionPoint gripInteractor
    // Size: 0x8
    // Offset: 0xB8
    ::GlobalNamespace::InteractionPoint* gripInteractor;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::InteractionPoint*) == 0x8);
    // public UnityEngine.Transform grabAnchor
    // Size: 0x8
    // Offset: 0xC0
    ::UnityEngine::Transform* grabAnchor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Transform handPoseLeft
    // Size: 0x8
    // Offset: 0xC8
    ::UnityEngine::Transform* handPoseLeft;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Transform handPoseRight
    // Size: 0x8
    // Offset: 0xD0
    ::UnityEngine::Transform* handPoseRight;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public System.Boolean isGrabAnchorSet
    // Size: 0x1
    // Offset: 0xD8
    bool isGrabAnchorSet;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public TransferrableItemSlotTransformOverride transferrableItemSlotTransformOverride
    // Size: 0x8
    // Offset: 0xE0
    ::GlobalNamespace::TransferrableItemSlotTransformOverride* transferrableItemSlotTransformOverride;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::TransferrableItemSlotTransformOverride*) == 0x8);
    // public System.Int32 myIndex
    // Size: 0x4
    // Offset: 0xE8
    int myIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public UnityEngine.GameObject[] gameObjectsActiveOnlyWhileHeld
    // Size: 0x8
    // Offset: 0xF0
    ::ArrayW<::UnityEngine::GameObject*> gameObjectsActiveOnlyWhileHeld;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // public UnityEngine.GameObject[] gameObjectsActiveOnlyWhileDocked
    // Size: 0x8
    // Offset: 0xF8
    ::ArrayW<::UnityEngine::GameObject*> gameObjectsActiveOnlyWhileDocked;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // public UnityEngine.Behaviour[] behavioursEnabledOnlyWhileHeld
    // Size: 0x8
    // Offset: 0x100
    ::ArrayW<::UnityEngine::Behaviour*> behavioursEnabledOnlyWhileHeld;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Behaviour*>) == 0x8);
    // public UnityEngine.Behaviour[] behavioursEnabledOnlyWhileDocked
    // Size: 0x8
    // Offset: 0x108
    ::ArrayW<::UnityEngine::Behaviour*> behavioursEnabledOnlyWhileDocked;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Behaviour*>) == 0x8);
    // protected internal WorldShareableItem worldShareableInstance
    // Size: 0x8
    // Offset: 0x110
    ::GlobalNamespace::WorldShareableItem* worldShareableInstance;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::WorldShareableItem*) == 0x8);
    // private System.Single interpTime
    // Size: 0x4
    // Offset: 0x118
    float interpTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single interpDt
    // Size: 0x4
    // Offset: 0x11C
    float interpDt;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector3 interpStartPos
    // Size: 0xC
    // Offset: 0x120
    ::UnityEngine::Vector3 interpStartPos;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Quaternion interpStartRot
    // Size: 0x10
    // Offset: 0x12C
    ::UnityEngine::Quaternion interpStartRot;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // protected System.Int32 enabledOnFrame
    // Size: 0x4
    // Offset: 0x13C
    int enabledOnFrame;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected UnityEngine.Vector3 initOffset
    // Size: 0xC
    // Offset: 0x140
    ::UnityEngine::Vector3 initOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // protected UnityEngine.Quaternion initRotation
    // Size: 0x10
    // Offset: 0x14C
    ::UnityEngine::Quaternion initRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.Matrix4x4 initMatrix
    // Size: 0x40
    // Offset: 0x15C
    ::UnityEngine::Matrix4x4 initMatrix;
    // Field size check
    static_assert(sizeof(::UnityEngine::Matrix4x4) == 0x40);
    // private UnityEngine.Matrix4x4 leftHandMatrix
    // Size: 0x40
    // Offset: 0x19C
    ::UnityEngine::Matrix4x4 leftHandMatrix;
    // Field size check
    static_assert(sizeof(::UnityEngine::Matrix4x4) == 0x40);
    // private UnityEngine.Matrix4x4 rightHandMatrix
    // Size: 0x40
    // Offset: 0x1DC
    ::UnityEngine::Matrix4x4 rightHandMatrix;
    // Field size check
    static_assert(sizeof(::UnityEngine::Matrix4x4) == 0x40);
    // private System.Boolean positionInitialized
    // Size: 0x1
    // Offset: 0x21C
    bool positionInitialized;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean isSceneObject
    // Size: 0x1
    // Offset: 0x21D
    bool isSceneObject;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public UnityEngine.Rigidbody rigidbodyInstance
    // Size: 0x8
    // Offset: 0x220
    ::UnityEngine::Rigidbody* rigidbodyInstance;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rigidbody*) == 0x8);
    // private System.Boolean <isRigidbodySet>k__BackingField
    // Size: 0x1
    // Offset: 0x228
    bool isRigidbodySet;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean canDrop
    // Size: 0x1
    // Offset: 0x229
    bool canDrop;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean allowReparenting
    // Size: 0x1
    // Offset: 0x22A
    bool allowReparenting;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean shareable
    // Size: 0x1
    // Offset: 0x22B
    bool shareable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean detatchOnGrab
    // Size: 0x1
    // Offset: 0x22C
    bool detatchOnGrab;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean allowWorldSharableInstance
    // Size: 0x1
    // Offset: 0x22D
    bool allowWorldSharableInstance;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public UnityEngine.Transform originPoint
    // Size: 0x8
    // Offset: 0x230
    ::UnityEngine::Transform* originPoint;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public System.Single maxDistanceFromOriginBeforeRespawn
    // Size: 0x4
    // Offset: 0x238
    float maxDistanceFromOriginBeforeRespawn;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.AudioClip resetPositionAudioClip
    // Size: 0x8
    // Offset: 0x240
    ::UnityEngine::AudioClip* resetPositionAudioClip;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // public System.Single maxDistanceFromTargetPlayerBeforeRespawn
    // Size: 0x4
    // Offset: 0x248
    float maxDistanceFromTargetPlayerBeforeRespawn;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean wasHover
    // Size: 0x1
    // Offset: 0x24C
    bool wasHover;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean isHover
    // Size: 0x1
    // Offset: 0x24D
    bool isHover;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean disableItem
    // Size: 0x1
    // Offset: 0x24E
    bool disableItem;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean loaded
    // Size: 0x1
    // Offset: 0x24F
    bool loaded;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean ClearLocalPositionOnReset
    // Size: 0x1
    // Offset: 0x250
    bool ClearLocalPositionOnReset;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public TransferrableObject/InterpolateState interpState
    // Size: 0x4
    // Offset: 0x254
    ::GlobalNamespace::TransferrableObject::InterpolateState interpState;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::TransferrableObject::InterpolateState) == 0x4);
    // public System.Boolean startInterpolation
    // Size: 0x1
    // Offset: 0x258
    bool startInterpolation;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public UnityEngine.Transform InitialDockObject
    // Size: 0x8
    // Offset: 0x260
    ::UnityEngine::Transform* InitialDockObject;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.AudioSource audioSrc
    // Size: 0x8
    // Offset: 0x268
    ::UnityEngine::AudioSource* audioSrc;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // private System.Boolean _isListeningFor_OnPostInstantiateAllPrefabs2
    // Size: 0x1
    // Offset: 0x270
    bool isListeningFor_OnPostInstantiateAllPrefabs2;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <IsSpawned>k__BackingField
    // Size: 0x1
    // Offset: 0x271
    bool IsSpawned;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected UnityEngine.Transform _defaultAnchor
    // Size: 0x8
    // Offset: 0x278
    ::UnityEngine::Transform* defaultAnchor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // protected System.Boolean _isDefaultAnchorSet
    // Size: 0x1
    // Offset: 0x280
    bool isDefaultAnchorSet;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Nullable`1<UnityEngine.Matrix4x4> transferrableItemSlotTransformOverrideCachedMatrix
    // Size: 0xFFFFFFFF
    // Offset: 0x284
    ::System::Nullable_1<::UnityEngine::Matrix4x4> transferrableItemSlotTransformOverrideCachedMatrix;
    // private System.Boolean transferrableItemSlotTransformOverrideApplicable
    // Size: 0x1
    // Offset: 0x2C8
    bool transferrableItemSlotTransformOverrideApplicable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating interface conversion operator: operator ::Sirenix::OdinInspector::ISelfValidator
    operator ::Sirenix::OdinInspector::ISelfValidator() noexcept {
      return *reinterpret_cast<::Sirenix::OdinInspector::ISelfValidator*>(this);
    }
    // Creating interface conversion operator: operator ::GlobalNamespace::IRequestableOwnershipGuardCallbacks
    operator ::GlobalNamespace::IRequestableOwnershipGuardCallbacks() noexcept {
      return *reinterpret_cast<::GlobalNamespace::IRequestableOwnershipGuardCallbacks*>(this);
    }
    // Creating interface conversion operator: operator ::GlobalNamespace::IPreDisable
    operator ::GlobalNamespace::IPreDisable() noexcept {
      return *reinterpret_cast<::GlobalNamespace::IPreDisable*>(this);
    }
