// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: TransferrableObject
#include "GlobalNamespace/TransferrableObject.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
// Including type: UnityEngine.ContactPoint
#include "UnityEngine/ContactPoint.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: SoundBankPlayer
  class SoundBankPlayer;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: AnimationCurve
  class AnimationCurve;
  // Forward declaring type: SphereCollider
  class SphereCollider;
  // Forward declaring type: Collider
  class Collider;
  // Forward declaring type: Collision
  class Collision;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: GorillaLocomotion::Climbing
namespace GorillaLocomotion::Climbing {
  // Forward declaring type: GorillaHandClimber
  class GorillaHandClimber;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: TransferrableBall
  class TransferrableBall;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::TransferrableBall);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::TransferrableBall*, "", "TransferrableBall");
// Type namespace: 
namespace GlobalNamespace {
  // WARNING Size may be invalid!
  // Autogenerated type: TransferrableBall
  // [TokenAttribute] Offset: FFFFFFFF
  class TransferrableBall : public ::GlobalNamespace::TransferrableObject {
    public:
    // Nested type: ::GlobalNamespace::TransferrableBall::$$c
    class $$c;
    public:
    // public System.Single ballRadius
    // Size: 0x4
    // Offset: 0x2CC
    float ballRadius;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single depenetrationSpeed
    // Size: 0x4
    // Offset: 0x2D0
    float depenetrationSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single hitSpeedThreshold
    // Size: 0x4
    // Offset: 0x2D4
    float hitSpeedThreshold;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single maxHitSpeed
    // Size: 0x4
    // Offset: 0x2D8
    float maxHitSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.Vector2 hitSpeedToHitMultiplierMinMax
    // Size: 0x8
    // Offset: 0x2DC
    ::UnityEngine::Vector2 hitSpeedToHitMultiplierMinMax;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // public UnityEngine.AnimationCurve hitMultiplierCurve
    // Size: 0x8
    // Offset: 0x2E8
    ::UnityEngine::AnimationCurve* hitMultiplierCurve;
    // Field size check
    static_assert(sizeof(::UnityEngine::AnimationCurve*) == 0x8);
    // public System.Single hitTorqueMultiplier
    // Size: 0x4
    // Offset: 0x2F0
    float hitTorqueMultiplier;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single reflectOffHandAmount
    // Size: 0x4
    // Offset: 0x2F4
    float reflectOffHandAmount;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single minHitSpeedThreshold
    // Size: 0x4
    // Offset: 0x2F8
    float minHitSpeedThreshold;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single surfaceGripDistance
    // Size: 0x4
    // Offset: 0x2FC
    float surfaceGripDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.Vector2 reflectOffHandSpeedInputMinMax
    // Size: 0x8
    // Offset: 0x300
    ::UnityEngine::Vector2 reflectOffHandSpeedInputMinMax;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // public UnityEngine.Vector2 reflectOffHandAmountOutputMinMax
    // Size: 0x8
    // Offset: 0x308
    ::UnityEngine::Vector2 reflectOffHandAmountOutputMinMax;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // public SoundBankPlayer hitSoundBank
    // Size: 0x8
    // Offset: 0x310
    ::GlobalNamespace::SoundBankPlayer* hitSoundBank;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SoundBankPlayer*) == 0x8);
    // public UnityEngine.Vector2 hitSpeedToAudioMinMax
    // Size: 0x8
    // Offset: 0x318
    ::UnityEngine::Vector2 hitSpeedToAudioMinMax;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // public System.Single handHitAudioMultiplier
    // Size: 0x4
    // Offset: 0x320
    float handHitAudioMultiplier;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.Vector2 hitSoundPitchMinMax
    // Size: 0x8
    // Offset: 0x324
    ::UnityEngine::Vector2 hitSoundPitchMinMax;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // public UnityEngine.Vector2 hitSoundVolumeMinMax
    // Size: 0x8
    // Offset: 0x32C
    ::UnityEngine::Vector2 hitSoundVolumeMinMax;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // public System.Boolean allowHeadButting
    // Size: 0x1
    // Offset: 0x334
    bool allowHeadButting;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Single headButtRadius
    // Size: 0x4
    // Offset: 0x338
    float headButtRadius;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single headButtHitMultiplier
    // Size: 0x4
    // Offset: 0x33C
    float headButtHitMultiplier;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single gravityCounterAmount
    // Size: 0x4
    // Offset: 0x340
    float gravityCounterAmount;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean debugDraw
    // Size: 0x1
    // Offset: 0x344
    bool debugDraw;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Collections.Generic.Dictionary`2<GorillaLocomotion.Climbing.GorillaHandClimber,System.Int32> handClimberMap
    // Size: 0x8
    // Offset: 0x348
    ::System::Collections::Generic::Dictionary_2<::GorillaLocomotion::Climbing::GorillaHandClimber*, int>* handClimberMap;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::GorillaLocomotion::Climbing::GorillaHandClimber*, int>*) == 0x8);
    // private UnityEngine.SphereCollider playerHeadCollider
    // Size: 0x8
    // Offset: 0x350
    ::UnityEngine::SphereCollider* playerHeadCollider;
    // Field size check
    static_assert(sizeof(::UnityEngine::SphereCollider*) == 0x8);
    // private UnityEngine.ContactPoint[] collisionContacts
    // Size: 0x8
    // Offset: 0x358
    ::ArrayW<::UnityEngine::ContactPoint> collisionContacts;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::ContactPoint>) == 0x8);
    // private System.Int32 collisionContactsCount
    // Size: 0x4
    // Offset: 0x360
    int collisionContactsCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single handRadius
    // Size: 0x4
    // Offset: 0x364
    float handRadius;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single depenetrationBias
    // Size: 0x4
    // Offset: 0x368
    float depenetrationBias;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean leftHandOverlapping
    // Size: 0x1
    // Offset: 0x36C
    bool leftHandOverlapping;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean rightHandOverlapping
    // Size: 0x1
    // Offset: 0x36D
    bool rightHandOverlapping;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean headOverlapping
    // Size: 0x1
    // Offset: 0x36E
    bool headOverlapping;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean onGround
    // Size: 0x1
    // Offset: 0x36F
    bool onGround;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private UnityEngine.ContactPoint groundContact
    // Size: 0x30
    // Offset: 0x370
    ::UnityEngine::ContactPoint groundContact;
    // Field size check
    static_assert(sizeof(::UnityEngine::ContactPoint) == 0x30);
    // private System.Boolean applyFrictionHolding
    // Size: 0x1
    // Offset: 0x3A0
    bool applyFrictionHolding;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private UnityEngine.Vector3 frictionHoldLocalPosLeft
    // Size: 0xC
    // Offset: 0x3A4
    ::UnityEngine::Vector3 frictionHoldLocalPosLeft;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Quaternion frictionHoldLocalRotLeft
    // Size: 0x10
    // Offset: 0x3B0
    ::UnityEngine::Quaternion frictionHoldLocalRotLeft;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.Vector3 frictionHoldLocalPosRight
    // Size: 0xC
    // Offset: 0x3C0
    ::UnityEngine::Vector3 frictionHoldLocalPosRight;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Quaternion frictionHoldLocalRotRight
    // Size: 0x10
    // Offset: 0x3CC
    ::UnityEngine::Quaternion frictionHoldLocalRotRight;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private System.Single hitSoundSpamLastHitTime
    // Size: 0x4
    // Offset: 0x3DC
    float hitSoundSpamLastHitTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 hitSoundSpamCount
    // Size: 0x4
    // Offset: 0x3E0
    int hitSoundSpamCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 hitSoundSpamLimit
    // Size: 0x4
    // Offset: 0x3E4
    int hitSoundSpamLimit;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single hitSoundSpamCooldownResetTime
    // Size: 0x4
    // Offset: 0x3E8
    float hitSoundSpamCooldownResetTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.String gorillaHeadTriggerTag
    // Size: 0x8
    // Offset: 0x3F0
    ::StringW gorillaHeadTriggerTag;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Get instance field reference: public System.Single ballRadius
    [[deprecated("Use field access instead!")]] float& dyn_ballRadius();
    // Get instance field reference: public System.Single depenetrationSpeed
    [[deprecated("Use field access instead!")]] float& dyn_depenetrationSpeed();
    // Get instance field reference: public System.Single hitSpeedThreshold
    [[deprecated("Use field access instead!")]] float& dyn_hitSpeedThreshold();
    // Get instance field reference: public System.Single maxHitSpeed
    [[deprecated("Use field access instead!")]] float& dyn_maxHitSpeed();
    // Get instance field reference: public UnityEngine.Vector2 hitSpeedToHitMultiplierMinMax
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector2& dyn_hitSpeedToHitMultiplierMinMax();
