// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: TryOnBundleButton
  class TryOnBundleButton;
  // Forward declaring type: TryOnPurchaseButton
  class TryOnPurchaseButton;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Image
  class Image;
  // Forward declaring type: Text
  class Text;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: GorillaNetworking::Store
namespace GorillaNetworking::Store {
  // Forward declaring type: StoreBundle
  class StoreBundle;
  // Forward declaring type: StoreBundleData
  class StoreBundleData;
}
// Forward declaring namespace: PlayFab
namespace PlayFab {
  // Forward declaring type: PlayFabError
  class PlayFabError;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: TryOnBundlesStand
  class TryOnBundlesStand;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::TryOnBundlesStand);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::TryOnBundlesStand*, "", "TryOnBundlesStand");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0xA8
  #pragma pack(push, 1)
  // Autogenerated type: TryOnBundlesStand
  // [TokenAttribute] Offset: FFFFFFFF
  class TryOnBundlesStand : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private TryOnBundleButton[] TryOnBundleButtons
    // Size: 0x8
    // Offset: 0x20
    ::ArrayW<::GlobalNamespace::TryOnBundleButton*> TryOnBundleButtons;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::TryOnBundleButton*>) == 0x8);
    // private UnityEngine.UI.Image[] BundleIcons
    // Size: 0x8
    // Offset: 0x28
    ::ArrayW<::UnityEngine::UI::Image*> BundleIcons;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::UI::Image*>) == 0x8);
    // private System.Int32 SelectedButtonIndex
    // Size: 0x4
    // Offset: 0x30
    int SelectedButtonIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: SelectedButtonIndex and: purchaseButton
    char __padding2[0x4] = {};
    // public TryOnPurchaseButton purchaseButton
    // Size: 0x8
    // Offset: 0x38
    ::GlobalNamespace::TryOnPurchaseButton* purchaseButton;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::TryOnPurchaseButton*) == 0x8);
    // public UnityEngine.UI.Image selectedBundleImage
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::UI::Image* selectedBundleImage;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Image*) == 0x8);
    // public UnityEngine.UI.Text computerScreenText
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::UI::Text* computerScreenText;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // public System.String ComputerDefaultTextTitleDataKey
    // Size: 0x8
    // Offset: 0x50
    ::StringW ComputerDefaultTextTitleDataKey;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String ComputerDefaultTextTitleDataValue
    // Size: 0x8
    // Offset: 0x58
    ::StringW ComputerDefaultTextTitleDataValue;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String ComputerAlreadyOwnTextTitleDataKey
    // Size: 0x8
    // Offset: 0x60
    ::StringW ComputerAlreadyOwnTextTitleDataKey;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String ComputerAlreadyOwnTextTitleDataValue
    // Size: 0x8
    // Offset: 0x68
    ::StringW ComputerAlreadyOwnTextTitleDataValue;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String PurchaseButtonDefaultTextTitleDataKey
    // Size: 0x8
    // Offset: 0x70
    ::StringW PurchaseButtonDefaultTextTitleDataKey;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String PurchaseButtonDefaultTextTitleDataValue
    // Size: 0x8
    // Offset: 0x78
    ::StringW PurchaseButtonDefaultTextTitleDataValue;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String PurchaseButtonAlreadyOwnTextTitleDataKey
    // Size: 0x8
    // Offset: 0x80
    ::StringW PurchaseButtonAlreadyOwnTextTitleDataKey;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String PurchaseButtonAlreadyOwnTextTitleDataValue
    // Size: 0x8
    // Offset: 0x88
    ::StringW PurchaseButtonAlreadyOwnTextTitleDataValue;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean bError
    // Size: 0x1
    // Offset: 0x90
    bool bError;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: bError and: computerScreeErrorText
    char __padding14[0x7] = {};
    // public System.String computerScreeErrorText
    // Size: 0x8
    // Offset: 0x98
    ::StringW computerScreeErrorText;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Collections.Generic.List`1<GorillaNetworking.Store.StoreBundle> storeBundles
    // Size: 0x8
    // Offset: 0xA0
    ::System::Collections::Generic::List_1<::GorillaNetworking::Store::StoreBundle*>* storeBundles;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GorillaNetworking::Store::StoreBundle*>*) == 0x8);
    public:
    // Get instance field reference: private TryOnBundleButton[] TryOnBundleButtons
    [[deprecated("Use field access instead!")]] ::ArrayW<::GlobalNamespace::TryOnBundleButton*>& dyn_TryOnBundleButtons();
    // Get instance field reference: private UnityEngine.UI.Image[] BundleIcons
    [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::UI::Image*>& dyn_BundleIcons();
    // Get instance field reference: private System.Int32 SelectedButtonIndex
    [[deprecated("Use field access instead!")]] int& dyn_SelectedButtonIndex();
    // Get instance field reference: public TryOnPurchaseButton purchaseButton
