// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: TMPro
namespace TMPro {
  // Forward declaring type: TextMeshProUGUI
  class TextMeshProUGUI;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Image
  class Image;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: UiAxis2dInspector
  class UiAxis2dInspector;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::UiAxis2dInspector);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::UiAxis2dInspector*, "", "UiAxis2dInspector");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x48
  #pragma pack(push, 1)
  // Autogenerated type: UiAxis2dInspector
  // [TokenAttribute] Offset: FFFFFFFF
  class UiAxis2dInspector : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private UnityEngine.Vector2 m_xExtent
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::Vector2 m_xExtent;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private UnityEngine.Vector2 m_yExtent
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::Vector2 m_yExtent;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private TMPro.TextMeshProUGUI m_nameLabel
    // Size: 0x8
    // Offset: 0x30
    ::TMPro::TextMeshProUGUI* m_nameLabel;
    // Field size check
    static_assert(sizeof(::TMPro::TextMeshProUGUI*) == 0x8);
    // private TMPro.TextMeshProUGUI m_valueLabel
    // Size: 0x8
    // Offset: 0x38
    ::TMPro::TextMeshProUGUI* m_valueLabel;
    // Field size check
    static_assert(sizeof(::TMPro::TextMeshProUGUI*) == 0x8);
    // private UnityEngine.UI.Image m_handle
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::UI::Image* m_handle;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Image*) == 0x8);
    public:
    // Get instance field reference: private UnityEngine.Vector2 m_xExtent
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector2& dyn_m_xExtent();
    // Get instance field reference: private UnityEngine.Vector2 m_yExtent
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector2& dyn_m_yExtent();
    // Get instance field reference: private TMPro.TextMeshProUGUI m_nameLabel
    [[deprecated("Use field access instead!")]] ::TMPro::TextMeshProUGUI*& dyn_m_nameLabel();
    // Get instance field reference: private TMPro.TextMeshProUGUI m_valueLabel
    [[deprecated("Use field access instead!")]] ::TMPro::TextMeshProUGUI*& dyn_m_valueLabel();
    // Get instance field reference: private UnityEngine.UI.Image m_handle
    [[deprecated("Use field access instead!")]] ::UnityEngine::UI::Image*& dyn_m_handle();
    // public System.Void SetExtents(UnityEngine.Vector2 xExtent, UnityEngine.Vector2 yExtent)
    // Offset: 0x294D804
    void SetExtents(::UnityEngine::Vector2 xExtent, ::UnityEngine::Vector2 yExtent);
    // public System.Void SetName(System.String name)
    // Offset: 0x294D810
    void SetName(::StringW name);
    // public System.Void SetValue(System.Boolean isTouching, UnityEngine.Vector2 value)
    // Offset: 0x294D834
    void SetValue(bool isTouching, ::UnityEngine::Vector2 value);
    // public System.Void .ctor()
    // Offset: 0x294DB48
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static UiAxis2dInspector* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::GlobalNamespace::UiAxis2dInspector::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<UiAxis2dInspector*, creationType>()));
    }
  }; // UiAxis2dInspector
  #pragma pack(pop)
  static check_size<sizeof(UiAxis2dInspector), 64 + sizeof(::UnityEngine::UI::Image*)> __GlobalNamespace_UiAxis2dInspectorSizeCheck;
  static_assert(sizeof(UiAxis2dInspector) == 0x48);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: GlobalNamespace::UiAxis2dInspector::SetExtents
// Il2CppName: SetExtents
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::UiAxis2dInspector::*)(::UnityEngine::Vector2, ::UnityEngine::Vector2)>(&GlobalNamespace::UiAxis2dInspector::SetExtents)> {
  static const MethodInfo* get() {
    static auto* xExtent = &::il2cpp_utils::GetClassFromName("UnityEngine", "Vector2")->byval_arg;
    static auto* yExtent = &::il2cpp_utils::GetClassFromName("UnityEngine", "Vector2")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::UiAxis2dInspector*), "SetExtents", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{xExtent, yExtent});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::UiAxis2dInspector::SetName
// Il2CppName: SetName
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::UiAxis2dInspector::*)(::StringW)>(&GlobalNamespace::UiAxis2dInspector::SetName)> {
  static const MethodInfo* get() {
    static auto* name = &::il2cpp_utils::GetClassFromName("System", "String")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::UiAxis2dInspector*), "SetName", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{name});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::UiAxis2dInspector::SetValue
// Il2CppName: SetValue
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GlobalNamespace::UiAxis2dInspector::*)(bool, ::UnityEngine::Vector2)>(&GlobalNamespace::UiAxis2dInspector::SetValue)> {
  static const MethodInfo* get() {
    static auto* isTouching = &::il2cpp_utils::GetClassFromName("System", "Boolean")->byval_arg;
    static auto* value = &::il2cpp_utils::GetClassFromName("UnityEngine", "Vector2")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(GlobalNamespace::UiAxis2dInspector*), "SetValue", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{isTouching, value});
  }
};
// Writing MetadataGetter for method: GlobalNamespace::UiAxis2dInspector::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
