// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: IWrappedSerializable
#include "GlobalNamespace/IWrappedSerializable.hpp"
// Including type: IPreDisable
#include "GlobalNamespace/IPreDisable.hpp"
// Including type: IUserCosmeticsCallback
#include "GlobalNamespace/IUserCosmeticsCallback.hpp"
// Including type: GorillaNetworking.CosmeticsController
#include "GorillaNetworking/CosmeticsController.hpp"
// Including type: Slingshot/SlingshotState
#include "GlobalNamespace/Slingshot_SlingshotState.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: System.Boolean
#include "System/Boolean.hpp"
// Including type: GTBitOps/BitWriteInfo
#include "GlobalNamespace/GTBitOps_BitWriteInfo.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares

namespace GorillaNetworking {
  // Forward declaring type: CosmeticItemRegistry
  class CosmeticItemRegistry;
  // Forward declaring type: FriendshipBracelet
  class FriendshipBracelet;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Forward declaring namespace: Photon::Voice::PUN
namespace Photon::Voice::PUN {
  // Forward declaring type: PhotonVoiceView
  class PhotonVoiceView;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: Photon::Voice
namespace Photon::Voice {
  // Forward declaring type: IAudioDesc
  class IAudioDesc;
}
// Forward declaring namespace: Photon::Pun
namespace Photon::Pun {
  // Forward declaring type: PhotonView
  class PhotonView;
  // Forward declaring type: PhotonStream
  class PhotonStream;
  // Skipping declaration: PhotonMessageInfo because it is already included!
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Action
  class Action;
}
// Forward declaring namespace: UnityEngine::XR
namespace UnityEngine::XR {
  // Forward declaring type: XRNode
  struct XRNode;
}
// Forward declaring namespace: PlayFab::ClientModels
namespace PlayFab::ClientModels {
  // Forward declaring type: GetUserInventoryResult
  class GetUserInventoryResult;
}
// Forward declaring namespace: PlayFab
namespace PlayFab {
  // Forward declaring type: PlayFabError
  class PlayFabError;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: VRRig
  class VRRig;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::VRRig);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::VRRig*, "", "VRRig");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x538
  #pragma pack(push, 1)
  // Autogenerated type: VRRig
  // [TokenAttribute] Offset: FFFFFFFF
  class VRRig : public ::UnityEngine::MonoBehaviour/*, public ::GlobalNamespace::IWrappedSerializable, public ::GlobalNamespace::IPreDisable, public ::GlobalNamespace::IUserCosmeticsCallback*/ {
    public:
    // Nested type: ::GlobalNamespace::VRRig::PartyMemberStatus
    struct PartyMemberStatus;
    // Nested type: ::GlobalNamespace::VRRig::WearablePackedStateSlots
    struct WearablePackedStateSlots;
    // Nested type: ::GlobalNamespace::VRRig::VelocityTime
    struct VelocityTime;
    // Nested type: ::GlobalNamespace::VRRig::QAxis
    struct QAxis;
    // Nested type: ::GlobalNamespace::VRRig::$$c
    class $$c;
    // Nested type: ::GlobalNamespace::VRRig::$OccasionalUpdate$d__227
    class $OccasionalUpdate$d__227;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: VRRig/PartyMemberStatus
    // [TokenAttribute] Offset: FFFFFFFF
    struct PartyMemberStatus/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: PartyMemberStatus
      constexpr PartyMemberStatus(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public VRRig/PartyMemberStatus NeedsUpdate
      static constexpr const int NeedsUpdate = 0;
      // Get static field: static public VRRig/PartyMemberStatus NeedsUpdate
      static ::GlobalNamespace::VRRig::PartyMemberStatus _get_NeedsUpdate();
      // Set static field: static public VRRig/PartyMemberStatus NeedsUpdate
      static void _set_NeedsUpdate(::GlobalNamespace::VRRig::PartyMemberStatus value);
      // static field const value: static public VRRig/PartyMemberStatus InLocalParty
      static constexpr const int InLocalParty = 1;
      // Get static field: static public VRRig/PartyMemberStatus InLocalParty
      static ::GlobalNamespace::VRRig::PartyMemberStatus _get_InLocalParty();
      // Set static field: static public VRRig/PartyMemberStatus InLocalParty
      static void _set_InLocalParty(::GlobalNamespace::VRRig::PartyMemberStatus value);
      // static field const value: static public VRRig/PartyMemberStatus NotInLocalParty
      static constexpr const int NotInLocalParty = 2;
      // Get static field: static public VRRig/PartyMemberStatus NotInLocalParty
      static ::GlobalNamespace::VRRig::PartyMemberStatus _get_NotInLocalParty();
      // Set static field: static public VRRig/PartyMemberStatus NotInLocalParty
      static void _set_NotInLocalParty(::GlobalNamespace::VRRig::PartyMemberStatus value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // VRRig/PartyMemberStatus
    #pragma pack(pop)
    static check_size<sizeof(VRRig::PartyMemberStatus), 0 + sizeof(int)> __GlobalNamespace_VRRig_PartyMemberStatusSizeCheck;
    static_assert(sizeof(VRRig::PartyMemberStatus) == 0x4);
    // Size: 0x18
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: VRRig/VelocityTime
    // [TokenAttribute] Offset: FFFFFFFF
    struct VelocityTime/*, public ::System::ValueType*/ {
      public:
      public:
      // public UnityEngine.Vector3 vel
      // Size: 0xC
      // Offset: 0x0
      ::UnityEngine::Vector3 vel;
      // Field size check
      static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
      // Padding between fields: vel and: time
      char __padding0[0x4] = {};
      // public System.Double time
      // Size: 0x8
      // Offset: 0x10
      double time;
      // Field size check
      static_assert(sizeof(double) == 0x8);
      public:
      // Creating value type constructor for type: VelocityTime
      constexpr VelocityTime(::UnityEngine::Vector3 vel_ = {}, double time_ = {}) noexcept : vel{vel_}, time{time_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public UnityEngine.Vector3 vel
      [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_vel();
      // Get instance field reference: public System.Double time
      [[deprecated("Use field access instead!")]] double& dyn_time();
      // public System.Void .ctor(UnityEngine.Vector3 velocity, System.Double velTime)
      // Offset: 0x26A6B5C
      // ABORTED: conflicts with another method.  VelocityTime(::UnityEngine::Vector3 velocity, double velTime);
    }; // VRRig/VelocityTime
    #pragma pack(pop)
    static check_size<sizeof(VRRig::VelocityTime), 16 + sizeof(double)> __GlobalNamespace_VRRig_VelocityTimeSizeCheck;
    static_assert(sizeof(VRRig::VelocityTime) == 0x18);
    public:
    // private System.Boolean _isListeningFor_OnPostInstantiateAllPrefabs
    // Size: 0x1
    // Offset: 0x20
    bool isListeningFor_OnPostInstantiateAllPrefabs;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isListeningFor_OnPostInstantiateAllPrefabs and: head
    char __padding0[0x7] = {};
    // public VRMap head
    // Size: 0x8
    // Offset: 0x28
    ::GlobalNamespace::VRMap* head;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::VRMap*) == 0x8);
    // public VRMap rightHand
    // Size: 0x8
    // Offset: 0x30
    ::GlobalNamespace::VRMap* rightHand;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::VRMap*) == 0x8);
    // public VRMap leftHand
    // Size: 0x8
    // Offset: 0x38
    ::GlobalNamespace::VRMap* leftHand;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::VRMap*) == 0x8);
    // public VRMapThumb leftThumb
    // Size: 0x8
    // Offset: 0x40
    ::GlobalNamespace::VRMapThumb* leftThumb;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::VRMapThumb*) == 0x8);
    // public VRMapIndex leftIndex
    // Size: 0x8
    // Offset: 0x48
    ::GlobalNamespace::VRMapIndex* leftIndex;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::VRMapIndex*) == 0x8);
    // public VRMapMiddle leftMiddle
    // Size: 0x8
    // Offset: 0x50
    ::GlobalNamespace::VRMapMiddle* leftMiddle;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::VRMapMiddle*) == 0x8);
    // public VRMapThumb rightThumb
    // Size: 0x8
    // Offset: 0x58
    ::GlobalNamespace::VRMapThumb* rightThumb;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::VRMapThumb*) == 0x8);
    // public VRMapIndex rightIndex
    // Size: 0x8
    // Offset: 0x60
    ::GlobalNamespace::VRMapIndex* rightIndex;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::VRMapIndex*) == 0x8);
    // public VRMapMiddle rightMiddle
    // Size: 0x8
    // Offset: 0x68
    ::GlobalNamespace::VRMapMiddle* rightMiddle;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::VRMapMiddle*) == 0x8);
    // private System.Int32 previousGrabbedRope
    // Size: 0x4
    // Offset: 0x70
    int previousGrabbedRope;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 previousGrabbedRopeBoneIndex
    // Size: 0x4
    // Offset: 0x74
    int previousGrabbedRopeBoneIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean previousGrabbedRopeWasLeft
    // Size: 0x1
    // Offset: 0x78
    bool previousGrabbedRopeWasLeft;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: previousGrabbedRopeWasLeft and: currentRopeSwing
    char __padding12[0x7] = {};
    // private GorillaLocomotion.Gameplay.GorillaRopeSwing currentRopeSwing
    // Size: 0x8
    // Offset: 0x80
    ::GorillaLocomotion::Gameplay::GorillaRopeSwing* currentRopeSwing;
    // Field size check
    static_assert(sizeof(::GorillaLocomotion::Gameplay::GorillaRopeSwing*) == 0x8);
    // private UnityEngine.Transform currentHoldParent
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::Transform* currentHoldParent;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform currentRopeSwingTarget
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::Transform* currentRopeSwingTarget;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private System.Single lastRopeGrabTimer
    // Size: 0x4
    // Offset: 0x98
    float lastRopeGrabTimer;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean shouldLerpToRope
    // Size: 0x1
    // Offset: 0x9C
    bool shouldLerpToRope;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: shouldLerpToRope and: grabbedRopeIndex
    char __padding17[0x3] = {};
    // public System.Int32 grabbedRopeIndex
    // Size: 0x4
    // Offset: 0xA0
    int grabbedRopeIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 grabbedRopeBoneIndex
    // Size: 0x4
    // Offset: 0xA4
    int grabbedRopeBoneIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Boolean grabbedRopeIsLeft
    // Size: 0x1
    // Offset: 0xA8
    bool grabbedRopeIsLeft;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: grabbedRopeIsLeft and: grabbedRopeOffset
    char __padding20[0x3] = {};
    // public UnityEngine.Vector3 grabbedRopeOffset
    // Size: 0xC
    // Offset: 0xAC
    ::UnityEngine::Vector3 grabbedRopeOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public System.Boolean isOfflineVRRig
    // Size: 0x1
    // Offset: 0xB8
    bool isOfflineVRRig;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isOfflineVRRig and: mainCamera
    char __padding22[0x7] = {};
    // public UnityEngine.GameObject mainCamera
    // Size: 0x8
    // Offset: 0xC0
    ::UnityEngine::GameObject* mainCamera;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.Transform playerOffsetTransform
    // Size: 0x8
    // Offset: 0xC8
    ::UnityEngine::Transform* playerOffsetTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public System.Int32 SDKIndex
    // Size: 0x4
    // Offset: 0xD0
    int SDKIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Boolean isMyPlayer
    // Size: 0x1
    // Offset: 0xD4
    bool isMyPlayer;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isMyPlayer and: leftHandPlayer
    char __padding26[0x3] = {};
    // public UnityEngine.AudioSource leftHandPlayer
    // Size: 0x8
    // Offset: 0xD8
    ::UnityEngine::AudioSource* leftHandPlayer;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // public UnityEngine.AudioSource rightHandPlayer
    // Size: 0x8
    // Offset: 0xE0
    ::UnityEngine::AudioSource* rightHandPlayer;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // public UnityEngine.AudioSource tagSound
    // Size: 0x8
    // Offset: 0xE8
    ::UnityEngine::AudioSource* tagSound;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // private System.Single ratio
    // Size: 0x4
    // Offset: 0xF0
    float ratio;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: ratio and: headConstraint
    char __padding30[0x4] = {};
    // public UnityEngine.Transform headConstraint
    // Size: 0x8
    // Offset: 0xF8
    ::UnityEngine::Transform* headConstraint;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Vector3 headBodyOffset
    // Size: 0xC
    // Offset: 0x100
    ::UnityEngine::Vector3 headBodyOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // Padding between fields: headBodyOffset and: headMesh
    char __padding32[0x4] = {};
    // public UnityEngine.GameObject headMesh
    // Size: 0x8
    // Offset: 0x110
    ::UnityEngine::GameObject* headMesh;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.Vector3 syncPos
    // Size: 0xC
    // Offset: 0x118
    ::UnityEngine::Vector3 syncPos;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 jobPos
    // Size: 0xC
    // Offset: 0x124
    ::UnityEngine::Vector3 jobPos;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Quaternion syncRotation
    // Size: 0x10
    // Offset: 0x130
    ::UnityEngine::Quaternion syncRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // public UnityEngine.Quaternion jobRotation
    // Size: 0x10
    // Offset: 0x140
    ::UnityEngine::Quaternion jobRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // public UnityEngine.AudioClip[] clipToPlay
    // Size: 0x8
    // Offset: 0x150
    ::ArrayW<::UnityEngine::AudioClip*> clipToPlay;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::AudioClip*>) == 0x8);
    // public UnityEngine.AudioClip[] handTapSound
    // Size: 0x8
    // Offset: 0x158
    ::ArrayW<::UnityEngine::AudioClip*> handTapSound;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::AudioClip*>) == 0x8);
    // public System.Int32 currentMatIndex
    // Size: 0x4
    // Offset: 0x160
    int currentMatIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 setMatIndex
    // Size: 0x4
    // Offset: 0x164
    int setMatIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 tempMatIndex
    // Size: 0x4
    // Offset: 0x168
    int tempMatIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Single lerpValueFingers
    // Size: 0x4
    // Offset: 0x16C
    float lerpValueFingers;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single lerpValueBody
    // Size: 0x4
    // Offset: 0x170
    float lerpValueBody;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: lerpValueBody and: backpack
    char __padding44[0x4] = {};
    // public UnityEngine.GameObject backpack
    // Size: 0x8
    // Offset: 0x178
    ::UnityEngine::GameObject* backpack;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.Transform leftHandTransform
    // Size: 0x8
    // Offset: 0x180
    ::UnityEngine::Transform* leftHandTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Transform rightHandTransform
    // Size: 0x8
    // Offset: 0x188
    ::UnityEngine::Transform* rightHandTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.SkinnedMeshRenderer mainSkin
    // Size: 0x8
    // Offset: 0x190
    ::UnityEngine::SkinnedMeshRenderer* mainSkin;
    // Field size check
    static_assert(sizeof(::UnityEngine::SkinnedMeshRenderer*) == 0x8);
    // public GorillaSkin defaultSkin
    // Size: 0x8
    // Offset: 0x198
    ::GlobalNamespace::GorillaSkin* defaultSkin;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::GorillaSkin*) == 0x8);
    // public ZoneEntity zoneEntity
    // Size: 0x8
    // Offset: 0x1A0
    ::GlobalNamespace::ZoneEntity* zoneEntity;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ZoneEntity*) == 0x8);
    // public UnityEngine.Material myDefaultSkinMaterialInstance
    // Size: 0x8
    // Offset: 0x1A8
    ::UnityEngine::Material* myDefaultSkinMaterialInstance;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // public UnityEngine.Material scoreboardMaterial
    // Size: 0x8
    // Offset: 0x1B0
    ::UnityEngine::Material* scoreboardMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // public UnityEngine.GameObject spectatorSkin
    // Size: 0x8
    // Offset: 0x1B8
    ::UnityEngine::GameObject* spectatorSkin;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public System.Int32 handSync
    // Size: 0x4
    // Offset: 0x1C0
    int handSync;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: handSync and: materialsToChangeTo
    char __padding54[0x4] = {};
    // public UnityEngine.Material[] materialsToChangeTo
    // Size: 0x8
    // Offset: 0x1C8
    ::ArrayW<::UnityEngine::Material*> materialsToChangeTo;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Material*>) == 0x8);
    // public System.Single red
    // Size: 0x4
    // Offset: 0x1D0
    float red;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single green
    // Size: 0x4
    // Offset: 0x1D4
    float green;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single blue
    // Size: 0x4
    // Offset: 0x1D8
    float blue;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: blue and: playerName
    char __padding58[0x4] = {};
    // public System.String playerName
    // Size: 0x8
    // Offset: 0x1E0
    ::StringW playerName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public UnityEngine.UI.Text playerText
    // Size: 0x8
    // Offset: 0x1E8
    ::UnityEngine::UI::Text* playerText;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // public System.String playerNameVisible
    // Size: 0x8
    // Offset: 0x1F0
    ::StringW playerNameVisible;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Boolean showName
    // Size: 0x1
    // Offset: 0x1F8
    bool showName;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: showName and: cosmeticsObjectRegistry
    char __padding62[0x7] = {};
    // public GorillaNetworking.CosmeticItemRegistry cosmeticsObjectRegistry
    // Size: 0x8
    // Offset: 0x200
    ::GorillaNetworking::CosmeticItemRegistry* cosmeticsObjectRegistry;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::CosmeticItemRegistry*) == 0x8);
    // public UnityEngine.GameObject[] _cosmetics
    // Size: 0x8
    // Offset: 0x208
    ::ArrayW<::UnityEngine::GameObject*> cosmetics;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // public UnityEngine.GameObject[] _overrideCosmetics
    // Size: 0x8
    // Offset: 0x210
    ::ArrayW<::UnityEngine::GameObject*> overrideCosmetics;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // public System.String concatStringOfCosmeticsAllowed
    // Size: 0x8
    // Offset: 0x218
    ::StringW concatStringOfCosmeticsAllowed;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Boolean initializedCosmetics
    // Size: 0x1
    // Offset: 0x220
    bool initializedCosmetics;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: initializedCosmetics and: cosmeticSet
    char __padding67[0x7] = {};
    // public GorillaNetworking.CosmeticsController/CosmeticSet cosmeticSet
    // Size: 0x8
    // Offset: 0x228
    ::GorillaNetworking::CosmeticsController::CosmeticSet* cosmeticSet;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::CosmeticsController::CosmeticSet*) == 0x8);
    // public GorillaNetworking.CosmeticsController/CosmeticSet tryOnSet
    // Size: 0x8
    // Offset: 0x230
    ::GorillaNetworking::CosmeticsController::CosmeticSet* tryOnSet;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::CosmeticsController::CosmeticSet*) == 0x8);
    // public GorillaNetworking.CosmeticsController/CosmeticSet mergedSet
    // Size: 0x8
    // Offset: 0x238
    ::GorillaNetworking::CosmeticsController::CosmeticSet* mergedSet;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::CosmeticsController::CosmeticSet*) == 0x8);
    // public GorillaNetworking.CosmeticsController/CosmeticSet prevSet
    // Size: 0x8
    // Offset: 0x240
    ::GorillaNetworking::CosmeticsController::CosmeticSet* prevSet;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::CosmeticsController::CosmeticSet*) == 0x8);
    // private System.Int32 cosmeticRetries
    // Size: 0x4
    // Offset: 0x248
    int cosmeticRetries;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 currentCosmeticTries
    // Size: 0x4
    // Offset: 0x24C
    int currentCosmeticTries;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public SizeManager sizeManager
    // Size: 0x8
    // Offset: 0x250
    ::GlobalNamespace::SizeManager* sizeManager;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SizeManager*) == 0x8);
    // public System.Single pitchScale
    // Size: 0x4
    // Offset: 0x258
    float pitchScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single pitchOffset
    // Size: 0x4
    // Offset: 0x25C
    float pitchOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean IsHaunted
    // Size: 0x1
    // Offset: 0x260
    bool IsHaunted;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: IsHaunted and: HauntedVoicePitch
    char __padding77[0x3] = {};
    // public System.Single HauntedVoicePitch
    // Size: 0x4
    // Offset: 0x264
    float HauntedVoicePitch;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single HauntedHearingVolume
    // Size: 0x4
    // Offset: 0x268
    float HauntedHearingVolume;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean UsingHauntedRing
    // Size: 0x1
    // Offset: 0x26C
    bool UsingHauntedRing;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: UsingHauntedRing and: HauntedRingVoicePitch
    char __padding80[0x3] = {};
    // public System.Single HauntedRingVoicePitch
    // Size: 0x4
    // Offset: 0x270
    float HauntedRingVoicePitch;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: HauntedRingVoicePitch and: friendshipBraceletLeftHand
    char __padding81[0x4] = {};
    // public GorillaNetworking.FriendshipBracelet friendshipBraceletLeftHand
    // Size: 0x8
    // Offset: 0x278
    ::GorillaNetworking::FriendshipBracelet* friendshipBraceletLeftHand;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::FriendshipBracelet*) == 0x8);
    // public NonCosmeticHandItem nonCosmeticLeftHandItem
    // Size: 0x8
    // Offset: 0x280
    ::GlobalNamespace::NonCosmeticHandItem* nonCosmeticLeftHandItem;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::NonCosmeticHandItem*) == 0x8);
    // public GorillaNetworking.FriendshipBracelet friendshipBraceletRightHand
    // Size: 0x8
    // Offset: 0x288
    ::GorillaNetworking::FriendshipBracelet* friendshipBraceletRightHand;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::FriendshipBracelet*) == 0x8);
    // public NonCosmeticHandItem nonCosmeticRightHandItem
    // Size: 0x8
    // Offset: 0x290
    ::GlobalNamespace::NonCosmeticHandItem* nonCosmeticRightHandItem;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::NonCosmeticHandItem*) == 0x8);
    // public VRRigReliableState reliableState
    // Size: 0x8
    // Offset: 0x298
    ::GlobalNamespace::VRRigReliableState* reliableState;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::VRRigReliableState*) == 0x8);
    // private UnityEngine.Transform MouthPosition
    // Size: 0x8
    // Offset: 0x2A0
    ::UnityEngine::Transform* MouthPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // RigContainer rigContainer
    // Size: 0x8
    // Offset: 0x2A8
    ::GlobalNamespace::RigContainer* rigContainer;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::RigContainer*) == 0x8);
    // private UnityEngine.Vector3 remoteVelocity
    // Size: 0xC
    // Offset: 0x2B0
    ::UnityEngine::Vector3 remoteVelocity;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // Padding between fields: remoteVelocity and: remoteLatestTimestamp
    char __padding89[0x4] = {};
    // private System.Double remoteLatestTimestamp
    // Size: 0x8
    // Offset: 0x2C0
    double remoteLatestTimestamp;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private UnityEngine.Vector3 remoteCorrectionNeeded
    // Size: 0xC
    // Offset: 0x2C8
    ::UnityEngine::Vector3 remoteCorrectionNeeded;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private VRRig/PartyMemberStatus partyMemberStatus
    // Size: 0x4
    // Offset: 0x2D4
    ::GlobalNamespace::VRRig::PartyMemberStatus partyMemberStatus;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::VRRig::PartyMemberStatus) == 0x4);
    // public System.Boolean inTryOnRoom
    // Size: 0x1
    // Offset: 0x2D8
    bool inTryOnRoom;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean muted
    // Size: 0x1
    // Offset: 0x2D9
    bool muted;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: muted and: scaleFactor
    char __padding94[0x2] = {};
    // public System.Single scaleFactor
    // Size: 0x4
    // Offset: 0x2DC
    float scaleFactor;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single lastScaleFactor
    // Size: 0x4
    // Offset: 0x2E0
    float lastScaleFactor;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single timeSpawned
    // Size: 0x4
    // Offset: 0x2E4
    float timeSpawned;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single doNotLerpConstant
    // Size: 0x4
    // Offset: 0x2E8
    float doNotLerpConstant;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: doNotLerpConstant and: tempString
    char __padding98[0x4] = {};
    // public System.String tempString
    // Size: 0x8
    // Offset: 0x2F0
    ::StringW tempString;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private Photon.Realtime.Player tempPlayer
    // Size: 0x8
    // Offset: 0x2F8
    ::Photon::Realtime::Player* tempPlayer;
    // Field size check
    static_assert(sizeof(::Photon::Realtime::Player*) == 0x8);
    // Photon.Realtime.Player creator
    // Size: 0x8
    // Offset: 0x300
    ::Photon::Realtime::Player* creator;
    // Field size check
    static_assert(sizeof(::Photon::Realtime::Player*) == 0x8);
    // NetPlayer creatorWrapped
    // Size: 0x8
    // Offset: 0x308
    ::GlobalNamespace::NetPlayer* creatorWrapped;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::NetPlayer*) == 0x8);
    // private VRRig tempRig
    // Size: 0x8
    // Offset: 0x310
    ::GlobalNamespace::VRRig* tempRig;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::VRRig*) == 0x8);
    // private System.Single[] speedArray
    // Size: 0x8
    // Offset: 0x318
    ::ArrayW<float> speedArray;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    // private System.Double handLerpValues
    // Size: 0x8
    // Offset: 0x320
    double handLerpValues;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private System.Boolean initialized
    // Size: 0x1
    // Offset: 0x328
    bool initialized;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: initialized and: battleBalloons
    char __padding106[0x7] = {};
    // public BattleBalloons battleBalloons
    // Size: 0x8
    // Offset: 0x330
    ::GlobalNamespace::BattleBalloons* battleBalloons;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BattleBalloons*) == 0x8);
    // private System.Int32 tempInt
    // Size: 0x4
    // Offset: 0x338
    int tempInt;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: tempInt and: myBodyDockPositions
    char __padding108[0x4] = {};
    // public BodyDockPositions myBodyDockPositions
    // Size: 0x8
    // Offset: 0x340
    ::GlobalNamespace::BodyDockPositions* myBodyDockPositions;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::BodyDockPositions*) == 0x8);
    // public UnityEngine.ParticleSystem lavaParticleSystem
    // Size: 0x8
    // Offset: 0x348
    ::UnityEngine::ParticleSystem* lavaParticleSystem;
    // Field size check
    static_assert(sizeof(::UnityEngine::ParticleSystem*) == 0x8);
    // public UnityEngine.ParticleSystem rockParticleSystem
    // Size: 0x8
    // Offset: 0x350
    ::UnityEngine::ParticleSystem* rockParticleSystem;
    // Field size check
    static_assert(sizeof(::UnityEngine::ParticleSystem*) == 0x8);
    // public UnityEngine.ParticleSystem iceParticleSystem
    // Size: 0x8
    // Offset: 0x358
    ::UnityEngine::ParticleSystem* iceParticleSystem;
    // Field size check
    static_assert(sizeof(::UnityEngine::ParticleSystem*) == 0x8);
    // public System.String tempItemName
    // Size: 0x8
    // Offset: 0x360
    ::StringW tempItemName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public GorillaNetworking.CosmeticsController/CosmeticItem tempItem
    // Size: 0x79
    // Offset: 0x368
    ::GorillaNetworking::CosmeticsController::CosmeticItem tempItem;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::CosmeticsController::CosmeticItem) == 0x79);
    // Padding between fields: tempItem and: tempItemId
    char __padding114[0x7] = {};
    // public System.String tempItemId
    // Size: 0x8
    // Offset: 0x3E8
    ::StringW tempItemId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Int32 tempItemCost
    // Size: 0x4
    // Offset: 0x3F0
    int tempItemCost;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 leftHandHoldableStatus
    // Size: 0x4
    // Offset: 0x3F4
    int leftHandHoldableStatus;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 rightHandHoldableStatus
    // Size: 0x4
    // Offset: 0x3F8
    int rightHandHoldableStatus;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: rightHandHoldableStatus and: musicDrums
    char __padding118[0x4] = {};
    // public UnityEngine.AudioSource[] musicDrums
    // Size: 0x8
    // Offset: 0x400
    ::ArrayW<::UnityEngine::AudioSource*> musicDrums;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::AudioSource*>) == 0x8);
    // public TransferrableObject[] instrumentSelfOnly
    // Size: 0x8
    // Offset: 0x408
    ::ArrayW<::GlobalNamespace::TransferrableObject*> instrumentSelfOnly;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::TransferrableObject*>) == 0x8);
    // public UnityEngine.AudioSource geodeCrackingSound
    // Size: 0x8
    // Offset: 0x410
    ::UnityEngine::AudioSource* geodeCrackingSound;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // public System.Single bonkTime
    // Size: 0x4
    // Offset: 0x418
    float bonkTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single bonkCooldown
    // Size: 0x4
    // Offset: 0x41C
    float bonkCooldown;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private VRRig tempVRRig
    // Size: 0x8
    // Offset: 0x420
    ::GlobalNamespace::VRRig* tempVRRig;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::VRRig*) == 0x8);
    // public UnityEngine.GameObject huntComputer
    // Size: 0x8
    // Offset: 0x428
    ::UnityEngine::GameObject* huntComputer;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject builderResizeWatch
    // Size: 0x8
    // Offset: 0x430
    ::UnityEngine::GameObject* builderResizeWatch;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public Slingshot slingshot
    // Size: 0x8
    // Offset: 0x438
    ::GlobalNamespace::Slingshot* slingshot;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::Slingshot*) == 0x8);
    // public Slingshot/SlingshotState slingshotState
    // Size: 0x4
    // Offset: 0x440
    ::GlobalNamespace::Slingshot::SlingshotState slingshotState;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::Slingshot::SlingshotState) == 0x4);
    // Padding between fields: slingshotState and: myPhotonVoiceView
    char __padding128[0x4] = {};
    // private Photon.Voice.PUN.PhotonVoiceView myPhotonVoiceView
    // Size: 0x8
    // Offset: 0x448
    ::Photon::Voice::PUN::PhotonVoiceView* myPhotonVoiceView;
    // Field size check
    static_assert(sizeof(::Photon::Voice::PUN::PhotonVoiceView*) == 0x8);
    // private VRRig senderRig
    // Size: 0x8
    // Offset: 0x450
    ::GlobalNamespace::VRRig* senderRig;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::VRRig*) == 0x8);
    // private System.Boolean isInitialized
    // Size: 0x1
    // Offset: 0x458
    bool isInitialized;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isInitialized and: velocityHistoryList
    char __padding131[0x7] = {};
    // private System.Collections.Generic.List`1<VRRig/VelocityTime> velocityHistoryList
    // Size: 0x8
    // Offset: 0x460
    ::System::Collections::Generic::List_1<::GlobalNamespace::VRRig::VelocityTime>* velocityHistoryList;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GlobalNamespace::VRRig::VelocityTime>*) == 0x8);
    // public System.Int32 velocityHistoryMaxLength
    // Size: 0x4
    // Offset: 0x468
    int velocityHistoryMaxLength;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.Vector3 lastPosition
    // Size: 0xC
    // Offset: 0x46C
    ::UnityEngine::Vector3 lastPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Single[] splashEffectTimes
    // Size: 0x8
    // Offset: 0x478
    ::ArrayW<float> splashEffectTimes;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    // UnityEngine.AudioSource voiceAudio
    // Size: 0x8
    // Offset: 0x480
    ::UnityEngine::AudioSource* voiceAudio;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // public System.Boolean remoteUseReplacementVoice
    // Size: 0x1
    // Offset: 0x488
    bool remoteUseReplacementVoice;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean localUseReplacementVoice
    // Size: 0x1
    // Offset: 0x489
    bool localUseReplacementVoice;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: localUseReplacementVoice and: currentMicWrapper
    char __padding138[0x6] = {};
    // private Photon.Voice.Unity.MicWrapper currentMicWrapper
    // Size: 0x8
    // Offset: 0x490
    ::Photon::Voice::Unity::MicWrapper* currentMicWrapper;
    // Field size check
    static_assert(sizeof(::Photon::Voice::Unity::MicWrapper*) == 0x8);
    // private Photon.Voice.IAudioDesc audioDesc
    // Size: 0x8
    // Offset: 0x498
    ::Photon::Voice::IAudioDesc* audioDesc;
    // Field size check
    static_assert(sizeof(::Photon::Voice::IAudioDesc*) == 0x8);
    // private System.Single speakingLoudness
    // Size: 0x4
    // Offset: 0x4A0
    float speakingLoudness;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean shouldSendSpeakingLoudness
    // Size: 0x1
    // Offset: 0x4A4
    bool shouldSendSpeakingLoudness;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: shouldSendSpeakingLoudness and: replacementVoiceLoudnessThreshold
    char __padding142[0x3] = {};
    // public System.Single replacementVoiceLoudnessThreshold
    // Size: 0x4
    // Offset: 0x4A8
    float replacementVoiceLoudnessThreshold;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Int32 replacementVoiceDetectionDelay
    // Size: 0x4
    // Offset: 0x4AC
    int replacementVoiceDetectionDelay;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private GorillaMouthFlap myMouthFlap
    // Size: 0x8
    // Offset: 0x4B0
    ::GlobalNamespace::GorillaMouthFlap* myMouthFlap;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::GorillaMouthFlap*) == 0x8);
    // private GorillaSpeakerLoudness mySpeakerLoudness
    // Size: 0x8
    // Offset: 0x4B8
    ::GlobalNamespace::GorillaSpeakerLoudness* mySpeakerLoudness;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::GorillaSpeakerLoudness*) == 0x8);
    // public ReplacementVoice myReplacementVoice
    // Size: 0x8
    // Offset: 0x4C0
    ::GlobalNamespace::ReplacementVoice* myReplacementVoice;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ReplacementVoice*) == 0x8);
    // private GorillaEyeExpressions myEyeExpressions
    // Size: 0x8
    // Offset: 0x4C8
    ::GlobalNamespace::GorillaEyeExpressions* myEyeExpressions;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::GorillaEyeExpressions*) == 0x8);
    // Photon.Pun.PhotonView photonView
    // Size: 0x8
    // Offset: 0x4D0
    ::Photon::Pun::PhotonView* photonView;
    // Field size check
    static_assert(sizeof(::Photon::Pun::PhotonView*) == 0x8);
    // VRRigSerializer rigSerializer
    // Size: 0x8
    // Offset: 0x4D8
    ::GlobalNamespace::VRRigSerializer* rigSerializer;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::VRRigSerializer*) == 0x8);
    // public NetPlayer OwningNetPlayer
    // Size: 0x8
    // Offset: 0x4E0
    ::GlobalNamespace::NetPlayer* OwningNetPlayer;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::NetPlayer*) == 0x8);
    // private FXSystemSettings sharedFXSettings
    // Size: 0x8
    // Offset: 0x4E8
    ::GlobalNamespace::FXSystemSettings* sharedFXSettings;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::FXSystemSettings*) == 0x8);
    // public FXSystemSettings fxSettings
    // Size: 0x8
    // Offset: 0x4F0
    ::GlobalNamespace::FXSystemSettings* fxSettings;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::FXSystemSettings*) == 0x8);
    // private System.Boolean playerWasHaunted
    // Size: 0x1
    // Offset: 0x4F8
    bool playerWasHaunted;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: playerWasHaunted and: nonHauntedVolume
    char __padding154[0x3] = {};
    // private System.Single nonHauntedVolume
    // Size: 0x4
    // Offset: 0x4FC
    float nonHauntedVolume;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.Color playerColor
    // Size: 0x10
    // Offset: 0x500
    ::UnityEngine::Color playerColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // public System.Boolean colorInitialized
    // Size: 0x1
    // Offset: 0x510
    bool colorInitialized;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: colorInitialized and: onColorInitialized
    char __padding157[0x7] = {};
    // private System.Action`1<UnityEngine.Color> onColorInitialized
    // Size: 0x8
    // Offset: 0x518
    ::System::Action_1<::UnityEngine::Color>* onColorInitialized;
    // Field size check
    static_assert(sizeof(::System::Action_1<::UnityEngine::Color>*) == 0x8);
    // private System.Action`1<UnityEngine.Color> OnColorChanged
    // Size: 0x8
    // Offset: 0x520
    ::System::Action_1<::UnityEngine::Color>* OnColorChanged;
    // Field size check
    static_assert(sizeof(::System::Action_1<::UnityEngine::Color>*) == 0x8);
    // private System.Boolean canReport
    // Size: 0x1
    // Offset: 0x528
    bool canReport;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean pendingCosmeticUpdate
    // Size: 0x1
    // Offset: 0x529
    bool pendingCosmeticUpdate;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: pendingCosmeticUpdate and: rawCosmeticString
    char __padding161[0x6] = {};
    // private System.String rawCosmeticString
    // Size: 0x8
    // Offset: 0x530
    ::StringW rawCosmeticString;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Creating interface conversion operator: operator ::GlobalNamespace::IWrappedSerializable
    operator ::GlobalNamespace::IWrappedSerializable() noexcept {
      return *reinterpret_cast<::GlobalNamespace::IWrappedSerializable*>(this);
    }
    // Creating interface conversion operator: operator ::GlobalNamespace::IPreDisable
    operator ::GlobalNamespace::IPreDisable() noexcept {
      return *reinterpret_cast<::GlobalNamespace::IPreDisable*>(this);
    }
    // Creating interface conversion operator: operator ::GlobalNamespace::IUserCosmeticsCallback
    operator ::GlobalNamespace::IUserCosmeticsCallback() noexcept {
      return *reinterpret_cast<::GlobalNamespace::IUserCosmeticsCallback*>(this);
    }
    // Get static field: static public System.Action newPlayerJoined
    static ::System::Action* _get_newPlayerJoined();
