// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Photon.Pun.MonoBehaviourPunCallbacks
#include "Photon/Pun/MonoBehaviourPunCallbacks.hpp"
// Including type: Photon.Pun.IPunInstantiateMagicCallback
#include "Photon/Pun/IPunInstantiateMagicCallback.hpp"
// Including type: Photon.Pun.IOnPhotonViewOwnerChange
#include "Photon/Pun/IOnPhotonViewOwnerChange.hpp"
// Including type: Photon.Pun.IPunObservable
#include "Photon/Pun/IPunObservable.hpp"
// Including type: IRequestableOwnershipGuardCallbacks
#include "GlobalNamespace/IRequestableOwnershipGuardCallbacks.hpp"
// Including type: TransferrableObject/PositionState
#include "GlobalNamespace/TransferrableObject.hpp"
// Including type: TransferrableObject/ItemStates
// Already included the same include: GlobalNamespace/TransferrableObject.hpp
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: RequestableOwnershipGuard
  class RequestableOwnershipGuard;
  // Forward declaring type: TransformViewTeleportSerializer
  class TransformViewTeleportSerializer;
  // Forward declaring type: WorldTargetItem
  class WorldTargetItem;
  // Skipping declaration: TransferrableObject because it is already included!
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
}
// Forward declaring namespace: Photon::Pun
namespace Photon::Pun {
  // Forward declaring type: PhotonView
  class PhotonView;
  // Forward declaring type: PhotonMessageInfo
  struct PhotonMessageInfo;
  // Forward declaring type: PhotonStream
  class PhotonStream;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: Photon::Realtime
namespace Photon::Realtime {
  // Forward declaring type: Player
  class Player;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: WorldShareableItem
  class WorldShareableItem;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::WorldShareableItem);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::WorldShareableItem*, "", "WorldShareableItem");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x78
  #pragma pack(push, 1)
  // Autogenerated type: WorldShareableItem
  // [TokenAttribute] Offset: FFFFFFFF
  class WorldShareableItem : public ::Photon::Pun::MonoBehaviourPunCallbacks/*, public ::Photon::Pun::IPunInstantiateMagicCallback, public ::Photon::Pun::IOnPhotonViewOwnerChange, public ::Photon::Pun::IPunObservable, public ::GlobalNamespace::IRequestableOwnershipGuardCallbacks*/ {
    public:
    // Nested type: ::GlobalNamespace::WorldShareableItem::Delegate
    class Delegate;
    // Nested type: ::GlobalNamespace::WorldShareableItem::OnOwnerChangeDelegate
    class OnOwnerChangeDelegate;
    // Nested type: ::GlobalNamespace::WorldShareableItem::CachedData
    struct CachedData;
    // Size: 0x8
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: WorldShareableItem/CachedData
    // [TokenAttribute] Offset: FFFFFFFF
    struct CachedData/*, public ::System::ValueType*/ {
      public:
      public:
      // public TransferrableObject/PositionState cachedTransferableObjectState
      // Size: 0x4
      // Offset: 0x0
      ::GlobalNamespace::TransferrableObject::PositionState cachedTransferableObjectState;
      // Field size check
      static_assert(sizeof(::GlobalNamespace::TransferrableObject::PositionState) == 0x4);
      // public TransferrableObject/ItemStates cachedTransferableObjectItemState
      // Size: 0x4
      // Offset: 0x4
      ::GlobalNamespace::TransferrableObject::ItemStates cachedTransferableObjectItemState;
      // Field size check
      static_assert(sizeof(::GlobalNamespace::TransferrableObject::ItemStates) == 0x4);
      public:
      // Creating value type constructor for type: CachedData
      constexpr CachedData(::GlobalNamespace::TransferrableObject::PositionState cachedTransferableObjectState_ = {}, ::GlobalNamespace::TransferrableObject::ItemStates cachedTransferableObjectItemState_ = {}) noexcept : cachedTransferableObjectState{cachedTransferableObjectState_}, cachedTransferableObjectItemState{cachedTransferableObjectItemState_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public TransferrableObject/PositionState cachedTransferableObjectState
      [[deprecated("Use field access instead!")]] ::GlobalNamespace::TransferrableObject::PositionState& dyn_cachedTransferableObjectState();
      // Get instance field reference: public TransferrableObject/ItemStates cachedTransferableObjectItemState
      [[deprecated("Use field access instead!")]] ::GlobalNamespace::TransferrableObject::ItemStates& dyn_cachedTransferableObjectItemState();
    }; // WorldShareableItem/CachedData
    #pragma pack(pop)
    static check_size<sizeof(WorldShareableItem::CachedData), 4 + sizeof(::GlobalNamespace::TransferrableObject::ItemStates)> __GlobalNamespace_WorldShareableItem_CachedDataSizeCheck;
    static_assert(sizeof(WorldShareableItem::CachedData) == 0x8);
    public:
    // private TransferrableObject/PositionState <transferableObjectState>k__BackingField
    // Size: 0x4
    // Offset: 0x28
    ::GlobalNamespace::TransferrableObject::PositionState transferableObjectState;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::TransferrableObject::PositionState) == 0x4);
    // private TransferrableObject/ItemStates <transferableObjectItemState>k__BackingField
    // Size: 0x4
    // Offset: 0x2C
    ::GlobalNamespace::TransferrableObject::ItemStates transferableObjectItemState;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::TransferrableObject::ItemStates) == 0x4);
    // private System.Boolean validShareable
    // Size: 0x1
    // Offset: 0x30
    bool validShareable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: validShareable and: view
    char __padding2[0x7] = {};
    // Photon.Pun.PhotonView view
    // Size: 0x8
    // Offset: 0x38
    ::Photon::Pun::PhotonView* view;
    // Field size check
    static_assert(sizeof(::Photon::Pun::PhotonView*) == 0x8);
    // public RequestableOwnershipGuard guard
    // Size: 0x8
    // Offset: 0x40
    ::GlobalNamespace::RequestableOwnershipGuard* guard;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::RequestableOwnershipGuard*) == 0x8);
    // private TransformViewTeleportSerializer teleportSerializer
    // Size: 0x8
    // Offset: 0x48
    ::GlobalNamespace::TransformViewTeleportSerializer* teleportSerializer;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::TransformViewTeleportSerializer*) == 0x8);
    // private WorldTargetItem target
    // Size: 0x8
    // Offset: 0x50
    ::GlobalNamespace::WorldTargetItem* target;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::WorldTargetItem*) == 0x8);
    // public WorldShareableItem/OnOwnerChangeDelegate onOwnerChangeCb
    // Size: 0x8
    // Offset: 0x58
    ::GlobalNamespace::WorldShareableItem::OnOwnerChangeDelegate* onOwnerChangeCb;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::WorldShareableItem::OnOwnerChangeDelegate*) == 0x8);
    // public System.Action rpcCallBack
    // Size: 0x8
    // Offset: 0x60
    ::System::Action* rpcCallBack;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private System.Boolean enableRemoteSync
    // Size: 0x1
    // Offset: 0x68
    bool enableRemoteSync;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: enableRemoteSync and: cachedDatas
    char __padding9[0x7] = {};
    // public System.Collections.Generic.Dictionary`2<Photon.Realtime.Player,WorldShareableItem/CachedData> cachedDatas
    // Size: 0x8
    // Offset: 0x70
    ::System::Collections::Generic::Dictionary_2<::Photon::Realtime::Player*, ::GlobalNamespace::WorldShareableItem::CachedData>* cachedDatas;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::Photon::Realtime::Player*, ::GlobalNamespace::WorldShareableItem::CachedData>*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::Photon::Pun::IPunInstantiateMagicCallback
    operator ::Photon::Pun::IPunInstantiateMagicCallback() noexcept {
      return *reinterpret_cast<::Photon::Pun::IPunInstantiateMagicCallback*>(this);
    }
    // Creating interface conversion operator: operator ::Photon::Pun::IOnPhotonViewOwnerChange
    operator ::Photon::Pun::IOnPhotonViewOwnerChange() noexcept {
      return *reinterpret_cast<::Photon::Pun::IOnPhotonViewOwnerChange*>(this);
    }
    // Creating interface conversion operator: operator ::Photon::Pun::IPunObservable
