// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: GorillaTag.Cosmetics.RCRemoteHoldable/RCInput
#include "GorillaTag/Cosmetics/RCRemoteHoldable.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GorillaTag::Cosmetics
namespace GorillaTag::Cosmetics {
  // Skipping declaration: RCRemoteHoldable because it is already included!
  // Forward declaring type: RCCosmeticNetworkSync
  class RCCosmeticNetworkSync;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: Rigidbody
  class Rigidbody;
  // Skipping declaration: Vector3 because it is already included!
}
// Completed forward declares
// Type namespace: GorillaTag.Cosmetics
namespace GorillaTag::Cosmetics {
  // Forward declaring type: RCVehicle
  class RCVehicle;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GorillaTag::Cosmetics::RCVehicle);
DEFINE_IL2CPP_ARG_TYPE(::GorillaTag::Cosmetics::RCVehicle*, "GorillaTag.Cosmetics", "RCVehicle");
// Type namespace: GorillaTag.Cosmetics
namespace GorillaTag::Cosmetics {
  // Size: 0xC8
  #pragma pack(push, 1)
  // Autogenerated type: GorillaTag.Cosmetics.RCVehicle
  // [TokenAttribute] Offset: FFFFFFFF
  class RCVehicle : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::GorillaTag::Cosmetics::RCVehicle::State
    struct State;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: GorillaTag.Cosmetics.RCVehicle/State
    // [TokenAttribute] Offset: FFFFFFFF
    struct State/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: State
      constexpr State(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public GorillaTag.Cosmetics.RCVehicle/State Disabled
      static constexpr const int Disabled = 0;
      // Get static field: static public GorillaTag.Cosmetics.RCVehicle/State Disabled
      static ::GorillaTag::Cosmetics::RCVehicle::State _get_Disabled();
      // Set static field: static public GorillaTag.Cosmetics.RCVehicle/State Disabled
      static void _set_Disabled(::GorillaTag::Cosmetics::RCVehicle::State value);
      // static field const value: static public GorillaTag.Cosmetics.RCVehicle/State DockedLeft
      static constexpr const int DockedLeft = 1;
      // Get static field: static public GorillaTag.Cosmetics.RCVehicle/State DockedLeft
      static ::GorillaTag::Cosmetics::RCVehicle::State _get_DockedLeft();
      // Set static field: static public GorillaTag.Cosmetics.RCVehicle/State DockedLeft
      static void _set_DockedLeft(::GorillaTag::Cosmetics::RCVehicle::State value);
      // static field const value: static public GorillaTag.Cosmetics.RCVehicle/State DockedRight
      static constexpr const int DockedRight = 2;
      // Get static field: static public GorillaTag.Cosmetics.RCVehicle/State DockedRight
      static ::GorillaTag::Cosmetics::RCVehicle::State _get_DockedRight();
      // Set static field: static public GorillaTag.Cosmetics.RCVehicle/State DockedRight
      static void _set_DockedRight(::GorillaTag::Cosmetics::RCVehicle::State value);
      // static field const value: static public GorillaTag.Cosmetics.RCVehicle/State Mobilized
      static constexpr const int Mobilized = 3;
      // Get static field: static public GorillaTag.Cosmetics.RCVehicle/State Mobilized
      static ::GorillaTag::Cosmetics::RCVehicle::State _get_Mobilized();
      // Set static field: static public GorillaTag.Cosmetics.RCVehicle/State Mobilized
      static void _set_Mobilized(::GorillaTag::Cosmetics::RCVehicle::State value);
      // static field const value: static public GorillaTag.Cosmetics.RCVehicle/State Crashed
      static constexpr const int Crashed = 4;
      // Get static field: static public GorillaTag.Cosmetics.RCVehicle/State Crashed
      static ::GorillaTag::Cosmetics::RCVehicle::State _get_Crashed();
      // Set static field: static public GorillaTag.Cosmetics.RCVehicle/State Crashed
      static void _set_Crashed(::GorillaTag::Cosmetics::RCVehicle::State value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // GorillaTag.Cosmetics.RCVehicle/State
    #pragma pack(pop)
    static check_size<sizeof(RCVehicle::State), 0 + sizeof(int)> __GorillaTag_Cosmetics_RCVehicle_StateSizeCheck;
    static_assert(sizeof(RCVehicle::State) == 0x4);
    public:
    // private UnityEngine.Transform leftDockParent
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::Transform* leftDockParent;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private System.String leftDockParent_path
    // Size: 0x8
    // Offset: 0x28
    ::StringW leftDockParent_path;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private UnityEngine.Transform rightDockParent
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Transform* rightDockParent;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private System.String rightDockParent_path
    // Size: 0x8
    // Offset: 0x38
    ::StringW rightDockParent_path;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Single maxRange
    // Size: 0x4
    // Offset: 0x40
    float maxRange;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single maxDisconnectionTime
    // Size: 0x4
    // Offset: 0x44
    float maxDisconnectionTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single crashRespawnDelay
    // Size: 0x4
    // Offset: 0x48
    float crashRespawnDelay;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean crashOnHit
    // Size: 0x1
    // Offset: 0x4C
    bool crashOnHit;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: crashOnHit and: crashOnHitSpeedThreshold
    char __padding7[0x3] = {};
    // private System.Single crashOnHitSpeedThreshold
    // Size: 0x4
    // Offset: 0x50
    float crashOnHitSpeedThreshold;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single hitVelocityTransfer
    // Size: 0x4
    // Offset: 0x54
    float hitVelocityTransfer;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single projectileVelocityTransfer
    // Size: 0x4
    // Offset: 0x58
    float projectileVelocityTransfer;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single hitMaxHitSpeed
    // Size: 0x4
    // Offset: 0x5C
    float hitMaxHitSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single joystickDeadzone
    // Size: 0x4
    // Offset: 0x60
    float joystickDeadzone;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected GorillaTag.Cosmetics.RCVehicle/State localState
    // Size: 0x4
    // Offset: 0x64
    ::GorillaTag::Cosmetics::RCVehicle::State localState;
    // Field size check
    static_assert(sizeof(::GorillaTag::Cosmetics::RCVehicle::State) == 0x4);
    // protected GorillaTag.Cosmetics.RCVehicle/State localStatePrev
    // Size: 0x4
    // Offset: 0x68
    ::GorillaTag::Cosmetics::RCVehicle::State localStatePrev;
    // Field size check
    static_assert(sizeof(::GorillaTag::Cosmetics::RCVehicle::State) == 0x4);
    // protected System.Single stateStartTime
    // Size: 0x4
    // Offset: 0x6C
    float stateStartTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected GorillaTag.Cosmetics.RCRemoteHoldable connectedRemote
    // Size: 0x8
    // Offset: 0x70
    ::GorillaTag::Cosmetics::RCRemoteHoldable* connectedRemote;
    // Field size check
    static_assert(sizeof(::GorillaTag::Cosmetics::RCRemoteHoldable*) == 0x8);
    // protected GorillaTag.Cosmetics.RCCosmeticNetworkSync networkSync
    // Size: 0x8
    // Offset: 0x78
    ::GorillaTag::Cosmetics::RCCosmeticNetworkSync* networkSync;
    // Field size check
    static_assert(sizeof(::GorillaTag::Cosmetics::RCCosmeticNetworkSync*) == 0x8);
    // protected GorillaTag.Cosmetics.RCRemoteHoldable/RCInput activeInput
    // Size: 0xC
    // Offset: 0x80
    ::GorillaTag::Cosmetics::RCRemoteHoldable::RCInput activeInput;
    // Field size check
    static_assert(sizeof(::GorillaTag::Cosmetics::RCRemoteHoldable::RCInput) == 0xC);
    // Padding between fields: activeInput and: rb
    char __padding18[0x4] = {};
    // protected UnityEngine.Rigidbody rb
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::Rigidbody* rb;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rigidbody*) == 0x8);
    // private UnityEngine.Quaternion leftDockLocalRot
    // Size: 0x10
    // Offset: 0x98
    ::UnityEngine::Quaternion leftDockLocalRot;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.Quaternion rightDockLocalRot
    // Size: 0x10
    // Offset: 0xA8
    ::UnityEngine::Quaternion rightDockLocalRot;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private System.Boolean waitingForTriggerRelease
    // Size: 0x1
    // Offset: 0xB8
    bool waitingForTriggerRelease;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: waitingForTriggerRelease and: disconnectionTime
    char __padding22[0x3] = {};
    // private System.Single disconnectionTime
    // Size: 0x4
    // Offset: 0xBC
    float disconnectionTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean useLeftDock
    // Size: 0x1
    // Offset: 0xC0
    bool useLeftDock;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: useLeftDock and: networkSyncFollowRateExp
    char __padding24[0x3] = {};
    // private System.Single networkSyncFollowRateExp
    // Size: 0x4
    // Offset: 0xC4
    float networkSyncFollowRateExp;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Get instance field reference: private UnityEngine.Transform leftDockParent
    [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_leftDockParent();
    // Get instance field reference: private System.String leftDockParent_path
    [[deprecated("Use field access instead!")]] ::StringW& dyn_leftDockParent_path();
    // Get instance field reference: private UnityEngine.Transform rightDockParent
    [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_rightDockParent();
    // Get instance field reference: private System.String rightDockParent_path
    [[deprecated("Use field access instead!")]] ::StringW& dyn_rightDockParent_path();
    // Get instance field reference: private System.Single maxRange
    [[deprecated("Use field access instead!")]] float& dyn_maxRange();
