// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: KID.Client.IReadableConfiguration
#include "KID/Client/IReadableConfiguration.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: KID::Client
namespace KID::Client {
  // Forward declaring type: ExceptionFactory
  class ExceptionFactory;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: IDictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class IDictionary_2;
  // Forward declaring type: IList`1<T>
  template<typename T>
  class IList_1;
  // Forward declaring type: IReadOnlyDictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class IReadOnlyDictionary_2;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: System::Net
namespace System::Net {
  // Forward declaring type: WebProxy
  class WebProxy;
}
// Forward declaring namespace: System::Security::Cryptography::X509Certificates
namespace System::Security::Cryptography::X509Certificates {
  // Forward declaring type: X509CertificateCollection
  class X509CertificateCollection;
}
// Forward declaring namespace: System::Net::Security
namespace System::Net::Security {
  // Forward declaring type: RemoteCertificateValidationCallback
  class RemoteCertificateValidationCallback;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
}
// Completed forward declares
// Type namespace: KID.Client
namespace KID::Client {
  // Forward declaring type: Configuration
  class Configuration;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::KID::Client::Configuration);
DEFINE_IL2CPP_ARG_TYPE(::KID::Client::Configuration*, "KID.Client", "Configuration");
// Type namespace: KID.Client
namespace KID::Client {
  // Size: 0x98
  #pragma pack(push, 1)
  // Autogenerated type: KID.Client.Configuration
  // [TokenAttribute] Offset: FFFFFFFF
  class Configuration : public ::Il2CppObject/*, public ::KID::Client::IReadableConfiguration*/ {
    public:
    // Nested type: ::KID::Client::Configuration::$$c
    class $$c;
    public:
    // private System.String _basePath
    // Size: 0x8
    // Offset: 0x10
    ::StringW basePath;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean _useDefaultCredentials
    // Size: 0x1
    // Offset: 0x18
    bool useDefaultCredentials;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: useDefaultCredentials and: apiKey
    char __padding1[0x7] = {};
    // private System.Collections.Generic.IDictionary`2<System.String,System.String> _apiKey
    // Size: 0x8
    // Offset: 0x20
    ::System::Collections::Generic::IDictionary_2<::StringW, ::StringW>* apiKey;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::IDictionary_2<::StringW, ::StringW>*) == 0x8);
    // private System.Collections.Generic.IDictionary`2<System.String,System.String> _apiKeyPrefix
    // Size: 0x8
    // Offset: 0x28
    ::System::Collections::Generic::IDictionary_2<::StringW, ::StringW>* apiKeyPrefix;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::IDictionary_2<::StringW, ::StringW>*) == 0x8);
    // private System.String _dateTimeFormat
    // Size: 0x8
    // Offset: 0x30
    ::StringW dateTimeFormat;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String _tempFolderPath
    // Size: 0x8
    // Offset: 0x38
    ::StringW tempFolderPath;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Collections.Generic.IList`1<System.Collections.Generic.IReadOnlyDictionary`2<System.String,System.Object>> _servers
    // Size: 0x8
    // Offset: 0x40
    ::System::Collections::Generic::IList_1<::System::Collections::Generic::IReadOnlyDictionary_2<::StringW, ::Il2CppObject*>*>* servers;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::IList_1<::System::Collections::Generic::IReadOnlyDictionary_2<::StringW, ::Il2CppObject*>*>*) == 0x8);
    // private System.Collections.Generic.IReadOnlyDictionary`2<System.String,System.Collections.Generic.List`1<System.Collections.Generic.IReadOnlyDictionary`2<System.String,System.Object>>> _operationServers
    // Size: 0x8
    // Offset: 0x48
    ::System::Collections::Generic::IReadOnlyDictionary_2<::StringW, ::System::Collections::Generic::List_1<::System::Collections::Generic::IReadOnlyDictionary_2<::StringW, ::Il2CppObject*>*>*>* operationServers;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::IReadOnlyDictionary_2<::StringW, ::System::Collections::Generic::List_1<::System::Collections::Generic::IReadOnlyDictionary_2<::StringW, ::Il2CppObject*>*>*>*) == 0x8);
    // private System.Collections.Generic.IDictionary`2<System.String,System.String> <DefaultHeaders>k__BackingField
    // Size: 0x8
    // Offset: 0x50
    ::System::Collections::Generic::IDictionary_2<::StringW, ::StringW>* DefaultHeaders;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::IDictionary_2<::StringW, ::StringW>*) == 0x8);
    // private System.Int32 <Timeout>k__BackingField
    // Size: 0x4
    // Offset: 0x58
    int Timeout;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: Timeout and: Proxy
    char __padding9[0x4] = {};
    // private System.Net.WebProxy <Proxy>k__BackingField
    // Size: 0x8
    // Offset: 0x60
    ::System::Net::WebProxy* Proxy;
    // Field size check
    static_assert(sizeof(::System::Net::WebProxy*) == 0x8);
    // private System.String <UserAgent>k__BackingField
    // Size: 0x8
    // Offset: 0x68
    ::StringW UserAgent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String <Username>k__BackingField
    // Size: 0x8
    // Offset: 0x70
    ::StringW Username;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String <Password>k__BackingField
    // Size: 0x8
    // Offset: 0x78
    ::StringW Password;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Security.Cryptography.X509Certificates.X509CertificateCollection <ClientCertificates>k__BackingField
    // Size: 0x8
    // Offset: 0x80
    ::System::Security::Cryptography::X509Certificates::X509CertificateCollection* ClientCertificates;
    // Field size check
    static_assert(sizeof(::System::Security::Cryptography::X509Certificates::X509CertificateCollection*) == 0x8);
    // private System.String <AccessToken>k__BackingField
    // Size: 0x8
    // Offset: 0x88
    ::StringW AccessToken;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Net.Security.RemoteCertificateValidationCallback <RemoteCertificateValidationCallback>k__BackingField
    // Size: 0x8
    // Offset: 0x90
    ::System::Net::Security::RemoteCertificateValidationCallback* RemoteCertificateValidationCallback;
    // Field size check
    static_assert(sizeof(::System::Net::Security::RemoteCertificateValidationCallback*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::KID::Client::IReadableConfiguration
    operator ::KID::Client::IReadableConfiguration() noexcept {
      return *reinterpret_cast<::KID::Client::IReadableConfiguration*>(this);
    }
    // static field const value: static public System.String Version
    static constexpr const char* Version = "1.0.0";
    // Get static field: static public System.String Version
    static ::StringW _get_Version();
    // Set static field: static public System.String Version
    static void _set_Version(::StringW value);
    // static field const value: static public System.String ISO8601_DATETIME_FORMAT
    static constexpr const char* ISO8601_DATETIME_FORMAT = "o";
