// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.UIElements.IStylePainter
#include "UnityEngine/UIElements/IStylePainter.hpp"
// Including type: UnityEngine.UIElements.UIR.BMPAlloc
#include "UnityEngine/UIElements/UIR/BMPAlloc.hpp"
// Including type: UnityEngine.UIElements.Vertex
#include "UnityEngine/UIElements/Vertex.hpp"
// Including type: UnityEngine.UIElements.UIR.MeshBuilder/AllocMeshData
#include "UnityEngine/UIElements/UIR/MeshBuilder_AllocMeshData.hpp"
// Including type: Unity.Collections.NativeSlice`1
#include "Unity/Collections/NativeSlice_1.hpp"
// Including type: UnityEngine.UIElements.UIR.VertexFlags
#include "UnityEngine/UIElements/UIR/VertexFlags.hpp"
// Including type: UnityEngine.Rect
#include "UnityEngine/Rect.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: AtlasBase
  class AtlasBase;
  // Forward declaring type: MeshWriteData
  class MeshWriteData;
  // Forward declaring type: VisualElement
  class VisualElement;
  // Forward declaring type: MeshWriteDataInterface
  struct MeshWriteDataInterface;
  // Forward declaring type: TextElement
  class TextElement;
}
// Forward declaring namespace: UnityEngine::UIElements::UIR
namespace UnityEngine::UIElements::UIR {
  // Forward declaring type: TempAllocator`1<T>
  template<typename T>
  class TempAllocator_1;
  // Forward declaring type: RenderChain
  class RenderChain;
  // Forward declaring type: VectorImageManager
  class VectorImageManager;
  // Forward declaring type: RenderChainCommand
  class RenderChainCommand;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine::TextCore::Text
namespace UnityEngine::TextCore::Text {
  // Forward declaring type: TextInfo
  class TextInfo;
}
// Forward declaring namespace: UnityEngine::UIElements::UIR::Implementation
namespace UnityEngine::UIElements::UIR::Implementation {
  // Skipping declaration: ClosingInfo because it is already included!
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Texture
  class Texture;
  // Forward declaring type: Material
  class Material;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
}
// Completed forward declares
// Type namespace: UnityEngine.UIElements.UIR.Implementation
namespace UnityEngine::UIElements::UIR::Implementation {
  // Forward declaring type: UIRStylePainter
  class UIRStylePainter;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::UIElements::UIR::Implementation::UIRStylePainter);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UIElements::UIR::Implementation::UIRStylePainter*, "UnityEngine.UIElements.UIR.Implementation", "UIRStylePainter");
// Type namespace: UnityEngine.UIElements.UIR.Implementation
namespace UnityEngine::UIElements::UIR::Implementation {
  // WARNING Size may be invalid!
  // Autogenerated type: UnityEngine.UIElements.UIR.Implementation.UIRStylePainter
  // [TokenAttribute] Offset: FFFFFFFF
  class UIRStylePainter : public ::Il2CppObject/*, public ::UnityEngine::UIElements::IStylePainter*/ {
    public:
    // Nested type: ::UnityEngine::UIElements::UIR::Implementation::UIRStylePainter::Entry
    struct Entry;
    // Nested type: ::UnityEngine::UIElements::UIR::Implementation::UIRStylePainter::ClosingInfo
    struct ClosingInfo;
    // Nested type: ::UnityEngine::UIElements::UIR::Implementation::UIRStylePainter::RepeatRectUV
    struct RepeatRectUV;
    // WARNING Size may be invalid!
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.UIElements.UIR.Implementation.UIRStylePainter/Entry
    // [TokenAttribute] Offset: FFFFFFFF
    struct Entry/*, public ::System::ValueType*/ {
      public:
      public:
      // public Unity.Collections.NativeSlice`1<UnityEngine.UIElements.Vertex> vertices
      // Size: 0xFFFFFFFF
      // Offset: 0x0
      ::Unity::Collections::NativeSlice_1<::UnityEngine::UIElements::Vertex> vertices;
      // public Unity.Collections.NativeSlice`1<System.UInt16> indices
      // Size: 0xFFFFFFFF
      // Offset: 0x10
      ::Unity::Collections::NativeSlice_1<uint16_t> indices;
      // public UnityEngine.Material material
      // Size: 0x8
      // Offset: 0x20
      ::UnityEngine::Material* material;
      // Field size check
      static_assert(sizeof(::UnityEngine::Material*) == 0x8);
      // public System.Single fontTexSDFScale
      // Size: 0x4
      // Offset: 0x28
      float fontTexSDFScale;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public UnityEngine.UIElements.TextureId texture
      // Size: 0x4
      // Offset: 0x2C
      ::UnityEngine::UIElements::TextureId texture;
      // Field size check
      static_assert(sizeof(::UnityEngine::UIElements::TextureId) == 0x4);
      // public UnityEngine.UIElements.UIR.RenderChainCommand customCommand
      // Size: 0x8
      // Offset: 0x30
      ::UnityEngine::UIElements::UIR::RenderChainCommand* customCommand;
      // Field size check
      static_assert(sizeof(::UnityEngine::UIElements::UIR::RenderChainCommand*) == 0x8);
      // public UnityEngine.UIElements.UIR.BMPAlloc clipRectID
      // Size: 0x8
      // Offset: 0x38
      ::UnityEngine::UIElements::UIR::BMPAlloc clipRectID;
      // Field size check
      static_assert(sizeof(::UnityEngine::UIElements::UIR::BMPAlloc) == 0x8);
      // public UnityEngine.UIElements.UIR.VertexFlags addFlags
      // Size: 0x4
      // Offset: 0x40
      ::UnityEngine::UIElements::UIR::VertexFlags addFlags;
      // Field size check
      static_assert(sizeof(::UnityEngine::UIElements::UIR::VertexFlags) == 0x4);
      // public System.Boolean uvIsDisplacement
      // Size: 0x1
      // Offset: 0x44
      bool uvIsDisplacement;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // public System.Boolean isTextEntry
      // Size: 0x1
      // Offset: 0x45
      bool isTextEntry;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // public System.Boolean isClipRegisterEntry
      // Size: 0x1
      // Offset: 0x46
      bool isClipRegisterEntry;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // public System.Int32 stencilRef
      // Size: 0x4
      // Offset: 0x48
      int stencilRef;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Int32 maskDepth
      // Size: 0x4
      // Offset: 0x4C
      int maskDepth;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: Entry
      constexpr Entry(::Unity::Collections::NativeSlice_1<::UnityEngine::UIElements::Vertex> vertices_ = {}, ::Unity::Collections::NativeSlice_1<uint16_t> indices_ = {}, ::UnityEngine::Material* material_ = {}, float fontTexSDFScale_ = {}, ::UnityEngine::UIElements::TextureId texture_ = {}, ::UnityEngine::UIElements::UIR::RenderChainCommand* customCommand_ = {}, ::UnityEngine::UIElements::UIR::BMPAlloc clipRectID_ = {}, ::UnityEngine::UIElements::UIR::VertexFlags addFlags_ = {}, bool uvIsDisplacement_ = {}, bool isTextEntry_ = {}, bool isClipRegisterEntry_ = {}, int stencilRef_ = {}, int maskDepth_ = {}) noexcept : vertices{vertices_}, indices{indices_}, material{material_}, fontTexSDFScale{fontTexSDFScale_}, texture{texture_}, customCommand{customCommand_}, clipRectID{clipRectID_}, addFlags{addFlags_}, uvIsDisplacement{uvIsDisplacement_}, isTextEntry{isTextEntry_}, isClipRegisterEntry{isClipRegisterEntry_}, stencilRef{stencilRef_}, maskDepth{maskDepth_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public Unity.Collections.NativeSlice`1<UnityEngine.UIElements.Vertex> vertices
      [[deprecated("Use field access instead!")]] ::Unity::Collections::NativeSlice_1<::UnityEngine::UIElements::Vertex>& dyn_vertices();
      // Get instance field reference: public Unity.Collections.NativeSlice`1<System.UInt16> indices
      [[deprecated("Use field access instead!")]] ::Unity::Collections::NativeSlice_1<uint16_t>& dyn_indices();
      // Get instance field reference: public UnityEngine.Material material
      [[deprecated("Use field access instead!")]] ::UnityEngine::Material*& dyn_material();
      // Get instance field reference: public System.Single fontTexSDFScale
      [[deprecated("Use field access instead!")]] float& dyn_fontTexSDFScale();
      // Get instance field reference: public UnityEngine.UIElements.TextureId texture
      [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::TextureId& dyn_texture();
      // Get instance field reference: public UnityEngine.UIElements.UIR.RenderChainCommand customCommand
      [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::UIR::RenderChainCommand*& dyn_customCommand();
      // Get instance field reference: public UnityEngine.UIElements.UIR.BMPAlloc clipRectID
      [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::UIR::BMPAlloc& dyn_clipRectID();
      // Get instance field reference: public UnityEngine.UIElements.UIR.VertexFlags addFlags
      [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::UIR::VertexFlags& dyn_addFlags();
      // Get instance field reference: public System.Boolean uvIsDisplacement
      [[deprecated("Use field access instead!")]] bool& dyn_uvIsDisplacement();
      // Get instance field reference: public System.Boolean isTextEntry
      [[deprecated("Use field access instead!")]] bool& dyn_isTextEntry();
      // Get instance field reference: public System.Boolean isClipRegisterEntry
      [[deprecated("Use field access instead!")]] bool& dyn_isClipRegisterEntry();
      // Get instance field reference: public System.Int32 stencilRef
      [[deprecated("Use field access instead!")]] int& dyn_stencilRef();
      // Get instance field reference: public System.Int32 maskDepth
      [[deprecated("Use field access instead!")]] int& dyn_maskDepth();
    }; // UnityEngine.UIElements.UIR.Implementation.UIRStylePainter/Entry
    // WARNING Not writing size check since size may be invalid!
    // WARNING Size may be invalid!
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.UIElements.UIR.Implementation.UIRStylePainter/ClosingInfo
    // [TokenAttribute] Offset: FFFFFFFF
    struct ClosingInfo/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.Boolean needsClosing
      // Size: 0x1
      // Offset: 0x0
      bool needsClosing;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // public System.Boolean popViewMatrix
      // Size: 0x1
      // Offset: 0x1
      bool popViewMatrix;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // public System.Boolean popScissorClip
      // Size: 0x1
      // Offset: 0x2
      bool popScissorClip;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // public System.Boolean blitAndPopRenderTexture
      // Size: 0x1
      // Offset: 0x3
      bool blitAndPopRenderTexture;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // public System.Boolean PopDefaultMaterial
      // Size: 0x1
      // Offset: 0x4
      bool PopDefaultMaterial;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // public UnityEngine.UIElements.UIR.RenderChainCommand clipUnregisterDrawCommand
      // Size: 0x8
      // Offset: 0x8
      ::UnityEngine::UIElements::UIR::RenderChainCommand* clipUnregisterDrawCommand;
      // Field size check
      static_assert(sizeof(::UnityEngine::UIElements::UIR::RenderChainCommand*) == 0x8);
      // public Unity.Collections.NativeSlice`1<UnityEngine.UIElements.Vertex> clipperRegisterVertices
      // Size: 0xFFFFFFFF
      // Offset: 0x10
      ::Unity::Collections::NativeSlice_1<::UnityEngine::UIElements::Vertex> clipperRegisterVertices;
      // public Unity.Collections.NativeSlice`1<System.UInt16> clipperRegisterIndices
      // Size: 0xFFFFFFFF
      // Offset: 0x20
      ::Unity::Collections::NativeSlice_1<uint16_t> clipperRegisterIndices;
      // public System.Int32 clipperRegisterIndexOffset
      // Size: 0x4
      // Offset: 0x30
      int clipperRegisterIndexOffset;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Int32 maskStencilRef
      // Size: 0x4
      // Offset: 0x34
      int maskStencilRef;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: ClosingInfo
      constexpr ClosingInfo(bool needsClosing_ = {}, bool popViewMatrix_ = {}, bool popScissorClip_ = {}, bool blitAndPopRenderTexture_ = {}, bool PopDefaultMaterial_ = {}, ::UnityEngine::UIElements::UIR::RenderChainCommand* clipUnregisterDrawCommand_ = {}, ::Unity::Collections::NativeSlice_1<::UnityEngine::UIElements::Vertex> clipperRegisterVertices_ = {}, ::Unity::Collections::NativeSlice_1<uint16_t> clipperRegisterIndices_ = {}, int clipperRegisterIndexOffset_ = {}, int maskStencilRef_ = {}) noexcept : needsClosing{needsClosing_}, popViewMatrix{popViewMatrix_}, popScissorClip{popScissorClip_}, blitAndPopRenderTexture{blitAndPopRenderTexture_}, PopDefaultMaterial{PopDefaultMaterial_}, clipUnregisterDrawCommand{clipUnregisterDrawCommand_}, clipperRegisterVertices{clipperRegisterVertices_}, clipperRegisterIndices{clipperRegisterIndices_}, clipperRegisterIndexOffset{clipperRegisterIndexOffset_}, maskStencilRef{maskStencilRef_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public System.Boolean needsClosing
      [[deprecated("Use field access instead!")]] bool& dyn_needsClosing();
      // Get instance field reference: public System.Boolean popViewMatrix
      [[deprecated("Use field access instead!")]] bool& dyn_popViewMatrix();
      // Get instance field reference: public System.Boolean popScissorClip
      [[deprecated("Use field access instead!")]] bool& dyn_popScissorClip();
      // Get instance field reference: public System.Boolean blitAndPopRenderTexture
      [[deprecated("Use field access instead!")]] bool& dyn_blitAndPopRenderTexture();
      // Get instance field reference: public System.Boolean PopDefaultMaterial
      [[deprecated("Use field access instead!")]] bool& dyn_PopDefaultMaterial();
      // Get instance field reference: public UnityEngine.UIElements.UIR.RenderChainCommand clipUnregisterDrawCommand
      [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::UIR::RenderChainCommand*& dyn_clipUnregisterDrawCommand();
      // Get instance field reference: public Unity.Collections.NativeSlice`1<UnityEngine.UIElements.Vertex> clipperRegisterVertices
      [[deprecated("Use field access instead!")]] ::Unity::Collections::NativeSlice_1<::UnityEngine::UIElements::Vertex>& dyn_clipperRegisterVertices();
      // Get instance field reference: public Unity.Collections.NativeSlice`1<System.UInt16> clipperRegisterIndices
      [[deprecated("Use field access instead!")]] ::Unity::Collections::NativeSlice_1<uint16_t>& dyn_clipperRegisterIndices();
      // Get instance field reference: public System.Int32 clipperRegisterIndexOffset
      [[deprecated("Use field access instead!")]] int& dyn_clipperRegisterIndexOffset();
      // Get instance field reference: public System.Int32 maskStencilRef
      [[deprecated("Use field access instead!")]] int& dyn_maskStencilRef();
    }; // UnityEngine.UIElements.UIR.Implementation.UIRStylePainter/ClosingInfo
    // WARNING Not writing size check since size may be invalid!
    // Size: 0x20
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.UIElements.UIR.Implementation.UIRStylePainter/RepeatRectUV
    // [TokenAttribute] Offset: FFFFFFFF
    struct RepeatRectUV/*, public ::System::ValueType*/ {
      public:
      public:
      // public UnityEngine.Rect rect
      // Size: 0x10
      // Offset: 0x0
      ::UnityEngine::Rect rect;
      // Field size check
      static_assert(sizeof(::UnityEngine::Rect) == 0x10);
      // public UnityEngine.Rect uv
      // Size: 0x10
      // Offset: 0x10
      ::UnityEngine::Rect uv;
      // Field size check
      static_assert(sizeof(::UnityEngine::Rect) == 0x10);
      public:
      // Creating value type constructor for type: RepeatRectUV
      constexpr RepeatRectUV(::UnityEngine::Rect rect_ = {}, ::UnityEngine::Rect uv_ = {}) noexcept : rect{rect_}, uv{uv_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public UnityEngine.Rect rect
      [[deprecated("Use field access instead!")]] ::UnityEngine::Rect& dyn_rect();
      // Get instance field reference: public UnityEngine.Rect uv
      [[deprecated("Use field access instead!")]] ::UnityEngine::Rect& dyn_uv();
    }; // UnityEngine.UIElements.UIR.Implementation.UIRStylePainter/RepeatRectUV
    #pragma pack(pop)
    static check_size<sizeof(UIRStylePainter::RepeatRectUV), 16 + sizeof(::UnityEngine::Rect)> __UnityEngine_UIElements_UIR_Implementation_UIRStylePainter_RepeatRectUVSizeCheck;
    static_assert(sizeof(UIRStylePainter::RepeatRectUV) == 0x20);
    public:
    // private UnityEngine.UIElements.UIR.RenderChain m_Owner
    // Size: 0x8
    // Offset: 0x10
    ::UnityEngine::UIElements::UIR::RenderChain* m_Owner;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UIR::RenderChain*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.UIElements.UIR.Implementation.UIRStylePainter/Entry> m_Entries
    // Size: 0x8
    // Offset: 0x18
    ::System::Collections::Generic::List_1<::UnityEngine::UIElements::UIR::Implementation::UIRStylePainter::Entry>* m_Entries;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::UIElements::UIR::Implementation::UIRStylePainter::Entry>*) == 0x8);
    // private UnityEngine.UIElements.AtlasBase m_Atlas
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::UIElements::AtlasBase* m_Atlas;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::AtlasBase*) == 0x8);
    // private UnityEngine.UIElements.UIR.VectorImageManager m_VectorImageManager
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::UIElements::UIR::VectorImageManager* m_VectorImageManager;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UIR::VectorImageManager*) == 0x8);
    // private UnityEngine.UIElements.UIR.Implementation.UIRStylePainter/Entry m_CurrentEntry
    // Size: 0xFFFFFFFF
    // Offset: 0x30
    ::UnityEngine::UIElements::UIR::Implementation::UIRStylePainter::Entry m_CurrentEntry;
    // private UnityEngine.UIElements.UIR.Implementation.UIRStylePainter/ClosingInfo m_ClosingInfo
    // Size: 0xFFFFFFFF
    // Offset: 0x80
    ::UnityEngine::UIElements::UIR::Implementation::UIRStylePainter::ClosingInfo m_ClosingInfo;
    // private System.Int32 m_MaskDepth
    // Size: 0x4
    // Offset: 0xB8
    int m_MaskDepth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_StencilRef
    // Size: 0x4
    // Offset: 0xBC
    int m_StencilRef;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.UIElements.UIR.BMPAlloc m_ClipRectID
    // Size: 0x8
    // Offset: 0xC0
    ::UnityEngine::UIElements::UIR::BMPAlloc m_ClipRectID;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UIR::BMPAlloc) == 0x8);
    // private System.Int32 m_SVGBackgroundEntryIndex
    // Size: 0x4
    // Offset: 0xC8
    int m_SVGBackgroundEntryIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.UIElements.UIR.TempAllocator`1<UnityEngine.UIElements.Vertex> m_VertsPool
    // Size: 0x8
    // Offset: 0xD0
    ::UnityEngine::UIElements::UIR::TempAllocator_1<::UnityEngine::UIElements::Vertex>* m_VertsPool;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UIR::TempAllocator_1<::UnityEngine::UIElements::Vertex>*) == 0x8);
    // private UnityEngine.UIElements.UIR.TempAllocator`1<System.UInt16> m_IndicesPool
    // Size: 0x8
    // Offset: 0xD8
    ::UnityEngine::UIElements::UIR::TempAllocator_1<uint16_t>* m_IndicesPool;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UIR::TempAllocator_1<uint16_t>*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.UIElements.MeshWriteData> m_MeshWriteDataPool
    // Size: 0x8
    // Offset: 0xE0
    ::System::Collections::Generic::List_1<::UnityEngine::UIElements::MeshWriteData*>* m_MeshWriteDataPool;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::UIElements::MeshWriteData*>*) == 0x8);
    // private System.Int32 m_NextMeshWriteDataPoolItem
    // Size: 0x4
    // Offset: 0xE8
    int m_NextMeshWriteDataPoolItem;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Collections.Generic.List`1<UnityEngine.UIElements.UIR.Implementation.UIRStylePainter/RepeatRectUV>[] m_RepeatRectUVList
    // Size: 0x8
    // Offset: 0xF0
    ::ArrayW<::System::Collections::Generic::List_1<::UnityEngine::UIElements::UIR::Implementation::UIRStylePainter::RepeatRectUV>*> m_RepeatRectUVList;
    // Field size check
    static_assert(sizeof(::ArrayW<::System::Collections::Generic::List_1<::UnityEngine::UIElements::UIR::Implementation::UIRStylePainter::RepeatRectUV>*>) == 0x8);
    // private UnityEngine.UIElements.UIR.MeshBuilder/AllocMeshData/Allocator m_AllocRawVertsIndicesDelegate
    // Size: 0x8
    // Offset: 0xF8
    ::UnityEngine::UIElements::UIR::MeshBuilder::AllocMeshData::Allocator* m_AllocRawVertsIndicesDelegate;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UIR::MeshBuilder::AllocMeshData::Allocator*) == 0x8);
    // private UnityEngine.UIElements.UIR.MeshBuilder/AllocMeshData/Allocator m_AllocThroughDrawMeshDelegate
    // Size: 0x8
    // Offset: 0x100
    ::UnityEngine::UIElements::UIR::MeshBuilder::AllocMeshData::Allocator* m_AllocThroughDrawMeshDelegate;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UIR::MeshBuilder::AllocMeshData::Allocator*) == 0x8);
    // private readonly UnityEngine.UIElements.MeshGenerationContext <meshGenerationContext>k__BackingField
    // Size: 0x8
    // Offset: 0x108
    ::UnityEngine::UIElements::MeshGenerationContext* meshGenerationContext;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::MeshGenerationContext*) == 0x8);
    // private UnityEngine.UIElements.VisualElement <currentElement>k__BackingField
    // Size: 0x8
    // Offset: 0x110
    ::UnityEngine::UIElements::VisualElement* currentElement;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::VisualElement*) == 0x8);
    // private System.Int32 <totalVertices>k__BackingField
    // Size: 0x4
    // Offset: 0x118
    int totalVertices;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 <totalIndices>k__BackingField
    // Size: 0x4
    // Offset: 0x11C
    int totalIndices;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.TextCore.Text.TextInfo m_TextInfo
    // Size: 0x8
    // Offset: 0x120
    ::UnityEngine::TextCore::Text::TextInfo* m_TextInfo;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextCore::Text::TextInfo*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::UnityEngine::UIElements::IStylePainter
    operator ::UnityEngine::UIElements::IStylePainter() noexcept {
      return *reinterpret_cast<::UnityEngine::UIElements::IStylePainter*>(this);
    }
    // Get instance field reference: private UnityEngine.UIElements.UIR.RenderChain m_Owner
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::UIR::RenderChain*& dyn_m_Owner();
    // Get instance field reference: private System.Collections.Generic.List`1<UnityEngine.UIElements.UIR.Implementation.UIRStylePainter/Entry> m_Entries
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::UnityEngine::UIElements::UIR::Implementation::UIRStylePainter::Entry>*& dyn_m_Entries();
