// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.RenderTextureDescriptor
#include "UnityEngine/RenderTextureDescriptor.hpp"
// Including type: UnityEngine.Experimental.Rendering.XRView
#include "UnityEngine/Experimental/Rendering/XRView.hpp"
// Including type: UnityEngine.Rendering.RenderTargetIdentifier
#include "UnityEngine/Rendering/RenderTargetIdentifier.hpp"
// Including type: UnityEngine.Rendering.ScriptableCullingParameters
#include "UnityEngine/Rendering/ScriptableCullingParameters.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine::Experimental::Rendering
namespace UnityEngine::Experimental::Rendering {
  // Forward declaring type: XROcclusionMesh
  class XROcclusionMesh;
  // Forward declaring type: XRPassCreateInfo
  struct XRPassCreateInfo;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Skipping declaration: Matrix4x4 because it is already included!
  // Skipping declaration: Rect because it is already included!
  // Forward declaring type: Mesh
  class Mesh;
  // Forward declaring type: Vector4
  struct Vector4;
  // Skipping declaration: Vector2 because it is already included!
}
// Forward declaring namespace: UnityEngine::Rendering
namespace UnityEngine::Rendering {
  // Forward declaring type: CommandBuffer
  class CommandBuffer;
}
// Completed forward declares
// Type namespace: UnityEngine.Experimental.Rendering
namespace UnityEngine::Experimental::Rendering {
  // Forward declaring type: XRPass
  class XRPass;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::Experimental::Rendering::XRPass);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::Experimental::Rendering::XRPass*, "UnityEngine.Experimental.Rendering", "XRPass");
// Type namespace: UnityEngine.Experimental.Rendering
namespace UnityEngine::Experimental::Rendering {
  // Size: 0x6C8
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.Experimental.Rendering.XRPass
  // [TokenAttribute] Offset: FFFFFFFF
  class XRPass : public ::Il2CppObject {
    public:
    public:
    // private readonly System.Collections.Generic.List`1<UnityEngine.Experimental.Rendering.XRView> m_Views
    // Size: 0x8
    // Offset: 0x10
    ::System::Collections::Generic::List_1<::UnityEngine::Experimental::Rendering::XRView>* m_Views;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Experimental::Rendering::XRView>*) == 0x8);
    // private readonly UnityEngine.Experimental.Rendering.XROcclusionMesh m_OcclusionMesh
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::Experimental::Rendering::XROcclusionMesh* m_OcclusionMesh;
    // Field size check
    static_assert(sizeof(::UnityEngine::Experimental::Rendering::XROcclusionMesh*) == 0x8);
    // private System.Boolean <copyDepth>k__BackingField
    // Size: 0x1
    // Offset: 0x20
    bool copyDepth;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: copyDepth and: multipassId
    char __padding2[0x3] = {};
    // private System.Int32 <multipassId>k__BackingField
    // Size: 0x4
    // Offset: 0x24
    int multipassId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 <cullingPassId>k__BackingField
    // Size: 0x4
    // Offset: 0x28
    int cullingPassId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: cullingPassId and: renderTarget
    char __padding4[0x4] = {};
    // private UnityEngine.Rendering.RenderTargetIdentifier <renderTarget>k__BackingField
    // Size: 0x24
    // Offset: 0x30
    ::UnityEngine::Rendering::RenderTargetIdentifier renderTarget;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::RenderTargetIdentifier) == 0x24);
    // Padding between fields: renderTarget and: renderTargetDesc
    char __padding5[0x4] = {};
    // private UnityEngine.RenderTextureDescriptor <renderTargetDesc>k__BackingField
    // Size: 0x34
    // Offset: 0x58
    ::UnityEngine::RenderTextureDescriptor renderTargetDesc;
    // Field size check
    static_assert(sizeof(::UnityEngine::RenderTextureDescriptor) == 0x34);
    // Padding between fields: renderTargetDesc and: cullingParams
    char __padding6[0x4] = {};
    // private UnityEngine.Rendering.ScriptableCullingParameters <cullingParams>k__BackingField
    // Size: 0x630
    // Offset: 0x90
    ::UnityEngine::Rendering::ScriptableCullingParameters cullingParams;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::ScriptableCullingParameters) == 0x630);
    // private System.IntPtr <foveatedRenderingInfo>k__BackingField
    // Size: 0x8
    // Offset: 0x6C0
    ::System::IntPtr foveatedRenderingInfo;
    // Field size check
    static_assert(sizeof(::System::IntPtr) == 0x8);
    public:
    // Get instance field reference: private readonly System.Collections.Generic.List`1<UnityEngine.Experimental.Rendering.XRView> m_Views
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::UnityEngine::Experimental::Rendering::XRView>*& dyn_m_Views();
    // Get instance field reference: private readonly UnityEngine.Experimental.Rendering.XROcclusionMesh m_OcclusionMesh
    [[deprecated("Use field access instead!")]] ::UnityEngine::Experimental::Rendering::XROcclusionMesh*& dyn_m_OcclusionMesh();
    // Get instance field reference: private System.Boolean <copyDepth>k__BackingField
    [[deprecated("Use field access instead!")]] bool& dyn_$copyDepth$k__BackingField();
    // Get instance field reference: private System.Int32 <multipassId>k__BackingField
