// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include <stdint.h>
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: Unity.Burst.Intrinsics.v64
#include "Unity/Burst/Intrinsics/v64.hpp"
// Completed includes
// Type namespace: Unity.Burst.Intrinsics
namespace Unity::Burst::Intrinsics {
  // Forward declaring type: v128
  struct v128;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::Unity::Burst::Intrinsics::v128, "Unity.Burst.Intrinsics", "v128");
// Type namespace: Unity.Burst.Intrinsics
namespace Unity::Burst::Intrinsics {
  // WARNING Size may be invalid!
  // WARNING Layout: Explicit may not be correctly taken into account!
  // Autogenerated type: Unity.Burst.Intrinsics.v128
  // [TokenAttribute] Offset: FFFFFFFF
  // [DebuggerTypeProxyAttribute] Offset: FFFFFFFF
  struct v128/*, public ::System::ValueType*/ {
    public:
    public:
    // public System.Byte Byte0
    // Size: 0x1
    // Offset: 0x0
    uint8_t Byte0;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte Byte1
    // Size: 0x1
    // Offset: 0x1
    uint8_t Byte1;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte Byte2
    // Size: 0x1
    // Offset: 0x2
    uint8_t Byte2;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte Byte3
    // Size: 0x1
    // Offset: 0x3
    uint8_t Byte3;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte Byte4
    // Size: 0x1
    // Offset: 0x4
    uint8_t Byte4;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte Byte5
    // Size: 0x1
    // Offset: 0x5
    uint8_t Byte5;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte Byte6
    // Size: 0x1
    // Offset: 0x6
    uint8_t Byte6;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte Byte7
    // Size: 0x1
    // Offset: 0x7
    uint8_t Byte7;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte Byte8
    // Size: 0x1
    // Offset: 0x8
    uint8_t Byte8;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte Byte9
    // Size: 0x1
    // Offset: 0x9
    uint8_t Byte9;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte Byte10
    // Size: 0x1
    // Offset: 0xA
    uint8_t Byte10;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte Byte11
    // Size: 0x1
    // Offset: 0xB
    uint8_t Byte11;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte Byte12
    // Size: 0x1
    // Offset: 0xC
    uint8_t Byte12;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte Byte13
    // Size: 0x1
    // Offset: 0xD
    uint8_t Byte13;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte Byte14
    // Size: 0x1
    // Offset: 0xE
    uint8_t Byte14;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte Byte15
    // Size: 0x1
    // Offset: 0xF
    uint8_t Byte15;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.SByte SByte0
    // Size: 0x1
    // Offset: 0x0
    int8_t SByte0;
    // Field size check
    static_assert(sizeof(int8_t) == 0x1);
    // public System.SByte SByte1
    // Size: 0x1
    // Offset: 0x1
    int8_t SByte1;
    // Field size check
    static_assert(sizeof(int8_t) == 0x1);
    // public System.SByte SByte2
    // Size: 0x1
    // Offset: 0x2
    int8_t SByte2;
    // Field size check
    static_assert(sizeof(int8_t) == 0x1);
    // public System.SByte SByte3
    // Size: 0x1
    // Offset: 0x3
    int8_t SByte3;
    // Field size check
    static_assert(sizeof(int8_t) == 0x1);
    // public System.SByte SByte4
    // Size: 0x1
    // Offset: 0x4
    int8_t SByte4;
    // Field size check
    static_assert(sizeof(int8_t) == 0x1);
    // public System.SByte SByte5
    // Size: 0x1
    // Offset: 0x5
    int8_t SByte5;
    // Field size check
    static_assert(sizeof(int8_t) == 0x1);
    // public System.SByte SByte6
    // Size: 0x1
    // Offset: 0x6
    int8_t SByte6;
    // Field size check
    static_assert(sizeof(int8_t) == 0x1);
    // public System.SByte SByte7
    // Size: 0x1
    // Offset: 0x7
    int8_t SByte7;
    // Field size check
    static_assert(sizeof(int8_t) == 0x1);
    // public System.SByte SByte8
    // Size: 0x1
    // Offset: 0x8
    int8_t SByte8;
    // Field size check
    static_assert(sizeof(int8_t) == 0x1);
    // public System.SByte SByte9
    // Size: 0x1
    // Offset: 0x9
    int8_t SByte9;
    // Field size check
    static_assert(sizeof(int8_t) == 0x1);
    // public System.SByte SByte10
    // Size: 0x1
    // Offset: 0xA
    int8_t SByte10;
    // Field size check
    static_assert(sizeof(int8_t) == 0x1);
    // public System.SByte SByte11
    // Size: 0x1
    // Offset: 0xB
    int8_t SByte11;
    // Field size check
    static_assert(sizeof(int8_t) == 0x1);
    // public System.SByte SByte12
    // Size: 0x1
    // Offset: 0xC
    int8_t SByte12;
    // Field size check
    static_assert(sizeof(int8_t) == 0x1);
    // public System.SByte SByte13
    // Size: 0x1
    // Offset: 0xD
    int8_t SByte13;
    // Field size check
    static_assert(sizeof(int8_t) == 0x1);
    // public System.SByte SByte14
    // Size: 0x1
    // Offset: 0xE
    int8_t SByte14;
    // Field size check
    static_assert(sizeof(int8_t) == 0x1);
    // public System.SByte SByte15
    // Size: 0x1
    // Offset: 0xF
    int8_t SByte15;
    // Field size check
    static_assert(sizeof(int8_t) == 0x1);
    // public System.UInt16 UShort0
    // Size: 0x2
    // Offset: 0x0
    uint16_t UShort0;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // public System.UInt16 UShort1
    // Size: 0x2
    // Offset: 0x2
    uint16_t UShort1;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // public System.UInt16 UShort2
    // Size: 0x2
    // Offset: 0x4
    uint16_t UShort2;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // public System.UInt16 UShort3
    // Size: 0x2
    // Offset: 0x6
    uint16_t UShort3;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // public System.UInt16 UShort4
    // Size: 0x2
    // Offset: 0x8
    uint16_t UShort4;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // public System.UInt16 UShort5
    // Size: 0x2
    // Offset: 0xA
    uint16_t UShort5;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // public System.UInt16 UShort6
    // Size: 0x2
    // Offset: 0xC
    uint16_t UShort6;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // public System.UInt16 UShort7
    // Size: 0x2
    // Offset: 0xE
    uint16_t UShort7;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // public System.Int16 SShort0
    // Size: 0x2
    // Offset: 0x0
    int16_t SShort0;
    // Field size check
    static_assert(sizeof(int16_t) == 0x2);
    // public System.Int16 SShort1
    // Size: 0x2
    // Offset: 0x2
    int16_t SShort1;
    // Field size check
    static_assert(sizeof(int16_t) == 0x2);
    // public System.Int16 SShort2
    // Size: 0x2
    // Offset: 0x4
    int16_t SShort2;
    // Field size check
    static_assert(sizeof(int16_t) == 0x2);
    // public System.Int16 SShort3
    // Size: 0x2
    // Offset: 0x6
    int16_t SShort3;
    // Field size check
    static_assert(sizeof(int16_t) == 0x2);
    // public System.Int16 SShort4
    // Size: 0x2
    // Offset: 0x8
    int16_t SShort4;
    // Field size check
    static_assert(sizeof(int16_t) == 0x2);
    // public System.Int16 SShort5
    // Size: 0x2
    // Offset: 0xA
    int16_t SShort5;
    // Field size check
    static_assert(sizeof(int16_t) == 0x2);
    // public System.Int16 SShort6
    // Size: 0x2
    // Offset: 0xC
    int16_t SShort6;
    // Field size check
    static_assert(sizeof(int16_t) == 0x2);
    // public System.Int16 SShort7
    // Size: 0x2
    // Offset: 0xE
    int16_t SShort7;
    // Field size check
    static_assert(sizeof(int16_t) == 0x2);
    // public System.UInt32 UInt0
    // Size: 0x4
    // Offset: 0x0
    uint UInt0;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // public System.UInt32 UInt1
    // Size: 0x4
    // Offset: 0x4
    uint UInt1;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // public System.UInt32 UInt2
    // Size: 0x4
    // Offset: 0x8
    uint UInt2;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // public System.UInt32 UInt3
    // Size: 0x4
    // Offset: 0xC
    uint UInt3;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // public System.Int32 SInt0
    // Size: 0x4
    // Offset: 0x0
    int SInt0;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 SInt1
    // Size: 0x4
    // Offset: 0x4
    int SInt1;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 SInt2
    // Size: 0x4
    // Offset: 0x8
    int SInt2;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 SInt3
    // Size: 0x4
    // Offset: 0xC
    int SInt3;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.UInt64 ULong0
    // Size: 0x8
    // Offset: 0x0
    uint64_t ULong0;
    // Field size check
    static_assert(sizeof(uint64_t) == 0x8);
    // public System.UInt64 ULong1
    // Size: 0x8
    // Offset: 0x8
    uint64_t ULong1;
    // Field size check
    static_assert(sizeof(uint64_t) == 0x8);
    // public System.Int64 SLong0
    // Size: 0x8
    // Offset: 0x0
    int64_t SLong0;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // public System.Int64 SLong1
    // Size: 0x8
    // Offset: 0x8
    int64_t SLong1;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // public System.Single Float0
    // Size: 0x4
    // Offset: 0x0
    float Float0;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single Float1
    // Size: 0x4
    // Offset: 0x4
    float Float1;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single Float2
    // Size: 0x4
    // Offset: 0x8
    float Float2;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single Float3
    // Size: 0x4
    // Offset: 0xC
    float Float3;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Double Double0
    // Size: 0x8
    // Offset: 0x0
    double Double0;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // public System.Double Double1
    // Size: 0x8
    // Offset: 0x8
    double Double1;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // public Unity.Burst.Intrinsics.v64 Lo64
    // Size: 0xFFFFFFFF
    // Offset: 0x0
    ::Unity::Burst::Intrinsics::v64 Lo64;
    // public Unity.Burst.Intrinsics.v64 Hi64
    // Size: 0xFFFFFFFF
    // Offset: 0x8
    ::Unity::Burst::Intrinsics::v64 Hi64;
    public:
    // Creating value type constructor for type: v128
    constexpr v128(uint8_t Byte0_ = {}, uint8_t Byte1_ = {}, uint8_t Byte2_ = {}, uint8_t Byte3_ = {}, uint8_t Byte4_ = {}, uint8_t Byte5_ = {}, uint8_t Byte6_ = {}, uint8_t Byte7_ = {}, uint8_t Byte8_ = {}, uint8_t Byte9_ = {}, uint8_t Byte10_ = {}, uint8_t Byte11_ = {}, uint8_t Byte12_ = {}, uint8_t Byte13_ = {}, uint8_t Byte14_ = {}, uint8_t Byte15_ = {}, int8_t SByte0_ = {}, int8_t SByte1_ = {}, int8_t SByte2_ = {}, int8_t SByte3_ = {}, int8_t SByte4_ = {}, int8_t SByte5_ = {}, int8_t SByte6_ = {}, int8_t SByte7_ = {}, int8_t SByte8_ = {}, int8_t SByte9_ = {}, int8_t SByte10_ = {}, int8_t SByte11_ = {}, int8_t SByte12_ = {}, int8_t SByte13_ = {}, int8_t SByte14_ = {}, int8_t SByte15_ = {}, uint16_t UShort0_ = {}, uint16_t UShort1_ = {}, uint16_t UShort2_ = {}, uint16_t UShort3_ = {}, uint16_t UShort4_ = {}, uint16_t UShort5_ = {}, uint16_t UShort6_ = {}, uint16_t UShort7_ = {}, int16_t SShort0_ = {}, int16_t SShort1_ = {}, int16_t SShort2_ = {}, int16_t SShort3_ = {}, int16_t SShort4_ = {}, int16_t SShort5_ = {}, int16_t SShort6_ = {}, int16_t SShort7_ = {}, uint UInt0_ = {}, uint UInt1_ = {}, uint UInt2_ = {}, uint UInt3_ = {}, int SInt0_ = {}, int SInt1_ = {}, int SInt2_ = {}, int SInt3_ = {}, uint64_t ULong0_ = {}, uint64_t ULong1_ = {}, int64_t SLong0_ = {}, int64_t SLong1_ = {}, float Float0_ = {}, float Float1_ = {}, float Float2_ = {}, float Float3_ = {}, double Double0_ = {}, double Double1_ = {}, ::Unity::Burst::Intrinsics::v64 Lo64_ = {}, ::Unity::Burst::Intrinsics::v64 Hi64_ = {}) noexcept : Byte0{Byte0_}, Byte1{Byte1_}, Byte2{Byte2_}, Byte3{Byte3_}, Byte4{Byte4_}, Byte5{Byte5_}, Byte6{Byte6_}, Byte7{Byte7_}, Byte8{Byte8_}, Byte9{Byte9_}, Byte10{Byte10_}, Byte11{Byte11_}, Byte12{Byte12_}, Byte13{Byte13_}, Byte14{Byte14_}, Byte15{Byte15_}, SByte0{SByte0_}, SByte1{SByte1_}, SByte2{SByte2_}, SByte3{SByte3_}, SByte4{SByte4_}, SByte5{SByte5_}, SByte6{SByte6_}, SByte7{SByte7_}, SByte8{SByte8_}, SByte9{SByte9_}, SByte10{SByte10_}, SByte11{SByte11_}, SByte12{SByte12_}, SByte13{SByte13_}, SByte14{SByte14_}, SByte15{SByte15_}, UShort0{UShort0_}, UShort1{UShort1_}, UShort2{UShort2_}, UShort3{UShort3_}, UShort4{UShort4_}, UShort5{UShort5_}, UShort6{UShort6_}, UShort7{UShort7_}, SShort0{SShort0_}, SShort1{SShort1_}, SShort2{SShort2_}, SShort3{SShort3_}, SShort4{SShort4_}, SShort5{SShort5_}, SShort6{SShort6_}, SShort7{SShort7_}, UInt0{UInt0_}, UInt1{UInt1_}, UInt2{UInt2_}, UInt3{UInt3_}, SInt0{SInt0_}, SInt1{SInt1_}, SInt2{SInt2_}, SInt3{SInt3_}, ULong0{ULong0_}, ULong1{ULong1_}, SLong0{SLong0_}, SLong1{SLong1_}, Float0{Float0_}, Float1{Float1_}, Float2{Float2_}, Float3{Float3_}, Double0{Double0_}, Double1{Double1_}, Lo64{Lo64_}, Hi64{Hi64_} {}
    // Creating interface conversion operator: operator ::System::ValueType
    operator ::System::ValueType() noexcept {
      return *reinterpret_cast<::System::ValueType*>(this);
    }
    // Get instance field reference: public System.Byte Byte0
    [[deprecated("Use field access instead!")]] uint8_t& dyn_Byte0();
    // Get instance field reference: public System.Byte Byte1
    [[deprecated("Use field access instead!")]] uint8_t& dyn_Byte1();
    // Get instance field reference: public System.Byte Byte2
    [[deprecated("Use field access instead!")]] uint8_t& dyn_Byte2();
    // Get instance field reference: public System.Byte Byte3
    [[deprecated("Use field access instead!")]] uint8_t& dyn_Byte3();
    // Get instance field reference: public System.Byte Byte4
    [[deprecated("Use field access instead!")]] uint8_t& dyn_Byte4();
    // Get instance field reference: public System.Byte Byte5
    [[deprecated("Use field access instead!")]] uint8_t& dyn_Byte5();
    // Get instance field reference: public System.Byte Byte6
    [[deprecated("Use field access instead!")]] uint8_t& dyn_Byte6();
    // Get instance field reference: public System.Byte Byte7
    [[deprecated("Use field access instead!")]] uint8_t& dyn_Byte7();
    // Get instance field reference: public System.Byte Byte8
    [[deprecated("Use field access instead!")]] uint8_t& dyn_Byte8();
    // Get instance field reference: public System.Byte Byte9
    [[deprecated("Use field access instead!")]] uint8_t& dyn_Byte9();
    // Get instance field reference: public System.Byte Byte10
    [[deprecated("Use field access instead!")]] uint8_t& dyn_Byte10();
    // Get instance field reference: public System.Byte Byte11
    [[deprecated("Use field access instead!")]] uint8_t& dyn_Byte11();
    // Get instance field reference: public System.Byte Byte12
    [[deprecated("Use field access instead!")]] uint8_t& dyn_Byte12();
    // Get instance field reference: public System.Byte Byte13
    [[deprecated("Use field access instead!")]] uint8_t& dyn_Byte13();
    // Get instance field reference: public System.Byte Byte14
    [[deprecated("Use field access instead!")]] uint8_t& dyn_Byte14();
    // Get instance field reference: public System.Byte Byte15
    [[deprecated("Use field access instead!")]] uint8_t& dyn_Byte15();
    // Get instance field reference: public System.SByte SByte0
    [[deprecated("Use field access instead!")]] int8_t& dyn_SByte0();
    // Get instance field reference: public System.SByte SByte1
    [[deprecated("Use field access instead!")]] int8_t& dyn_SByte1();
    // Get instance field reference: public System.SByte SByte2
    [[deprecated("Use field access instead!")]] int8_t& dyn_SByte2();
    // Get instance field reference: public System.SByte SByte3
    [[deprecated("Use field access instead!")]] int8_t& dyn_SByte3();
    // Get instance field reference: public System.SByte SByte4
    [[deprecated("Use field access instead!")]] int8_t& dyn_SByte4();
    // Get instance field reference: public System.SByte SByte5
    [[deprecated("Use field access instead!")]] int8_t& dyn_SByte5();
    // Get instance field reference: public System.SByte SByte6
    [[deprecated("Use field access instead!")]] int8_t& dyn_SByte6();
    // Get instance field reference: public System.SByte SByte7
    [[deprecated("Use field access instead!")]] int8_t& dyn_SByte7();
    // Get instance field reference: public System.SByte SByte8
    [[deprecated("Use field access instead!")]] int8_t& dyn_SByte8();
    // Get instance field reference: public System.SByte SByte9
    [[deprecated("Use field access instead!")]] int8_t& dyn_SByte9();
    // Get instance field reference: public System.SByte SByte10
    [[deprecated("Use field access instead!")]] int8_t& dyn_SByte10();
    // Get instance field reference: public System.SByte SByte11
    [[deprecated("Use field access instead!")]] int8_t& dyn_SByte11();
    // Get instance field reference: public System.SByte SByte12
    [[deprecated("Use field access instead!")]] int8_t& dyn_SByte12();
    // Get instance field reference: public System.SByte SByte13
    [[deprecated("Use field access instead!")]] int8_t& dyn_SByte13();
    // Get instance field reference: public System.SByte SByte14
    [[deprecated("Use field access instead!")]] int8_t& dyn_SByte14();
    // Get instance field reference: public System.SByte SByte15
    [[deprecated("Use field access instead!")]] int8_t& dyn_SByte15();
    // Get instance field reference: public System.UInt16 UShort0
    [[deprecated("Use field access instead!")]] uint16_t& dyn_UShort0();
    // Get instance field reference: public System.UInt16 UShort1
    [[deprecated("Use field access instead!")]] uint16_t& dyn_UShort1();
    // Get instance field reference: public System.UInt16 UShort2
    [[deprecated("Use field access instead!")]] uint16_t& dyn_UShort2();
    // Get instance field reference: public System.UInt16 UShort3
    [[deprecated("Use field access instead!")]] uint16_t& dyn_UShort3();
    // Get instance field reference: public System.UInt16 UShort4
    [[deprecated("Use field access instead!")]] uint16_t& dyn_UShort4();
    // Get instance field reference: public System.UInt16 UShort5
    [[deprecated("Use field access instead!")]] uint16_t& dyn_UShort5();
    // Get instance field reference: public System.UInt16 UShort6
    [[deprecated("Use field access instead!")]] uint16_t& dyn_UShort6();
    // Get instance field reference: public System.UInt16 UShort7
    [[deprecated("Use field access instead!")]] uint16_t& dyn_UShort7();
    // Get instance field reference: public System.Int16 SShort0
    [[deprecated("Use field access instead!")]] int16_t& dyn_SShort0();
    // Get instance field reference: public System.Int16 SShort1
    [[deprecated("Use field access instead!")]] int16_t& dyn_SShort1();
    // Get instance field reference: public System.Int16 SShort2
    [[deprecated("Use field access instead!")]] int16_t& dyn_SShort2();
    // Get instance field reference: public System.Int16 SShort3
    [[deprecated("Use field access instead!")]] int16_t& dyn_SShort3();
    // Get instance field reference: public System.Int16 SShort4
    [[deprecated("Use field access instead!")]] int16_t& dyn_SShort4();
    // Get instance field reference: public System.Int16 SShort5
    [[deprecated("Use field access instead!")]] int16_t& dyn_SShort5();
    // Get instance field reference: public System.Int16 SShort6
    [[deprecated("Use field access instead!")]] int16_t& dyn_SShort6();
    // Get instance field reference: public System.Int16 SShort7
    [[deprecated("Use field access instead!")]] int16_t& dyn_SShort7();
    // Get instance field reference: public System.UInt32 UInt0
    [[deprecated("Use field access instead!")]] uint& dyn_UInt0();
    // Get instance field reference: public System.UInt32 UInt1
    [[deprecated("Use field access instead!")]] uint& dyn_UInt1();
    // Get instance field reference: public System.UInt32 UInt2
    [[deprecated("Use field access instead!")]] uint& dyn_UInt2();
    // Get instance field reference: public System.UInt32 UInt3
    [[deprecated("Use field access instead!")]] uint& dyn_UInt3();
    // Get instance field reference: public System.Int32 SInt0
    [[deprecated("Use field access instead!")]] int& dyn_SInt0();
    // Get instance field reference: public System.Int32 SInt1
    [[deprecated("Use field access instead!")]] int& dyn_SInt1();
    // Get instance field reference: public System.Int32 SInt2
    [[deprecated("Use field access instead!")]] int& dyn_SInt2();
    // Get instance field reference: public System.Int32 SInt3
    [[deprecated("Use field access instead!")]] int& dyn_SInt3();
    // Get instance field reference: public System.UInt64 ULong0
    [[deprecated("Use field access instead!")]] uint64_t& dyn_ULong0();
    // Get instance field reference: public System.UInt64 ULong1
    [[deprecated("Use field access instead!")]] uint64_t& dyn_ULong1();
    // Get instance field reference: public System.Int64 SLong0
    [[deprecated("Use field access instead!")]] int64_t& dyn_SLong0();
    // Get instance field reference: public System.Int64 SLong1
    [[deprecated("Use field access instead!")]] int64_t& dyn_SLong1();
    // Get instance field reference: public System.Single Float0
    [[deprecated("Use field access instead!")]] float& dyn_Float0();
    // Get instance field reference: public System.Single Float1
    [[deprecated("Use field access instead!")]] float& dyn_Float1();
    // Get instance field reference: public System.Single Float2
    [[deprecated("Use field access instead!")]] float& dyn_Float2();
    // Get instance field reference: public System.Single Float3
    [[deprecated("Use field access instead!")]] float& dyn_Float3();
    // Get instance field reference: public System.Double Double0
    [[deprecated("Use field access instead!")]] double& dyn_Double0();
    // Get instance field reference: public System.Double Double1
    [[deprecated("Use field access instead!")]] double& dyn_Double1();
    // Get instance field reference: public Unity.Burst.Intrinsics.v64 Lo64
    [[deprecated("Use field access instead!")]] ::Unity::Burst::Intrinsics::v64& dyn_Lo64();
    // Get instance field reference: public Unity.Burst.Intrinsics.v64 Hi64
    [[deprecated("Use field access instead!")]] ::Unity::Burst::Intrinsics::v64& dyn_Hi64();
  }; // Unity.Burst.Intrinsics.v128
  // WARNING Not writing size check since size may be invalid!
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
