// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include <stdint.h>
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: Unity.Burst.Intrinsics.v128
#include "Unity/Burst/Intrinsics/v128.hpp"
// Completed includes
// Type namespace: Unity.Burst.Intrinsics
namespace Unity::Burst::Intrinsics {
  // Forward declaring type: v256
  struct v256;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::Unity::Burst::Intrinsics::v256, "Unity.Burst.Intrinsics", "v256");
// Type namespace: Unity.Burst.Intrinsics
namespace Unity::Burst::Intrinsics {
  // WARNING Size may be invalid!
  // WARNING Layout: Explicit may not be correctly taken into account!
  // Autogenerated type: Unity.Burst.Intrinsics.v256
  // [TokenAttribute] Offset: FFFFFFFF
  // [DebuggerTypeProxyAttribute] Offset: FFFFFFFF
  struct v256/*, public ::System::ValueType*/ {
    public:
    public:
    // public System.Byte Byte0
    // Size: 0x1
    // Offset: 0x0
    uint8_t Byte0;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte Byte1
    // Size: 0x1
    // Offset: 0x1
    uint8_t Byte1;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte Byte2
    // Size: 0x1
    // Offset: 0x2
    uint8_t Byte2;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte Byte3
    // Size: 0x1
    // Offset: 0x3
    uint8_t Byte3;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte Byte4
    // Size: 0x1
    // Offset: 0x4
    uint8_t Byte4;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte Byte5
    // Size: 0x1
    // Offset: 0x5
    uint8_t Byte5;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte Byte6
    // Size: 0x1
    // Offset: 0x6
    uint8_t Byte6;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte Byte7
    // Size: 0x1
    // Offset: 0x7
    uint8_t Byte7;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte Byte8
    // Size: 0x1
    // Offset: 0x8
    uint8_t Byte8;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte Byte9
    // Size: 0x1
    // Offset: 0x9
    uint8_t Byte9;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte Byte10
    // Size: 0x1
    // Offset: 0xA
    uint8_t Byte10;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte Byte11
    // Size: 0x1
    // Offset: 0xB
    uint8_t Byte11;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte Byte12
    // Size: 0x1
    // Offset: 0xC
    uint8_t Byte12;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte Byte13
    // Size: 0x1
    // Offset: 0xD
    uint8_t Byte13;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte Byte14
    // Size: 0x1
    // Offset: 0xE
    uint8_t Byte14;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte Byte15
    // Size: 0x1
    // Offset: 0xF
    uint8_t Byte15;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte Byte16
    // Size: 0x1
    // Offset: 0x10
    uint8_t Byte16;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte Byte17
    // Size: 0x1
    // Offset: 0x11
    uint8_t Byte17;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte Byte18
    // Size: 0x1
    // Offset: 0x12
    uint8_t Byte18;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte Byte19
    // Size: 0x1
    // Offset: 0x13
    uint8_t Byte19;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte Byte20
    // Size: 0x1
    // Offset: 0x14
    uint8_t Byte20;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte Byte21
    // Size: 0x1
    // Offset: 0x15
    uint8_t Byte21;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte Byte22
    // Size: 0x1
    // Offset: 0x16
    uint8_t Byte22;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte Byte23
    // Size: 0x1
    // Offset: 0x17
    uint8_t Byte23;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte Byte24
    // Size: 0x1
    // Offset: 0x18
    uint8_t Byte24;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte Byte25
    // Size: 0x1
    // Offset: 0x19
    uint8_t Byte25;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte Byte26
    // Size: 0x1
    // Offset: 0x1A
    uint8_t Byte26;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte Byte27
    // Size: 0x1
    // Offset: 0x1B
    uint8_t Byte27;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte Byte28
    // Size: 0x1
    // Offset: 0x1C
    uint8_t Byte28;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte Byte29
    // Size: 0x1
    // Offset: 0x1D
    uint8_t Byte29;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte Byte30
    // Size: 0x1
    // Offset: 0x1E
    uint8_t Byte30;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte Byte31
    // Size: 0x1
    // Offset: 0x1F
    uint8_t Byte31;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.SByte SByte0
    // Size: 0x1
    // Offset: 0x0
    int8_t SByte0;
    // Field size check
    static_assert(sizeof(int8_t) == 0x1);
    // public System.SByte SByte1
    // Size: 0x1
    // Offset: 0x1
    int8_t SByte1;
    // Field size check
    static_assert(sizeof(int8_t) == 0x1);
    // public System.SByte SByte2
    // Size: 0x1
    // Offset: 0x2
    int8_t SByte2;
    // Field size check
    static_assert(sizeof(int8_t) == 0x1);
    // public System.SByte SByte3
    // Size: 0x1
    // Offset: 0x3
    int8_t SByte3;
    // Field size check
    static_assert(sizeof(int8_t) == 0x1);
    // public System.SByte SByte4
    // Size: 0x1
    // Offset: 0x4
    int8_t SByte4;
    // Field size check
    static_assert(sizeof(int8_t) == 0x1);
    // public System.SByte SByte5
    // Size: 0x1
    // Offset: 0x5
    int8_t SByte5;
    // Field size check
    static_assert(sizeof(int8_t) == 0x1);
    // public System.SByte SByte6
    // Size: 0x1
    // Offset: 0x6
    int8_t SByte6;
    // Field size check
    static_assert(sizeof(int8_t) == 0x1);
    // public System.SByte SByte7
    // Size: 0x1
    // Offset: 0x7
    int8_t SByte7;
    // Field size check
    static_assert(sizeof(int8_t) == 0x1);
    // public System.SByte SByte8
    // Size: 0x1
    // Offset: 0x8
    int8_t SByte8;
    // Field size check
    static_assert(sizeof(int8_t) == 0x1);
    // public System.SByte SByte9
    // Size: 0x1
    // Offset: 0x9
    int8_t SByte9;
    // Field size check
    static_assert(sizeof(int8_t) == 0x1);
    // public System.SByte SByte10
    // Size: 0x1
    // Offset: 0xA
    int8_t SByte10;
    // Field size check
    static_assert(sizeof(int8_t) == 0x1);
    // public System.SByte SByte11
    // Size: 0x1
    // Offset: 0xB
    int8_t SByte11;
    // Field size check
    static_assert(sizeof(int8_t) == 0x1);
    // public System.SByte SByte12
    // Size: 0x1
    // Offset: 0xC
    int8_t SByte12;
    // Field size check
    static_assert(sizeof(int8_t) == 0x1);
    // public System.SByte SByte13
    // Size: 0x1
    // Offset: 0xD
    int8_t SByte13;
    // Field size check
    static_assert(sizeof(int8_t) == 0x1);
    // public System.SByte SByte14
    // Size: 0x1
    // Offset: 0xE
    int8_t SByte14;
    // Field size check
    static_assert(sizeof(int8_t) == 0x1);
    // public System.SByte SByte15
    // Size: 0x1
    // Offset: 0xF
    int8_t SByte15;
    // Field size check
    static_assert(sizeof(int8_t) == 0x1);
    // public System.SByte SByte16
    // Size: 0x1
    // Offset: 0x10
    int8_t SByte16;
    // Field size check
    static_assert(sizeof(int8_t) == 0x1);
    // public System.SByte SByte17
    // Size: 0x1
    // Offset: 0x11
    int8_t SByte17;
    // Field size check
    static_assert(sizeof(int8_t) == 0x1);
    // public System.SByte SByte18
    // Size: 0x1
    // Offset: 0x12
    int8_t SByte18;
    // Field size check
    static_assert(sizeof(int8_t) == 0x1);
    // public System.SByte SByte19
    // Size: 0x1
    // Offset: 0x13
    int8_t SByte19;
    // Field size check
    static_assert(sizeof(int8_t) == 0x1);
    // public System.SByte SByte20
    // Size: 0x1
    // Offset: 0x14
    int8_t SByte20;
    // Field size check
    static_assert(sizeof(int8_t) == 0x1);
    // public System.SByte SByte21
    // Size: 0x1
    // Offset: 0x15
    int8_t SByte21;
    // Field size check
    static_assert(sizeof(int8_t) == 0x1);
    // public System.SByte SByte22
    // Size: 0x1
    // Offset: 0x16
    int8_t SByte22;
    // Field size check
    static_assert(sizeof(int8_t) == 0x1);
    // public System.SByte SByte23
    // Size: 0x1
    // Offset: 0x17
    int8_t SByte23;
    // Field size check
    static_assert(sizeof(int8_t) == 0x1);
    // public System.SByte SByte24
    // Size: 0x1
    // Offset: 0x18
    int8_t SByte24;
    // Field size check
    static_assert(sizeof(int8_t) == 0x1);
    // public System.SByte SByte25
    // Size: 0x1
    // Offset: 0x19
    int8_t SByte25;
    // Field size check
    static_assert(sizeof(int8_t) == 0x1);
    // public System.SByte SByte26
    // Size: 0x1
    // Offset: 0x1A
    int8_t SByte26;
    // Field size check
    static_assert(sizeof(int8_t) == 0x1);
    // public System.SByte SByte27
    // Size: 0x1
    // Offset: 0x1B
    int8_t SByte27;
    // Field size check
    static_assert(sizeof(int8_t) == 0x1);
    // public System.SByte SByte28
    // Size: 0x1
    // Offset: 0x1C
    int8_t SByte28;
    // Field size check
    static_assert(sizeof(int8_t) == 0x1);
    // public System.SByte SByte29
    // Size: 0x1
    // Offset: 0x1D
    int8_t SByte29;
    // Field size check
    static_assert(sizeof(int8_t) == 0x1);
    // public System.SByte SByte30
    // Size: 0x1
    // Offset: 0x1E
    int8_t SByte30;
    // Field size check
    static_assert(sizeof(int8_t) == 0x1);
    // public System.SByte SByte31
    // Size: 0x1
    // Offset: 0x1F
    int8_t SByte31;
    // Field size check
    static_assert(sizeof(int8_t) == 0x1);
    // public System.UInt16 UShort0
    // Size: 0x2
    // Offset: 0x0
    uint16_t UShort0;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // public System.UInt16 UShort1
    // Size: 0x2
    // Offset: 0x2
    uint16_t UShort1;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // public System.UInt16 UShort2
    // Size: 0x2
    // Offset: 0x4
    uint16_t UShort2;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // public System.UInt16 UShort3
    // Size: 0x2
    // Offset: 0x6
    uint16_t UShort3;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // public System.UInt16 UShort4
    // Size: 0x2
    // Offset: 0x8
    uint16_t UShort4;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // public System.UInt16 UShort5
    // Size: 0x2
    // Offset: 0xA
    uint16_t UShort5;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // public System.UInt16 UShort6
    // Size: 0x2
    // Offset: 0xC
    uint16_t UShort6;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // public System.UInt16 UShort7
    // Size: 0x2
    // Offset: 0xE
    uint16_t UShort7;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // public System.UInt16 UShort8
    // Size: 0x2
    // Offset: 0x10
    uint16_t UShort8;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // public System.UInt16 UShort9
    // Size: 0x2
    // Offset: 0x12
    uint16_t UShort9;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // public System.UInt16 UShort10
    // Size: 0x2
    // Offset: 0x14
    uint16_t UShort10;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // public System.UInt16 UShort11
    // Size: 0x2
    // Offset: 0x16
    uint16_t UShort11;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // public System.UInt16 UShort12
    // Size: 0x2
    // Offset: 0x18
    uint16_t UShort12;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // public System.UInt16 UShort13
    // Size: 0x2
    // Offset: 0x1A
    uint16_t UShort13;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // public System.UInt16 UShort14
    // Size: 0x2
    // Offset: 0x1C
    uint16_t UShort14;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // public System.UInt16 UShort15
    // Size: 0x2
    // Offset: 0x1E
    uint16_t UShort15;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // public System.Int16 SShort0
    // Size: 0x2
    // Offset: 0x0
    int16_t SShort0;
    // Field size check
    static_assert(sizeof(int16_t) == 0x2);
    // public System.Int16 SShort1
    // Size: 0x2
    // Offset: 0x2
    int16_t SShort1;
    // Field size check
    static_assert(sizeof(int16_t) == 0x2);
    // public System.Int16 SShort2
    // Size: 0x2
    // Offset: 0x4
    int16_t SShort2;
    // Field size check
    static_assert(sizeof(int16_t) == 0x2);
    // public System.Int16 SShort3
    // Size: 0x2
    // Offset: 0x6
    int16_t SShort3;
    // Field size check
    static_assert(sizeof(int16_t) == 0x2);
    // public System.Int16 SShort4
    // Size: 0x2
    // Offset: 0x8
    int16_t SShort4;
    // Field size check
    static_assert(sizeof(int16_t) == 0x2);
    // public System.Int16 SShort5
    // Size: 0x2
    // Offset: 0xA
    int16_t SShort5;
    // Field size check
    static_assert(sizeof(int16_t) == 0x2);
    // public System.Int16 SShort6
    // Size: 0x2
    // Offset: 0xC
    int16_t SShort6;
    // Field size check
    static_assert(sizeof(int16_t) == 0x2);
    // public System.Int16 SShort7
    // Size: 0x2
    // Offset: 0xE
    int16_t SShort7;
    // Field size check
    static_assert(sizeof(int16_t) == 0x2);
    // public System.Int16 SShort8
    // Size: 0x2
    // Offset: 0x10
    int16_t SShort8;
    // Field size check
    static_assert(sizeof(int16_t) == 0x2);
    // public System.Int16 SShort9
    // Size: 0x2
    // Offset: 0x12
    int16_t SShort9;
    // Field size check
    static_assert(sizeof(int16_t) == 0x2);
    // public System.Int16 SShort10
    // Size: 0x2
    // Offset: 0x14
    int16_t SShort10;
    // Field size check
    static_assert(sizeof(int16_t) == 0x2);
    // public System.Int16 SShort11
    // Size: 0x2
    // Offset: 0x16
    int16_t SShort11;
    // Field size check
    static_assert(sizeof(int16_t) == 0x2);
    // public System.Int16 SShort12
    // Size: 0x2
    // Offset: 0x18
    int16_t SShort12;
    // Field size check
    static_assert(sizeof(int16_t) == 0x2);
    // public System.Int16 SShort13
    // Size: 0x2
    // Offset: 0x1A
    int16_t SShort13;
    // Field size check
    static_assert(sizeof(int16_t) == 0x2);
    // public System.Int16 SShort14
    // Size: 0x2
    // Offset: 0x1C
    int16_t SShort14;
    // Field size check
    static_assert(sizeof(int16_t) == 0x2);
    // public System.Int16 SShort15
    // Size: 0x2
    // Offset: 0x1E
    int16_t SShort15;
    // Field size check
    static_assert(sizeof(int16_t) == 0x2);
    // public System.UInt32 UInt0
    // Size: 0x4
    // Offset: 0x0
    uint UInt0;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // public System.UInt32 UInt1
    // Size: 0x4
    // Offset: 0x4
    uint UInt1;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // public System.UInt32 UInt2
    // Size: 0x4
    // Offset: 0x8
    uint UInt2;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // public System.UInt32 UInt3
    // Size: 0x4
    // Offset: 0xC
    uint UInt3;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // public System.UInt32 UInt4
    // Size: 0x4
    // Offset: 0x10
    uint UInt4;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // public System.UInt32 UInt5
    // Size: 0x4
    // Offset: 0x14
    uint UInt5;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // public System.UInt32 UInt6
    // Size: 0x4
    // Offset: 0x18
    uint UInt6;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // public System.UInt32 UInt7
    // Size: 0x4
    // Offset: 0x1C
    uint UInt7;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // public System.Int32 SInt0
    // Size: 0x4
    // Offset: 0x0
    int SInt0;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 SInt1
    // Size: 0x4
    // Offset: 0x4
    int SInt1;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 SInt2
    // Size: 0x4
    // Offset: 0x8
    int SInt2;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 SInt3
    // Size: 0x4
    // Offset: 0xC
    int SInt3;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 SInt4
    // Size: 0x4
    // Offset: 0x10
    int SInt4;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 SInt5
    // Size: 0x4
    // Offset: 0x14
    int SInt5;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 SInt6
    // Size: 0x4
    // Offset: 0x18
    int SInt6;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 SInt7
    // Size: 0x4
    // Offset: 0x1C
    int SInt7;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.UInt64 ULong0
    // Size: 0x8
    // Offset: 0x0
    uint64_t ULong0;
    // Field size check
    static_assert(sizeof(uint64_t) == 0x8);
    // public System.UInt64 ULong1
    // Size: 0x8
    // Offset: 0x8
    uint64_t ULong1;
    // Field size check
    static_assert(sizeof(uint64_t) == 0x8);
    // public System.UInt64 ULong2
    // Size: 0x8
    // Offset: 0x10
    uint64_t ULong2;
    // Field size check
    static_assert(sizeof(uint64_t) == 0x8);
    // public System.UInt64 ULong3
    // Size: 0x8
    // Offset: 0x18
    uint64_t ULong3;
    // Field size check
    static_assert(sizeof(uint64_t) == 0x8);
    // public System.Int64 SLong0
    // Size: 0x8
    // Offset: 0x0
    int64_t SLong0;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // public System.Int64 SLong1
    // Size: 0x8
    // Offset: 0x8
    int64_t SLong1;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // public System.Int64 SLong2
    // Size: 0x8
    // Offset: 0x10
    int64_t SLong2;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // public System.Int64 SLong3
    // Size: 0x8
    // Offset: 0x18
    int64_t SLong3;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // public System.Single Float0
    // Size: 0x4
    // Offset: 0x0
    float Float0;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single Float1
    // Size: 0x4
    // Offset: 0x4
    float Float1;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single Float2
    // Size: 0x4
    // Offset: 0x8
    float Float2;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single Float3
    // Size: 0x4
    // Offset: 0xC
    float Float3;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single Float4
    // Size: 0x4
    // Offset: 0x10
    float Float4;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single Float5
    // Size: 0x4
    // Offset: 0x14
    float Float5;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single Float6
    // Size: 0x4
    // Offset: 0x18
    float Float6;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single Float7
    // Size: 0x4
    // Offset: 0x1C
    float Float7;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Double Double0
    // Size: 0x8
    // Offset: 0x0
    double Double0;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // public System.Double Double1
    // Size: 0x8
    // Offset: 0x8
    double Double1;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // public System.Double Double2
    // Size: 0x8
    // Offset: 0x10
    double Double2;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // public System.Double Double3
    // Size: 0x8
    // Offset: 0x18
    double Double3;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // public Unity.Burst.Intrinsics.v128 Lo128
    // Size: 0xFFFFFFFF
    // Offset: 0x0
    ::Unity::Burst::Intrinsics::v128 Lo128;
    // public Unity.Burst.Intrinsics.v128 Hi128
    // Size: 0xFFFFFFFF
    // Offset: 0x10
    ::Unity::Burst::Intrinsics::v128 Hi128;
    public:
    // Creating value type constructor for type: v256
