// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Meta.WitAi.Requests.VoiceServiceRequest
#include "Meta/WitAi/Requests/VoiceServiceRequest.hpp"
// Including type: System.DateTime
#include "System/DateTime.hpp"
// Including type: Meta.WitAi.Requests.VoiceServiceRequestOptions
#include "Meta/WitAi/Requests/VoiceServiceRequestOptions.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Meta::WitAi
namespace Meta::WitAi {
  // Forward declaring type: AudioDurationTracker
  class AudioDurationTracker;
}
// Forward declaring namespace: Meta::WitAi::Data::Configuration
namespace Meta::WitAi::Data::Configuration {
  // Forward declaring type: WitConfiguration
  class WitConfiguration;
}
// Forward declaring namespace: Meta::WitAi::Data
namespace Meta::WitAi::Data {
  // Forward declaring type: AudioEncoding
  class AudioEncoding;
}
// Forward declaring namespace: System::Net
namespace System::Net {
  // Forward declaring type: HttpWebRequest
  class HttpWebRequest;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: Stream
  class Stream;
  // Forward declaring type: StreamReader
  class StreamReader;
}
// Forward declaring namespace: System::Collections::Concurrent
namespace System::Collections::Concurrent {
  // Forward declaring type: ConcurrentQueue`1<T>
  template<typename T>
  class ConcurrentQueue_1;
}
// Forward declaring namespace: Meta::WitAi::Json
namespace Meta::WitAi::Json {
  // Forward declaring type: WitResponseNode
  class WitResponseNode;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Uri
  class Uri;
  // Forward declaring type: IAsyncResult
  class IAsyncResult;
}
// Forward declaring namespace: Meta::WitAi::Configuration
namespace Meta::WitAi::Configuration {
  // Forward declaring type: WitRequestOptions
  class WitRequestOptions;
}
// Forward declaring namespace: Meta::WitAi::Requests
namespace Meta::WitAi::Requests {
  // Forward declaring type: VoiceServiceRequestEvents
  class VoiceServiceRequestEvents;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: Meta::Voice
namespace Meta::Voice {
  // Skipping declaration: VoiceRequestState because it is already included!
}
// Completed forward declares
// Type namespace: Meta.WitAi
namespace Meta::WitAi {
  // Forward declaring type: WitRequest
  class WitRequest;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Meta::WitAi::WitRequest);
DEFINE_IL2CPP_ARG_TYPE(::Meta::WitAi::WitRequest*, "Meta.WitAi", "WitRequest");
// Type namespace: Meta.WitAi
namespace Meta::WitAi {
  // WARNING Size may be invalid!
  // Autogenerated type: Meta.WitAi.WitRequest
  // [TokenAttribute] Offset: FFFFFFFF
  class WitRequest : public ::Meta::WitAi::Requests::VoiceServiceRequest {
    public:
    // Nested type: ::Meta::WitAi::WitRequest::OnProvideCustomHeadersEvent
    class OnProvideCustomHeadersEvent;
    // Nested type: ::Meta::WitAi::WitRequest::OnCustomizeUriEvent
    class OnCustomizeUriEvent;
    // Nested type: ::Meta::WitAi::WitRequest::PreSendRequestDelegate
    class PreSendRequestDelegate;
    // Nested type: ::Meta::WitAi::WitRequest::$$c__DisplayClass99_0
    class $$c__DisplayClass99_0;
    public:
    // private Meta.WitAi.Data.Configuration.WitConfiguration <Configuration>k__BackingField
    // Size: 0x8
    // Offset: 0x58
    ::Meta::WitAi::Data::Configuration::WitConfiguration* Configuration;
    // Field size check
    static_assert(sizeof(::Meta::WitAi::Data::Configuration::WitConfiguration*) == 0x8);
    // private System.Int32 <TimeoutMs>k__BackingField
    // Size: 0x4
    // Offset: 0x60
    int TimeoutMs;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private Meta.WitAi.Data.AudioEncoding <AudioEncoding>k__BackingField
    // Size: 0x8
    // Offset: 0x68
    ::Meta::WitAi::Data::AudioEncoding* AudioEncoding;
    // Field size check
    static_assert(sizeof(::Meta::WitAi::Data::AudioEncoding*) == 0x8);
    // private System.String <Path>k__BackingField
    // Size: 0x8
    // Offset: 0x70
    ::StringW Path;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String <Command>k__BackingField
    // Size: 0x8
    // Offset: 0x78
    ::StringW Command;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean <IsPost>k__BackingField
    // Size: 0x1
    // Offset: 0x80
    bool IsPost;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Byte[] postData
    // Size: 0x8
    // Offset: 0x88
    ::ArrayW<uint8_t> postData;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // public System.String postContentType
    // Size: 0x8
    // Offset: 0x90
    ::StringW postContentType;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String forcedHttpMethodType
    // Size: 0x8
    // Offset: 0x98
    ::StringW forcedHttpMethodType;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean <HasResponseStarted>k__BackingField
    // Size: 0x1
    // Offset: 0xA0
    bool HasResponseStarted;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <IsInputStreamReady>k__BackingField
    // Size: 0x1
    // Offset: 0xA1
    bool IsInputStreamReady;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public Meta.WitAi.AudioDurationTracker audioDurationTracker
    // Size: 0x8
    // Offset: 0xA8
    ::Meta::WitAi::AudioDurationTracker* audioDurationTracker;
    // Field size check
    static_assert(sizeof(::Meta::WitAi::AudioDurationTracker*) == 0x8);
    // private System.Net.HttpWebRequest _request
    // Size: 0x8
    // Offset: 0xB0
    ::System::Net::HttpWebRequest* request;
    // Field size check
    static_assert(sizeof(::System::Net::HttpWebRequest*) == 0x8);
    // private System.IO.Stream _writeStream
    // Size: 0x8
    // Offset: 0xB8
    ::System::IO::Stream* writeStream;
    // Field size check
    static_assert(sizeof(::System::IO::Stream*) == 0x8);
    // private System.Object _streamLock
    // Size: 0x8
    // Offset: 0xC0
    ::Il2CppObject* streamLock;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Int32 _bytesWritten
    // Size: 0x4
    // Offset: 0xC8
    int bytesWritten;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.String _stackTrace
    // Size: 0x8
    // Offset: 0xD0
    ::StringW stackTrace;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.DateTime _requestStartTime
    // Size: 0x8
    // Offset: 0xD8
    ::System::DateTime requestStartTime;
    // Field size check
    static_assert(sizeof(::System::DateTime) == 0x8);
    // private System.Collections.Concurrent.ConcurrentQueue`1<System.Byte[]> _writeBuffer
    // Size: 0x8
    // Offset: 0xE0
    ::System::Collections::Concurrent::ConcurrentQueue_1<::ArrayW<uint8_t>>* writeBuffer;
    // Field size check
    static_assert(sizeof(::System::Collections::Concurrent::ConcurrentQueue_1<::ArrayW<uint8_t>>*) == 0x8);
    // private System.String <StatusDescription>k__BackingField
    // Size: 0x8
    // Offset: 0xE8
    ::StringW StatusDescription;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private Meta.WitAi.Json.WitResponseNode _lastResponseData
    // Size: 0x8
    // Offset: 0xF0
    ::Meta::WitAi::Json::WitResponseNode* lastResponseData;
    // Field size check
    static_assert(sizeof(::Meta::WitAi::Json::WitResponseNode*) == 0x8);
    // private Meta.WitAi.WitRequest/OnProvideCustomHeadersEvent onProvideCustomHeaders
    // Size: 0x8
    // Offset: 0xF8
    ::Meta::WitAi::WitRequest::OnProvideCustomHeadersEvent* onProvideCustomHeaders;
    // Field size check
    static_assert(sizeof(::Meta::WitAi::WitRequest::OnProvideCustomHeadersEvent*) == 0x8);
    // private System.Action`1<Meta.WitAi.WitRequest> onInputStreamReady
    // Size: 0x8
    // Offset: 0x100
    ::System::Action_1<::Meta::WitAi::WitRequest*>* onInputStreamReady;
    // Field size check
    static_assert(sizeof(::System::Action_1<::Meta::WitAi::WitRequest*>*) == 0x8);
    // public System.Action`1<System.String> onRawResponse
    // Size: 0x8
    // Offset: 0x108
    ::System::Action_1<::StringW>* onRawResponse;
    // Field size check
    static_assert(sizeof(::System::Action_1<::StringW>*) == 0x8);
    // public Meta.WitAi.WitRequest/OnCustomizeUriEvent onCustomizeUri
    // Size: 0x8
    // Offset: 0x110
    ::Meta::WitAi::WitRequest::OnCustomizeUriEvent* onCustomizeUri;
    // Field size check
    static_assert(sizeof(::Meta::WitAi::WitRequest::OnCustomizeUriEvent*) == 0x8);
    // private System.Action`1<System.String> onPartialTranscription
    // Size: 0x8
    // Offset: 0x118
    ::System::Action_1<::StringW>* onPartialTranscription;
    // Field size check
    static_assert(sizeof(::System::Action_1<::StringW>*) == 0x8);
    // private System.Action`1<System.String> onFullTranscription
    // Size: 0x8
    // Offset: 0x120
    ::System::Action_1<::StringW>* onFullTranscription;
    // Field size check
    static_assert(sizeof(::System::Action_1<::StringW>*) == 0x8);
    // private System.Action`1<Meta.WitAi.WitRequest> onPartialResponse
    // Size: 0x8
    // Offset: 0x128
    ::System::Action_1<::Meta::WitAi::WitRequest*>* onPartialResponse;
    // Field size check
    static_assert(sizeof(::System::Action_1<::Meta::WitAi::WitRequest*>*) == 0x8);
    // private System.Action`1<Meta.WitAi.WitRequest> onResponse
    // Size: 0x8
    // Offset: 0x130
    ::System::Action_1<::Meta::WitAi::WitRequest*>* onResponse;
    // Field size check
    static_assert(sizeof(::System::Action_1<::Meta::WitAi::WitRequest*>*) == 0x8);
    // private System.Boolean _initialized
    // Size: 0x1
    // Offset: 0x138
    bool initialized;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get static field: static public Meta.WitAi.WitRequest/PreSendRequestDelegate onPreSendRequest
    static ::Meta::WitAi::WitRequest::PreSendRequestDelegate* _get_onPreSendRequest();
    // Set static field: static public Meta.WitAi.WitRequest/PreSendRequestDelegate onPreSendRequest
    static void _set_onPreSendRequest(::Meta::WitAi::WitRequest::PreSendRequestDelegate* value);
    // Get instance field reference: private Meta.WitAi.Data.Configuration.WitConfiguration <Configuration>k__BackingField
    [[deprecated("Use field access instead!")]] ::Meta::WitAi::Data::Configuration::WitConfiguration*& dyn_$Configuration$k__BackingField();
    // Get instance field reference: private System.Int32 <TimeoutMs>k__BackingField
    [[deprecated("Use field access instead!")]] int& dyn_$TimeoutMs$k__BackingField();
