// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.InputSystem.InputActionMap
#include "UnityEngine/InputSystem/InputActionMap.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::InputSystem
namespace UnityEngine::InputSystem {
  // Forward declaring type: InputBinding
  struct InputBinding;
}
// Completed forward declares
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::InputSystem::InputActionMap::BindingOverrideJson, "UnityEngine.InputSystem", "InputActionMap/BindingOverrideJson");
// Type namespace: UnityEngine.InputSystem
namespace UnityEngine::InputSystem {
  // Size: 0x28
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: UnityEngine.InputSystem.InputActionMap/BindingOverrideJson
  // [TokenAttribute] Offset: FFFFFFFF
  struct InputActionMap::BindingOverrideJson/*, public ::System::ValueType*/ {
    public:
    public:
    // public System.String action
    // Size: 0x8
    // Offset: 0x0
    ::StringW action;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String id
    // Size: 0x8
    // Offset: 0x8
    ::StringW id;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String path
    // Size: 0x8
    // Offset: 0x10
    ::StringW path;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String interactions
    // Size: 0x8
    // Offset: 0x18
    ::StringW interactions;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String processors
    // Size: 0x8
    // Offset: 0x20
    ::StringW processors;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Creating value type constructor for type: BindingOverrideJson
    constexpr BindingOverrideJson(::StringW action_ = {}, ::StringW id_ = {}, ::StringW path_ = {}, ::StringW interactions_ = {}, ::StringW processors_ = {}) noexcept : action{action_}, id{id_}, path{path_}, interactions{interactions_}, processors{processors_} {}
    // Creating interface conversion operator: operator ::System::ValueType
    operator ::System::ValueType() noexcept {
      return *reinterpret_cast<::System::ValueType*>(this);
    }
    // Get instance field reference: public System.String action
    [[deprecated("Use field access instead!")]] ::StringW& dyn_action();
    // Get instance field reference: public System.String id
    [[deprecated("Use field access instead!")]] ::StringW& dyn_id();
    // Get instance field reference: public System.String path
    [[deprecated("Use field access instead!")]] ::StringW& dyn_path();
    // Get instance field reference: public System.String interactions
    [[deprecated("Use field access instead!")]] ::StringW& dyn_interactions();
    // Get instance field reference: public System.String processors
    [[deprecated("Use field access instead!")]] ::StringW& dyn_processors();
    // static public UnityEngine.InputSystem.InputActionMap/BindingOverrideJson FromBinding(UnityEngine.InputSystem.InputBinding binding, System.String actionName)
    // Offset: 0x5096380
    static ::UnityEngine::InputSystem::InputActionMap::BindingOverrideJson FromBinding(::UnityEngine::InputSystem::InputBinding binding, ::StringW actionName);
    // static public UnityEngine.InputSystem.InputActionMap/BindingOverrideJson FromBinding(UnityEngine.InputSystem.InputBinding binding)
    // Offset: 0x5096494
    static ::UnityEngine::InputSystem::InputActionMap::BindingOverrideJson FromBinding(::UnityEngine::InputSystem::InputBinding binding);
    // static public UnityEngine.InputSystem.InputBinding ToBinding(UnityEngine.InputSystem.InputActionMap/BindingOverrideJson bindingOverride)
    // Offset: 0x50964E8
    static ::UnityEngine::InputSystem::InputBinding ToBinding(::UnityEngine::InputSystem::InputActionMap::BindingOverrideJson bindingOverride);
  }; // UnityEngine.InputSystem.InputActionMap/BindingOverrideJson
  #pragma pack(pop)
  static check_size<sizeof(InputActionMap::BindingOverrideJson), 32 + sizeof(::StringW)> __UnityEngine_InputSystem_InputActionMap_BindingOverrideJsonSizeCheck;
  static_assert(sizeof(InputActionMap::BindingOverrideJson) == 0x28);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: UnityEngine::InputSystem::InputActionMap::BindingOverrideJson::FromBinding
// Il2CppName: FromBinding
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::InputSystem::InputActionMap::BindingOverrideJson (*)(::UnityEngine::InputSystem::InputBinding, ::StringW)>(&UnityEngine::InputSystem::InputActionMap::BindingOverrideJson::FromBinding)> {
  static const MethodInfo* get() {
    static auto* binding = &::il2cpp_utils::GetClassFromName("UnityEngine.InputSystem", "InputBinding")->byval_arg;
    static auto* actionName = &::il2cpp_utils::GetClassFromName("System", "String")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::InputSystem::InputActionMap::BindingOverrideJson), "FromBinding", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{binding, actionName});
  }
};
// Writing MetadataGetter for method: UnityEngine::InputSystem::InputActionMap::BindingOverrideJson::FromBinding
// Il2CppName: FromBinding
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::InputSystem::InputActionMap::BindingOverrideJson (*)(::UnityEngine::InputSystem::InputBinding)>(&UnityEngine::InputSystem::InputActionMap::BindingOverrideJson::FromBinding)> {
  static const MethodInfo* get() {
    static auto* binding = &::il2cpp_utils::GetClassFromName("UnityEngine.InputSystem", "InputBinding")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::InputSystem::InputActionMap::BindingOverrideJson), "FromBinding", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{binding});
  }
};
// Writing MetadataGetter for method: UnityEngine::InputSystem::InputActionMap::BindingOverrideJson::ToBinding
// Il2CppName: ToBinding
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::InputSystem::InputBinding (*)(::UnityEngine::InputSystem::InputActionMap::BindingOverrideJson)>(&UnityEngine::InputSystem::InputActionMap::BindingOverrideJson::ToBinding)> {
  static const MethodInfo* get() {
    static auto* bindingOverride = &::il2cpp_utils::GetClassFromName("UnityEngine.InputSystem", "InputActionMap/BindingOverrideJson")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::InputSystem::InputActionMap::BindingOverrideJson), "ToBinding", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{bindingOverride});
  }
};
