// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.InputSystem.InputControl
#include "UnityEngine/InputSystem/InputControl.hpp"
// Including type: UnityEngine.InputSystem.Layouts.InputDeviceDescription
#include "UnityEngine/InputSystem/Layouts/InputDeviceDescription.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::InputSystem::Utilities
namespace UnityEngine::InputSystem::Utilities {
  // Forward declaring type: ReadOnlyArray`1<TValue>
  template<typename TValue>
  struct ReadOnlyArray_1;
}
// Forward declaring namespace: UnityEngine::InputSystem::LowLevel
namespace UnityEngine::InputSystem::LowLevel {
  // Forward declaring type: IInputDeviceCommandInfo
  class IInputDeviceCommandInfo;
  // Forward declaring type: InputDeviceCommand
  struct InputDeviceCommand;
}
// Forward declaring namespace: UnityEngine::InputSystem
namespace UnityEngine::InputSystem {
  // Skipping declaration: ControlBitRangeNode because it is already included!
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Type
  class Type;
}
// Completed forward declares
// Type namespace: UnityEngine.InputSystem
namespace UnityEngine::InputSystem {
  // Forward declaring type: InputDevice
  class InputDevice;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::InputSystem::InputDevice);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::InputSystem::InputDevice*, "UnityEngine.InputSystem", "InputDevice");
// Type namespace: UnityEngine.InputSystem
namespace UnityEngine::InputSystem {
  // Size: 0x170
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.InputSystem.InputDevice
  // [TokenAttribute] Offset: FFFFFFFF
  class InputDevice : public ::UnityEngine::InputSystem::InputControl {
    public:
    // Nested type: ::UnityEngine::InputSystem::InputDevice::DeviceFlags
    struct DeviceFlags;
    // Nested type: ::UnityEngine::InputSystem::InputDevice::ControlBitRangeNode
    struct ControlBitRangeNode;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.InputSystem.InputDevice/DeviceFlags
    // [TokenAttribute] Offset: FFFFFFFF
    // [FlagsAttribute] Offset: FFFFFFFF
    struct DeviceFlags/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: DeviceFlags
      constexpr DeviceFlags(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.InputSystem.InputDevice/DeviceFlags UpdateBeforeRender
      static constexpr const int UpdateBeforeRender = 1;
      // Get static field: static public UnityEngine.InputSystem.InputDevice/DeviceFlags UpdateBeforeRender
      static ::UnityEngine::InputSystem::InputDevice::DeviceFlags _get_UpdateBeforeRender();
      // Set static field: static public UnityEngine.InputSystem.InputDevice/DeviceFlags UpdateBeforeRender
      static void _set_UpdateBeforeRender(::UnityEngine::InputSystem::InputDevice::DeviceFlags value);
      // static field const value: static public UnityEngine.InputSystem.InputDevice/DeviceFlags HasStateCallbacks
      static constexpr const int HasStateCallbacks = 2;
      // Get static field: static public UnityEngine.InputSystem.InputDevice/DeviceFlags HasStateCallbacks
      static ::UnityEngine::InputSystem::InputDevice::DeviceFlags _get_HasStateCallbacks();
      // Set static field: static public UnityEngine.InputSystem.InputDevice/DeviceFlags HasStateCallbacks
      static void _set_HasStateCallbacks(::UnityEngine::InputSystem::InputDevice::DeviceFlags value);
      // static field const value: static public UnityEngine.InputSystem.InputDevice/DeviceFlags HasControlsWithDefaultState
      static constexpr const int HasControlsWithDefaultState = 4;
      // Get static field: static public UnityEngine.InputSystem.InputDevice/DeviceFlags HasControlsWithDefaultState
      static ::UnityEngine::InputSystem::InputDevice::DeviceFlags _get_HasControlsWithDefaultState();
      // Set static field: static public UnityEngine.InputSystem.InputDevice/DeviceFlags HasControlsWithDefaultState
      static void _set_HasControlsWithDefaultState(::UnityEngine::InputSystem::InputDevice::DeviceFlags value);
      // static field const value: static public UnityEngine.InputSystem.InputDevice/DeviceFlags HasDontResetControls
      static constexpr const int HasDontResetControls = 1024;
      // Get static field: static public UnityEngine.InputSystem.InputDevice/DeviceFlags HasDontResetControls
      static ::UnityEngine::InputSystem::InputDevice::DeviceFlags _get_HasDontResetControls();
      // Set static field: static public UnityEngine.InputSystem.InputDevice/DeviceFlags HasDontResetControls
      static void _set_HasDontResetControls(::UnityEngine::InputSystem::InputDevice::DeviceFlags value);
      // static field const value: static public UnityEngine.InputSystem.InputDevice/DeviceFlags HasEventMerger
      static constexpr const int HasEventMerger = 8192;
      // Get static field: static public UnityEngine.InputSystem.InputDevice/DeviceFlags HasEventMerger
      static ::UnityEngine::InputSystem::InputDevice::DeviceFlags _get_HasEventMerger();
      // Set static field: static public UnityEngine.InputSystem.InputDevice/DeviceFlags HasEventMerger
      static void _set_HasEventMerger(::UnityEngine::InputSystem::InputDevice::DeviceFlags value);
      // static field const value: static public UnityEngine.InputSystem.InputDevice/DeviceFlags HasEventPreProcessor
      static constexpr const int HasEventPreProcessor = 16384;
      // Get static field: static public UnityEngine.InputSystem.InputDevice/DeviceFlags HasEventPreProcessor
      static ::UnityEngine::InputSystem::InputDevice::DeviceFlags _get_HasEventPreProcessor();
      // Set static field: static public UnityEngine.InputSystem.InputDevice/DeviceFlags HasEventPreProcessor
      static void _set_HasEventPreProcessor(::UnityEngine::InputSystem::InputDevice::DeviceFlags value);
      // static field const value: static public UnityEngine.InputSystem.InputDevice/DeviceFlags Remote
      static constexpr const int Remote = 8;
      // Get static field: static public UnityEngine.InputSystem.InputDevice/DeviceFlags Remote
      static ::UnityEngine::InputSystem::InputDevice::DeviceFlags _get_Remote();
      // Set static field: static public UnityEngine.InputSystem.InputDevice/DeviceFlags Remote
      static void _set_Remote(::UnityEngine::InputSystem::InputDevice::DeviceFlags value);
      // static field const value: static public UnityEngine.InputSystem.InputDevice/DeviceFlags Native
      static constexpr const int Native = 16;
      // Get static field: static public UnityEngine.InputSystem.InputDevice/DeviceFlags Native
      static ::UnityEngine::InputSystem::InputDevice::DeviceFlags _get_Native();
      // Set static field: static public UnityEngine.InputSystem.InputDevice/DeviceFlags Native
      static void _set_Native(::UnityEngine::InputSystem::InputDevice::DeviceFlags value);
      // static field const value: static public UnityEngine.InputSystem.InputDevice/DeviceFlags DisabledInFrontend
      static constexpr const int DisabledInFrontend = 32;
      // Get static field: static public UnityEngine.InputSystem.InputDevice/DeviceFlags DisabledInFrontend
      static ::UnityEngine::InputSystem::InputDevice::DeviceFlags _get_DisabledInFrontend();
      // Set static field: static public UnityEngine.InputSystem.InputDevice/DeviceFlags DisabledInFrontend
      static void _set_DisabledInFrontend(::UnityEngine::InputSystem::InputDevice::DeviceFlags value);
      // static field const value: static public UnityEngine.InputSystem.InputDevice/DeviceFlags DisabledInRuntime
      static constexpr const int DisabledInRuntime = 128;
      // Get static field: static public UnityEngine.InputSystem.InputDevice/DeviceFlags DisabledInRuntime
      static ::UnityEngine::InputSystem::InputDevice::DeviceFlags _get_DisabledInRuntime();
      // Set static field: static public UnityEngine.InputSystem.InputDevice/DeviceFlags DisabledInRuntime
      static void _set_DisabledInRuntime(::UnityEngine::InputSystem::InputDevice::DeviceFlags value);
      // static field const value: static public UnityEngine.InputSystem.InputDevice/DeviceFlags DisabledWhileInBackground
      static constexpr const int DisabledWhileInBackground = 256;
      // Get static field: static public UnityEngine.InputSystem.InputDevice/DeviceFlags DisabledWhileInBackground
      static ::UnityEngine::InputSystem::InputDevice::DeviceFlags _get_DisabledWhileInBackground();
      // Set static field: static public UnityEngine.InputSystem.InputDevice/DeviceFlags DisabledWhileInBackground
      static void _set_DisabledWhileInBackground(::UnityEngine::InputSystem::InputDevice::DeviceFlags value);
      // static field const value: static public UnityEngine.InputSystem.InputDevice/DeviceFlags DisabledStateHasBeenQueriedFromRuntime
      static constexpr const int DisabledStateHasBeenQueriedFromRuntime = 64;
      // Get static field: static public UnityEngine.InputSystem.InputDevice/DeviceFlags DisabledStateHasBeenQueriedFromRuntime
      static ::UnityEngine::InputSystem::InputDevice::DeviceFlags _get_DisabledStateHasBeenQueriedFromRuntime();
      // Set static field: static public UnityEngine.InputSystem.InputDevice/DeviceFlags DisabledStateHasBeenQueriedFromRuntime
      static void _set_DisabledStateHasBeenQueriedFromRuntime(::UnityEngine::InputSystem::InputDevice::DeviceFlags value);
      // static field const value: static public UnityEngine.InputSystem.InputDevice/DeviceFlags CanRunInBackground
      static constexpr const int CanRunInBackground = 2048;
      // Get static field: static public UnityEngine.InputSystem.InputDevice/DeviceFlags CanRunInBackground
      static ::UnityEngine::InputSystem::InputDevice::DeviceFlags _get_CanRunInBackground();
      // Set static field: static public UnityEngine.InputSystem.InputDevice/DeviceFlags CanRunInBackground
      static void _set_CanRunInBackground(::UnityEngine::InputSystem::InputDevice::DeviceFlags value);
      // static field const value: static public UnityEngine.InputSystem.InputDevice/DeviceFlags CanRunInBackgroundHasBeenQueried
      static constexpr const int CanRunInBackgroundHasBeenQueried = 4096;
      // Get static field: static public UnityEngine.InputSystem.InputDevice/DeviceFlags CanRunInBackgroundHasBeenQueried
      static ::UnityEngine::InputSystem::InputDevice::DeviceFlags _get_CanRunInBackgroundHasBeenQueried();
      // Set static field: static public UnityEngine.InputSystem.InputDevice/DeviceFlags CanRunInBackgroundHasBeenQueried
      static void _set_CanRunInBackgroundHasBeenQueried(::UnityEngine::InputSystem::InputDevice::DeviceFlags value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.InputSystem.InputDevice/DeviceFlags
    #pragma pack(pop)
    static check_size<sizeof(InputDevice::DeviceFlags), 0 + sizeof(int)> __UnityEngine_InputSystem_InputDevice_DeviceFlagsSizeCheck;
    static_assert(sizeof(InputDevice::DeviceFlags) == 0x4);
    // Size: 0x7
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.InputSystem.InputDevice/ControlBitRangeNode
    // [TokenAttribute] Offset: FFFFFFFF
    struct ControlBitRangeNode/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.UInt16 endBitOffset
      // Size: 0x2
      // Offset: 0x0
      uint16_t endBitOffset;
      // Field size check
      static_assert(sizeof(uint16_t) == 0x2);
      // public System.Int16 leftChildIndex
      // Size: 0x2
      // Offset: 0x2
      int16_t leftChildIndex;
      // Field size check
      static_assert(sizeof(int16_t) == 0x2);
      // public System.UInt16 controlStartIndex
      // Size: 0x2
      // Offset: 0x4
      uint16_t controlStartIndex;
      // Field size check
      static_assert(sizeof(uint16_t) == 0x2);
      // public System.Byte controlCount
      // Size: 0x1
      // Offset: 0x6
      uint8_t controlCount;
      // Field size check
      static_assert(sizeof(uint8_t) == 0x1);
      public:
      // Creating value type constructor for type: ControlBitRangeNode
      constexpr ControlBitRangeNode(uint16_t endBitOffset_ = {}, int16_t leftChildIndex_ = {}, uint16_t controlStartIndex_ = {}, uint8_t controlCount_ = {}) noexcept : endBitOffset{endBitOffset_}, leftChildIndex{leftChildIndex_}, controlStartIndex{controlStartIndex_}, controlCount{controlCount_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public System.UInt16 endBitOffset
      [[deprecated("Use field access instead!")]] uint16_t& dyn_endBitOffset();
      // Get instance field reference: public System.Int16 leftChildIndex
      [[deprecated("Use field access instead!")]] int16_t& dyn_leftChildIndex();
      // Get instance field reference: public System.UInt16 controlStartIndex
      [[deprecated("Use field access instead!")]] uint16_t& dyn_controlStartIndex();
      // Get instance field reference: public System.Byte controlCount
      [[deprecated("Use field access instead!")]] uint8_t& dyn_controlCount();
      // public System.Void .ctor(System.UInt16 endOffset)
      // Offset: 0x50C679C
      ControlBitRangeNode(uint16_t endOffset);
    }; // UnityEngine.InputSystem.InputDevice/ControlBitRangeNode
    #pragma pack(pop)
    static check_size<sizeof(InputDevice::ControlBitRangeNode), 6 + sizeof(uint8_t)> __UnityEngine_InputSystem_InputDevice_ControlBitRangeNodeSizeCheck;
    static_assert(sizeof(InputDevice::ControlBitRangeNode) == 0x7);
    public:
    // UnityEngine.InputSystem.InputDevice/DeviceFlags m_DeviceFlags
    // Size: 0x4
    // Offset: 0xDC
    ::UnityEngine::InputSystem::InputDevice::DeviceFlags m_DeviceFlags;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputDevice::DeviceFlags) == 0x4);
    // System.Int32 m_DeviceId
    // Size: 0x4
    // Offset: 0xE0
    int m_DeviceId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 m_ParticipantId
    // Size: 0x4
    // Offset: 0xE4
    int m_ParticipantId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 m_DeviceIndex
    // Size: 0x4
    // Offset: 0xE8
    int m_DeviceIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: m_DeviceIndex and: m_Description
    char __padding3[0x4] = {};
    // UnityEngine.InputSystem.Layouts.InputDeviceDescription m_Description
    // Size: 0x38
    // Offset: 0xF0
    ::UnityEngine::InputSystem::Layouts::InputDeviceDescription m_Description;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::Layouts::InputDeviceDescription) == 0x38);
    // System.Double m_LastUpdateTimeInternal
    // Size: 0x8
    // Offset: 0x128
    double m_LastUpdateTimeInternal;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // System.UInt32 m_CurrentUpdateStepCount
    // Size: 0x4
    // Offset: 0x130
    uint m_CurrentUpdateStepCount;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // Padding between fields: m_CurrentUpdateStepCount and: m_AliasesForEachControl
    char __padding6[0x4] = {};
    // UnityEngine.InputSystem.Utilities.InternedString[] m_AliasesForEachControl
    // Size: 0x8
    // Offset: 0x138
    ::ArrayW<::UnityEngine::InputSystem::Utilities::InternedString> m_AliasesForEachControl;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::InputSystem::Utilities::InternedString>) == 0x8);
    // UnityEngine.InputSystem.Utilities.InternedString[] m_UsagesForEachControl
    // Size: 0x8
    // Offset: 0x140
    ::ArrayW<::UnityEngine::InputSystem::Utilities::InternedString> m_UsagesForEachControl;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::InputSystem::Utilities::InternedString>) == 0x8);
    // UnityEngine.InputSystem.InputControl[] m_UsageToControl
    // Size: 0x8
    // Offset: 0x148
    ::ArrayW<::UnityEngine::InputSystem::InputControl*> m_UsageToControl;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::InputSystem::InputControl*>) == 0x8);
    // UnityEngine.InputSystem.InputControl[] m_ChildrenForEachControl
    // Size: 0x8
    // Offset: 0x150
    ::ArrayW<::UnityEngine::InputSystem::InputControl*> m_ChildrenForEachControl;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::InputSystem::InputControl*>) == 0x8);
    // System.UInt32[] m_StateOffsetToControlMap
    // Size: 0x8
    // Offset: 0x158
    ::ArrayW<uint> m_StateOffsetToControlMap;
    // Field size check
    static_assert(sizeof(::ArrayW<uint>) == 0x8);
    // UnityEngine.InputSystem.InputDevice/ControlBitRangeNode[] m_ControlTreeNodes
    // Size: 0x8
    // Offset: 0x160
    ::ArrayW<::UnityEngine::InputSystem::InputDevice::ControlBitRangeNode> m_ControlTreeNodes;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::InputSystem::InputDevice::ControlBitRangeNode>) == 0x8);
    // System.UInt16[] m_ControlTreeIndices
    // Size: 0x8
    // Offset: 0x168
    ::ArrayW<uint16_t> m_ControlTreeIndices;
    // Field size check
    static_assert(sizeof(::ArrayW<uint16_t>) == 0x8);
    public:
    // static field const value: static public System.Int32 InvalidDeviceId
    static constexpr const int InvalidDeviceId = 0;
    // Get static field: static public System.Int32 InvalidDeviceId
    static int _get_InvalidDeviceId();
    // Set static field: static public System.Int32 InvalidDeviceId
    static void _set_InvalidDeviceId(int value);
    // static field const value: static System.Int32 kLocalParticipantId
    static constexpr const int kLocalParticipantId = 0;
    // Get static field: static System.Int32 kLocalParticipantId
    static int _get_kLocalParticipantId();
    // Set static field: static System.Int32 kLocalParticipantId
    static void _set_kLocalParticipantId(int value);
    // static field const value: static System.Int32 kInvalidDeviceIndex
    static constexpr const int kInvalidDeviceIndex = -1;
    // Get static field: static System.Int32 kInvalidDeviceIndex
    static int _get_kInvalidDeviceIndex();
    // Set static field: static System.Int32 kInvalidDeviceIndex
    static void _set_kInvalidDeviceIndex(int value);
    // static field const value: static System.Int32 kControlIndexBits
    static constexpr const int kControlIndexBits = 10;
    // Get static field: static System.Int32 kControlIndexBits
    static int _get_kControlIndexBits();
    // Set static field: static System.Int32 kControlIndexBits
    static void _set_kControlIndexBits(int value);
    // static field const value: static System.Int32 kStateOffsetBits
    static constexpr const int kStateOffsetBits = 13;
    // Get static field: static System.Int32 kStateOffsetBits
    static int _get_kStateOffsetBits();
    // Set static field: static System.Int32 kStateOffsetBits
    static void _set_kStateOffsetBits(int value);
    // static field const value: static System.Int32 kStateSizeBits
    static constexpr const int kStateSizeBits = 9;
    // Get static field: static System.Int32 kStateSizeBits
    static int _get_kStateSizeBits();
    // Set static field: static System.Int32 kStateSizeBits
    static void _set_kStateSizeBits(int value);
    // Get instance field reference: UnityEngine.InputSystem.InputDevice/DeviceFlags m_DeviceFlags
    [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::InputDevice::DeviceFlags& dyn_m_DeviceFlags();
    // Get instance field reference: System.Int32 m_DeviceId
    [[deprecated("Use field access instead!")]] int& dyn_m_DeviceId();
    // Get instance field reference: System.Int32 m_ParticipantId
    [[deprecated("Use field access instead!")]] int& dyn_m_ParticipantId();
    // Get instance field reference: System.Int32 m_DeviceIndex
    [[deprecated("Use field access instead!")]] int& dyn_m_DeviceIndex();
    // Get instance field reference: UnityEngine.InputSystem.Layouts.InputDeviceDescription m_Description
    [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::Layouts::InputDeviceDescription& dyn_m_Description();
    // Get instance field reference: System.Double m_LastUpdateTimeInternal
    [[deprecated("Use field access instead!")]] double& dyn_m_LastUpdateTimeInternal();
    // Get instance field reference: System.UInt32 m_CurrentUpdateStepCount
    [[deprecated("Use field access instead!")]] uint& dyn_m_CurrentUpdateStepCount();
    // Get instance field reference: UnityEngine.InputSystem.Utilities.InternedString[] m_AliasesForEachControl
    [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::InputSystem::Utilities::InternedString>& dyn_m_AliasesForEachControl();
    // Get instance field reference: UnityEngine.InputSystem.Utilities.InternedString[] m_UsagesForEachControl
    [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::InputSystem::Utilities::InternedString>& dyn_m_UsagesForEachControl();
    // Get instance field reference: UnityEngine.InputSystem.InputControl[] m_UsageToControl
    [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::InputSystem::InputControl*>& dyn_m_UsageToControl();
    // Get instance field reference: UnityEngine.InputSystem.InputControl[] m_ChildrenForEachControl
    [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::InputSystem::InputControl*>& dyn_m_ChildrenForEachControl();
    // Get instance field reference: System.UInt32[] m_StateOffsetToControlMap
    [[deprecated("Use field access instead!")]] ::ArrayW<uint>& dyn_m_StateOffsetToControlMap();
    // Get instance field reference: UnityEngine.InputSystem.InputDevice/ControlBitRangeNode[] m_ControlTreeNodes
    [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::InputSystem::InputDevice::ControlBitRangeNode>& dyn_m_ControlTreeNodes();
    // Get instance field reference: System.UInt16[] m_ControlTreeIndices
    [[deprecated("Use field access instead!")]] ::ArrayW<uint16_t>& dyn_m_ControlTreeIndices();
    // public UnityEngine.InputSystem.Layouts.InputDeviceDescription get_description()
    // Offset: 0x50C4F64
    ::UnityEngine::InputSystem::Layouts::InputDeviceDescription get_description();
    // public System.Boolean get_enabled()
    // Offset: 0x50C4F80
    bool get_enabled();
    // public System.Boolean get_canRunInBackground()
    // Offset: 0x50C503C
    bool get_canRunInBackground();
    // public System.Boolean get_added()
    // Offset: 0x50B94B0
    bool get_added();
    // public System.Boolean get_remote()
    // Offset: 0x50C50EC
    bool get_remote();
    // public System.Boolean get_native()
    // Offset: 0x50C50F8
    bool get_native();
    // public System.Boolean get_updateBeforeRender()
    // Offset: 0x50C5104
    bool get_updateBeforeRender();
    // public System.Int32 get_deviceId()
    // Offset: 0x50C5110
    int get_deviceId();
    // public System.Double get_lastUpdateTime()
    // Offset: 0x50C5118
    double get_lastUpdateTime();
    // public System.Boolean get_wasUpdatedThisFrame()
    // Offset: 0x50C516C
    bool get_wasUpdatedThisFrame();
    // public UnityEngine.InputSystem.Utilities.ReadOnlyArray`1<UnityEngine.InputSystem.InputControl> get_allControls()
    // Offset: 0x50C51C4
    ::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::InputControl*> get_allControls();
    // static public UnityEngine.InputSystem.Utilities.ReadOnlyArray`1<UnityEngine.InputSystem.InputDevice> get_all()
    // Offset: 0x50C529C
    static ::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::InputDevice*> get_all();
    // System.Void NotifyConfigurationChanged()
    // Offset: 0x50C5604
    void NotifyConfigurationChanged();
    // public System.Void MakeCurrent()
    // Offset: 0x50C4D18
    void MakeCurrent();
    // protected System.Void OnAdded()
    // Offset: 0x50C5680
    void OnAdded();
    // protected System.Void OnRemoved()
    // Offset: 0x50C5684
    void OnRemoved();
    // protected System.Void OnConfigurationChanged()
    // Offset: 0x50C5688
    void OnConfigurationChanged();
    // public System.Int64 ExecuteCommand(ref TCommand command)
    // Offset: 0xFFFFFFFFFFFFFFFF
    template<class TCommand>
    int64_t ExecuteCommand(ByRef<TCommand> command) {
      static_assert(std::is_convertible_v<std::remove_pointer_t<TCommand>, ::UnityEngine::InputSystem::LowLevel::IInputDeviceCommandInfo> && std::is_convertible_v<TCommand, ::System::ValueType*>);
      static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::InputSystem::InputDevice::ExecuteCommand");
      static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(this, "ExecuteCommand", std::vector<Il2CppClass*>{::il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<TCommand>::get()}, ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractType(command)})));
      static auto* ___generic__method = THROW_UNLESS(::il2cpp_utils::MakeGenericMethod(___internal__method, std::vector<Il2CppClass*>{::il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<TCommand>::get()}));
      return ::il2cpp_utils::RunMethodRethrow<int64_t, false>(this, ___generic__method, byref(command));
    }
    // protected System.Int64 ExecuteCommand(UnityEngine.InputSystem.LowLevel.InputDeviceCommand* commandPtr)
    // Offset: 0x50C568C
    int64_t ExecuteCommand(::UnityEngine::InputSystem::LowLevel::InputDeviceCommand* commandPtr);
    // System.Boolean QueryEnabledStateFromRuntime()
    // Offset: 0x50C4F9C
    bool QueryEnabledStateFromRuntime();
    // System.Boolean get_disabledInFrontend()
    // Offset: 0x50C5764
    bool get_disabledInFrontend();
    // System.Void set_disabledInFrontend(System.Boolean value)
    // Offset: 0x50C5770
    void set_disabledInFrontend(bool value);
    // System.Boolean get_disabledInRuntime()
    // Offset: 0x50C5790
    bool get_disabledInRuntime();
    // System.Void set_disabledInRuntime(System.Boolean value)
    // Offset: 0x50C579C
    void set_disabledInRuntime(bool value);
    // System.Boolean get_disabledWhileInBackground()
    // Offset: 0x50C57BC
    bool get_disabledWhileInBackground();
    // System.Void set_disabledWhileInBackground(System.Boolean value)
    // Offset: 0x50C57C8
    void set_disabledWhileInBackground(bool value);
    // static System.UInt32 EncodeStateOffsetToControlMapEntry(System.UInt32 controlIndex, System.UInt32 stateOffsetInBits, System.UInt32 stateSizeInBits)
    // Offset: 0x50C57E8
    static uint EncodeStateOffsetToControlMapEntry(uint controlIndex, uint stateOffsetInBits, uint stateSizeInBits);
    // static System.Void DecodeStateOffsetToControlMapEntry(System.UInt32 entry, out System.UInt32 controlIndex, out System.UInt32 stateOffset, out System.UInt32 stateSize)
    // Offset: 0x50C08C4
    static void DecodeStateOffsetToControlMapEntry(uint entry, ByRef<uint> controlIndex, ByRef<uint> stateOffset, ByRef<uint> stateSize);
    // System.Boolean get_hasControlsWithDefaultState()
    // Offset: 0x50C57F4
    bool get_hasControlsWithDefaultState();
    // System.Void set_hasControlsWithDefaultState(System.Boolean value)
    // Offset: 0x50C0BC0
    void set_hasControlsWithDefaultState(bool value);
    // System.Boolean get_hasDontResetControls()
    // Offset: 0x50C5800
    bool get_hasDontResetControls();
    // System.Void set_hasDontResetControls(System.Boolean value)
    // Offset: 0x50C0CBC
    void set_hasDontResetControls(bool value);
    // System.Boolean get_hasStateCallbacks()
    // Offset: 0x50BF124
    bool get_hasStateCallbacks();
    // System.Void set_hasStateCallbacks(System.Boolean value)
    // Offset: 0x50C580C
    void set_hasStateCallbacks(bool value);
    // System.Boolean get_hasEventMerger()
    // Offset: 0x50C582C
    bool get_hasEventMerger();
    // System.Void set_hasEventMerger(System.Boolean value)
    // Offset: 0x50C5838
    void set_hasEventMerger(bool value);
    // System.Boolean get_hasEventPreProcessor()
    // Offset: 0x50C5858
    bool get_hasEventPreProcessor();
    // System.Void set_hasEventPreProcessor(System.Boolean value)
    // Offset: 0x50C5864
    void set_hasEventPreProcessor(bool value);
    // System.Void AddDeviceUsage(UnityEngine.InputSystem.Utilities.InternedString usage)
    // Offset: 0x50C5884
    void AddDeviceUsage(::UnityEngine::InputSystem::Utilities::InternedString usage);
    // System.Void RemoveDeviceUsage(UnityEngine.InputSystem.Utilities.InternedString usage)
    // Offset: 0x50C5938
    void RemoveDeviceUsage(::UnityEngine::InputSystem::Utilities::InternedString usage);
    // System.Void ClearDeviceUsages()
    // Offset: 0x50C5A14
    void ClearDeviceUsages();
    // System.Boolean RequestSync()
    // Offset: 0x50B94C0
    bool RequestSync();
    // System.Boolean RequestReset()
    // Offset: 0x50B960C
    bool RequestReset();
    // System.Boolean ExecuteEnableCommand()
    // Offset: 0x50C5A74
    bool ExecuteEnableCommand();
    // System.Boolean ExecuteDisableCommand()
    // Offset: 0x50C5AEC
    bool ExecuteDisableCommand();
    // System.Void NotifyAdded()
    // Offset: 0x50C5B58
    void NotifyAdded();
    // System.Void NotifyRemoved()
    // Offset: 0x50C5B68
    void NotifyRemoved();
    // static TDevice Build(System.String layoutName, System.String layoutVariants, UnityEngine.InputSystem.Layouts.InputDeviceDescription deviceDescription, System.Boolean noPrecompiledLayouts)
    // Offset: 0xFFFFFFFFFFFFFFFF
    template<class TDevice>
    static TDevice Build(::StringW layoutName, ::StringW layoutVariants, ::UnityEngine::InputSystem::Layouts::InputDeviceDescription deviceDescription, bool noPrecompiledLayouts) {
      static_assert(std::is_convertible_v<TDevice, ::UnityEngine::InputSystem::InputDevice*>);
      static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::InputSystem::InputDevice::Build");
      static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod("UnityEngine.InputSystem", "InputDevice", "Build", std::vector<Il2CppClass*>{::il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<TDevice>::get()}, ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractType(layoutName), ::il2cpp_utils::ExtractType(layoutVariants), ::il2cpp_utils::ExtractType(deviceDescription), ::il2cpp_utils::ExtractType(noPrecompiledLayouts)})));
      static auto* ___generic__method = THROW_UNLESS(::il2cpp_utils::MakeGenericMethod(___internal__method, std::vector<Il2CppClass*>{::il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<TDevice>::get()}));
      return ::il2cpp_utils::RunMethodRethrow<TDevice, false>(static_cast<Il2CppObject*>(nullptr), ___generic__method, layoutName, layoutVariants, deviceDescription, noPrecompiledLayouts);
    }
    // System.Void WriteChangedControlStates(System.Byte* deviceStateBuffer, System.Void* statePtr, System.UInt32 stateSizeInBytes, System.UInt32 stateOffsetInDevice)
    // Offset: 0x50C5B78
    void WriteChangedControlStates(uint8_t* deviceStateBuffer, void* statePtr, uint stateSizeInBytes, uint stateOffsetInDevice);
    // private System.Void WritePartialChangedControlStatesInternal(System.Void* statePtr, System.UInt32 stateSizeInBits, System.UInt32 stateOffsetInDeviceInBits, System.Byte* deviceStatePtr, UnityEngine.InputSystem.InputDevice/ControlBitRangeNode parentNode, System.UInt32 startOffset)
    // Offset: 0x50C5C2C
    void WritePartialChangedControlStatesInternal(void* statePtr, uint stateSizeInBits, uint stateOffsetInDeviceInBits, uint8_t* deviceStatePtr, ::UnityEngine::InputSystem::InputDevice::ControlBitRangeNode parentNode, uint startOffset);
    // private System.Void DumpControlBitRangeNode(System.Int32 nodeIndex, UnityEngine.InputSystem.InputDevice/ControlBitRangeNode node, System.UInt32 startOffset, System.UInt32 sizeInBits, System.Collections.Generic.List`1<System.String> output)
    // Offset: 0x50C60E8
    void DumpControlBitRangeNode(int nodeIndex, ::UnityEngine::InputSystem::InputDevice::ControlBitRangeNode node, uint startOffset, uint sizeInBits, ::System::Collections::Generic::List_1<::StringW>* output);
    // private System.Void DumpControlTree(UnityEngine.InputSystem.InputDevice/ControlBitRangeNode parentNode, System.UInt32 startOffset, System.Collections.Generic.List`1<System.String> output)
    // Offset: 0x50C6544
    void DumpControlTree(::UnityEngine::InputSystem::InputDevice::ControlBitRangeNode parentNode, uint startOffset, ::System::Collections::Generic::List_1<::StringW>* output);
    // System.String DumpControlTree()
    // Offset: 0x50C6668
    ::StringW DumpControlTree();
    // private System.Void WriteChangedControlStatesInternal(System.Void* statePtr, System.UInt32 stateSizeInBits, System.Byte* deviceStatePtr, UnityEngine.InputSystem.InputDevice/ControlBitRangeNode parentNode, System.UInt32 startOffset)
    // Offset: 0x50C5EA4
    void WriteChangedControlStatesInternal(void* statePtr, uint stateSizeInBits, uint8_t* deviceStatePtr, ::UnityEngine::InputSystem::InputDevice::ControlBitRangeNode parentNode, uint startOffset);
    // static private System.Boolean HasDataChangedInRange(System.Byte* deviceStatePtr, System.Void* statePtr, System.UInt32 startOffset, System.UInt32 sizeInBits)
    // Offset: 0x50C6734
    static bool HasDataChangedInRange(uint8_t* deviceStatePtr, void* statePtr, uint startOffset, uint sizeInBits);
    // public override System.Type get_valueType()
    // Offset: 0x50C5224
    // Implemented from: UnityEngine.InputSystem.InputControl
    // Base method: System.Type InputControl::get_valueType()
    ::System::Type* get_valueType();
    // public override System.Int32 get_valueSizeInBytes()
    // Offset: 0x50C5290
    // Implemented from: UnityEngine.InputSystem.InputControl
    // Base method: System.Int32 InputControl::get_valueSizeInBytes()
    int get_valueSizeInBytes();
    // public System.Void .ctor()
    // Offset: 0x50C4F30
    // Implemented from: UnityEngine.InputSystem.InputControl
    // Base method: System.Void InputControl::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static InputDevice* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::InputSystem::InputDevice::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<InputDevice*, creationType>()));
    }
    // public override System.Object ReadValueFromBufferAsObject(System.Void* buffer, System.Int32 bufferSize)
    // Offset: 0x50C52E8
    // Implemented from: UnityEngine.InputSystem.InputControl
    // Base method: System.Object InputControl::ReadValueFromBufferAsObject(System.Void* buffer, System.Int32 bufferSize)
    ::Il2CppObject* ReadValueFromBufferAsObject(void* buffer, int bufferSize);
    // public override System.Object ReadValueFromStateAsObject(System.Void* statePtr)
    // Offset: 0x50C5320
    // Implemented from: UnityEngine.InputSystem.InputControl
    // Base method: System.Object InputControl::ReadValueFromStateAsObject(System.Void* statePtr)
    ::Il2CppObject* ReadValueFromStateAsObject(void* statePtr);
    // public override System.Void ReadValueFromStateIntoBuffer(System.Void* statePtr, System.Void* bufferPtr, System.Int32 bufferSize)
    // Offset: 0x50C53E4
    // Implemented from: UnityEngine.InputSystem.InputControl
    // Base method: System.Void InputControl::ReadValueFromStateIntoBuffer(System.Void* statePtr, System.Void* bufferPtr, System.Int32 bufferSize)
    void ReadValueFromStateIntoBuffer(void* statePtr, void* bufferPtr, int bufferSize);
    // public override System.Boolean CompareValue(System.Void* firstStatePtr, System.Void* secondStatePtr)
    // Offset: 0x50C5558
    // Implemented from: UnityEngine.InputSystem.InputControl
    // Base method: System.Boolean InputControl::CompareValue(System.Void* firstStatePtr, System.Void* secondStatePtr)
    bool CompareValue(void* firstStatePtr, void* secondStatePtr);
  }; // UnityEngine.InputSystem.InputDevice
  #pragma pack(pop)
  static check_size<sizeof(InputDevice), 360 + sizeof(::ArrayW<uint16_t>)> __UnityEngine_InputSystem_InputDeviceSizeCheck;
  static_assert(sizeof(InputDevice) == 0x170);
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::InputSystem::InputDevice::ControlBitRangeNode, "UnityEngine.InputSystem", "InputDevice/ControlBitRangeNode");
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::InputSystem::InputDevice::DeviceFlags, "UnityEngine.InputSystem", "InputDevice/DeviceFlags");
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: UnityEngine::InputSystem::InputDevice::get_description
// Il2CppName: get_description
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::InputSystem::Layouts::InputDeviceDescription (UnityEngine::InputSystem::InputDevice::*)()>(&UnityEngine::InputSystem::InputDevice::get_description)> {
  static const MethodInfo* get() {
