// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.ScriptableObject
#include "UnityEngine/ScriptableObject.hpp"
// Including type: UnityEngine.InputSystem.IInputActionCollection2
#include "UnityEngine/InputSystem/IInputActionCollection2.hpp"
// Including type: UnityEngine.InputSystem.InputActionRebindingExtensions/ParameterOverride
#include "UnityEngine/InputSystem/InputActionRebindingExtensions.hpp"
// Including type: UnityEngine.InputSystem.InputActionMap/DeviceArray
#include "UnityEngine/InputSystem/InputActionMap.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::InputSystem
namespace UnityEngine::InputSystem {
  // Skipping declaration: InputActionMap because it is already included!
  // Forward declaring type: InputActionState
  class InputActionState;
  // Forward declaring type: InputDevice
  class InputDevice;
  // Forward declaring type: InputAction
  class InputAction;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
  // Forward declaring type: Guid
  struct Guid;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Skipping declaration: IEnumerable`1 because it is already included!
  // Skipping declaration: IEnumerator`1 because it is already included!
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Skipping declaration: IEnumerator because it is already included!
}
// Completed forward declares
// Type namespace: UnityEngine.InputSystem
namespace UnityEngine::InputSystem {
  // Forward declaring type: InputActionAsset
  class InputActionAsset;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::InputSystem::InputActionAsset);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::InputSystem::InputActionAsset*, "UnityEngine.InputSystem", "InputActionAsset");
// Type namespace: UnityEngine.InputSystem
namespace UnityEngine::InputSystem {
  // WARNING Size may be invalid!
  // Autogenerated type: UnityEngine.InputSystem.InputActionAsset
  // [TokenAttribute] Offset: FFFFFFFF
  // [DefaultMemberAttribute] Offset: FFFFFFFF
  class InputActionAsset : public ::UnityEngine::ScriptableObject/*, public ::UnityEngine::InputSystem::IInputActionCollection2*/ {
    public:
    // Nested type: ::UnityEngine::InputSystem::InputActionAsset::WriteFileJson
    struct WriteFileJson;
    // Nested type: ::UnityEngine::InputSystem::InputActionAsset::ReadFileJson
    struct ReadFileJson;
    // Nested type: ::UnityEngine::InputSystem::InputActionAsset::$GetEnumerator$d__31
    class $GetEnumerator$d__31;
    // Nested type: ::UnityEngine::InputSystem::InputActionAsset::$get_bindings$d__8
    class $get_bindings$d__8;
    public:
    // UnityEngine.InputSystem.InputActionMap[] m_ActionMaps
    // Size: 0x8
    // Offset: 0x18
    ::ArrayW<::UnityEngine::InputSystem::InputActionMap*> m_ActionMaps;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::InputSystem::InputActionMap*>) == 0x8);
    // UnityEngine.InputSystem.InputControlScheme[] m_ControlSchemes
    // Size: 0x8
    // Offset: 0x20
    ::ArrayW<::UnityEngine::InputSystem::InputControlScheme> m_ControlSchemes;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::InputSystem::InputControlScheme>) == 0x8);
    // UnityEngine.InputSystem.InputActionState m_SharedStateForAllMaps
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::InputSystem::InputActionState* m_SharedStateForAllMaps;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionState*) == 0x8);
    // System.Nullable`1<UnityEngine.InputSystem.InputBinding> m_BindingMask
    // Size: 0xFFFFFFFF
    // Offset: 0x30
    ::System::Nullable_1<::UnityEngine::InputSystem::InputBinding> m_BindingMask;
    // System.Int32 m_ParameterOverridesCount
    // Size: 0x4
    // Offset: 0x90
    int m_ParameterOverridesCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // UnityEngine.InputSystem.InputActionRebindingExtensions/ParameterOverride[] m_ParameterOverrides
    // Size: 0x8
    // Offset: 0x98
    ::ArrayW<::UnityEngine::InputSystem::InputActionRebindingExtensions::ParameterOverride> m_ParameterOverrides;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::InputSystem::InputActionRebindingExtensions::ParameterOverride>) == 0x8);
    // UnityEngine.InputSystem.InputActionMap/DeviceArray m_Devices
    // Size: 0x10
    // Offset: 0xA0
    ::UnityEngine::InputSystem::InputActionMap::DeviceArray m_Devices;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionMap::DeviceArray) == 0x10);
    public:
    // Creating interface conversion operator: operator ::UnityEngine::InputSystem::IInputActionCollection2
    operator ::UnityEngine::InputSystem::IInputActionCollection2() noexcept {
      return *reinterpret_cast<::UnityEngine::InputSystem::IInputActionCollection2*>(this);
    }
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // static field const value: static public System.String Extension
    static constexpr const char* Extension = "inputactions";
    // Get static field: static public System.String Extension
    static ::StringW _get_Extension();
    // Set static field: static public System.String Extension
    static void _set_Extension(::StringW value);
    // Get instance field reference: UnityEngine.InputSystem.InputActionMap[] m_ActionMaps
