// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ICloneable
#include "System/ICloneable.hpp"
// Including type: UnityEngine.ISerializationCallbackReceiver
#include "UnityEngine/ISerializationCallbackReceiver.hpp"
// Including type: UnityEngine.InputSystem.IInputActionCollection2
#include "UnityEngine/InputSystem/IInputActionCollection2.hpp"
// Including type: UnityEngine.InputSystem.InputActionRebindingExtensions/ParameterOverride
#include "UnityEngine/InputSystem/InputActionRebindingExtensions.hpp"
// Including type: UnityEngine.InputSystem.Utilities.CallbackArray`1
#include "UnityEngine/InputSystem/Utilities/CallbackArray_1.hpp"
// Including type: UnityEngine.InputSystem.InputAction/CallbackContext
#include "UnityEngine/InputSystem/InputAction_CallbackContext.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares

namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Guid
  struct Guid;
}
// Forward declaring namespace: UnityEngine::InputSystem
namespace UnityEngine::InputSystem {
  // Forward declaring type: InputActionAsset
  class InputActionAsset;
  // Forward declaring type: InputAction
  class InputAction;
  // Forward declaring type: InputControl
  class InputControl;
  // Forward declaring type: InputActionState
  class InputActionState;
  // Forward declaring type: InputDevice
  class InputDevice;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Skipping declaration: IEnumerator because it is already included!
}
// Completed forward declares
// Type namespace: UnityEngine.InputSystem
namespace UnityEngine::InputSystem {
  // Forward declaring type: InputActionMap
  class InputActionMap;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::InputSystem::InputActionMap);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::InputSystem::InputActionMap*, "UnityEngine.InputSystem", "InputActionMap");
// Type namespace: UnityEngine.InputSystem
namespace UnityEngine::InputSystem {
  // WARNING Size may be invalid!
  // Autogenerated type: UnityEngine.InputSystem.InputActionMap
  // [TokenAttribute] Offset: FFFFFFFF
  // [DefaultMemberAttribute] Offset: FFFFFFFF
  class InputActionMap : public ::Il2CppObject/*, public ::System::ICloneable, public ::UnityEngine::ISerializationCallbackReceiver, public ::UnityEngine::InputSystem::IInputActionCollection2, public ::System::IDisposable*/ {
    public:
    // Nested type: ::UnityEngine::InputSystem::InputActionMap::Flags
    struct Flags;
    // Nested type: ::UnityEngine::InputSystem::InputActionMap::DeviceArray
    struct DeviceArray;
    // Nested type: ::UnityEngine::InputSystem::InputActionMap::BindingOverrideListJson
    struct BindingOverrideListJson;
    // Nested type: ::UnityEngine::InputSystem::InputActionMap::BindingOverrideJson
    struct BindingOverrideJson;
    // Nested type: ::UnityEngine::InputSystem::InputActionMap::BindingJson
    struct BindingJson;
    // Nested type: ::UnityEngine::InputSystem::InputActionMap::ReadActionJson
    struct ReadActionJson;
    // Nested type: ::UnityEngine::InputSystem::InputActionMap::WriteActionJson
    struct WriteActionJson;
    // Nested type: ::UnityEngine::InputSystem::InputActionMap::ReadMapJson
    struct ReadMapJson;
    // Nested type: ::UnityEngine::InputSystem::InputActionMap::WriteMapJson
    struct WriteMapJson;
    // Nested type: ::UnityEngine::InputSystem::InputActionMap::WriteFileJson
    struct WriteFileJson;
    // Nested type: ::UnityEngine::InputSystem::InputActionMap::ReadFileJson
    struct ReadFileJson;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.InputSystem.InputActionMap/Flags
    // [TokenAttribute] Offset: FFFFFFFF
    // [FlagsAttribute] Offset: FFFFFFFF
    struct Flags/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: Flags
      constexpr Flags(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.InputSystem.InputActionMap/Flags NeedToResolveBindings
      static constexpr const int NeedToResolveBindings = 1;
      // Get static field: static public UnityEngine.InputSystem.InputActionMap/Flags NeedToResolveBindings
      static ::UnityEngine::InputSystem::InputActionMap::Flags _get_NeedToResolveBindings();
      // Set static field: static public UnityEngine.InputSystem.InputActionMap/Flags NeedToResolveBindings
      static void _set_NeedToResolveBindings(::UnityEngine::InputSystem::InputActionMap::Flags value);
      // static field const value: static public UnityEngine.InputSystem.InputActionMap/Flags BindingResolutionNeedsFullReResolve
      static constexpr const int BindingResolutionNeedsFullReResolve = 2;
      // Get static field: static public UnityEngine.InputSystem.InputActionMap/Flags BindingResolutionNeedsFullReResolve
      static ::UnityEngine::InputSystem::InputActionMap::Flags _get_BindingResolutionNeedsFullReResolve();
      // Set static field: static public UnityEngine.InputSystem.InputActionMap/Flags BindingResolutionNeedsFullReResolve
      static void _set_BindingResolutionNeedsFullReResolve(::UnityEngine::InputSystem::InputActionMap::Flags value);
      // static field const value: static public UnityEngine.InputSystem.InputActionMap/Flags ControlsForEachActionInitialized
      static constexpr const int ControlsForEachActionInitialized = 4;
      // Get static field: static public UnityEngine.InputSystem.InputActionMap/Flags ControlsForEachActionInitialized
      static ::UnityEngine::InputSystem::InputActionMap::Flags _get_ControlsForEachActionInitialized();
      // Set static field: static public UnityEngine.InputSystem.InputActionMap/Flags ControlsForEachActionInitialized
      static void _set_ControlsForEachActionInitialized(::UnityEngine::InputSystem::InputActionMap::Flags value);
      // static field const value: static public UnityEngine.InputSystem.InputActionMap/Flags BindingsForEachActionInitialized
      static constexpr const int BindingsForEachActionInitialized = 8;
      // Get static field: static public UnityEngine.InputSystem.InputActionMap/Flags BindingsForEachActionInitialized
      static ::UnityEngine::InputSystem::InputActionMap::Flags _get_BindingsForEachActionInitialized();
      // Set static field: static public UnityEngine.InputSystem.InputActionMap/Flags BindingsForEachActionInitialized
      static void _set_BindingsForEachActionInitialized(::UnityEngine::InputSystem::InputActionMap::Flags value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.InputSystem.InputActionMap/Flags
    #pragma pack(pop)
    static check_size<sizeof(InputActionMap::Flags), 0 + sizeof(int)> __UnityEngine_InputSystem_InputActionMap_FlagsSizeCheck;
    static_assert(sizeof(InputActionMap::Flags) == 0x4);
    // Size: 0x10
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.InputSystem.InputActionMap/DeviceArray
    // [TokenAttribute] Offset: FFFFFFFF
    struct DeviceArray/*, public ::System::ValueType*/ {
      public:
      public:
      // private System.Boolean m_HaveValue
      // Size: 0x1
      // Offset: 0x0
      bool m_HaveValue;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // Padding between fields: m_HaveValue and: m_DeviceCount
      char __padding0[0x3] = {};
      // private System.Int32 m_DeviceCount
      // Size: 0x4
      // Offset: 0x4
      int m_DeviceCount;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // private UnityEngine.InputSystem.InputDevice[] m_DeviceArray
      // Size: 0x8
      // Offset: 0x8
      ::ArrayW<::UnityEngine::InputSystem::InputDevice*> m_DeviceArray;
      // Field size check
      static_assert(sizeof(::ArrayW<::UnityEngine::InputSystem::InputDevice*>) == 0x8);
      public:
      // Creating value type constructor for type: DeviceArray
      constexpr DeviceArray(bool m_HaveValue_ = {}, int m_DeviceCount_ = {}, ::ArrayW<::UnityEngine::InputSystem::InputDevice*> m_DeviceArray_ = ::ArrayW<::UnityEngine::InputSystem::InputDevice*>(static_cast<void*>(nullptr))) noexcept : m_HaveValue{m_HaveValue_}, m_DeviceCount{m_DeviceCount_}, m_DeviceArray{m_DeviceArray_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: private System.Boolean m_HaveValue
      [[deprecated("Use field access instead!")]] bool& dyn_m_HaveValue();
      // Get instance field reference: private System.Int32 m_DeviceCount
      [[deprecated("Use field access instead!")]] int& dyn_m_DeviceCount();
      // Get instance field reference: private UnityEngine.InputSystem.InputDevice[] m_DeviceArray
      [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::InputSystem::InputDevice*>& dyn_m_DeviceArray();
      // public System.Int32 IndexOf(UnityEngine.InputSystem.InputDevice device)
      // Offset: 0x50962B0
      int IndexOf(::UnityEngine::InputSystem::InputDevice* device);
      // public System.Boolean Remove(UnityEngine.InputSystem.InputDevice device)
      // Offset: 0x509630C
      bool Remove(::UnityEngine::InputSystem::InputDevice* device);
      // public System.Nullable`1<UnityEngine.InputSystem.Utilities.ReadOnlyArray`1<UnityEngine.InputSystem.InputDevice>> Get()
      // Offset: 0x509054C
      ::System::Nullable_1<::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::InputDevice*>> Get();
      // public System.Boolean Set(System.Nullable`1<UnityEngine.InputSystem.Utilities.ReadOnlyArray`1<UnityEngine.InputSystem.InputDevice>> devices)
      // Offset: 0x5090638
      bool Set(::System::Nullable_1<::UnityEngine::InputSystem::Utilities::ReadOnlyArray_1<::UnityEngine::InputSystem::InputDevice*>> devices);
    }; // UnityEngine.InputSystem.InputActionMap/DeviceArray
    #pragma pack(pop)
    static check_size<sizeof(InputActionMap::DeviceArray), 8 + sizeof(::ArrayW<::UnityEngine::InputSystem::InputDevice*>)> __UnityEngine_InputSystem_InputActionMap_DeviceArraySizeCheck;
    static_assert(sizeof(InputActionMap::DeviceArray) == 0x10);
    public:
    // System.String m_Name
    // Size: 0x8
    // Offset: 0x10
    ::StringW m_Name;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.String m_Id
    // Size: 0x8
    // Offset: 0x18
    ::StringW m_Id;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // UnityEngine.InputSystem.InputActionAsset m_Asset
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::InputSystem::InputActionAsset* m_Asset;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionAsset*) == 0x8);
    // UnityEngine.InputSystem.InputAction[] m_Actions
    // Size: 0x8
    // Offset: 0x28
    ::ArrayW<::UnityEngine::InputSystem::InputAction*> m_Actions;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::InputSystem::InputAction*>) == 0x8);
    // UnityEngine.InputSystem.InputBinding[] m_Bindings
    // Size: 0x8
    // Offset: 0x30
    ::ArrayW<::UnityEngine::InputSystem::InputBinding> m_Bindings;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::InputSystem::InputBinding>) == 0x8);
    // private UnityEngine.InputSystem.InputBinding[] m_BindingsForEachAction
    // Size: 0x8
    // Offset: 0x38
    ::ArrayW<::UnityEngine::InputSystem::InputBinding> m_BindingsForEachAction;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::InputSystem::InputBinding>) == 0x8);
    // private UnityEngine.InputSystem.InputControl[] m_ControlsForEachAction
    // Size: 0x8
    // Offset: 0x40
    ::ArrayW<::UnityEngine::InputSystem::InputControl*> m_ControlsForEachAction;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::InputSystem::InputControl*>) == 0x8);
    // System.Int32 m_EnabledActionsCount
    // Size: 0x4
    // Offset: 0x48
    int m_EnabledActionsCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // UnityEngine.InputSystem.InputAction m_SingletonAction
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::InputSystem::InputAction* m_SingletonAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputAction*) == 0x8);
    // System.Int32 m_MapIndexInState
    // Size: 0x4
    // Offset: 0x58
    int m_MapIndexInState;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // UnityEngine.InputSystem.InputActionState m_State
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::InputSystem::InputActionState* m_State;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionState*) == 0x8);
    // System.Nullable`1<UnityEngine.InputSystem.InputBinding> m_BindingMask
    // Size: 0xFFFFFFFF
    // Offset: 0x68
    ::System::Nullable_1<::UnityEngine::InputSystem::InputBinding> m_BindingMask;
    // private UnityEngine.InputSystem.InputActionMap/Flags m_Flags
    // Size: 0x4
    // Offset: 0xC8
    ::UnityEngine::InputSystem::InputActionMap::Flags m_Flags;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionMap::Flags) == 0x4);
    // System.Int32 m_ParameterOverridesCount
    // Size: 0x4
    // Offset: 0xCC
    int m_ParameterOverridesCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // UnityEngine.InputSystem.InputActionRebindingExtensions/ParameterOverride[] m_ParameterOverrides
    // Size: 0x8
    // Offset: 0xD0
    ::ArrayW<::UnityEngine::InputSystem::InputActionRebindingExtensions::ParameterOverride> m_ParameterOverrides;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::InputSystem::InputActionRebindingExtensions::ParameterOverride>) == 0x8);
    // UnityEngine.InputSystem.InputActionMap/DeviceArray m_Devices
    // Size: 0x10
    // Offset: 0xD8
    ::UnityEngine::InputSystem::InputActionMap::DeviceArray m_Devices;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionMap::DeviceArray) == 0x10);
    // UnityEngine.InputSystem.Utilities.CallbackArray`1<System.Action`1<UnityEngine.InputSystem.InputAction/CallbackContext>> m_ActionCallbacks
    // Size: 0xFFFFFFFF
    // Offset: 0xE8
    ::UnityEngine::InputSystem::Utilities::CallbackArray_1<::System::Action_1<::UnityEngine::InputSystem::InputAction_CallbackContext>*> m_ActionCallbacks;
    // System.Collections.Generic.Dictionary`2<System.String,System.Int32> m_ActionIndexByNameOrId
    // Size: 0x8
    // Offset: 0x138
    ::System::Collections::Generic::Dictionary_2<::StringW, int>* m_ActionIndexByNameOrId;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, int>*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::System::ICloneable
    operator ::System::ICloneable() noexcept {
      return *reinterpret_cast<::System::ICloneable*>(this);
    }
    // Creating interface conversion operator: operator ::UnityEngine::ISerializationCallbackReceiver
    operator ::UnityEngine::ISerializationCallbackReceiver() noexcept {
      return *reinterpret_cast<::UnityEngine::ISerializationCallbackReceiver*>(this);
    }
    // Creating interface conversion operator: operator ::UnityEngine::InputSystem::IInputActionCollection2
    operator ::UnityEngine::InputSystem::IInputActionCollection2() noexcept {
      return *reinterpret_cast<::UnityEngine::InputSystem::IInputActionCollection2*>(this);
    }
