// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.ScriptableObject
#include "UnityEngine/ScriptableObject.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: HashSet`1<T>
  template<typename T>
  class HashSet_1;
}
// Forward declaring namespace: UnityEngine::InputSystem
namespace UnityEngine::InputSystem {
  // Skipping declaration: UpdateMode because it is already included!
  // Skipping declaration: BackgroundBehavior because it is already included!
  // Skipping declaration: EditorInputBehaviorInPlayMode because it is already included!
}
// Forward declaring namespace: UnityEngine::InputSystem::Utilities
namespace UnityEngine::InputSystem::Utilities {
  // Forward declaring type: ReadOnlyArray`1<TValue>
  template<typename TValue>
  struct ReadOnlyArray_1;
}
// Completed forward declares
// Type namespace: UnityEngine.InputSystem
namespace UnityEngine::InputSystem {
  // Forward declaring type: InputSettings
  class InputSettings;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::InputSystem::InputSettings);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::InputSystem::InputSettings*, "UnityEngine.InputSystem", "InputSettings");
// Type namespace: UnityEngine.InputSystem
namespace UnityEngine::InputSystem {
  // Size: 0x68
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.InputSystem.InputSettings
  // [TokenAttribute] Offset: FFFFFFFF
  class InputSettings : public ::UnityEngine::ScriptableObject {
    public:
    // Nested type: ::UnityEngine::InputSystem::InputSettings::UpdateMode
    struct UpdateMode;
    // Nested type: ::UnityEngine::InputSystem::InputSettings::BackgroundBehavior
    struct BackgroundBehavior;
    // Nested type: ::UnityEngine::InputSystem::InputSettings::EditorInputBehaviorInPlayMode
    struct EditorInputBehaviorInPlayMode;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.InputSystem.InputSettings/UpdateMode
    // [TokenAttribute] Offset: FFFFFFFF
    struct UpdateMode/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: UpdateMode
      constexpr UpdateMode(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.InputSystem.InputSettings/UpdateMode ProcessEventsInDynamicUpdate
      static constexpr const int ProcessEventsInDynamicUpdate = 1;
      // Get static field: static public UnityEngine.InputSystem.InputSettings/UpdateMode ProcessEventsInDynamicUpdate
      static ::UnityEngine::InputSystem::InputSettings::UpdateMode _get_ProcessEventsInDynamicUpdate();
      // Set static field: static public UnityEngine.InputSystem.InputSettings/UpdateMode ProcessEventsInDynamicUpdate
      static void _set_ProcessEventsInDynamicUpdate(::UnityEngine::InputSystem::InputSettings::UpdateMode value);
      // static field const value: static public UnityEngine.InputSystem.InputSettings/UpdateMode ProcessEventsInFixedUpdate
      static constexpr const int ProcessEventsInFixedUpdate = 2;
      // Get static field: static public UnityEngine.InputSystem.InputSettings/UpdateMode ProcessEventsInFixedUpdate
      static ::UnityEngine::InputSystem::InputSettings::UpdateMode _get_ProcessEventsInFixedUpdate();
      // Set static field: static public UnityEngine.InputSystem.InputSettings/UpdateMode ProcessEventsInFixedUpdate
      static void _set_ProcessEventsInFixedUpdate(::UnityEngine::InputSystem::InputSettings::UpdateMode value);
      // static field const value: static public UnityEngine.InputSystem.InputSettings/UpdateMode ProcessEventsManually
      static constexpr const int ProcessEventsManually = 3;
      // Get static field: static public UnityEngine.InputSystem.InputSettings/UpdateMode ProcessEventsManually
      static ::UnityEngine::InputSystem::InputSettings::UpdateMode _get_ProcessEventsManually();
      // Set static field: static public UnityEngine.InputSystem.InputSettings/UpdateMode ProcessEventsManually
      static void _set_ProcessEventsManually(::UnityEngine::InputSystem::InputSettings::UpdateMode value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.InputSystem.InputSettings/UpdateMode
    #pragma pack(pop)
    static check_size<sizeof(InputSettings::UpdateMode), 0 + sizeof(int)> __UnityEngine_InputSystem_InputSettings_UpdateModeSizeCheck;
    static_assert(sizeof(InputSettings::UpdateMode) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.InputSystem.InputSettings/BackgroundBehavior
    // [TokenAttribute] Offset: FFFFFFFF
    struct BackgroundBehavior/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: BackgroundBehavior
      constexpr BackgroundBehavior(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.InputSystem.InputSettings/BackgroundBehavior ResetAndDisableNonBackgroundDevices
      static constexpr const int ResetAndDisableNonBackgroundDevices = 0;
      // Get static field: static public UnityEngine.InputSystem.InputSettings/BackgroundBehavior ResetAndDisableNonBackgroundDevices
      static ::UnityEngine::InputSystem::InputSettings::BackgroundBehavior _get_ResetAndDisableNonBackgroundDevices();
      // Set static field: static public UnityEngine.InputSystem.InputSettings/BackgroundBehavior ResetAndDisableNonBackgroundDevices
      static void _set_ResetAndDisableNonBackgroundDevices(::UnityEngine::InputSystem::InputSettings::BackgroundBehavior value);
      // static field const value: static public UnityEngine.InputSystem.InputSettings/BackgroundBehavior ResetAndDisableAllDevices
      static constexpr const int ResetAndDisableAllDevices = 1;
      // Get static field: static public UnityEngine.InputSystem.InputSettings/BackgroundBehavior ResetAndDisableAllDevices
      static ::UnityEngine::InputSystem::InputSettings::BackgroundBehavior _get_ResetAndDisableAllDevices();
      // Set static field: static public UnityEngine.InputSystem.InputSettings/BackgroundBehavior ResetAndDisableAllDevices
      static void _set_ResetAndDisableAllDevices(::UnityEngine::InputSystem::InputSettings::BackgroundBehavior value);
      // static field const value: static public UnityEngine.InputSystem.InputSettings/BackgroundBehavior IgnoreFocus
      static constexpr const int IgnoreFocus = 2;
      // Get static field: static public UnityEngine.InputSystem.InputSettings/BackgroundBehavior IgnoreFocus
      static ::UnityEngine::InputSystem::InputSettings::BackgroundBehavior _get_IgnoreFocus();
      // Set static field: static public UnityEngine.InputSystem.InputSettings/BackgroundBehavior IgnoreFocus
      static void _set_IgnoreFocus(::UnityEngine::InputSystem::InputSettings::BackgroundBehavior value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.InputSystem.InputSettings/BackgroundBehavior
    #pragma pack(pop)
    static check_size<sizeof(InputSettings::BackgroundBehavior), 0 + sizeof(int)> __UnityEngine_InputSystem_InputSettings_BackgroundBehaviorSizeCheck;
    static_assert(sizeof(InputSettings::BackgroundBehavior) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.InputSystem.InputSettings/EditorInputBehaviorInPlayMode
    // [TokenAttribute] Offset: FFFFFFFF
    struct EditorInputBehaviorInPlayMode/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: EditorInputBehaviorInPlayMode
      constexpr EditorInputBehaviorInPlayMode(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.InputSystem.InputSettings/EditorInputBehaviorInPlayMode PointersAndKeyboardsRespectGameViewFocus
      static constexpr const int PointersAndKeyboardsRespectGameViewFocus = 0;
      // Get static field: static public UnityEngine.InputSystem.InputSettings/EditorInputBehaviorInPlayMode PointersAndKeyboardsRespectGameViewFocus
      static ::UnityEngine::InputSystem::InputSettings::EditorInputBehaviorInPlayMode _get_PointersAndKeyboardsRespectGameViewFocus();
      // Set static field: static public UnityEngine.InputSystem.InputSettings/EditorInputBehaviorInPlayMode PointersAndKeyboardsRespectGameViewFocus
      static void _set_PointersAndKeyboardsRespectGameViewFocus(::UnityEngine::InputSystem::InputSettings::EditorInputBehaviorInPlayMode value);
      // static field const value: static public UnityEngine.InputSystem.InputSettings/EditorInputBehaviorInPlayMode AllDevicesRespectGameViewFocus
      static constexpr const int AllDevicesRespectGameViewFocus = 1;
      // Get static field: static public UnityEngine.InputSystem.InputSettings/EditorInputBehaviorInPlayMode AllDevicesRespectGameViewFocus
      static ::UnityEngine::InputSystem::InputSettings::EditorInputBehaviorInPlayMode _get_AllDevicesRespectGameViewFocus();
      // Set static field: static public UnityEngine.InputSystem.InputSettings/EditorInputBehaviorInPlayMode AllDevicesRespectGameViewFocus
      static void _set_AllDevicesRespectGameViewFocus(::UnityEngine::InputSystem::InputSettings::EditorInputBehaviorInPlayMode value);
      // static field const value: static public UnityEngine.InputSystem.InputSettings/EditorInputBehaviorInPlayMode AllDeviceInputAlwaysGoesToGameView
      static constexpr const int AllDeviceInputAlwaysGoesToGameView = 2;
      // Get static field: static public UnityEngine.InputSystem.InputSettings/EditorInputBehaviorInPlayMode AllDeviceInputAlwaysGoesToGameView
      static ::UnityEngine::InputSystem::InputSettings::EditorInputBehaviorInPlayMode _get_AllDeviceInputAlwaysGoesToGameView();
      // Set static field: static public UnityEngine.InputSystem.InputSettings/EditorInputBehaviorInPlayMode AllDeviceInputAlwaysGoesToGameView
      static void _set_AllDeviceInputAlwaysGoesToGameView(::UnityEngine::InputSystem::InputSettings::EditorInputBehaviorInPlayMode value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.InputSystem.InputSettings/EditorInputBehaviorInPlayMode
    #pragma pack(pop)
    static check_size<sizeof(InputSettings::EditorInputBehaviorInPlayMode), 0 + sizeof(int)> __UnityEngine_InputSystem_InputSettings_EditorInputBehaviorInPlayModeSizeCheck;
    static_assert(sizeof(InputSettings::EditorInputBehaviorInPlayMode) == 0x4);
    public:
    // private System.String[] m_SupportedDevices
    // Size: 0x8
    // Offset: 0x18
    ::ArrayW<::StringW> m_SupportedDevices;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // private UnityEngine.InputSystem.InputSettings/UpdateMode m_UpdateMode
    // Size: 0x4
    // Offset: 0x20
    ::UnityEngine::InputSystem::InputSettings::UpdateMode m_UpdateMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputSettings::UpdateMode) == 0x4);
    // private System.Int32 m_MaxEventBytesPerUpdate
    // Size: 0x4
    // Offset: 0x24
    int m_MaxEventBytesPerUpdate;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_MaxQueuedEventsPerUpdate
    // Size: 0x4
    // Offset: 0x28
    int m_MaxQueuedEventsPerUpdate;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean m_CompensateForScreenOrientation
    // Size: 0x1
    // Offset: 0x2C
    bool m_CompensateForScreenOrientation;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_CompensateForScreenOrientation and: m_BackgroundBehavior
    char __padding4[0x3] = {};
    // private UnityEngine.InputSystem.InputSettings/BackgroundBehavior m_BackgroundBehavior
    // Size: 0x4
    // Offset: 0x30
    ::UnityEngine::InputSystem::InputSettings::BackgroundBehavior m_BackgroundBehavior;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputSettings::BackgroundBehavior) == 0x4);
    // private UnityEngine.InputSystem.InputSettings/EditorInputBehaviorInPlayMode m_EditorInputBehaviorInPlayMode
    // Size: 0x4
    // Offset: 0x34
    ::UnityEngine::InputSystem::InputSettings::EditorInputBehaviorInPlayMode m_EditorInputBehaviorInPlayMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputSettings::EditorInputBehaviorInPlayMode) == 0x4);
    // private System.Single m_DefaultDeadzoneMin
    // Size: 0x4
    // Offset: 0x38
    float m_DefaultDeadzoneMin;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_DefaultDeadzoneMax
    // Size: 0x4
    // Offset: 0x3C
    float m_DefaultDeadzoneMax;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_DefaultButtonPressPoint
    // Size: 0x4
    // Offset: 0x40
    float m_DefaultButtonPressPoint;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_ButtonReleaseThreshold
    // Size: 0x4
    // Offset: 0x44
    float m_ButtonReleaseThreshold;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_DefaultTapTime
    // Size: 0x4
    // Offset: 0x48
    float m_DefaultTapTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_DefaultSlowTapTime
    // Size: 0x4
    // Offset: 0x4C
    float m_DefaultSlowTapTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_DefaultHoldTime
    // Size: 0x4
    // Offset: 0x50
    float m_DefaultHoldTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_TapRadius
    // Size: 0x4
    // Offset: 0x54
    float m_TapRadius;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_MultiTapDelayTime
    // Size: 0x4
    // Offset: 0x58
    float m_MultiTapDelayTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_DisableRedundantEventsMerging
    // Size: 0x1
    // Offset: 0x5C
    bool m_DisableRedundantEventsMerging;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_ShortcutKeysConsumeInputs
    // Size: 0x1
    // Offset: 0x5D
    bool m_ShortcutKeysConsumeInputs;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_ShortcutKeysConsumeInputs and: m_FeatureFlags
    char __padding17[0x2] = {};
    // System.Collections.Generic.HashSet`1<System.String> m_FeatureFlags
    // Size: 0x8
    // Offset: 0x60
    ::System::Collections::Generic::HashSet_1<::StringW>* m_FeatureFlags;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::HashSet_1<::StringW>*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get static field: static System.Boolean optimizedControlsFeatureEnabled
    static bool _get_optimizedControlsFeatureEnabled();
    // Set static field: static System.Boolean optimizedControlsFeatureEnabled
    static void _set_optimizedControlsFeatureEnabled(bool value);
    // Get static field: static System.Boolean readValueCachingFeatureEnabled
    static bool _get_readValueCachingFeatureEnabled();
    // Set static field: static System.Boolean readValueCachingFeatureEnabled
    static void _set_readValueCachingFeatureEnabled(bool value);
    // Get static field: static System.Boolean paranoidReadValueCachingChecksEnabled
