// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.InputSystem.LowLevel.IInputStateChangeMonitor
#include "UnityEngine/InputSystem/LowLevel/IInputStateChangeMonitor.hpp"
// Including type: System.ICloneable
#include "System/ICloneable.hpp"
// Including type: System.IDisposable
#include "System/IDisposable.hpp"
// Including type: UnityEngine.InputSystem.LowLevel.InputEventPtr
#include "UnityEngine/InputSystem/LowLevel/InputEventPtr.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
// Including type: UnityEngine.InputSystem.InputAction/CallbackContext
#include "UnityEngine/InputSystem/InputAction_CallbackContext.hpp"
// Including type: UnityEngine.InputSystem.Utilities.InlinedArray`1
#include "UnityEngine/InputSystem/Utilities/InlinedArray_1.hpp"
// Including type: System.Runtime.InteropServices.GCHandle
#include "System/Runtime/InteropServices/GCHandle.hpp"
// Including type: UnityEngine.InputSystem.Utilities.CallbackArray`1
#include "UnityEngine/InputSystem/Utilities/CallbackArray_1.hpp"
// Including type: UnityEngine.InputSystem.InputActionChange
#include "UnityEngine/InputSystem/InputActionChange.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"

  // Forward declaring type: InputBinding
  struct InputBinding;
  // Forward declaring type: InputControl`1<TValue>
  template<typename TValue>
  class InputControl_1;
  // Forward declaring type: InputDeviceChange
  struct InputDeviceChange;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Type
  class Type;
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
}
// Forward declaring namespace: UnityEngine::InputSystem::LowLevel
namespace UnityEngine::InputSystem::LowLevel {
  // Forward declaring type: InputEvent
  struct InputEvent;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: IComparer`1<T>
  template<typename T>
  class IComparer_1;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine::InputSystem::Utilities
namespace UnityEngine::InputSystem::Utilities {
  // Forward declaring type: ISavedState
  class ISavedState;
}
// Completed forward declares
// Type namespace: UnityEngine.InputSystem
namespace UnityEngine::InputSystem {
  // Forward declaring type: InputActionState
  class InputActionState;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::InputSystem::InputActionState);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::InputSystem::InputActionState*, "UnityEngine.InputSystem", "InputActionState");
// Type namespace: UnityEngine.InputSystem
namespace UnityEngine::InputSystem {
  // Size: 0xE0
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.InputSystem.InputActionState
  // [TokenAttribute] Offset: FFFFFFFF
  class InputActionState : public ::Il2CppObject/*, public ::UnityEngine::InputSystem::LowLevel::IInputStateChangeMonitor, public ::System::ICloneable, public ::System::IDisposable*/ {
    public:
    // Nested type: ::UnityEngine::InputSystem::InputActionState::InteractionState
    struct InteractionState;
    // Nested type: ::UnityEngine::InputSystem::InputActionState::BindingState
    struct BindingState;
    // Nested type: ::UnityEngine::InputSystem::InputActionState::TriggerState
    struct TriggerState;
    // Nested type: ::UnityEngine::InputSystem::InputActionState::ActionMapIndices
    struct ActionMapIndices;
    // Nested type: ::UnityEngine::InputSystem::InputActionState::UnmanagedMemory
    struct UnmanagedMemory;
    // Nested type: ::UnityEngine::InputSystem::InputActionState::GlobalState
    struct GlobalState;
    // Nested type: ::UnityEngine::InputSystem::InputActionState::$$c
    class $$c;
    // Size: 0x80
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.InputSystem.InputActionState/UnmanagedMemory
    // [TokenAttribute] Offset: FFFFFFFF
    struct UnmanagedMemory/*, public ::System::ValueType, public ::System::IDisposable*/ {
      public:
      public:
      // public System.Void* basePtr
      // Size: 0x8
      // Offset: 0x0
      void* basePtr;
      // Field size check
      static_assert(sizeof(void*) == 0x8);
      // public System.Int32 mapCount
      // Size: 0x4
      // Offset: 0x8
      int mapCount;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Int32 actionCount
      // Size: 0x4
      // Offset: 0xC
      int actionCount;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Int32 interactionCount
      // Size: 0x4
      // Offset: 0x10
      int interactionCount;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Int32 bindingCount
      // Size: 0x4
      // Offset: 0x14
      int bindingCount;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Int32 controlCount
      // Size: 0x4
      // Offset: 0x18
      int controlCount;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Int32 compositeCount
      // Size: 0x4
      // Offset: 0x1C
      int compositeCount;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public UnityEngine.InputSystem.InputActionState/TriggerState* actionStates
      // Size: 0x8
      // Offset: 0x20
      ::UnityEngine::InputSystem::InputActionState::TriggerState* actionStates;
      // Field size check
      static_assert(sizeof(::UnityEngine::InputSystem::InputActionState::TriggerState*) == 0x8);
      // public UnityEngine.InputSystem.InputActionState/BindingState* bindingStates
      // Size: 0x8
      // Offset: 0x28
      ::UnityEngine::InputSystem::InputActionState::BindingState* bindingStates;
      // Field size check
      static_assert(sizeof(::UnityEngine::InputSystem::InputActionState::BindingState*) == 0x8);
      // public UnityEngine.InputSystem.InputActionState/InteractionState* interactionStates
      // Size: 0x8
      // Offset: 0x30
      ::UnityEngine::InputSystem::InputActionState::InteractionState* interactionStates;
      // Field size check
      static_assert(sizeof(::UnityEngine::InputSystem::InputActionState::InteractionState*) == 0x8);
      // public System.Single* controlMagnitudes
      // Size: 0x8
      // Offset: 0x38
      float* controlMagnitudes;
      // Field size check
      static_assert(sizeof(float*) == 0x8);
      // public System.Single* compositeMagnitudes
      // Size: 0x8
      // Offset: 0x40
      float* compositeMagnitudes;
      // Field size check
      static_assert(sizeof(float*) == 0x8);
      // public System.Int32* enabledControls
      // Size: 0x8
      // Offset: 0x48
      int* enabledControls;
      // Field size check
      static_assert(sizeof(int*) == 0x8);
      // public System.UInt16* actionBindingIndicesAndCounts
      // Size: 0x8
      // Offset: 0x50
      uint16_t* actionBindingIndicesAndCounts;
      // Field size check
      static_assert(sizeof(uint16_t*) == 0x8);
      // public System.UInt16* actionBindingIndices
      // Size: 0x8
      // Offset: 0x58
      uint16_t* actionBindingIndices;
      // Field size check
      static_assert(sizeof(uint16_t*) == 0x8);
      // public System.Int32* controlIndexToBindingIndex
      // Size: 0x8
      // Offset: 0x60
      int* controlIndexToBindingIndex;
      // Field size check
      static_assert(sizeof(int*) == 0x8);
      // public System.UInt16* controlGroupingAndComplexity
      // Size: 0x8
      // Offset: 0x68
      uint16_t* controlGroupingAndComplexity;
      // Field size check
      static_assert(sizeof(uint16_t*) == 0x8);
      // public System.Boolean controlGroupingInitialized
      // Size: 0x1
      // Offset: 0x70
      bool controlGroupingInitialized;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // Padding between fields: controlGroupingInitialized and: mapIndices
      char __padding17[0x7] = {};
      // public UnityEngine.InputSystem.InputActionState/ActionMapIndices* mapIndices
      // Size: 0x8
      // Offset: 0x78
      ::UnityEngine::InputSystem::InputActionState::ActionMapIndices* mapIndices;
      // Field size check
      static_assert(sizeof(::UnityEngine::InputSystem::InputActionState::ActionMapIndices*) == 0x8);
      public:
      // Creating value type constructor for type: UnmanagedMemory
      constexpr UnmanagedMemory(void* basePtr_ = {}, int mapCount_ = {}, int actionCount_ = {}, int interactionCount_ = {}, int bindingCount_ = {}, int controlCount_ = {}, int compositeCount_ = {}, ::UnityEngine::InputSystem::InputActionState::TriggerState* actionStates_ = {}, ::UnityEngine::InputSystem::InputActionState::BindingState* bindingStates_ = {}, ::UnityEngine::InputSystem::InputActionState::InteractionState* interactionStates_ = {}, float* controlMagnitudes_ = {}, float* compositeMagnitudes_ = {}, int* enabledControls_ = {}, uint16_t* actionBindingIndicesAndCounts_ = {}, uint16_t* actionBindingIndices_ = {}, int* controlIndexToBindingIndex_ = {}, uint16_t* controlGroupingAndComplexity_ = {}, bool controlGroupingInitialized_ = {}, ::UnityEngine::InputSystem::InputActionState::ActionMapIndices* mapIndices_ = {}) noexcept : basePtr{basePtr_}, mapCount{mapCount_}, actionCount{actionCount_}, interactionCount{interactionCount_}, bindingCount{bindingCount_}, controlCount{controlCount_}, compositeCount{compositeCount_}, actionStates{actionStates_}, bindingStates{bindingStates_}, interactionStates{interactionStates_}, controlMagnitudes{controlMagnitudes_}, compositeMagnitudes{compositeMagnitudes_}, enabledControls{enabledControls_}, actionBindingIndicesAndCounts{actionBindingIndicesAndCounts_}, actionBindingIndices{actionBindingIndices_}, controlIndexToBindingIndex{controlIndexToBindingIndex_}, controlGroupingAndComplexity{controlGroupingAndComplexity_}, controlGroupingInitialized{controlGroupingInitialized_}, mapIndices{mapIndices_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Creating interface conversion operator: operator ::System::IDisposable
      operator ::System::IDisposable() noexcept {
        return *reinterpret_cast<::System::IDisposable*>(this);
      }
      // Get instance field reference: public System.Void* basePtr
      [[deprecated("Use field access instead!")]] void*& dyn_basePtr();
      // Get instance field reference: public System.Int32 mapCount
      [[deprecated("Use field access instead!")]] int& dyn_mapCount();
      // Get instance field reference: public System.Int32 actionCount
      [[deprecated("Use field access instead!")]] int& dyn_actionCount();
      // Get instance field reference: public System.Int32 interactionCount
      [[deprecated("Use field access instead!")]] int& dyn_interactionCount();
      // Get instance field reference: public System.Int32 bindingCount
      [[deprecated("Use field access instead!")]] int& dyn_bindingCount();
      // Get instance field reference: public System.Int32 controlCount
      [[deprecated("Use field access instead!")]] int& dyn_controlCount();
      // Get instance field reference: public System.Int32 compositeCount
      [[deprecated("Use field access instead!")]] int& dyn_compositeCount();
      // Get instance field reference: public UnityEngine.InputSystem.InputActionState/TriggerState* actionStates
      [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::InputActionState::TriggerState*& dyn_actionStates();
      // Get instance field reference: public UnityEngine.InputSystem.InputActionState/BindingState* bindingStates
      [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::InputActionState::BindingState*& dyn_bindingStates();
      // Get instance field reference: public UnityEngine.InputSystem.InputActionState/InteractionState* interactionStates
      [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::InputActionState::InteractionState*& dyn_interactionStates();
      // Get instance field reference: public System.Single* controlMagnitudes
      [[deprecated("Use field access instead!")]] float*& dyn_controlMagnitudes();
      // Get instance field reference: public System.Single* compositeMagnitudes
      [[deprecated("Use field access instead!")]] float*& dyn_compositeMagnitudes();
      // Get instance field reference: public System.Int32* enabledControls
      [[deprecated("Use field access instead!")]] int*& dyn_enabledControls();
      // Get instance field reference: public System.UInt16* actionBindingIndicesAndCounts
      [[deprecated("Use field access instead!")]] uint16_t*& dyn_actionBindingIndicesAndCounts();
      // Get instance field reference: public System.UInt16* actionBindingIndices
      [[deprecated("Use field access instead!")]] uint16_t*& dyn_actionBindingIndices();
      // Get instance field reference: public System.Int32* controlIndexToBindingIndex
      [[deprecated("Use field access instead!")]] int*& dyn_controlIndexToBindingIndex();
      // Get instance field reference: public System.UInt16* controlGroupingAndComplexity
      [[deprecated("Use field access instead!")]] uint16_t*& dyn_controlGroupingAndComplexity();
      // Get instance field reference: public System.Boolean controlGroupingInitialized
      [[deprecated("Use field access instead!")]] bool& dyn_controlGroupingInitialized();
      // Get instance field reference: public UnityEngine.InputSystem.InputActionState/ActionMapIndices* mapIndices
      [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::InputActionState::ActionMapIndices*& dyn_mapIndices();
      // public System.Boolean get_isAllocated()
      // Offset: 0x50ACF30
      bool get_isAllocated();
      // public System.Int32 get_sizeInBytes()
      // Offset: 0x50ACF40
      int get_sizeInBytes();
      // public System.Void Allocate(System.Int32 mapCount, System.Int32 actionCount, System.Int32 bindingCount, System.Int32 controlCount, System.Int32 interactionCount, System.Int32 compositeCount)
      // Offset: 0x50ACF8C
      void Allocate(int mapCount, int actionCount, int bindingCount, int controlCount, int interactionCount, int compositeCount);
      // public System.Void Dispose()
      // Offset: 0x50A5F68
      void Dispose();
      // public System.Void CopyDataFrom(UnityEngine.InputSystem.InputActionState/UnmanagedMemory memory)
      // Offset: 0x50AD0B4
      void CopyDataFrom(::UnityEngine::InputSystem::InputActionState::UnmanagedMemory memory);
      // public UnityEngine.InputSystem.InputActionState/UnmanagedMemory Clone()
      // Offset: 0x50A6138
      ::UnityEngine::InputSystem::InputActionState::UnmanagedMemory Clone();
    }; // UnityEngine.InputSystem.InputActionState/UnmanagedMemory
    #pragma pack(pop)
    static check_size<sizeof(InputActionState::UnmanagedMemory), 120 + sizeof(::UnityEngine::InputSystem::InputActionState::ActionMapIndices*)> __UnityEngine_InputSystem_InputActionState_UnmanagedMemorySizeCheck;
    static_assert(sizeof(InputActionState::UnmanagedMemory) == 0x80);
    // WARNING Size may be invalid!
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.InputSystem.InputActionState/GlobalState
    // [TokenAttribute] Offset: FFFFFFFF
    struct GlobalState/*, public ::System::ValueType*/ {
      public:
      public:
      // UnityEngine.InputSystem.Utilities.InlinedArray`1<System.Runtime.InteropServices.GCHandle> globalList
      // Size: 0xFFFFFFFF
      // Offset: 0x0
      ::UnityEngine::InputSystem::Utilities::InlinedArray_1<::System::Runtime::InteropServices::GCHandle> globalList;
      // UnityEngine.InputSystem.Utilities.CallbackArray`1<System.Action`2<System.Object,UnityEngine.InputSystem.InputActionChange>> onActionChange
      // Size: 0xFFFFFFFF
      // Offset: 0x18
      ::UnityEngine::InputSystem::Utilities::CallbackArray_1<::System::Action_2<::Il2CppObject*, ::UnityEngine::InputSystem::InputActionChange>*> onActionChange;
      // UnityEngine.InputSystem.Utilities.CallbackArray`1<System.Action`1<System.Object>> onActionControlsChanged
      // Size: 0xFFFFFFFF
      // Offset: 0x68
      ::UnityEngine::InputSystem::Utilities::CallbackArray_1<::System::Action_1<::Il2CppObject*>*> onActionControlsChanged;
      public:
      // Creating value type constructor for type: GlobalState
      constexpr GlobalState(::UnityEngine::InputSystem::Utilities::InlinedArray_1<::System::Runtime::InteropServices::GCHandle> globalList_ = {}, ::UnityEngine::InputSystem::Utilities::CallbackArray_1<::System::Action_2<::Il2CppObject*, ::UnityEngine::InputSystem::InputActionChange>*> onActionChange_ = {}, ::UnityEngine::InputSystem::Utilities::CallbackArray_1<::System::Action_1<::Il2CppObject*>*> onActionControlsChanged_ = {}) noexcept : globalList{globalList_}, onActionChange{onActionChange_}, onActionControlsChanged{onActionControlsChanged_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: UnityEngine.InputSystem.Utilities.InlinedArray`1<System.Runtime.InteropServices.GCHandle> globalList
      [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::Utilities::InlinedArray_1<::System::Runtime::InteropServices::GCHandle>& dyn_globalList();
      // Get instance field reference: UnityEngine.InputSystem.Utilities.CallbackArray`1<System.Action`2<System.Object,UnityEngine.InputSystem.InputActionChange>> onActionChange
      [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::Utilities::CallbackArray_1<::System::Action_2<::Il2CppObject*, ::UnityEngine::InputSystem::InputActionChange>*>& dyn_onActionChange();
      // Get instance field reference: UnityEngine.InputSystem.Utilities.CallbackArray`1<System.Action`1<System.Object>> onActionControlsChanged
      [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::Utilities::CallbackArray_1<::System::Action_1<::Il2CppObject*>*>& dyn_onActionControlsChanged();
    }; // UnityEngine.InputSystem.InputActionState/GlobalState
    // WARNING Not writing size check since size may be invalid!
    public:
    // public UnityEngine.InputSystem.InputActionMap[] maps
    // Size: 0x8
    // Offset: 0x10
    ::ArrayW<::UnityEngine::InputSystem::InputActionMap*> maps;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::InputSystem::InputActionMap*>) == 0x8);
    // public UnityEngine.InputSystem.InputControl[] controls
    // Size: 0x8
    // Offset: 0x18
    ::ArrayW<::UnityEngine::InputSystem::InputControl*> controls;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::InputSystem::InputControl*>) == 0x8);
    // public UnityEngine.InputSystem.IInputInteraction[] interactions
    // Size: 0x8
    // Offset: 0x20
    ::ArrayW<::UnityEngine::InputSystem::IInputInteraction*> interactions;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::InputSystem::IInputInteraction*>) == 0x8);
    // public UnityEngine.InputSystem.InputProcessor[] processors
    // Size: 0x8
    // Offset: 0x28
    ::ArrayW<::UnityEngine::InputSystem::InputProcessor*> processors;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::InputSystem::InputProcessor*>) == 0x8);
    // public UnityEngine.InputSystem.InputBindingComposite[] composites
    // Size: 0x8
    // Offset: 0x30
    ::ArrayW<::UnityEngine::InputSystem::InputBindingComposite*> composites;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::InputSystem::InputBindingComposite*>) == 0x8);
    // public System.Int32 totalProcessorCount
    // Size: 0x4
    // Offset: 0x38
    int totalProcessorCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: totalProcessorCount and: memory
    char __padding5[0x4] = {};
    // public UnityEngine.InputSystem.InputActionState/UnmanagedMemory memory
    // Size: 0x80
    // Offset: 0x40
    ::UnityEngine::InputSystem::InputActionState::UnmanagedMemory memory;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionState::UnmanagedMemory) == 0x80);
    // private System.Boolean m_OnBeforeUpdateHooked
    // Size: 0x1
    // Offset: 0xC0
    bool m_OnBeforeUpdateHooked;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_OnAfterUpdateHooked
    // Size: 0x1
    // Offset: 0xC1
    bool m_OnAfterUpdateHooked;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_InProcessControlStateChange
    // Size: 0x1
    // Offset: 0xC2
    bool m_InProcessControlStateChange;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_InProcessControlStateChange and: m_CurrentlyProcessingThisEvent
    char __padding9[0x5] = {};
    // private UnityEngine.InputSystem.LowLevel.InputEventPtr m_CurrentlyProcessingThisEvent
    // Size: 0x8
    // Offset: 0xC8
    ::UnityEngine::InputSystem::LowLevel::InputEventPtr m_CurrentlyProcessingThisEvent;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::LowLevel::InputEventPtr) == 0x8);
    // private System.Action m_OnBeforeUpdateDelegate
    // Size: 0x8
    // Offset: 0xD0
    ::System::Action* m_OnBeforeUpdateDelegate;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private System.Action m_OnAfterUpdateDelegate
    // Size: 0x8
    // Offset: 0xD8
    ::System::Action* m_OnAfterUpdateDelegate;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::UnityEngine::InputSystem::LowLevel::IInputStateChangeMonitor
    operator ::UnityEngine::InputSystem::LowLevel::IInputStateChangeMonitor() noexcept {
      return *reinterpret_cast<::UnityEngine::InputSystem::LowLevel::IInputStateChangeMonitor*>(this);
    }
    // Creating interface conversion operator: operator ::System::ICloneable
    operator ::System::ICloneable() noexcept {
      return *reinterpret_cast<::System::ICloneable*>(this);
    }
    // Creating interface conversion operator: operator ::System::IDisposable
    operator ::System::IDisposable() noexcept {
      return *reinterpret_cast<::System::IDisposable*>(this);
    }
    // static field const value: static public System.Int32 kInvalidIndex
    static constexpr const int kInvalidIndex = -1;
