// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.InputSystem.InputActionState
#include "UnityEngine/InputSystem/InputActionState.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::InputSystem
namespace UnityEngine::InputSystem {
  // Forward declaring type: InputActionPhase
  struct InputActionPhase;
}
// Completed forward declares
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::InputSystem::InputActionState::TriggerState, "UnityEngine.InputSystem", "InputActionState/TriggerState");
// Type namespace: UnityEngine.InputSystem
namespace UnityEngine::InputSystem {
  // Size: 0x30
  #pragma pack(push, 1)
  // WARNING Layout: Explicit may not be correctly taken into account!
  // Autogenerated type: UnityEngine.InputSystem.InputActionState/TriggerState
  // [TokenAttribute] Offset: FFFFFFFF
  struct InputActionState::TriggerState/*, public ::System::ValueType*/ {
    public:
    // Nested type: ::UnityEngine::InputSystem::InputActionState::TriggerState::Flags
    struct Flags;
    public:
    // private System.Byte m_Phase
    // Size: 0x1
    // Offset: 0x0
    uint8_t m_Phase;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Byte m_Flags
    // Size: 0x1
    // Offset: 0x1
    uint8_t m_Flags;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Byte m_MapIndex
    // Size: 0x1
    // Offset: 0x2
    uint8_t m_MapIndex;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // Padding between fields: m_MapIndex and: m_ControlIndex
    char __padding2[0x1] = {};
    // private System.UInt16 m_ControlIndex
    // Size: 0x2
    // Offset: 0x4
    uint16_t m_ControlIndex;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // Padding between fields: m_ControlIndex and: m_Time
    char __padding3[0x2] = {};
    // private System.Double m_Time
    // Size: 0x8
    // Offset: 0x8
    double m_Time;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private System.Double m_StartTime
    // Size: 0x8
    // Offset: 0x10
    double m_StartTime;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private System.UInt16 m_BindingIndex
    // Size: 0x2
    // Offset: 0x18
    uint16_t m_BindingIndex;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // private System.UInt16 m_InteractionIndex
    // Size: 0x2
    // Offset: 0x1A
    uint16_t m_InteractionIndex;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // private System.Single m_Magnitude
    // Size: 0x4
    // Offset: 0x1C
    float m_Magnitude;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.UInt32 m_LastPerformedInUpdate
    // Size: 0x4
    // Offset: 0x20
    uint m_LastPerformedInUpdate;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 m_LastCanceledInUpdate
    // Size: 0x4
    // Offset: 0x24
    uint m_LastCanceledInUpdate;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 m_PressedInUpdate
    // Size: 0x4
    // Offset: 0x28
    uint m_PressedInUpdate;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 m_ReleasedInUpdate
    // Size: 0x4
    // Offset: 0x2C
    uint m_ReleasedInUpdate;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    public:
    // Creating value type constructor for type: TriggerState
