// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include <initializer_list>
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: Meta.WitAi.Speech.ISpeechEventProvider
#include "Meta/WitAi/Speech/ISpeechEventProvider.hpp"
// Including type: System.DateTime
#include "System/DateTime.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Queue`1<T>
  template<typename T>
  class Queue_1;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: Meta::WitAi::TTS::Utilities
namespace Meta::WitAi::TTS::Utilities {
  // Forward declaring type: TTSSpeakerEvents
  class TTSSpeakerEvents;
  // Skipping declaration: TTSSpeakerRequestData because it is already included!
  // Forward declaring type: TTSSpeakerClipEvents
  class TTSSpeakerClipEvents;
}
// Forward declaring namespace: Meta::WitAi::TTS
namespace Meta::WitAi::TTS {
  // Forward declaring type: TTSService
  class TTSService;
}
// Forward declaring namespace: Meta::WitAi::TTS::Integrations
namespace Meta::WitAi::TTS::Integrations {
  // Forward declaring type: TTSWitVoiceSettings
  class TTSWitVoiceSettings;
}
// Forward declaring namespace: Meta::WitAi::TTS::Data
namespace Meta::WitAi::TTS::Data {
  // Forward declaring type: TTSVoiceSettings
  class TTSVoiceSettings;
  // Forward declaring type: TTSClipData
  class TTSClipData;
  // Forward declaring type: TTSDiskCacheSettings
  class TTSDiskCacheSettings;
}
// Forward declaring namespace: Meta::WitAi::TTS::Interfaces
namespace Meta::WitAi::TTS::Interfaces {
  // Forward declaring type: ISpeakerTextPreprocessor
  class ISpeakerTextPreprocessor;
  // Forward declaring type: ISpeakerTextPostprocessor
  class ISpeakerTextPostprocessor;
}
// Forward declaring namespace: Meta::Voice::Audio
namespace Meta::Voice::Audio {
  // Forward declaring type: IAudioPlayer
  class IAudioPlayer;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Coroutine
  class Coroutine;
  // Forward declaring type: AudioSource
  class AudioSource;
}
// Forward declaring namespace: Meta::WitAi::Speech
namespace Meta::WitAi::Speech {
  // Forward declaring type: VoiceSpeechEvents
  class VoiceSpeechEvents;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Forward declaring namespace: Meta::WitAi::Json
namespace Meta::WitAi::Json {
  // Forward declaring type: WitResponseNode
  class WitResponseNode;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Func`2<T, TResult>
  template<typename T, typename TResult>
  class Func_2;
}
// Completed forward declares
// Type namespace: Meta.WitAi.TTS.Utilities
namespace Meta::WitAi::TTS::Utilities {
  // Forward declaring type: TTSSpeaker
  class TTSSpeaker;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Meta::WitAi::TTS::Utilities::TTSSpeaker);
DEFINE_IL2CPP_ARG_TYPE(::Meta::WitAi::TTS::Utilities::TTSSpeaker*, "Meta.WitAi.TTS.Utilities", "TTSSpeaker");
// Type namespace: Meta.WitAi.TTS.Utilities
namespace Meta::WitAi::TTS::Utilities {
  // Size: 0xA9
  #pragma pack(push, 1)
  // Autogenerated type: Meta.WitAi.TTS.Utilities.TTSSpeaker
  // [TokenAttribute] Offset: FFFFFFFF
  class TTSSpeaker : public ::UnityEngine::MonoBehaviour/*, public ::Meta::WitAi::Speech::ISpeechEventProvider*/ {
    public:
    // Nested type: ::Meta::WitAi::TTS::Utilities::TTSSpeaker::TTSSpeakerRequestData
    struct TTSSpeakerRequestData;
    // Nested type: ::Meta::WitAi::TTS::Utilities::TTSSpeaker::$$c__DisplayClass104_0
    class $$c__DisplayClass104_0;
    // Nested type: ::Meta::WitAi::TTS::Utilities::TTSSpeaker::$$c__DisplayClass118_0
    class $$c__DisplayClass118_0;
    // Nested type: ::Meta::WitAi::TTS::Utilities::TTSSpeaker::$$c__DisplayClass119_0
    class $$c__DisplayClass119_0;
    // Nested type: ::Meta::WitAi::TTS::Utilities::TTSSpeaker::$$c__DisplayClass54_0
    class $$c__DisplayClass54_0;
    // Nested type: ::Meta::WitAi::TTS::Utilities::TTSSpeaker::$SpeakAsync$d__63
    class $SpeakAsync$d__63;
    // Nested type: ::Meta::WitAi::TTS::Utilities::TTSSpeaker::$SpeakAsync$d__64
    class $SpeakAsync$d__64;
    // Nested type: ::Meta::WitAi::TTS::Utilities::TTSSpeaker::$SpeakAsync$d__65
    class $SpeakAsync$d__65;
    // Nested type: ::Meta::WitAi::TTS::Utilities::TTSSpeaker::$SpeakAsync$d__66
    class $SpeakAsync$d__66;
    // Nested type: ::Meta::WitAi::TTS::Utilities::TTSSpeaker::$SpeakAsync$d__90
    class $SpeakAsync$d__90;
    // Nested type: ::Meta::WitAi::TTS::Utilities::TTSSpeaker::$SpeakAsync$d__91
    class $SpeakAsync$d__91;
    // Nested type: ::Meta::WitAi::TTS::Utilities::TTSSpeaker::$SpeakAsync$d__92
    class $SpeakAsync$d__92;
    // Nested type: ::Meta::WitAi::TTS::Utilities::TTSSpeaker::$SpeakAsync$d__93
    class $SpeakAsync$d__93;
    // Nested type: ::Meta::WitAi::TTS::Utilities::TTSSpeaker::$SpeakQueuedAsync$d__100
    class $SpeakQueuedAsync$d__100;
    // Nested type: ::Meta::WitAi::TTS::Utilities::TTSSpeaker::$SpeakQueuedAsync$d__101
    class $SpeakQueuedAsync$d__101;
    // Nested type: ::Meta::WitAi::TTS::Utilities::TTSSpeaker::$SpeakQueuedAsync$d__102
    class $SpeakQueuedAsync$d__102;
    // Nested type: ::Meta::WitAi::TTS::Utilities::TTSSpeaker::$SpeakQueuedAsync$d__103
    class $SpeakQueuedAsync$d__103;
    // Nested type: ::Meta::WitAi::TTS::Utilities::TTSSpeaker::$SpeakQueuedAsync$d__72
    class $SpeakQueuedAsync$d__72;
    // Nested type: ::Meta::WitAi::TTS::Utilities::TTSSpeaker::$SpeakQueuedAsync$d__73
    class $SpeakQueuedAsync$d__73;
    // Nested type: ::Meta::WitAi::TTS::Utilities::TTSSpeaker::$SpeakQueuedAsync$d__74
    class $SpeakQueuedAsync$d__74;
    // Nested type: ::Meta::WitAi::TTS::Utilities::TTSSpeaker::$SpeakQueuedAsync$d__75
    class $SpeakQueuedAsync$d__75;
    // Nested type: ::Meta::WitAi::TTS::Utilities::TTSSpeaker::$SpeakQueuedAsync$d__99
    class $SpeakQueuedAsync$d__99;
    // Nested type: ::Meta::WitAi::TTS::Utilities::TTSSpeaker::$WaitForCompletion$d__54
    class $WaitForCompletion$d__54;
    // Nested type: ::Meta::WitAi::TTS::Utilities::TTSSpeaker::$WaitForPlaybackComplete$d__108
    class $WaitForPlaybackComplete$d__108;
    // Size: 0x20
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: Meta.WitAi.TTS.Utilities.TTSSpeaker/TTSSpeakerRequestData
    // [TokenAttribute] Offset: FFFFFFFF
    struct TTSSpeakerRequestData/*, public ::System::ValueType*/ {
      public:
      public:
      // public Meta.WitAi.TTS.Data.TTSClipData ClipData
      // Size: 0x8
      // Offset: 0x0
      ::Meta::WitAi::TTS::Data::TTSClipData* ClipData;
      // Field size check
      static_assert(sizeof(::Meta::WitAi::TTS::Data::TTSClipData*) == 0x8);
      // public System.DateTime StartTime
      // Size: 0x8
      // Offset: 0x8
      ::System::DateTime StartTime;
      // Field size check
      static_assert(sizeof(::System::DateTime) == 0x8);
      // public System.Boolean StopQueueOnLoad
      // Size: 0x1
      // Offset: 0x10
      bool StopQueueOnLoad;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // Padding between fields: StopQueueOnLoad and: PlaybackEvents
      char __padding2[0x7] = {};
      // public Meta.WitAi.TTS.Utilities.TTSSpeakerClipEvents PlaybackEvents
      // Size: 0x8
      // Offset: 0x18
      ::Meta::WitAi::TTS::Utilities::TTSSpeakerClipEvents* PlaybackEvents;
      // Field size check
      static_assert(sizeof(::Meta::WitAi::TTS::Utilities::TTSSpeakerClipEvents*) == 0x8);
      public:
      // Creating value type constructor for type: TTSSpeakerRequestData
      constexpr TTSSpeakerRequestData(::Meta::WitAi::TTS::Data::TTSClipData* ClipData_ = {}, ::System::DateTime StartTime_ = {}, bool StopQueueOnLoad_ = {}, ::Meta::WitAi::TTS::Utilities::TTSSpeakerClipEvents* PlaybackEvents_ = {}) noexcept : ClipData{ClipData_}, StartTime{StartTime_}, StopQueueOnLoad{StopQueueOnLoad_}, PlaybackEvents{PlaybackEvents_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public Meta.WitAi.TTS.Data.TTSClipData ClipData
      [[deprecated("Use field access instead!")]] ::Meta::WitAi::TTS::Data::TTSClipData*& dyn_ClipData();
      // Get instance field reference: public System.DateTime StartTime
      [[deprecated("Use field access instead!")]] ::System::DateTime& dyn_StartTime();
      // Get instance field reference: public System.Boolean StopQueueOnLoad
      [[deprecated("Use field access instead!")]] bool& dyn_StopQueueOnLoad();
      // Get instance field reference: public Meta.WitAi.TTS.Utilities.TTSSpeakerClipEvents PlaybackEvents
      [[deprecated("Use field access instead!")]] ::Meta::WitAi::TTS::Utilities::TTSSpeakerClipEvents*& dyn_PlaybackEvents();
    }; // Meta.WitAi.TTS.Utilities.TTSSpeaker/TTSSpeakerRequestData
    #pragma pack(pop)
    static check_size<sizeof(TTSSpeaker::TTSSpeakerRequestData), 24 + sizeof(::Meta::WitAi::TTS::Utilities::TTSSpeakerClipEvents*)> __Meta_WitAi_TTS_Utilities_TTSSpeaker_TTSSpeakerRequestDataSizeCheck;
    static_assert(sizeof(TTSSpeaker::TTSSpeakerRequestData) == 0x20);
    public:
    // private Meta.WitAi.TTS.Utilities.TTSSpeakerEvents _events
    // Size: 0x8
    // Offset: 0x20
    ::Meta::WitAi::TTS::Utilities::TTSSpeakerEvents* events;
    // Field size check
    static_assert(sizeof(::Meta::WitAi::TTS::Utilities::TTSSpeakerEvents*) == 0x8);
    // public System.String PrependedText
    // Size: 0x8
    // Offset: 0x28
    ::StringW PrependedText;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String AppendedText
    // Size: 0x8
    // Offset: 0x30
    ::StringW AppendedText;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private Meta.WitAi.TTS.TTSService _ttsService
    // Size: 0x8
    // Offset: 0x38
    ::Meta::WitAi::TTS::TTSService* ttsService;
    // Field size check
    static_assert(sizeof(::Meta::WitAi::TTS::TTSService*) == 0x8);
    // public System.String presetVoiceID
    // Size: 0x8
    // Offset: 0x40
    ::StringW presetVoiceID;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public Meta.WitAi.TTS.Integrations.TTSWitVoiceSettings customWitVoiceSettings
    // Size: 0x8
    // Offset: 0x48
    ::Meta::WitAi::TTS::Integrations::TTSWitVoiceSettings* customWitVoiceSettings;
    // Field size check
    static_assert(sizeof(::Meta::WitAi::TTS::Integrations::TTSWitVoiceSettings*) == 0x8);
    // private Meta.WitAi.TTS.Data.TTSVoiceSettings _overrideVoiceSettings
    // Size: 0x8
    // Offset: 0x50
    ::Meta::WitAi::TTS::Data::TTSVoiceSettings* overrideVoiceSettings;
    // Field size check
    static_assert(sizeof(::Meta::WitAi::TTS::Data::TTSVoiceSettings*) == 0x8);
    // protected Meta.WitAi.TTS.Utilities.TTSSpeaker/TTSSpeakerRequestData _speakingRequest
    // Size: 0x20
    // Offset: 0x58
    ::Meta::WitAi::TTS::Utilities::TTSSpeaker::TTSSpeakerRequestData speakingRequest;
    // Field size check
    static_assert(sizeof(::Meta::WitAi::TTS::Utilities::TTSSpeaker::TTSSpeakerRequestData) == 0x20);
    // private System.Collections.Generic.Queue`1<Meta.WitAi.TTS.Utilities.TTSSpeaker/TTSSpeakerRequestData> _queuedRequests
    // Size: 0x8
    // Offset: 0x78
    ::System::Collections::Generic::Queue_1<::Meta::WitAi::TTS::Utilities::TTSSpeaker::TTSSpeakerRequestData>* queuedRequests;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Queue_1<::Meta::WitAi::TTS::Utilities::TTSSpeaker::TTSSpeakerRequestData>*) == 0x8);
    // private System.Boolean _hasQueue
    // Size: 0x1
    // Offset: 0x80
    bool hasQueue;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _willHaveQueue
    // Size: 0x1
    // Offset: 0x81
    bool willHaveQueue;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: willHaveQueue and: textPreprocessors
    char __padding10[0x6] = {};
    // private Meta.WitAi.TTS.Interfaces.ISpeakerTextPreprocessor[] _textPreprocessors
    // Size: 0x8
    // Offset: 0x88
    ::ArrayW<::Meta::WitAi::TTS::Interfaces::ISpeakerTextPreprocessor*> textPreprocessors;
    // Field size check
    static_assert(sizeof(::ArrayW<::Meta::WitAi::TTS::Interfaces::ISpeakerTextPreprocessor*>) == 0x8);
    // private Meta.WitAi.TTS.Interfaces.ISpeakerTextPostprocessor[] _textPostprocessors
    // Size: 0x8
    // Offset: 0x90
    ::ArrayW<::Meta::WitAi::TTS::Interfaces::ISpeakerTextPostprocessor*> textPostprocessors;
    // Field size check
    static_assert(sizeof(::ArrayW<::Meta::WitAi::TTS::Interfaces::ISpeakerTextPostprocessor*>) == 0x8);
    // private Meta.Voice.Audio.IAudioPlayer _audioPlayer
    // Size: 0x8
    // Offset: 0x98
    ::Meta::Voice::Audio::IAudioPlayer* audioPlayer;
    // Field size check
    static_assert(sizeof(::Meta::Voice::Audio::IAudioPlayer*) == 0x8);
    // private UnityEngine.Coroutine _waitForCompletion
    // Size: 0x8
    // Offset: 0xA0
    ::UnityEngine::Coroutine* waitForCompletion;
    // Field size check
    static_assert(sizeof(::UnityEngine::Coroutine*) == 0x8);
    // private System.Boolean <IsPaused>k__BackingField
    // Size: 0x1
    // Offset: 0xA8
    bool IsPaused;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating interface conversion operator: operator ::Meta::WitAi::Speech::ISpeechEventProvider
    operator ::Meta::WitAi::Speech::ISpeechEventProvider() noexcept {
      return *reinterpret_cast<::Meta::WitAi::Speech::ISpeechEventProvider*>(this);
    }
    // Get instance field reference: private Meta.WitAi.TTS.Utilities.TTSSpeakerEvents _events
    [[deprecated("Use field access instead!")]] ::Meta::WitAi::TTS::Utilities::TTSSpeakerEvents*& dyn__events();
    // Get instance field reference: public System.String PrependedText
    [[deprecated("Use field access instead!")]] ::StringW& dyn_PrependedText();
    // Get instance field reference: public System.String AppendedText
    [[deprecated("Use field access instead!")]] ::StringW& dyn_AppendedText();
    // Get instance field reference: private Meta.WitAi.TTS.TTSService _ttsService
