// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: BoingKit.BoingBase
#include "BoingKit/BoingBase.hpp"
// Including type: BoingKit.Aabb
#include "BoingKit/Aabb.hpp"
// Including type: BoingKit.BoingWork/Params
#include "BoingKit/BoingWork_Params.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: ComputeBuffer
  class ComputeBuffer;
  // Forward declaring type: ComputeShader
  class ComputeShader;
  // Forward declaring type: MaterialPropertyBlock
  class MaterialPropertyBlock;
  // Forward declaring type: Material
  class Material;
  // Skipping declaration: Vector4 because it is already included!
}
// Forward declaring namespace: BoingKit
namespace BoingKit {
  // Forward declaring type: SharedBoingParams
  class SharedBoingParams;
  // Skipping declaration: BoingEffector because it is already included!
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Completed forward declares
// Type namespace: BoingKit
namespace BoingKit {
  // Forward declaring type: BoingReactorField
  class BoingReactorField;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::BoingKit::BoingReactorField);
DEFINE_IL2CPP_ARG_TYPE(::BoingKit::BoingReactorField*, "BoingKit", "BoingReactorField");
// Type namespace: BoingKit
namespace BoingKit {
  // Size: 0x308
  #pragma pack(push, 1)
  // Autogenerated type: BoingKit.BoingReactorField
  // [TokenAttribute] Offset: FFFFFFFF
  class BoingReactorField : public ::BoingKit::BoingBase {
    public:
    // Nested type: ::BoingKit::BoingReactorField::HardwareModeEnum
    struct HardwareModeEnum;
    // Nested type: ::BoingKit::BoingReactorField::CellMoveModeEnum
    struct CellMoveModeEnum;
    // Nested type: ::BoingKit::BoingReactorField::FalloffModeEnum
    struct FalloffModeEnum;
    // Nested type: ::BoingKit::BoingReactorField::FalloffDimensionsEnum
    struct FalloffDimensionsEnum;
    // Nested type: ::BoingKit::BoingReactorField::ShaderPropertyIdSet
    class ShaderPropertyIdSet;
    // Nested type: ::BoingKit::BoingReactorField::FieldParams
    struct FieldParams;
    // Nested type: ::BoingKit::BoingReactorField::ComputeKernelId
    class ComputeKernelId;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: BoingKit.BoingReactorField/HardwareModeEnum
    // [TokenAttribute] Offset: FFFFFFFF
    struct HardwareModeEnum/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: HardwareModeEnum
      constexpr HardwareModeEnum(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public BoingKit.BoingReactorField/HardwareModeEnum CPU
      static constexpr const int CPU = 0;
      // Get static field: static public BoingKit.BoingReactorField/HardwareModeEnum CPU
      static ::BoingKit::BoingReactorField::HardwareModeEnum _get_CPU();
      // Set static field: static public BoingKit.BoingReactorField/HardwareModeEnum CPU
      static void _set_CPU(::BoingKit::BoingReactorField::HardwareModeEnum value);
      // static field const value: static public BoingKit.BoingReactorField/HardwareModeEnum GPU
      static constexpr const int GPU = 1;
      // Get static field: static public BoingKit.BoingReactorField/HardwareModeEnum GPU
      static ::BoingKit::BoingReactorField::HardwareModeEnum _get_GPU();
      // Set static field: static public BoingKit.BoingReactorField/HardwareModeEnum GPU
      static void _set_GPU(::BoingKit::BoingReactorField::HardwareModeEnum value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // BoingKit.BoingReactorField/HardwareModeEnum
    #pragma pack(pop)
    static check_size<sizeof(BoingReactorField::HardwareModeEnum), 0 + sizeof(int)> __BoingKit_BoingReactorField_HardwareModeEnumSizeCheck;
    static_assert(sizeof(BoingReactorField::HardwareModeEnum) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: BoingKit.BoingReactorField/CellMoveModeEnum
    // [TokenAttribute] Offset: FFFFFFFF
    struct CellMoveModeEnum/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: CellMoveModeEnum
      constexpr CellMoveModeEnum(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public BoingKit.BoingReactorField/CellMoveModeEnum Follow
      static constexpr const int Follow = 0;
      // Get static field: static public BoingKit.BoingReactorField/CellMoveModeEnum Follow
      static ::BoingKit::BoingReactorField::CellMoveModeEnum _get_Follow();
      // Set static field: static public BoingKit.BoingReactorField/CellMoveModeEnum Follow
      static void _set_Follow(::BoingKit::BoingReactorField::CellMoveModeEnum value);
      // static field const value: static public BoingKit.BoingReactorField/CellMoveModeEnum WrapAround
      static constexpr const int WrapAround = 1;
      // Get static field: static public BoingKit.BoingReactorField/CellMoveModeEnum WrapAround
      static ::BoingKit::BoingReactorField::CellMoveModeEnum _get_WrapAround();
      // Set static field: static public BoingKit.BoingReactorField/CellMoveModeEnum WrapAround
      static void _set_WrapAround(::BoingKit::BoingReactorField::CellMoveModeEnum value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // BoingKit.BoingReactorField/CellMoveModeEnum
    #pragma pack(pop)
    static check_size<sizeof(BoingReactorField::CellMoveModeEnum), 0 + sizeof(int)> __BoingKit_BoingReactorField_CellMoveModeEnumSizeCheck;
    static_assert(sizeof(BoingReactorField::CellMoveModeEnum) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: BoingKit.BoingReactorField/FalloffModeEnum
    // [TokenAttribute] Offset: FFFFFFFF
    struct FalloffModeEnum/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: FalloffModeEnum
      constexpr FalloffModeEnum(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public BoingKit.BoingReactorField/FalloffModeEnum None
      static constexpr const int None = 0;
      // Get static field: static public BoingKit.BoingReactorField/FalloffModeEnum None
      static ::BoingKit::BoingReactorField::FalloffModeEnum _get_None();
      // Set static field: static public BoingKit.BoingReactorField/FalloffModeEnum None
      static void _set_None(::BoingKit::BoingReactorField::FalloffModeEnum value);
      // static field const value: static public BoingKit.BoingReactorField/FalloffModeEnum Circle
      static constexpr const int Circle = 1;
      // Get static field: static public BoingKit.BoingReactorField/FalloffModeEnum Circle
      static ::BoingKit::BoingReactorField::FalloffModeEnum _get_Circle();
      // Set static field: static public BoingKit.BoingReactorField/FalloffModeEnum Circle
      static void _set_Circle(::BoingKit::BoingReactorField::FalloffModeEnum value);
      // static field const value: static public BoingKit.BoingReactorField/FalloffModeEnum Square
      static constexpr const int Square = 2;
      // Get static field: static public BoingKit.BoingReactorField/FalloffModeEnum Square
      static ::BoingKit::BoingReactorField::FalloffModeEnum _get_Square();
      // Set static field: static public BoingKit.BoingReactorField/FalloffModeEnum Square
      static void _set_Square(::BoingKit::BoingReactorField::FalloffModeEnum value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // BoingKit.BoingReactorField/FalloffModeEnum
    #pragma pack(pop)
    static check_size<sizeof(BoingReactorField::FalloffModeEnum), 0 + sizeof(int)> __BoingKit_BoingReactorField_FalloffModeEnumSizeCheck;
    static_assert(sizeof(BoingReactorField::FalloffModeEnum) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: BoingKit.BoingReactorField/FalloffDimensionsEnum
    // [TokenAttribute] Offset: FFFFFFFF
    struct FalloffDimensionsEnum/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: FalloffDimensionsEnum
      constexpr FalloffDimensionsEnum(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public BoingKit.BoingReactorField/FalloffDimensionsEnum XYZ
      static constexpr const int XYZ = 0;
      // Get static field: static public BoingKit.BoingReactorField/FalloffDimensionsEnum XYZ
      static ::BoingKit::BoingReactorField::FalloffDimensionsEnum _get_XYZ();
      // Set static field: static public BoingKit.BoingReactorField/FalloffDimensionsEnum XYZ
      static void _set_XYZ(::BoingKit::BoingReactorField::FalloffDimensionsEnum value);
      // static field const value: static public BoingKit.BoingReactorField/FalloffDimensionsEnum XY
      static constexpr const int XY = 1;
      // Get static field: static public BoingKit.BoingReactorField/FalloffDimensionsEnum XY
      static ::BoingKit::BoingReactorField::FalloffDimensionsEnum _get_XY();
      // Set static field: static public BoingKit.BoingReactorField/FalloffDimensionsEnum XY
      static void _set_XY(::BoingKit::BoingReactorField::FalloffDimensionsEnum value);
      // static field const value: static public BoingKit.BoingReactorField/FalloffDimensionsEnum XZ
      static constexpr const int XZ = 2;
      // Get static field: static public BoingKit.BoingReactorField/FalloffDimensionsEnum XZ
      static ::BoingKit::BoingReactorField::FalloffDimensionsEnum _get_XZ();
      // Set static field: static public BoingKit.BoingReactorField/FalloffDimensionsEnum XZ
      static void _set_XZ(::BoingKit::BoingReactorField::FalloffDimensionsEnum value);
      // static field const value: static public BoingKit.BoingReactorField/FalloffDimensionsEnum YZ
      static constexpr const int YZ = 3;
      // Get static field: static public BoingKit.BoingReactorField/FalloffDimensionsEnum YZ
      static ::BoingKit::BoingReactorField::FalloffDimensionsEnum _get_YZ();
      // Set static field: static public BoingKit.BoingReactorField/FalloffDimensionsEnum YZ
      static void _set_YZ(::BoingKit::BoingReactorField::FalloffDimensionsEnum value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // BoingKit.BoingReactorField/FalloffDimensionsEnum
    #pragma pack(pop)
    static check_size<sizeof(BoingReactorField::FalloffDimensionsEnum), 0 + sizeof(int)> __BoingKit_BoingReactorField_FalloffDimensionsEnumSizeCheck;
    static_assert(sizeof(BoingReactorField::FalloffDimensionsEnum) == 0x4);
    // Size: 0x70
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: BoingKit.BoingReactorField/FieldParams
    // [TokenAttribute] Offset: FFFFFFFF
    struct FieldParams/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.Int32 CellsX
      // Size: 0x4
      // Offset: 0x0
      int CellsX;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Int32 CellsY
      // Size: 0x4
      // Offset: 0x4
      int CellsY;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Int32 CellsZ
      // Size: 0x4
      // Offset: 0x8
      int CellsZ;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Int32 NumEffectors
      // Size: 0x4
      // Offset: 0xC
      int NumEffectors;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Int32 iCellBaseX
      // Size: 0x4
      // Offset: 0x10
      int iCellBaseX;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Int32 iCellBaseY
      // Size: 0x4
      // Offset: 0x14
      int iCellBaseY;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Int32 iCellBaseZ
      // Size: 0x4
      // Offset: 0x18
      int iCellBaseZ;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Int32 m_padding0
      // Size: 0x4
      // Offset: 0x1C
      int m_padding0;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Int32 FalloffMode
      // Size: 0x4
      // Offset: 0x20
      int FalloffMode;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Int32 FalloffDimensions
      // Size: 0x4
      // Offset: 0x24
      int FalloffDimensions;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Int32 PropagationDepth
      // Size: 0x4
      // Offset: 0x28
      int PropagationDepth;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Int32 m_padding1
      // Size: 0x4
      // Offset: 0x2C
      int m_padding1;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public UnityEngine.Vector3 GridCenter
      // Size: 0xC
      // Offset: 0x30
      ::UnityEngine::Vector3 GridCenter;
      // Field size check
      static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
      // private System.Single m_padding3
      // Size: 0x4
      // Offset: 0x3C
      float m_padding3;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public UnityEngine.Vector3 UpWs
      // Size: 0xC
      // Offset: 0x40
      ::UnityEngine::Vector3 UpWs;
      // Field size check
      static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
      // private System.Single m_padding2
      // Size: 0x4
      // Offset: 0x4C
      float m_padding2;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public UnityEngine.Vector3 FieldPosition
      // Size: 0xC
      // Offset: 0x50
      ::UnityEngine::Vector3 FieldPosition;
      // Field size check
      static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
      // public System.Single m_padding4
      // Size: 0x4
      // Offset: 0x5C
      float m_padding4;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Single FalloffRatio
      // Size: 0x4
      // Offset: 0x60
      float FalloffRatio;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Single CellSize
      // Size: 0x4
      // Offset: 0x64
      float CellSize;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Single DeltaTime
      // Size: 0x4
      // Offset: 0x68
      float DeltaTime;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // private System.Single m_padding5
      // Size: 0x4
      // Offset: 0x6C
      float m_padding5;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      public:
      // Creating value type constructor for type: FieldParams
      constexpr FieldParams(int CellsX_ = {}, int CellsY_ = {}, int CellsZ_ = {}, int NumEffectors_ = {}, int iCellBaseX_ = {}, int iCellBaseY_ = {}, int iCellBaseZ_ = {}, int m_padding0_ = {}, int FalloffMode_ = {}, int FalloffDimensions_ = {}, int PropagationDepth_ = {}, int m_padding1_ = {}, ::UnityEngine::Vector3 GridCenter_ = {}, float m_padding3_ = {}, ::UnityEngine::Vector3 UpWs_ = {}, float m_padding2_ = {}, ::UnityEngine::Vector3 FieldPosition_ = {}, float m_padding4_ = {}, float FalloffRatio_ = {}, float CellSize_ = {}, float DeltaTime_ = {}, float m_padding5_ = {}) noexcept : CellsX{CellsX_}, CellsY{CellsY_}, CellsZ{CellsZ_}, NumEffectors{NumEffectors_}, iCellBaseX{iCellBaseX_}, iCellBaseY{iCellBaseY_}, iCellBaseZ{iCellBaseZ_}, m_padding0{m_padding0_}, FalloffMode{FalloffMode_}, FalloffDimensions{FalloffDimensions_}, PropagationDepth{PropagationDepth_}, m_padding1{m_padding1_}, GridCenter{GridCenter_}, m_padding3{m_padding3_}, UpWs{UpWs_}, m_padding2{m_padding2_}, FieldPosition{FieldPosition_}, m_padding4{m_padding4_}, FalloffRatio{FalloffRatio_}, CellSize{CellSize_}, DeltaTime{DeltaTime_}, m_padding5{m_padding5_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get static field: static public readonly System.Int32 Stride
      static int _get_Stride();
      // Set static field: static public readonly System.Int32 Stride
      static void _set_Stride(int value);
      // Get instance field reference: public System.Int32 CellsX
      [[deprecated("Use field access instead!")]] int& dyn_CellsX();
      // Get instance field reference: public System.Int32 CellsY
      [[deprecated("Use field access instead!")]] int& dyn_CellsY();
      // Get instance field reference: public System.Int32 CellsZ
      [[deprecated("Use field access instead!")]] int& dyn_CellsZ();
      // Get instance field reference: public System.Int32 NumEffectors
      [[deprecated("Use field access instead!")]] int& dyn_NumEffectors();
      // Get instance field reference: public System.Int32 iCellBaseX
      [[deprecated("Use field access instead!")]] int& dyn_iCellBaseX();
      // Get instance field reference: public System.Int32 iCellBaseY
      [[deprecated("Use field access instead!")]] int& dyn_iCellBaseY();
      // Get instance field reference: public System.Int32 iCellBaseZ
      [[deprecated("Use field access instead!")]] int& dyn_iCellBaseZ();
      // Get instance field reference: public System.Int32 m_padding0
      [[deprecated("Use field access instead!")]] int& dyn_m_padding0();
      // Get instance field reference: public System.Int32 FalloffMode
      [[deprecated("Use field access instead!")]] int& dyn_FalloffMode();
      // Get instance field reference: public System.Int32 FalloffDimensions
      [[deprecated("Use field access instead!")]] int& dyn_FalloffDimensions();
      // Get instance field reference: public System.Int32 PropagationDepth
      [[deprecated("Use field access instead!")]] int& dyn_PropagationDepth();
      // Get instance field reference: public System.Int32 m_padding1
      [[deprecated("Use field access instead!")]] int& dyn_m_padding1();
      // Get instance field reference: public UnityEngine.Vector3 GridCenter
      [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_GridCenter();
      // Get instance field reference: private System.Single m_padding3
      [[deprecated("Use field access instead!")]] float& dyn_m_padding3();
      // Get instance field reference: public UnityEngine.Vector3 UpWs
      [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_UpWs();
      // Get instance field reference: private System.Single m_padding2
      [[deprecated("Use field access instead!")]] float& dyn_m_padding2();
      // Get instance field reference: public UnityEngine.Vector3 FieldPosition
      [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_FieldPosition();
      // Get instance field reference: public System.Single m_padding4
      [[deprecated("Use field access instead!")]] float& dyn_m_padding4();
      // Get instance field reference: public System.Single FalloffRatio
      [[deprecated("Use field access instead!")]] float& dyn_FalloffRatio();
      // Get instance field reference: public System.Single CellSize
      [[deprecated("Use field access instead!")]] float& dyn_CellSize();
      // Get instance field reference: public System.Single DeltaTime
      [[deprecated("Use field access instead!")]] float& dyn_DeltaTime();
      // Get instance field reference: private System.Single m_padding5
      [[deprecated("Use field access instead!")]] float& dyn_m_padding5();
      // private System.Void SuppressWarnings()
      // Offset: 0x28F7C3C
      void SuppressWarnings();
      // static private System.Void .cctor()
      // Offset: 0x28F7C5C
      static void _cctor();
    }; // BoingKit.BoingReactorField/FieldParams
    #pragma pack(pop)
    static check_size<sizeof(BoingReactorField::FieldParams), 108 + sizeof(float)> __BoingKit_BoingReactorField_FieldParamsSizeCheck;
    static_assert(sizeof(BoingReactorField::FieldParams) == 0x70);
    public:
    // private BoingKit.BoingReactorField/FieldParams m_fieldParams
    // Size: 0x70
    // Offset: 0x44
    ::BoingKit::BoingReactorField::FieldParams m_fieldParams;
    // Field size check
    static_assert(sizeof(::BoingKit::BoingReactorField::FieldParams) == 0x70);
    // public BoingKit.BoingReactorField/HardwareModeEnum HardwareMode
    // Size: 0x4
    // Offset: 0xB4
    ::BoingKit::BoingReactorField::HardwareModeEnum HardwareMode;
    // Field size check
    static_assert(sizeof(::BoingKit::BoingReactorField::HardwareModeEnum) == 0x4);
    // private BoingKit.BoingReactorField/HardwareModeEnum m_hardwareMode
    // Size: 0x4
    // Offset: 0xB8
    ::BoingKit::BoingReactorField::HardwareModeEnum m_hardwareMode;
    // Field size check
    static_assert(sizeof(::BoingKit::BoingReactorField::HardwareModeEnum) == 0x4);
    // public BoingKit.BoingReactorField/CellMoveModeEnum CellMoveMode
    // Size: 0x4
    // Offset: 0xBC
    ::BoingKit::BoingReactorField::CellMoveModeEnum CellMoveMode;
    // Field size check
    static_assert(sizeof(::BoingKit::BoingReactorField::CellMoveModeEnum) == 0x4);
    // private BoingKit.BoingReactorField/CellMoveModeEnum m_cellMoveMode
    // Size: 0x4
    // Offset: 0xC0
    ::BoingKit::BoingReactorField::CellMoveModeEnum m_cellMoveMode;
    // Field size check
    static_assert(sizeof(::BoingKit::BoingReactorField::CellMoveModeEnum) == 0x4);
    // public System.Single CellSize
    // Size: 0x4
    // Offset: 0xC4
    float CellSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Int32 CellsX
    // Size: 0x4
    // Offset: 0xC8
    int CellsX;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 CellsY
    // Size: 0x4
    // Offset: 0xCC
    int CellsY;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 CellsZ
    // Size: 0x4
    // Offset: 0xD0
    int CellsZ;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_cellsX
    // Size: 0x4
    // Offset: 0xD4
    int m_cellsX;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_cellsY
    // Size: 0x4
    // Offset: 0xD8
    int m_cellsY;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_cellsZ
    // Size: 0x4
    // Offset: 0xDC
    int m_cellsZ;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_iCellBaseX
    // Size: 0x4
    // Offset: 0xE0
    int m_iCellBaseX;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_iCellBaseY
    // Size: 0x4
    // Offset: 0xE4
    int m_iCellBaseY;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_iCellBaseZ
    // Size: 0x4
    // Offset: 0xE8
    int m_iCellBaseZ;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public BoingKit.BoingReactorField/FalloffModeEnum FalloffMode
    // Size: 0x4
    // Offset: 0xEC
    ::BoingKit::BoingReactorField::FalloffModeEnum FalloffMode;
    // Field size check
    static_assert(sizeof(::BoingKit::BoingReactorField::FalloffModeEnum) == 0x4);
    // public System.Single FalloffRatio
    // Size: 0x4
    // Offset: 0xF0
    float FalloffRatio;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public BoingKit.BoingReactorField/FalloffDimensionsEnum FalloffDimensions
    // Size: 0x4
    // Offset: 0xF4
    ::BoingKit::BoingReactorField::FalloffDimensionsEnum FalloffDimensions;
    // Field size check
    static_assert(sizeof(::BoingKit::BoingReactorField::FalloffDimensionsEnum) == 0x4);
    // public BoingKit.BoingEffector[] Effectors
    // Size: 0x8
    // Offset: 0xF8
    ::ArrayW<::BoingKit::BoingEffector*> Effectors;
    // Field size check
    static_assert(sizeof(::ArrayW<::BoingKit::BoingEffector*>) == 0x8);
    // private System.Int32 m_numEffectors
    // Size: 0x4
    // Offset: 0x100
    int m_numEffectors;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private BoingKit.Aabb m_bounds
    // Size: 0x18
    // Offset: 0x104
    ::BoingKit::Aabb m_bounds;
    // Field size check
    static_assert(sizeof(::BoingKit::Aabb) == 0x18);
    // public System.Boolean TwoDDistanceCheck
    // Size: 0x1
    // Offset: 0x11C
    bool TwoDDistanceCheck;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean TwoDPositionInfluence
    // Size: 0x1
    // Offset: 0x11D
    bool TwoDPositionInfluence;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean TwoDRotationInfluence
    // Size: 0x1
    // Offset: 0x11E
    bool TwoDRotationInfluence;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean EnablePositionEffect
    // Size: 0x1
    // Offset: 0x11F
    bool EnablePositionEffect;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean EnableRotationEffect
    // Size: 0x1
    // Offset: 0x120
    bool EnableRotationEffect;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean GlobalReactionUpVector
    // Size: 0x1
    // Offset: 0x121
    bool GlobalReactionUpVector;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: GlobalReactionUpVector and: Params
    char __padding26[0x2] = {};
    // public BoingKit.BoingWork/Params Params
    // Size: 0x160
    // Offset: 0x124
    ::BoingKit::BoingWork::Params Params;
    // Field size check
    static_assert(sizeof(::BoingKit::BoingWork::Params) == 0x160);
    // Padding between fields: Params and: SharedParams
    char __padding27[0x4] = {};
    // public BoingKit.SharedBoingParams SharedParams
    // Size: 0x8
    // Offset: 0x288
    ::BoingKit::SharedBoingParams* SharedParams;
    // Field size check
    static_assert(sizeof(::BoingKit::SharedBoingParams*) == 0x8);
    // public System.Boolean EnablePropagation
    // Size: 0x1
    // Offset: 0x290
    bool EnablePropagation;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: EnablePropagation and: PositionPropagation
    char __padding29[0x3] = {};
    // public System.Single PositionPropagation
    // Size: 0x4
    // Offset: 0x294
    float PositionPropagation;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single RotationPropagation
    // Size: 0x4
    // Offset: 0x298
    float RotationPropagation;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Int32 PropagationDepth
    // Size: 0x4
    // Offset: 0x29C
    int PropagationDepth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Boolean AnchorPropagationAtBorder
    // Size: 0x1
    // Offset: 0x2A0
    bool AnchorPropagationAtBorder;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: AnchorPropagationAtBorder and: m_aCpuCell
    char __padding33[0x7] = {};
    // private BoingKit.BoingWork/Params/InstanceData[,,] m_aCpuCell
    // Size: 0x8
    // Offset: 0x2A8
    ::ArrayW<::BoingKit::BoingWork::Params::InstanceData> m_aCpuCell;
    // Field size check
    static_assert(sizeof(::ArrayW<::BoingKit::BoingWork::Params::InstanceData>) == 0x8);
    // private UnityEngine.ComputeShader m_shader
    // Size: 0x8
    // Offset: 0x2B0
    ::UnityEngine::ComputeShader* m_shader;
    // Field size check
    static_assert(sizeof(::UnityEngine::ComputeShader*) == 0x8);
    // private UnityEngine.ComputeBuffer m_effectorIndexBuffer
    // Size: 0x8
    // Offset: 0x2B8
    ::UnityEngine::ComputeBuffer* m_effectorIndexBuffer;
    // Field size check
    static_assert(sizeof(::UnityEngine::ComputeBuffer*) == 0x8);
    // private UnityEngine.ComputeBuffer m_reactorParamsBuffer
    // Size: 0x8
    // Offset: 0x2C0
    ::UnityEngine::ComputeBuffer* m_reactorParamsBuffer;
    // Field size check
    static_assert(sizeof(::UnityEngine::ComputeBuffer*) == 0x8);
    // private UnityEngine.ComputeBuffer m_fieldParamsBuffer
    // Size: 0x8
    // Offset: 0x2C8
    ::UnityEngine::ComputeBuffer* m_fieldParamsBuffer;
    // Field size check
    static_assert(sizeof(::UnityEngine::ComputeBuffer*) == 0x8);
    // private UnityEngine.ComputeBuffer m_cellsBuffer
    // Size: 0x8
    // Offset: 0x2D0
    ::UnityEngine::ComputeBuffer* m_cellsBuffer;
    // Field size check
    static_assert(sizeof(::UnityEngine::ComputeBuffer*) == 0x8);
    // private System.Int32 m_gpuResourceSetId
    // Size: 0x4
    // Offset: 0x2D8
    int m_gpuResourceSetId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean m_init
    // Size: 0x1
    // Offset: 0x2DC
    bool m_init;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_init and: m_gridCenter
    char __padding41[0x3] = {};
    // private UnityEngine.Vector3 m_gridCenter
    // Size: 0xC
    // Offset: 0x2E0
    ::UnityEngine::Vector3 m_gridCenter;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 m_qPrevGridCenterNorm
    // Size: 0xC
    // Offset: 0x2EC
    ::UnityEngine::Vector3 m_qPrevGridCenterNorm;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Boolean m_cellBufferNeedsReset
    // Size: 0x1
    // Offset: 0x2F8
    bool m_cellBufferNeedsReset;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_cellBufferNeedsReset and: s_aReactorParams
    char __padding44[0x7] = {};
    // private BoingKit.BoingWork/Params[] s_aReactorParams
    // Size: 0x8
    // Offset: 0x300
    ::ArrayW<::BoingKit::BoingWork::Params> s_aReactorParams;
    // Field size check
    static_assert(sizeof(::ArrayW<::BoingKit::BoingWork::Params>) == 0x8);
    public:
    // Get static field: static private BoingKit.BoingReactorField/ShaderPropertyIdSet s_shaderPropertyId
    static ::BoingKit::BoingReactorField::ShaderPropertyIdSet* _get_s_shaderPropertyId();
    // Set static field: static private BoingKit.BoingReactorField/ShaderPropertyIdSet s_shaderPropertyId
    static void _set_s_shaderPropertyId(::BoingKit::BoingReactorField::ShaderPropertyIdSet* value);
    // Get static field: static private readonly System.Single kPropagationFactor
    static float _get_kPropagationFactor();
    // Set static field: static private readonly System.Single kPropagationFactor
    static void _set_kPropagationFactor(float value);
    // Get static field: static private BoingKit.BoingReactorField/ComputeKernelId s_computeKernelId
