// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: UnityEngine.Bounds
#include "UnityEngine/Bounds.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: MeshRenderer
  class MeshRenderer;
  // Forward declaring type: MeshFilter
  class MeshFilter;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: ParticleSystem
  class ParticleSystem;
  // Forward declaring type: MaterialPropertyBlock
  class MaterialPropertyBlock;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: SoundBankPlayer
  class SoundBankPlayer;
}
// Completed forward declares
// Type namespace: GorillaTag
namespace GorillaTag {
  // Forward declaring type: ContainerLiquid
  class ContainerLiquid;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GorillaTag::ContainerLiquid);
DEFINE_IL2CPP_ARG_TYPE(::GorillaTag::ContainerLiquid*, "GorillaTag", "ContainerLiquid");
// Type namespace: GorillaTag
namespace GorillaTag {
  // Size: 0x178
  #pragma pack(push, 1)
  // Autogenerated type: GorillaTag.ContainerLiquid
  // [TokenAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: FFFFFFFF
  // [ExecuteInEditMode] Offset: FFFFFFFF
  class ContainerLiquid : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // public UnityEngine.MeshRenderer meshRenderer
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::MeshRenderer* meshRenderer;
    // Field size check
    static_assert(sizeof(::UnityEngine::MeshRenderer*) == 0x8);
    // public UnityEngine.MeshFilter meshFilter
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::MeshFilter* meshFilter;
    // Field size check
    static_assert(sizeof(::UnityEngine::MeshFilter*) == 0x8);
    // public System.Boolean keepMeshHidden
    // Size: 0x1
    // Offset: 0x30
    bool keepMeshHidden;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: keepMeshHidden and: floater
    char __padding2[0x7] = {};
    // public UnityEngine.Transform floater
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::Transform* floater;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public System.Boolean useLiquidShader
    // Size: 0x1
    // Offset: 0x40
    bool useLiquidShader;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean useLiquidVolume
    // Size: 0x1
    // Offset: 0x41
    bool useLiquidVolume;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: useLiquidVolume and: liquidVolumeMinMax
    char __padding5[0x2] = {};
    // public UnityEngine.Vector2 liquidVolumeMinMax
    // Size: 0x8
    // Offset: 0x44
    ::UnityEngine::Vector2 liquidVolumeMinMax;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // Padding between fields: liquidVolumeMinMax and: liquidColorShaderPropertyName
    char __padding6[0x4] = {};
    // public System.String liquidColorShaderPropertyName
    // Size: 0x8
    // Offset: 0x50
    ::StringW liquidColorShaderPropertyName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String liquidPlaneNormalShaderPropertyName
    // Size: 0x8
    // Offset: 0x58
    ::StringW liquidPlaneNormalShaderPropertyName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String liquidPlanePositionShaderPropertyName
    // Size: 0x8
    // Offset: 0x60
    ::StringW liquidPlanePositionShaderPropertyName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public UnityEngine.ParticleSystem spillParticleSystem
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::ParticleSystem* spillParticleSystem;
    // Field size check
    static_assert(sizeof(::UnityEngine::ParticleSystem*) == 0x8);
    // public SoundBankPlayer emptySoundBankPlayer
    // Size: 0x8
    // Offset: 0x70
    ::GlobalNamespace::SoundBankPlayer* emptySoundBankPlayer;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SoundBankPlayer*) == 0x8);
    // public SoundBankPlayer refillSoundBankPlayer
    // Size: 0x8
    // Offset: 0x78
    ::GlobalNamespace::SoundBankPlayer* refillSoundBankPlayer;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SoundBankPlayer*) == 0x8);
    // public SoundBankPlayer spillSoundBankPlayer
    // Size: 0x8
    // Offset: 0x80
    ::GlobalNamespace::SoundBankPlayer* spillSoundBankPlayer;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SoundBankPlayer*) == 0x8);
    // public UnityEngine.Color liquidColor
    // Size: 0x10
    // Offset: 0x88
    ::UnityEngine::Color liquidColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // public System.Single fillAmount
    // Size: 0x4
    // Offset: 0x98
    float fillAmount;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single refillAmount
    // Size: 0x4
    // Offset: 0x9C
    float refillAmount;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single refillDelay
    // Size: 0x4
    // Offset: 0xA0
    float refillDelay;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single refillThreshold
    // Size: 0x4
    // Offset: 0xA4
    float refillThreshold;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single wobbleMax
    // Size: 0x4
    // Offset: 0xA8
    float wobbleMax;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single wobbleFrequency
    // Size: 0x4
    // Offset: 0xAC
    float wobbleFrequency;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single recovery
    // Size: 0x4
    // Offset: 0xB0
    float recovery;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single thickness
    // Size: 0x4
    // Offset: 0xB4
    float thickness;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single maxSpillRate
    // Size: 0x4
    // Offset: 0xB8
    float maxSpillRate;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector3 <cupTopWorldPos>k__BackingField
    // Size: 0xC
    // Offset: 0xBC
    ::UnityEngine::Vector3 cupTopWorldPos;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 <bottomLipWorldPos>k__BackingField
    // Size: 0xC
    // Offset: 0xC8
    ::UnityEngine::Vector3 bottomLipWorldPos;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 <liquidPlaneWorldPos>k__BackingField
    // Size: 0xC
    // Offset: 0xD4
    ::UnityEngine::Vector3 liquidPlaneWorldPos;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 <liquidPlaneWorldNormal>k__BackingField
    // Size: 0xC
    // Offset: 0xE0
    ::UnityEngine::Vector3 liquidPlaneWorldNormal;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Boolean wasEmptyLastFrame
    // Size: 0x1
    // Offset: 0xEC
    bool wasEmptyLastFrame;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: wasEmptyLastFrame and: liquidColorShaderProp
    char __padding28[0x3] = {};
    // private System.Int32 liquidColorShaderProp
    // Size: 0x4
    // Offset: 0xF0
    int liquidColorShaderProp;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 liquidPlaneNormalShaderProp
    // Size: 0x4
    // Offset: 0xF4
    int liquidPlaneNormalShaderProp;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 liquidPlanePositionShaderProp
    // Size: 0x4
    // Offset: 0xF8
    int liquidPlanePositionShaderProp;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single refillTimer
    // Size: 0x4
    // Offset: 0xFC
    float refillTimer;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single lastSineWave
    // Size: 0x4
    // Offset: 0x100
    float lastSineWave;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single lastWobble
    // Size: 0x4
    // Offset: 0x104
    float lastWobble;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector2 temporalWobbleAmp
    // Size: 0x8
    // Offset: 0x108
    ::UnityEngine::Vector2 temporalWobbleAmp;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private UnityEngine.Vector3 lastPos
    // Size: 0xC
    // Offset: 0x110
    ::UnityEngine::Vector3 lastPos;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 lastVelocity
    // Size: 0xC
    // Offset: 0x11C
    ::UnityEngine::Vector3 lastVelocity;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 lastAngularVelocity
    // Size: 0xC
    // Offset: 0x128
    ::UnityEngine::Vector3 lastAngularVelocity;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Quaternion lastRot
    // Size: 0x10
    // Offset: 0x134
    ::UnityEngine::Quaternion lastRot;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // Padding between fields: lastRot and: matPropBlock
    char __padding39[0x4] = {};
    // private UnityEngine.MaterialPropertyBlock matPropBlock
    // Size: 0x8
    // Offset: 0x148
    ::UnityEngine::MaterialPropertyBlock* matPropBlock;
    // Field size check
    static_assert(sizeof(::UnityEngine::MaterialPropertyBlock*) == 0x8);
    // private UnityEngine.Bounds localMeshBounds
    // Size: 0x18
    // Offset: 0x150
    ::UnityEngine::Bounds localMeshBounds;
    // Field size check
    static_assert(sizeof(::UnityEngine::Bounds) == 0x18);
    // private System.Boolean useFloater
    // Size: 0x1
    // Offset: 0x168
    bool useFloater;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: useFloater and: topVerts
    char __padding42[0x7] = {};
    // private UnityEngine.Vector3[] topVerts
    // Size: 0x8
    // Offset: 0x170
    ::ArrayW<::UnityEngine::Vector3> topVerts;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector3>) == 0x8);
    public:
    // Get instance field reference: public UnityEngine.MeshRenderer meshRenderer
    [[deprecated("Use field access instead!")]] ::UnityEngine::MeshRenderer*& dyn_meshRenderer();
    // Get instance field reference: public UnityEngine.MeshFilter meshFilter
    [[deprecated("Use field access instead!")]] ::UnityEngine::MeshFilter*& dyn_meshFilter();
    // Get instance field reference: public System.Boolean keepMeshHidden
    [[deprecated("Use field access instead!")]] bool& dyn_keepMeshHidden();
    // Get instance field reference: public UnityEngine.Transform floater
    [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_floater();
    // Get instance field reference: public System.Boolean useLiquidShader
    [[deprecated("Use field access instead!")]] bool& dyn_useLiquidShader();
