// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: IGorillaSerializeableScene
#include "GlobalNamespace/IGorillaSerializeableScene.hpp"
// Including type: ITickSystemPost
#include "GlobalNamespace/ITickSystemPost.hpp"
// Including type: GorillaTag.GuidedRefs.IGuidedRefReceiverMono
#include "GorillaTag/GuidedRefs/IGuidedRefReceiverMono.hpp"
// Including type: GorillaTag.GuidedRefs.GuidedRefReceiverFieldInfo
#include "GorillaTag/GuidedRefs/GuidedRefReceiverFieldInfo.hpp"
// Including type: GorillaTag.GuidedRefs.GuidedRefReceiverArrayInfo
#include "GorillaTag/GuidedRefs/GuidedRefReceiverArrayInfo.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GorillaTag
namespace GorillaTag {
  // Skipping declaration: RisingLavaState because it is already included!

  // Skipping declaration: LavaSyncData because it is already included!
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: GorillaSerializerScene
  class GorillaSerializerScene;
  // Forward declaring type: SlingshotProjectileHitNotifier
  class SlingshotProjectileHitNotifier;
  // Forward declaring type: SlingshotProjectile
  class SlingshotProjectile;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: AnimationCurve
  class AnimationCurve;
  // Forward declaring type: Gradient
  class Gradient;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: MeshRenderer
  class MeshRenderer;
  // Forward declaring type: Plane
  struct Plane;
  // Skipping declaration: Vector3 because it is already included!
  // Skipping declaration: Object because it is already included!
  // Forward declaring type: Collider
  class Collider;
  // Forward declaring type: Collision
  class Collision;
}
// Forward declaring namespace: GorillaLocomotion::Swimming
namespace GorillaLocomotion::Swimming {
  // Forward declaring type: WaterVolume
  class WaterVolume;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
}
// Forward declaring namespace: Photon::Pun
namespace Photon::Pun {
  // Forward declaring type: PhotonStream
  class PhotonStream;
  // Forward declaring type: PhotonMessageInfo
  struct PhotonMessageInfo;
}
// Forward declaring namespace: Photon::Realtime
namespace Photon::Realtime {
  // Forward declaring type: Player
  class Player;
}
// Forward declaring namespace: GorillaTag::GuidedRefs
namespace GorillaTag::GuidedRefs {
  // Forward declaring type: GuidedRefTryResolveInfo
  struct GuidedRefTryResolveInfo;
}
// Completed forward declares
// Type namespace: GorillaTag
namespace GorillaTag {
  // Forward declaring type: InfectionLavaController
  class InfectionLavaController;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GorillaTag::InfectionLavaController);
DEFINE_IL2CPP_ARG_TYPE(::GorillaTag::InfectionLavaController*, "GorillaTag", "InfectionLavaController");
// Type namespace: GorillaTag
namespace GorillaTag {
  // Size: 0x210
  #pragma pack(push, 1)
  // Autogenerated type: GorillaTag.InfectionLavaController
  // [TokenAttribute] Offset: FFFFFFFF
  class InfectionLavaController : public ::UnityEngine::MonoBehaviour/*, public ::GlobalNamespace::IGorillaSerializeableScene, public ::GlobalNamespace::ITickSystemPost, public ::GorillaTag::GuidedRefs::IGuidedRefReceiverMono*/ {
    public:
    // Nested type: ::GorillaTag::InfectionLavaController::RisingLavaState
    struct RisingLavaState;
    // Nested type: ::GorillaTag::InfectionLavaController::LavaSyncData
    struct LavaSyncData;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: GorillaTag.InfectionLavaController/RisingLavaState
    // [TokenAttribute] Offset: FFFFFFFF
    struct RisingLavaState/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: RisingLavaState
      constexpr RisingLavaState(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public GorillaTag.InfectionLavaController/RisingLavaState Drained
      static constexpr const int Drained = 0;
      // Get static field: static public GorillaTag.InfectionLavaController/RisingLavaState Drained
      static ::GorillaTag::InfectionLavaController::RisingLavaState _get_Drained();
      // Set static field: static public GorillaTag.InfectionLavaController/RisingLavaState Drained
      static void _set_Drained(::GorillaTag::InfectionLavaController::RisingLavaState value);
      // static field const value: static public GorillaTag.InfectionLavaController/RisingLavaState Erupting
      static constexpr const int Erupting = 1;
      // Get static field: static public GorillaTag.InfectionLavaController/RisingLavaState Erupting
      static ::GorillaTag::InfectionLavaController::RisingLavaState _get_Erupting();
      // Set static field: static public GorillaTag.InfectionLavaController/RisingLavaState Erupting
      static void _set_Erupting(::GorillaTag::InfectionLavaController::RisingLavaState value);
      // static field const value: static public GorillaTag.InfectionLavaController/RisingLavaState Rising
      static constexpr const int Rising = 2;
      // Get static field: static public GorillaTag.InfectionLavaController/RisingLavaState Rising
      static ::GorillaTag::InfectionLavaController::RisingLavaState _get_Rising();
      // Set static field: static public GorillaTag.InfectionLavaController/RisingLavaState Rising
      static void _set_Rising(::GorillaTag::InfectionLavaController::RisingLavaState value);
      // static field const value: static public GorillaTag.InfectionLavaController/RisingLavaState Full
      static constexpr const int Full = 3;
      // Get static field: static public GorillaTag.InfectionLavaController/RisingLavaState Full
      static ::GorillaTag::InfectionLavaController::RisingLavaState _get_Full();
      // Set static field: static public GorillaTag.InfectionLavaController/RisingLavaState Full
      static void _set_Full(::GorillaTag::InfectionLavaController::RisingLavaState value);
      // static field const value: static public GorillaTag.InfectionLavaController/RisingLavaState Draining
      static constexpr const int Draining = 4;
      // Get static field: static public GorillaTag.InfectionLavaController/RisingLavaState Draining
      static ::GorillaTag::InfectionLavaController::RisingLavaState _get_Draining();
      // Set static field: static public GorillaTag.InfectionLavaController/RisingLavaState Draining
      static void _set_Draining(::GorillaTag::InfectionLavaController::RisingLavaState value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // GorillaTag.InfectionLavaController/RisingLavaState
    #pragma pack(pop)
    static check_size<sizeof(InfectionLavaController::RisingLavaState), 0 + sizeof(int)> __GorillaTag_InfectionLavaController_RisingLavaStateSizeCheck;
    static_assert(sizeof(InfectionLavaController::RisingLavaState) == 0x4);
    // Size: 0x18
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: GorillaTag.InfectionLavaController/LavaSyncData
    // [TokenAttribute] Offset: FFFFFFFF
    struct LavaSyncData/*, public ::System::ValueType*/ {
      public:
      public:
      // public GorillaTag.InfectionLavaController/RisingLavaState state
      // Size: 0x4
      // Offset: 0x0
      ::GorillaTag::InfectionLavaController::RisingLavaState state;
      // Field size check
      static_assert(sizeof(::GorillaTag::InfectionLavaController::RisingLavaState) == 0x4);
      // Padding between fields: state and: stateStartTime
      char __padding0[0x4] = {};
      // public System.Double stateStartTime
      // Size: 0x8
      // Offset: 0x8
      double stateStartTime;
      // Field size check
      static_assert(sizeof(double) == 0x8);
      // public System.Double activationProgress
      // Size: 0x8
      // Offset: 0x10
      double activationProgress;
      // Field size check
      static_assert(sizeof(double) == 0x8);
      public:
      // Creating value type constructor for type: LavaSyncData
      constexpr LavaSyncData(::GorillaTag::InfectionLavaController::RisingLavaState state_ = {}, double stateStartTime_ = {}, double activationProgress_ = {}) noexcept : state{state_}, stateStartTime{stateStartTime_}, activationProgress{activationProgress_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public GorillaTag.InfectionLavaController/RisingLavaState state
      [[deprecated("Use field access instead!")]] ::GorillaTag::InfectionLavaController::RisingLavaState& dyn_state();
      // Get instance field reference: public System.Double stateStartTime
      [[deprecated("Use field access instead!")]] double& dyn_stateStartTime();
      // Get instance field reference: public System.Double activationProgress
      [[deprecated("Use field access instead!")]] double& dyn_activationProgress();
    }; // GorillaTag.InfectionLavaController/LavaSyncData
    #pragma pack(pop)
    static check_size<sizeof(InfectionLavaController::LavaSyncData), 16 + sizeof(double)> __GorillaTag_InfectionLavaController_LavaSyncDataSizeCheck;
    static_assert(sizeof(InfectionLavaController::LavaSyncData) == 0x18);
    public:
    // private System.Single lavaMeshMinScale
    // Size: 0x4
    // Offset: 0x20
    float lavaMeshMinScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single lavaMeshMaxScale
    // Size: 0x4
    // Offset: 0x24
    float lavaMeshMaxScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single eruptTime
    // Size: 0x4
    // Offset: 0x28
    float eruptTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single riseTime
    // Size: 0x4
    // Offset: 0x2C
    float riseTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single fullTime
    // Size: 0x4
    // Offset: 0x30
    float fullTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single drainTime
    // Size: 0x4
    // Offset: 0x34
    float drainTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single lagResolutionLavaProgressPerSecond
    // Size: 0x4
    // Offset: 0x38
    float lagResolutionLavaProgressPerSecond;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: lagResolutionLavaProgressPerSecond and: lavaProgressAnimationCurve
    char __padding6[0x4] = {};
    // private UnityEngine.AnimationCurve lavaProgressAnimationCurve
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::AnimationCurve* lavaProgressAnimationCurve;
    // Field size check
    static_assert(sizeof(::UnityEngine::AnimationCurve*) == 0x8);
    // private System.Single activationVotePercentageDefaultQueue
    // Size: 0x4
    // Offset: 0x48
    float activationVotePercentageDefaultQueue;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single activationVotePercentageCompetitiveQueue
    // Size: 0x4
    // Offset: 0x4C
    float activationVotePercentageCompetitiveQueue;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Gradient lavaActivationGradient
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::Gradient* lavaActivationGradient;
    // Field size check
    static_assert(sizeof(::UnityEngine::Gradient*) == 0x8);
    // private UnityEngine.AnimationCurve lavaActivationRockProgressVsPlayerCount
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::AnimationCurve* lavaActivationRockProgressVsPlayerCount;
    // Field size check
    static_assert(sizeof(::UnityEngine::AnimationCurve*) == 0x8);
    // private UnityEngine.AnimationCurve lavaActivationDrainRateVsPlayerCount
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::AnimationCurve* lavaActivationDrainRateVsPlayerCount;
    // Field size check
    static_assert(sizeof(::UnityEngine::AnimationCurve*) == 0x8);
    // private System.Single lavaActivationVisualMovementProgressPerSecond
    // Size: 0x4
    // Offset: 0x68
    float lavaActivationVisualMovementProgressPerSecond;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean debugLavaActivationVotes
    // Size: 0x1
    // Offset: 0x6C
    bool debugLavaActivationVotes;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: debugLavaActivationVotes and: lavaMeshTransform
    char __padding14[0x3] = {};
    // private UnityEngine.Transform lavaMeshTransform
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::Transform* lavaMeshTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private GorillaTag.GuidedRefs.GuidedRefReceiverFieldInfo lavaMeshTransform_gRef
    // Size: 0x1C
    // Offset: 0x78
    ::GorillaTag::GuidedRefs::GuidedRefReceiverFieldInfo lavaMeshTransform_gRef;
    // Field size check
    static_assert(sizeof(::GorillaTag::GuidedRefs::GuidedRefReceiverFieldInfo) == 0x1C);
    // Padding between fields: lavaMeshTransform_gRef and: lavaSurfacePlaneTransform
    char __padding16[0x4] = {};
    // private UnityEngine.Transform lavaSurfacePlaneTransform
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::Transform* lavaSurfacePlaneTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private GorillaTag.GuidedRefs.GuidedRefReceiverFieldInfo lavaSurfacePlaneTransform_gRef
    // Size: 0x1C
    // Offset: 0xA0
    ::GorillaTag::GuidedRefs::GuidedRefReceiverFieldInfo lavaSurfacePlaneTransform_gRef;
    // Field size check
    static_assert(sizeof(::GorillaTag::GuidedRefs::GuidedRefReceiverFieldInfo) == 0x1C);
    // Padding between fields: lavaSurfacePlaneTransform_gRef and: lavaVolume
    char __padding18[0x4] = {};
    // private GorillaLocomotion.Swimming.WaterVolume lavaVolume
    // Size: 0x8
    // Offset: 0xC0
    ::GorillaLocomotion::Swimming::WaterVolume* lavaVolume;
    // Field size check
    static_assert(sizeof(::GorillaLocomotion::Swimming::WaterVolume*) == 0x8);
    // private GorillaTag.GuidedRefs.GuidedRefReceiverFieldInfo lavaVolume_gRef
    // Size: 0x1C
    // Offset: 0xC8
    ::GorillaTag::GuidedRefs::GuidedRefReceiverFieldInfo lavaVolume_gRef;
    // Field size check
    static_assert(sizeof(::GorillaTag::GuidedRefs::GuidedRefReceiverFieldInfo) == 0x1C);
    // Padding between fields: lavaVolume_gRef and: lavaActivationRenderer
    char __padding20[0x4] = {};
    // private UnityEngine.MeshRenderer lavaActivationRenderer
    // Size: 0x8
    // Offset: 0xE8
    ::UnityEngine::MeshRenderer* lavaActivationRenderer;
    // Field size check
    static_assert(sizeof(::UnityEngine::MeshRenderer*) == 0x8);
    // private GorillaTag.GuidedRefs.GuidedRefReceiverFieldInfo lavaActivationRenderer_gRef
    // Size: 0x1C
    // Offset: 0xF0
    ::GorillaTag::GuidedRefs::GuidedRefReceiverFieldInfo lavaActivationRenderer_gRef;
    // Field size check
    static_assert(sizeof(::GorillaTag::GuidedRefs::GuidedRefReceiverFieldInfo) == 0x1C);
    // Padding between fields: lavaActivationRenderer_gRef and: lavaActivationStartPos
    char __padding22[0x4] = {};
    // private UnityEngine.Transform lavaActivationStartPos
    // Size: 0x8
    // Offset: 0x110
    ::UnityEngine::Transform* lavaActivationStartPos;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private GorillaTag.GuidedRefs.GuidedRefReceiverFieldInfo lavaActivationStartPos_gRef
    // Size: 0x1C
    // Offset: 0x118
    ::GorillaTag::GuidedRefs::GuidedRefReceiverFieldInfo lavaActivationStartPos_gRef;
    // Field size check
    static_assert(sizeof(::GorillaTag::GuidedRefs::GuidedRefReceiverFieldInfo) == 0x1C);
    // Padding between fields: lavaActivationStartPos_gRef and: lavaActivationEndPos
    char __padding24[0x4] = {};
    // private UnityEngine.Transform lavaActivationEndPos
    // Size: 0x8
    // Offset: 0x138
    ::UnityEngine::Transform* lavaActivationEndPos;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private GorillaTag.GuidedRefs.GuidedRefReceiverFieldInfo lavaActivationEndPos_gRef
    // Size: 0x1C
    // Offset: 0x140
    ::GorillaTag::GuidedRefs::GuidedRefReceiverFieldInfo lavaActivationEndPos_gRef;
    // Field size check
    static_assert(sizeof(::GorillaTag::GuidedRefs::GuidedRefReceiverFieldInfo) == 0x1C);
    // Padding between fields: lavaActivationEndPos_gRef and: lavaActivationProjectileHitNotifier
    char __padding26[0x4] = {};
    // private SlingshotProjectileHitNotifier lavaActivationProjectileHitNotifier
    // Size: 0x8
    // Offset: 0x160
    ::GlobalNamespace::SlingshotProjectileHitNotifier* lavaActivationProjectileHitNotifier;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SlingshotProjectileHitNotifier*) == 0x8);
    // private GorillaTag.GuidedRefs.GuidedRefReceiverFieldInfo lavaActivationProjectileHitNotifier_gRef
    // Size: 0x1C
    // Offset: 0x168
    ::GorillaTag::GuidedRefs::GuidedRefReceiverFieldInfo lavaActivationProjectileHitNotifier_gRef;
    // Field size check
    static_assert(sizeof(::GorillaTag::GuidedRefs::GuidedRefReceiverFieldInfo) == 0x1C);
    // Padding between fields: lavaActivationProjectileHitNotifier_gRef and: volcanoEffects
    char __padding28[0x4] = {};
    // private GorillaTag.VolcanoEffects[] volcanoEffects
    // Size: 0x8
    // Offset: 0x188
    ::ArrayW<::GorillaTag::VolcanoEffects*> volcanoEffects;
    // Field size check
    static_assert(sizeof(::ArrayW<::GorillaTag::VolcanoEffects*>) == 0x8);
    // private GorillaTag.GuidedRefs.GuidedRefReceiverArrayInfo volcanoEffects_gRefs
    // Size: 0x20
    // Offset: 0x190
    ::GorillaTag::GuidedRefs::GuidedRefReceiverArrayInfo volcanoEffects_gRefs;
    // Field size check
    static_assert(sizeof(::GorillaTag::GuidedRefs::GuidedRefReceiverArrayInfo) == 0x20);
    // private GorillaTag.InfectionLavaController/LavaSyncData reliableState
    // Size: 0x18
    // Offset: 0x1B0
    ::GorillaTag::InfectionLavaController::LavaSyncData reliableState;
    // Field size check
    static_assert(sizeof(::GorillaTag::InfectionLavaController::LavaSyncData) == 0x18);
    // private System.Int32[] lavaActivationVotePlayerIds
    // Size: 0x8
    // Offset: 0x1C8
    ::ArrayW<int> lavaActivationVotePlayerIds;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // private System.Int32 lavaActivationVoteCount
    // Size: 0x4
    // Offset: 0x1D0
    int lavaActivationVoteCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single localLagLavaProgressOffset
    // Size: 0x4
    // Offset: 0x1D4
    float localLagLavaProgressOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single lavaProgressLinear
    // Size: 0x4
    // Offset: 0x1D8
    float lavaProgressLinear;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single lavaProgressSmooth
    // Size: 0x4
    // Offset: 0x1DC
    float lavaProgressSmooth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Double lastTagSelfRPCTime
    // Size: 0x8
    // Offset: 0x1E0
    double lastTagSelfRPCTime;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private System.Double currentTime
    // Size: 0x8
    // Offset: 0x1E8
    double currentTime;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private System.Double prevTime
    // Size: 0x8
    // Offset: 0x1F0
    double prevTime;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private System.Single activationProgessSmooth
    // Size: 0x4
    // Offset: 0x1F8
    float activationProgessSmooth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single lavaScale
    // Size: 0x4
    // Offset: 0x1FC
    float lavaScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private GorillaSerializerScene networkObject
    // Size: 0x8
    // Offset: 0x200
    ::GlobalNamespace::GorillaSerializerScene* networkObject;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::GorillaSerializerScene*) == 0x8);
    // private System.Boolean <ITickSystemPost.PostTickRunning>k__BackingField
    // Size: 0x1
    // Offset: 0x208
    bool PostTickRunning;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean guidedRefsFullyResolved
    // Size: 0x1
    // Offset: 0x209
    bool guidedRefsFullyResolved;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: guidedRefsFullyResolved and: GuidedRefsWaitingToResolveCount
    char __padding44[0x2] = {};
    // private System.Int32 <GorillaTag.GuidedRefs.IGuidedRefReceiverMono.GuidedRefsWaitingToResolveCount>k__BackingField
    // Size: 0x4
    // Offset: 0x20C
    int GuidedRefsWaitingToResolveCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Creating interface conversion operator: operator ::GlobalNamespace::IGorillaSerializeableScene
    operator ::GlobalNamespace::IGorillaSerializeableScene() noexcept {
      return *reinterpret_cast<::GlobalNamespace::IGorillaSerializeableScene*>(this);
    }
    // Creating interface conversion operator: operator ::GlobalNamespace::ITickSystemPost
    operator ::GlobalNamespace::ITickSystemPost() noexcept {
      return *reinterpret_cast<::GlobalNamespace::ITickSystemPost*>(this);
    }
    // Creating interface conversion operator: operator ::GorillaTag::GuidedRefs::IGuidedRefReceiverMono
    operator ::GorillaTag::GuidedRefs::IGuidedRefReceiverMono() noexcept {
      return *reinterpret_cast<::GorillaTag::GuidedRefs::IGuidedRefReceiverMono*>(this);
    }
    // Get static field: static private GorillaTag.InfectionLavaController instance
