// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Photon.Pun.MonoBehaviourPun
#include "Photon/Pun/MonoBehaviourPun.hpp"
// Including type: ITickSystemPost
#include "GlobalNamespace/ITickSystemPost.hpp"
// Including type: GorillaTag.GuidedRefs.IGuidedRefReceiverMono
#include "GorillaTag/GuidedRefs/IGuidedRefReceiverMono.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
// Including type: GorillaTag.GuidedRefs.GuidedRefReceiverFieldInfo
#include "GorillaTag/GuidedRefs/GuidedRefReceiverFieldInfo.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GorillaTag
namespace GorillaTag {
  // Forward declaring type: ScienceExperimentManager
  class ScienceExperimentManager;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: AnimationCurve
  class AnimationCurve;
  // Forward declaring type: Transform
  class Transform;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: Photon::Pun
namespace Photon::Pun {
  // Forward declaring type: PhotonMessageInfo
  struct PhotonMessageInfo;
}
// Forward declaring namespace: GorillaTag::GuidedRefs
namespace GorillaTag::GuidedRefs {
  // Forward declaring type: GuidedRefTryResolveInfo
  struct GuidedRefTryResolveInfo;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: SodaBubble
  class SodaBubble;
}
// Completed forward declares
// Type namespace: GorillaTag
namespace GorillaTag {
  // Forward declaring type: ScienceExperimentPlatformGenerator
  class ScienceExperimentPlatformGenerator;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GorillaTag::ScienceExperimentPlatformGenerator);
DEFINE_IL2CPP_ARG_TYPE(::GorillaTag::ScienceExperimentPlatformGenerator*, "GorillaTag", "ScienceExperimentPlatformGenerator");
// Type namespace: GorillaTag
namespace GorillaTag {
  // Size: 0x120
  #pragma pack(push, 1)
  // Autogenerated type: GorillaTag.ScienceExperimentPlatformGenerator
  // [TokenAttribute] Offset: FFFFFFFF
  class ScienceExperimentPlatformGenerator : public ::Photon::Pun::MonoBehaviourPun/*, public ::GlobalNamespace::ITickSystemPost, public ::GorillaTag::GuidedRefs::IGuidedRefReceiverMono*/ {
    public:
    // Nested type: ::GorillaTag::ScienceExperimentPlatformGenerator::BubbleData
    struct BubbleData;
    // Nested type: ::GorillaTag::ScienceExperimentPlatformGenerator::BubbleSpawnDebug
    struct BubbleSpawnDebug;
    // Size: 0x38
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: GorillaTag.ScienceExperimentPlatformGenerator/BubbleData
    // [TokenAttribute] Offset: FFFFFFFF
    struct BubbleData/*, public ::System::ValueType*/ {
      public:
      public:
      // public UnityEngine.Vector3 position
      // Size: 0xC
      // Offset: 0x0
      ::UnityEngine::Vector3 position;
      // Field size check
      static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
      // public UnityEngine.Vector3 direction
      // Size: 0xC
      // Offset: 0xC
      ::UnityEngine::Vector3 direction;
      // Field size check
      static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
      // public System.Single spawnSize
      // Size: 0x4
      // Offset: 0x18
      float spawnSize;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Single lifetime
      // Size: 0x4
      // Offset: 0x1C
      float lifetime;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Double spawnTime
      // Size: 0x8
      // Offset: 0x20
      double spawnTime;
      // Field size check
      static_assert(sizeof(double) == 0x8);
      // public System.Boolean isTrail
      // Size: 0x1
      // Offset: 0x28
      bool isTrail;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // Padding between fields: isTrail and: bubble
      char __padding5[0x7] = {};
      // public SodaBubble bubble
      // Size: 0x8
      // Offset: 0x30
      ::GlobalNamespace::SodaBubble* bubble;
      // Field size check
      static_assert(sizeof(::GlobalNamespace::SodaBubble*) == 0x8);
      public:
      // Creating value type constructor for type: BubbleData
      constexpr BubbleData(::UnityEngine::Vector3 position_ = {}, ::UnityEngine::Vector3 direction_ = {}, float spawnSize_ = {}, float lifetime_ = {}, double spawnTime_ = {}, bool isTrail_ = {}, ::GlobalNamespace::SodaBubble* bubble_ = {}) noexcept : position{position_}, direction{direction_}, spawnSize{spawnSize_}, lifetime{lifetime_}, spawnTime{spawnTime_}, isTrail{isTrail_}, bubble{bubble_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public UnityEngine.Vector3 position
      [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_position();
      // Get instance field reference: public UnityEngine.Vector3 direction
      [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_direction();
      // Get instance field reference: public System.Single spawnSize
      [[deprecated("Use field access instead!")]] float& dyn_spawnSize();
      // Get instance field reference: public System.Single lifetime
      [[deprecated("Use field access instead!")]] float& dyn_lifetime();
      // Get instance field reference: public System.Double spawnTime
      [[deprecated("Use field access instead!")]] double& dyn_spawnTime();
      // Get instance field reference: public System.Boolean isTrail
      [[deprecated("Use field access instead!")]] bool& dyn_isTrail();
      // Get instance field reference: public SodaBubble bubble
      [[deprecated("Use field access instead!")]] ::GlobalNamespace::SodaBubble*& dyn_bubble();
    }; // GorillaTag.ScienceExperimentPlatformGenerator/BubbleData
    #pragma pack(pop)
    static check_size<sizeof(ScienceExperimentPlatformGenerator::BubbleData), 48 + sizeof(::GlobalNamespace::SodaBubble*)> __GorillaTag_ScienceExperimentPlatformGenerator_BubbleDataSizeCheck;
    static_assert(sizeof(ScienceExperimentPlatformGenerator::BubbleData) == 0x38);
    // Size: 0x38
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: GorillaTag.ScienceExperimentPlatformGenerator/BubbleSpawnDebug
    // [TokenAttribute] Offset: FFFFFFFF
    struct BubbleSpawnDebug/*, public ::System::ValueType*/ {
      public:
      public:
      // public UnityEngine.Vector3 initialPosition
      // Size: 0xC
      // Offset: 0x0
      ::UnityEngine::Vector3 initialPosition;
      // Field size check
      static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
      // public UnityEngine.Vector3 initialDirection
      // Size: 0xC
      // Offset: 0xC
      ::UnityEngine::Vector3 initialDirection;
      // Field size check
      static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
      // public UnityEngine.Vector3 spawnPosition
      // Size: 0xC
      // Offset: 0x18
      ::UnityEngine::Vector3 spawnPosition;
      // Field size check
      static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
      // public System.Single minAngle
      // Size: 0x4
      // Offset: 0x24
      float minAngle;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Single maxAngle
      // Size: 0x4
      // Offset: 0x28
      float maxAngle;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Single edgeCorrectionAngle
      // Size: 0x4
      // Offset: 0x2C
      float edgeCorrectionAngle;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Double spawnTime
      // Size: 0x8
      // Offset: 0x30
      double spawnTime;
      // Field size check
      static_assert(sizeof(double) == 0x8);
      public:
      // Creating value type constructor for type: BubbleSpawnDebug
      constexpr BubbleSpawnDebug(::UnityEngine::Vector3 initialPosition_ = {}, ::UnityEngine::Vector3 initialDirection_ = {}, ::UnityEngine::Vector3 spawnPosition_ = {}, float minAngle_ = {}, float maxAngle_ = {}, float edgeCorrectionAngle_ = {}, double spawnTime_ = {}) noexcept : initialPosition{initialPosition_}, initialDirection{initialDirection_}, spawnPosition{spawnPosition_}, minAngle{minAngle_}, maxAngle{maxAngle_}, edgeCorrectionAngle{edgeCorrectionAngle_}, spawnTime{spawnTime_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public UnityEngine.Vector3 initialPosition
      [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_initialPosition();
      // Get instance field reference: public UnityEngine.Vector3 initialDirection
      [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_initialDirection();
      // Get instance field reference: public UnityEngine.Vector3 spawnPosition
      [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_spawnPosition();
      // Get instance field reference: public System.Single minAngle
      [[deprecated("Use field access instead!")]] float& dyn_minAngle();
      // Get instance field reference: public System.Single maxAngle
      [[deprecated("Use field access instead!")]] float& dyn_maxAngle();
      // Get instance field reference: public System.Single edgeCorrectionAngle
      [[deprecated("Use field access instead!")]] float& dyn_edgeCorrectionAngle();
      // Get instance field reference: public System.Double spawnTime
      [[deprecated("Use field access instead!")]] double& dyn_spawnTime();
    }; // GorillaTag.ScienceExperimentPlatformGenerator/BubbleSpawnDebug
    #pragma pack(pop)
    static check_size<sizeof(ScienceExperimentPlatformGenerator::BubbleSpawnDebug), 48 + sizeof(double)> __GorillaTag_ScienceExperimentPlatformGenerator_BubbleSpawnDebugSizeCheck;
    static_assert(sizeof(ScienceExperimentPlatformGenerator::BubbleSpawnDebug) == 0x38);
    public:
    // private UnityEngine.GameObject spawnedPrefab
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::GameObject* spawnedPrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Single scaleFactor
    // Size: 0x4
    // Offset: 0x30
    float scaleFactor;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector2 surfaceRadiusSpawnRange
    // Size: 0x8
    // Offset: 0x34
    ::UnityEngine::Vector2 surfaceRadiusSpawnRange;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private UnityEngine.Vector2 lifetimeRange
    // Size: 0x8
    // Offset: 0x3C
    ::UnityEngine::Vector2 lifetimeRange;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private UnityEngine.Vector2 sizeRange
    // Size: 0x8
    // Offset: 0x44
    ::UnityEngine::Vector2 sizeRange;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // Padding between fields: sizeRange and: rockCountVsLavaProgress
    char __padding4[0x4] = {};
    // private UnityEngine.AnimationCurve rockCountVsLavaProgress
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::AnimationCurve* rockCountVsLavaProgress;
    // Field size check
    static_assert(sizeof(::UnityEngine::AnimationCurve*) == 0x8);
    // private System.Single bubbleCountMultiplier
    // Size: 0x4
    // Offset: 0x58
    float bubbleCountMultiplier;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 maxBubbleCount
    // Size: 0x4
    // Offset: 0x5C
    int maxBubbleCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.AnimationCurve rockLifetimeMultiplierVsLavaProgress
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::AnimationCurve* rockLifetimeMultiplierVsLavaProgress;
    // Field size check
    static_assert(sizeof(::UnityEngine::AnimationCurve*) == 0x8);
    // private UnityEngine.AnimationCurve rockMaxSizeMultiplierVsLavaProgress
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::AnimationCurve* rockMaxSizeMultiplierVsLavaProgress;
    // Field size check
    static_assert(sizeof(::UnityEngine::AnimationCurve*) == 0x8);
    // private UnityEngine.AnimationCurve spawnRadiusMultiplierVsLavaProgress
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::AnimationCurve* spawnRadiusMultiplierVsLavaProgress;
    // Field size check
    static_assert(sizeof(::UnityEngine::AnimationCurve*) == 0x8);
    // private UnityEngine.AnimationCurve rockSizeVsLifetime
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::AnimationCurve* rockSizeVsLifetime;
    // Field size check
    static_assert(sizeof(::UnityEngine::AnimationCurve*) == 0x8);
    // private UnityEngine.AnimationCurve trailSpawnRateVsProgress
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::AnimationCurve* trailSpawnRateVsProgress;
    // Field size check
    static_assert(sizeof(::UnityEngine::AnimationCurve*) == 0x8);
    // private System.Single trailSpawnRateMultiplier
    // Size: 0x4
    // Offset: 0x88
    float trailSpawnRateMultiplier;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: trailSpawnRateMultiplier and: trailBubbleLifetimeVsProgress
    char __padding13[0x4] = {};
    // private UnityEngine.AnimationCurve trailBubbleLifetimeVsProgress
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::AnimationCurve* trailBubbleLifetimeVsProgress;
    // Field size check
    static_assert(sizeof(::UnityEngine::AnimationCurve*) == 0x8);
    // private UnityEngine.AnimationCurve trailBubbleBoundaryRadiusVsProgress
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::AnimationCurve* trailBubbleBoundaryRadiusVsProgress;
    // Field size check
    static_assert(sizeof(::UnityEngine::AnimationCurve*) == 0x8);
    // private System.Single trailBubbleLifetimeMultiplier
    // Size: 0x4
    // Offset: 0xA0
    float trailBubbleLifetimeMultiplier;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single trailDistanceBetweenSpawns
    // Size: 0x4
    // Offset: 0xA4
    float trailDistanceBetweenSpawns;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single trailMaxTurnAngle
    // Size: 0x4
    // Offset: 0xA8
    float trailMaxTurnAngle;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single trailBubbleSize
    // Size: 0x4
    // Offset: 0xAC
    float trailBubbleSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.AnimationCurve trailCountVsProgress
    // Size: 0x8
    // Offset: 0xB0
    ::UnityEngine::AnimationCurve* trailCountVsProgress;
    // Field size check
    static_assert(sizeof(::UnityEngine::AnimationCurve*) == 0x8);
    // private System.Single trailCountMultiplier
    // Size: 0x4
    // Offset: 0xB8
    float trailCountMultiplier;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector2 trailEdgeAvoidanceSpawnsMinMax
    // Size: 0x8
    // Offset: 0xBC
    ::UnityEngine::Vector2 trailEdgeAvoidanceSpawnsMinMax;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private System.Single bubblePopAnticipationTime
    // Size: 0x4
    // Offset: 0xC4
    float bubblePopAnticipationTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single bubblePopWobbleFrequency
    // Size: 0x4
    // Offset: 0xC8
    float bubblePopWobbleFrequency;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single bubblePopWobbleAmplitude
    // Size: 0x4
    // Offset: 0xCC
    float bubblePopWobbleAmplitude;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Transform liquidSurfacePlane
    // Size: 0x8
    // Offset: 0xD0
    ::UnityEngine::Transform* liquidSurfacePlane;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private GorillaTag.GuidedRefs.GuidedRefReceiverFieldInfo liquidSurfacePlane_gRef
    // Size: 0x1C
    // Offset: 0xD8
    ::GorillaTag::GuidedRefs::GuidedRefReceiverFieldInfo liquidSurfacePlane_gRef;
    // Field size check
    static_assert(sizeof(::GorillaTag::GuidedRefs::GuidedRefReceiverFieldInfo) == 0x1C);
    // Padding between fields: liquidSurfacePlane_gRef and: activeBubbles
    char __padding27[0x4] = {};
    // private System.Collections.Generic.List`1<GorillaTag.ScienceExperimentPlatformGenerator/BubbleData> activeBubbles
    // Size: 0x8
    // Offset: 0xF8
    ::System::Collections::Generic::List_1<::GorillaTag::ScienceExperimentPlatformGenerator::BubbleData>* activeBubbles;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GorillaTag::ScienceExperimentPlatformGenerator::BubbleData>*) == 0x8);
    // private System.Collections.Generic.List`1<GorillaTag.ScienceExperimentPlatformGenerator/BubbleData> trailHeads
    // Size: 0x8
    // Offset: 0x100
    ::System::Collections::Generic::List_1<::GorillaTag::ScienceExperimentPlatformGenerator::BubbleData>* trailHeads;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GorillaTag::ScienceExperimentPlatformGenerator::BubbleData>*) == 0x8);
    // private System.Collections.Generic.List`1<GorillaTag.ScienceExperimentPlatformGenerator/BubbleSpawnDebug> bubbleSpawnDebug
    // Size: 0x8
    // Offset: 0x108
    ::System::Collections::Generic::List_1<::GorillaTag::ScienceExperimentPlatformGenerator::BubbleSpawnDebug>* bubbleSpawnDebug;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GorillaTag::ScienceExperimentPlatformGenerator::BubbleSpawnDebug>*) == 0x8);
    // private GorillaTag.ScienceExperimentManager scienceExperimentManager
    // Size: 0x8
    // Offset: 0x110
    ::GorillaTag::ScienceExperimentManager* scienceExperimentManager;
    // Field size check
    static_assert(sizeof(::GorillaTag::ScienceExperimentManager*) == 0x8);
    // private System.Boolean <ITickSystemPost.PostTickRunning>k__BackingField
    // Size: 0x1
    // Offset: 0x118
    bool PostTickRunning;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: PostTickRunning and: GuidedRefsWaitingToResolveCount
    char __padding32[0x3] = {};
    // private System.Int32 <GorillaTag.GuidedRefs.IGuidedRefReceiverMono.GuidedRefsWaitingToResolveCount>k__BackingField
    // Size: 0x4
    // Offset: 0x11C
    int GuidedRefsWaitingToResolveCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Creating interface conversion operator: operator ::GlobalNamespace::ITickSystemPost
    operator ::GlobalNamespace::ITickSystemPost() noexcept {
      return *reinterpret_cast<::GlobalNamespace::ITickSystemPost*>(this);
    }
    // Creating interface conversion operator: operator ::GorillaTag::GuidedRefs::IGuidedRefReceiverMono
    operator ::GorillaTag::GuidedRefs::IGuidedRefReceiverMono() noexcept {
      return *reinterpret_cast<::GorillaTag::GuidedRefs::IGuidedRefReceiverMono*>(this);
    }
    // Get instance field reference: private UnityEngine.GameObject spawnedPrefab
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_spawnedPrefab();
    // Get instance field reference: private System.Single scaleFactor
    [[deprecated("Use field access instead!")]] float& dyn_scaleFactor();
