// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Photon.Pun.MonoBehaviourPun
#include "Photon/Pun/MonoBehaviourPun.hpp"
// Including type: Photon.Pun.IPunObservable
#include "Photon/Pun/IPunObservable.hpp"
// Including type: Photon.Realtime.IInRoomCallbacks
#include "Photon/Realtime/IInRoomCallbacks.hpp"
// Including type: ITickSystemTick
#include "GlobalNamespace/ITickSystemTick.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
// Including type: UnityEngine.ParticleSystem/EmissionModule
#include "UnityEngine/ParticleSystem_EmissionModule.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GorillaTag
namespace GorillaTag {
  // Skipping declaration: RisingLiquidState because it is already included!

  class WaterVolume;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: CompositeTriggerEvents
  class CompositeTriggerEvents;
  // Forward declaring type: ScienceExperimentSceneElements
  class ScienceExperimentSceneElements;
  // Forward declaring type: SlingshotProjectileHitNotifier
  class SlingshotProjectileHitNotifier;
  // Forward declaring type: ScienceExperimentElementID
  struct ScienceExperimentElementID;
  // Forward declaring type: SlingshotProjectile
  class SlingshotProjectile;
}
// Forward declaring namespace: Photon::Realtime
namespace Photon::Realtime {
  // Forward declaring type: Player
  class Player;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Forward declaring namespace: Photon::Pun
namespace Photon::Pun {
  // Forward declaring type: PhotonStream
  class PhotonStream;
  // Forward declaring type: PhotonMessageInfo
  struct PhotonMessageInfo;
}
// Forward declaring namespace: ExitGames::Client::Photon
namespace ExitGames::Client::Photon {
  // Forward declaring type: Hashtable
  class Hashtable;
}
// Completed forward declares
// Type namespace: GorillaTag
namespace GorillaTag {
  // Forward declaring type: ScienceExperimentManager
  class ScienceExperimentManager;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GorillaTag::ScienceExperimentManager);
DEFINE_IL2CPP_ARG_TYPE(::GorillaTag::ScienceExperimentManager*, "GorillaTag", "ScienceExperimentManager");
// Type namespace: GorillaTag
namespace GorillaTag {
  // Size: 0x209
  #pragma pack(push, 1)
  // Autogenerated type: GorillaTag.ScienceExperimentManager
  // [TokenAttribute] Offset: FFFFFFFF
  class ScienceExperimentManager : public ::Photon::Pun::MonoBehaviourPun/*, public ::Photon::Pun::IPunObservable, public ::Photon::Realtime::IInRoomCallbacks, public ::GlobalNamespace::ITickSystemTick*/ {
    public:
    // Nested type: ::GorillaTag::ScienceExperimentManager::RisingLiquidState
    struct RisingLiquidState;
    // Nested type: ::GorillaTag::ScienceExperimentManager::RiseSpeed
    struct RiseSpeed;
    // Nested type: ::GorillaTag::ScienceExperimentManager::TagBehavior
    struct TagBehavior;
    // Nested type: ::GorillaTag::ScienceExperimentManager::PlayerGameState
    struct PlayerGameState;
    // Nested type: ::GorillaTag::ScienceExperimentManager::SyncData
    struct SyncData;
    // Nested type: ::GorillaTag::ScienceExperimentManager::RotatingRingState
    struct RotatingRingState;
    // Nested type: ::GorillaTag::ScienceExperimentManager::DisableByLiquidData
    struct DisableByLiquidData;
    // Nested type: ::GorillaTag::ScienceExperimentManager::$RotateRingsCoroutine$d__123
    class $RotateRingsCoroutine$d__123;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: GorillaTag.ScienceExperimentManager/RisingLiquidState
    // [TokenAttribute] Offset: FFFFFFFF
    struct RisingLiquidState/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: RisingLiquidState
      constexpr RisingLiquidState(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public GorillaTag.ScienceExperimentManager/RisingLiquidState Drained
      static constexpr const int Drained = 0;
      // Get static field: static public GorillaTag.ScienceExperimentManager/RisingLiquidState Drained
      static ::GorillaTag::ScienceExperimentManager::RisingLiquidState _get_Drained();
      // Set static field: static public GorillaTag.ScienceExperimentManager/RisingLiquidState Drained
      static void _set_Drained(::GorillaTag::ScienceExperimentManager::RisingLiquidState value);
      // static field const value: static public GorillaTag.ScienceExperimentManager/RisingLiquidState Erupting
      static constexpr const int Erupting = 1;
      // Get static field: static public GorillaTag.ScienceExperimentManager/RisingLiquidState Erupting
      static ::GorillaTag::ScienceExperimentManager::RisingLiquidState _get_Erupting();
      // Set static field: static public GorillaTag.ScienceExperimentManager/RisingLiquidState Erupting
      static void _set_Erupting(::GorillaTag::ScienceExperimentManager::RisingLiquidState value);
      // static field const value: static public GorillaTag.ScienceExperimentManager/RisingLiquidState Rising
      static constexpr const int Rising = 2;
      // Get static field: static public GorillaTag.ScienceExperimentManager/RisingLiquidState Rising
      static ::GorillaTag::ScienceExperimentManager::RisingLiquidState _get_Rising();
      // Set static field: static public GorillaTag.ScienceExperimentManager/RisingLiquidState Rising
      static void _set_Rising(::GorillaTag::ScienceExperimentManager::RisingLiquidState value);
      // static field const value: static public GorillaTag.ScienceExperimentManager/RisingLiquidState Full
      static constexpr const int Full = 3;
      // Get static field: static public GorillaTag.ScienceExperimentManager/RisingLiquidState Full
      static ::GorillaTag::ScienceExperimentManager::RisingLiquidState _get_Full();
      // Set static field: static public GorillaTag.ScienceExperimentManager/RisingLiquidState Full
      static void _set_Full(::GorillaTag::ScienceExperimentManager::RisingLiquidState value);
      // static field const value: static public GorillaTag.ScienceExperimentManager/RisingLiquidState PreDrainDelay
      static constexpr const int PreDrainDelay = 4;
      // Get static field: static public GorillaTag.ScienceExperimentManager/RisingLiquidState PreDrainDelay
      static ::GorillaTag::ScienceExperimentManager::RisingLiquidState _get_PreDrainDelay();
      // Set static field: static public GorillaTag.ScienceExperimentManager/RisingLiquidState PreDrainDelay
      static void _set_PreDrainDelay(::GorillaTag::ScienceExperimentManager::RisingLiquidState value);
      // static field const value: static public GorillaTag.ScienceExperimentManager/RisingLiquidState Draining
      static constexpr const int Draining = 5;
      // Get static field: static public GorillaTag.ScienceExperimentManager/RisingLiquidState Draining
      static ::GorillaTag::ScienceExperimentManager::RisingLiquidState _get_Draining();
      // Set static field: static public GorillaTag.ScienceExperimentManager/RisingLiquidState Draining
      static void _set_Draining(::GorillaTag::ScienceExperimentManager::RisingLiquidState value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // GorillaTag.ScienceExperimentManager/RisingLiquidState
    #pragma pack(pop)
    static check_size<sizeof(ScienceExperimentManager::RisingLiquidState), 0 + sizeof(int)> __GorillaTag_ScienceExperimentManager_RisingLiquidStateSizeCheck;
    static_assert(sizeof(ScienceExperimentManager::RisingLiquidState) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: GorillaTag.ScienceExperimentManager/RiseSpeed
    // [TokenAttribute] Offset: FFFFFFFF
    struct RiseSpeed/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: RiseSpeed
      constexpr RiseSpeed(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public GorillaTag.ScienceExperimentManager/RiseSpeed Fast
      static constexpr const int Fast = 0;
      // Get static field: static public GorillaTag.ScienceExperimentManager/RiseSpeed Fast
      static ::GorillaTag::ScienceExperimentManager::RiseSpeed _get_Fast();
      // Set static field: static public GorillaTag.ScienceExperimentManager/RiseSpeed Fast
      static void _set_Fast(::GorillaTag::ScienceExperimentManager::RiseSpeed value);
      // static field const value: static public GorillaTag.ScienceExperimentManager/RiseSpeed Medium
      static constexpr const int Medium = 1;
      // Get static field: static public GorillaTag.ScienceExperimentManager/RiseSpeed Medium
      static ::GorillaTag::ScienceExperimentManager::RiseSpeed _get_Medium();
      // Set static field: static public GorillaTag.ScienceExperimentManager/RiseSpeed Medium
      static void _set_Medium(::GorillaTag::ScienceExperimentManager::RiseSpeed value);
      // static field const value: static public GorillaTag.ScienceExperimentManager/RiseSpeed Slow
      static constexpr const int Slow = 2;
      // Get static field: static public GorillaTag.ScienceExperimentManager/RiseSpeed Slow
      static ::GorillaTag::ScienceExperimentManager::RiseSpeed _get_Slow();
      // Set static field: static public GorillaTag.ScienceExperimentManager/RiseSpeed Slow
      static void _set_Slow(::GorillaTag::ScienceExperimentManager::RiseSpeed value);
      // static field const value: static public GorillaTag.ScienceExperimentManager/RiseSpeed ExtraSlow
      static constexpr const int ExtraSlow = 3;
      // Get static field: static public GorillaTag.ScienceExperimentManager/RiseSpeed ExtraSlow
      static ::GorillaTag::ScienceExperimentManager::RiseSpeed _get_ExtraSlow();
      // Set static field: static public GorillaTag.ScienceExperimentManager/RiseSpeed ExtraSlow
      static void _set_ExtraSlow(::GorillaTag::ScienceExperimentManager::RiseSpeed value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // GorillaTag.ScienceExperimentManager/RiseSpeed
    #pragma pack(pop)
    static check_size<sizeof(ScienceExperimentManager::RiseSpeed), 0 + sizeof(int)> __GorillaTag_ScienceExperimentManager_RiseSpeedSizeCheck;
    static_assert(sizeof(ScienceExperimentManager::RiseSpeed) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: GorillaTag.ScienceExperimentManager/TagBehavior
    // [TokenAttribute] Offset: FFFFFFFF
    struct TagBehavior/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: TagBehavior
      constexpr TagBehavior(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public GorillaTag.ScienceExperimentManager/TagBehavior None
      static constexpr const int None = 0;
      // Get static field: static public GorillaTag.ScienceExperimentManager/TagBehavior None
      static ::GorillaTag::ScienceExperimentManager::TagBehavior _get_None();
      // Set static field: static public GorillaTag.ScienceExperimentManager/TagBehavior None
      static void _set_None(::GorillaTag::ScienceExperimentManager::TagBehavior value);
      // static field const value: static public GorillaTag.ScienceExperimentManager/TagBehavior Infect
      static constexpr const int Infect = 1;
      // Get static field: static public GorillaTag.ScienceExperimentManager/TagBehavior Infect
      static ::GorillaTag::ScienceExperimentManager::TagBehavior _get_Infect();
      // Set static field: static public GorillaTag.ScienceExperimentManager/TagBehavior Infect
      static void _set_Infect(::GorillaTag::ScienceExperimentManager::TagBehavior value);
      // static field const value: static public GorillaTag.ScienceExperimentManager/TagBehavior Revive
      static constexpr const int Revive = 2;
      // Get static field: static public GorillaTag.ScienceExperimentManager/TagBehavior Revive
      static ::GorillaTag::ScienceExperimentManager::TagBehavior _get_Revive();
      // Set static field: static public GorillaTag.ScienceExperimentManager/TagBehavior Revive
      static void _set_Revive(::GorillaTag::ScienceExperimentManager::TagBehavior value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // GorillaTag.ScienceExperimentManager/TagBehavior
    #pragma pack(pop)
    static check_size<sizeof(ScienceExperimentManager::TagBehavior), 0 + sizeof(int)> __GorillaTag_ScienceExperimentManager_TagBehaviorSizeCheck;
    static_assert(sizeof(ScienceExperimentManager::TagBehavior) == 0x4);
    // Size: 0xC
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: GorillaTag.ScienceExperimentManager/PlayerGameState
    // [TokenAttribute] Offset: FFFFFFFF
    struct PlayerGameState/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.Int32 playerId
      // Size: 0x4
      // Offset: 0x0
      int playerId;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Boolean touchedLiquid
      // Size: 0x1
      // Offset: 0x4
      bool touchedLiquid;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // Padding between fields: touchedLiquid and: touchedLiquidAtProgress
      char __padding1[0x3] = {};
      // public System.Single touchedLiquidAtProgress
      // Size: 0x4
      // Offset: 0x8
      float touchedLiquidAtProgress;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      public:
      // Creating value type constructor for type: PlayerGameState
      constexpr PlayerGameState(int playerId_ = {}, bool touchedLiquid_ = {}, float touchedLiquidAtProgress_ = {}) noexcept : playerId{playerId_}, touchedLiquid{touchedLiquid_}, touchedLiquidAtProgress{touchedLiquidAtProgress_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public System.Int32 playerId
      [[deprecated("Use field access instead!")]] int& dyn_playerId();
      // Get instance field reference: public System.Boolean touchedLiquid
      [[deprecated("Use field access instead!")]] bool& dyn_touchedLiquid();
      // Get instance field reference: public System.Single touchedLiquidAtProgress
      [[deprecated("Use field access instead!")]] float& dyn_touchedLiquidAtProgress();
    }; // GorillaTag.ScienceExperimentManager/PlayerGameState
    #pragma pack(pop)
    static check_size<sizeof(ScienceExperimentManager::PlayerGameState), 8 + sizeof(float)> __GorillaTag_ScienceExperimentManager_PlayerGameStateSizeCheck;
    static_assert(sizeof(ScienceExperimentManager::PlayerGameState) == 0xC);
    // Size: 0x20
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: GorillaTag.ScienceExperimentManager/SyncData
    // [TokenAttribute] Offset: FFFFFFFF
    struct SyncData/*, public ::System::ValueType*/ {
      public:
      public:
      // public GorillaTag.ScienceExperimentManager/RisingLiquidState state
      // Size: 0x4
      // Offset: 0x0
      ::GorillaTag::ScienceExperimentManager::RisingLiquidState state;
      // Field size check
      static_assert(sizeof(::GorillaTag::ScienceExperimentManager::RisingLiquidState) == 0x4);
      // Padding between fields: state and: stateStartTime
      char __padding0[0x4] = {};
      // public System.Double stateStartTime
      // Size: 0x8
      // Offset: 0x8
      double stateStartTime;
      // Field size check
      static_assert(sizeof(double) == 0x8);
      // public System.Single stateStartLiquidProgressLinear
      // Size: 0x4
      // Offset: 0x10
      float stateStartLiquidProgressLinear;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // Padding between fields: stateStartLiquidProgressLinear and: activationProgress
      char __padding2[0x4] = {};
      // public System.Double activationProgress
      // Size: 0x8
      // Offset: 0x18
      double activationProgress;
      // Field size check
      static_assert(sizeof(double) == 0x8);
      public:
      // Creating value type constructor for type: SyncData
      constexpr SyncData(::GorillaTag::ScienceExperimentManager::RisingLiquidState state_ = {}, double stateStartTime_ = {}, float stateStartLiquidProgressLinear_ = {}, double activationProgress_ = {}) noexcept : state{state_}, stateStartTime{stateStartTime_}, stateStartLiquidProgressLinear{stateStartLiquidProgressLinear_}, activationProgress{activationProgress_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public GorillaTag.ScienceExperimentManager/RisingLiquidState state
      [[deprecated("Use field access instead!")]] ::GorillaTag::ScienceExperimentManager::RisingLiquidState& dyn_state();
      // Get instance field reference: public System.Double stateStartTime
      [[deprecated("Use field access instead!")]] double& dyn_stateStartTime();
      // Get instance field reference: public System.Single stateStartLiquidProgressLinear
      [[deprecated("Use field access instead!")]] float& dyn_stateStartLiquidProgressLinear();
      // Get instance field reference: public System.Double activationProgress
      [[deprecated("Use field access instead!")]] double& dyn_activationProgress();
    }; // GorillaTag.ScienceExperimentManager/SyncData
    #pragma pack(pop)
    static check_size<sizeof(ScienceExperimentManager::SyncData), 24 + sizeof(double)> __GorillaTag_ScienceExperimentManager_SyncDataSizeCheck;
    static_assert(sizeof(ScienceExperimentManager::SyncData) == 0x20);
    // Size: 0x10
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: GorillaTag.ScienceExperimentManager/RotatingRingState
    // [TokenAttribute] Offset: FFFFFFFF
    struct RotatingRingState/*, public ::System::ValueType*/ {
      public:
      public:
      // public UnityEngine.Transform ringTransform
      // Size: 0x8
      // Offset: 0x0
      ::UnityEngine::Transform* ringTransform;
      // Field size check
      static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
      // public System.Single initialAngle
      // Size: 0x4
      // Offset: 0x8
      float initialAngle;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Single resultingAngle
      // Size: 0x4
      // Offset: 0xC
      float resultingAngle;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      public:
      // Creating value type constructor for type: RotatingRingState
      constexpr RotatingRingState(::UnityEngine::Transform* ringTransform_ = {}, float initialAngle_ = {}, float resultingAngle_ = {}) noexcept : ringTransform{ringTransform_}, initialAngle{initialAngle_}, resultingAngle{resultingAngle_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public UnityEngine.Transform ringTransform
      [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_ringTransform();
      // Get instance field reference: public System.Single initialAngle
      [[deprecated("Use field access instead!")]] float& dyn_initialAngle();
      // Get instance field reference: public System.Single resultingAngle
      [[deprecated("Use field access instead!")]] float& dyn_resultingAngle();
    }; // GorillaTag.ScienceExperimentManager/RotatingRingState
    #pragma pack(pop)
    static check_size<sizeof(ScienceExperimentManager::RotatingRingState), 12 + sizeof(float)> __GorillaTag_ScienceExperimentManager_RotatingRingStateSizeCheck;
    static_assert(sizeof(ScienceExperimentManager::RotatingRingState) == 0x10);
    public:
    // private GorillaTag.ScienceExperimentManager/TagBehavior tagBehavior
    // Size: 0x4
    // Offset: 0x28
    ::GorillaTag::ScienceExperimentManager::TagBehavior tagBehavior;
    // Field size check
    static_assert(sizeof(::GorillaTag::ScienceExperimentManager::TagBehavior) == 0x4);
    // private System.Single minScale
    // Size: 0x4
    // Offset: 0x2C
    float minScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single maxScale
    // Size: 0x4
    // Offset: 0x30
    float maxScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single riseTimeFast
    // Size: 0x4
    // Offset: 0x34
    float riseTimeFast;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single riseTimeMedium
    // Size: 0x4
    // Offset: 0x38
    float riseTimeMedium;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single riseTimeSlow
    // Size: 0x4
    // Offset: 0x3C
    float riseTimeSlow;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single riseTimeExtraSlow
    // Size: 0x4
    // Offset: 0x40
    float riseTimeExtraSlow;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single preDrainWaitTime
    // Size: 0x4
    // Offset: 0x44
    float preDrainWaitTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single maxFullTime
    // Size: 0x4
    // Offset: 0x48
    float maxFullTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single drainTime
    // Size: 0x4
    // Offset: 0x4C
    float drainTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single fullyDrainedWaitTime
    // Size: 0x4
    // Offset: 0x50
    float fullyDrainedWaitTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single lagResolutionLavaProgressPerSecond
    // Size: 0x4
    // Offset: 0x54
    float lagResolutionLavaProgressPerSecond;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.AnimationCurve animationCurve
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::AnimationCurve* animationCurve;
    // Field size check
    static_assert(sizeof(::UnityEngine::AnimationCurve*) == 0x8);
    // private System.Single lavaProgressToDisableRefreshWater
    // Size: 0x4
    // Offset: 0x60
    float lavaProgressToDisableRefreshWater;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single lavaProgressToEnableRefreshWater
    // Size: 0x4
    // Offset: 0x64
    float lavaProgressToEnableRefreshWater;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single entryLiquidMaxScale
    // Size: 0x4
    // Offset: 0x68
    float entryLiquidMaxScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector2 entryLiquidScaleSyncOpeningTop
    // Size: 0x8
    // Offset: 0x6C
    ::UnityEngine::Vector2 entryLiquidScaleSyncOpeningTop;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private UnityEngine.Vector2 entryLiquidScaleSyncOpeningBottom
    // Size: 0x8
    // Offset: 0x74
    ::UnityEngine::Vector2 entryLiquidScaleSyncOpeningBottom;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private System.Single entryBridgeQuadMaxScaleY
    // Size: 0x4
    // Offset: 0x7C
    float entryBridgeQuadMaxScaleY;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector2 entryBridgeQuadMinMaxZHeight
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::Vector2 entryBridgeQuadMinMaxZHeight;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private UnityEngine.AnimationCurve lavaActivationRockProgressVsPlayerCount
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::AnimationCurve* lavaActivationRockProgressVsPlayerCount;
    // Field size check
    static_assert(sizeof(::UnityEngine::AnimationCurve*) == 0x8);
    // private UnityEngine.AnimationCurve lavaActivationDrainRateVsPlayerCount
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::AnimationCurve* lavaActivationDrainRateVsPlayerCount;
    // Field size check
    static_assert(sizeof(::UnityEngine::AnimationCurve*) == 0x8);
    // public UnityEngine.GameObject waterBalloonPrefab
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::GameObject* waterBalloonPrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.Vector2 rotatingRingRandomAngleRange
    // Size: 0x8
    // Offset: 0xA0
    ::UnityEngine::Vector2 rotatingRingRandomAngleRange;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private System.Boolean rotatingRingQuantizeAngles
    // Size: 0x1
    // Offset: 0xA8
    bool rotatingRingQuantizeAngles;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: rotatingRingQuantizeAngles and: rotatingRingAngleSnapDegrees
    char __padding24[0x3] = {};
    // private System.Single rotatingRingAngleSnapDegrees
    // Size: 0x4
    // Offset: 0xAC
    float rotatingRingAngleSnapDegrees;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single drainBlockerSlideTime
    // Size: 0x4
    // Offset: 0xB0
    float drainBlockerSlideTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector2 sodaFizzParticleEmissionMinMax
    // Size: 0x8
    // Offset: 0xB4
    ::UnityEngine::Vector2 sodaFizzParticleEmissionMinMax;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private System.Single infrequentUpdatePeriod
    // Size: 0x4
    // Offset: 0xBC
    float infrequentUpdatePeriod;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean optPlayersOutOfRoomGameMode
    // Size: 0x1
    // Offset: 0xC0
    bool optPlayersOutOfRoomGameMode;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean debugDrawPlayerGameState
    // Size: 0x1
    // Offset: 0xC1
    bool debugDrawPlayerGameState;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: debugDrawPlayerGameState and: elements
    char __padding30[0x6] = {};
    // private ScienceExperimentSceneElements elements
    // Size: 0x8
    // Offset: 0xC8
    ::GlobalNamespace::ScienceExperimentSceneElements* elements;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ScienceExperimentSceneElements*) == 0x8);
    // private Photon.Realtime.Player[] allPlayersInRoom
    // Size: 0x8
    // Offset: 0xD0
    ::ArrayW<::Photon::Realtime::Player*> allPlayersInRoom;
    // Field size check
    static_assert(sizeof(::ArrayW<::Photon::Realtime::Player*>) == 0x8);
    // private GorillaTag.ScienceExperimentManager/RotatingRingState[] rotatingRings
    // Size: 0x8
    // Offset: 0xD8
    ::ArrayW<::GorillaTag::ScienceExperimentManager::RotatingRingState> rotatingRings;
    // Field size check
    static_assert(sizeof(::ArrayW<::GorillaTag::ScienceExperimentManager::RotatingRingState>) == 0x8);
    // private GorillaTag.ScienceExperimentManager/PlayerGameState[] inGamePlayerStates
    // Size: 0x8
    // Offset: 0xE0
    ::ArrayW<::GorillaTag::ScienceExperimentManager::PlayerGameState> inGamePlayerStates;
    // Field size check
    static_assert(sizeof(::ArrayW<::GorillaTag::ScienceExperimentManager::PlayerGameState>) == 0x8);
    // private System.Int32 inGamePlayerCount
    // Size: 0x4
    // Offset: 0xE8
    int inGamePlayerCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 lastWinnerId
    // Size: 0x4
    // Offset: 0xEC
    int lastWinnerId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.String lastWinnerName
    // Size: 0x8
    // Offset: 0xF0
    ::StringW lastWinnerName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Collections.Generic.List`1<GorillaTag.ScienceExperimentManager/PlayerGameState> sortedPlayerStates
    // Size: 0x8
    // Offset: 0xF8
    ::System::Collections::Generic::List_1<::GorillaTag::ScienceExperimentManager::PlayerGameState>* sortedPlayerStates;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GorillaTag::ScienceExperimentManager::PlayerGameState>*) == 0x8);
    // private GorillaTag.ScienceExperimentManager/SyncData reliableState
    // Size: 0x20
    // Offset: 0x100
    ::GorillaTag::ScienceExperimentManager::SyncData reliableState;
    // Field size check
    static_assert(sizeof(::GorillaTag::ScienceExperimentManager::SyncData) == 0x20);
    // private GorillaTag.ScienceExperimentManager/RiseSpeed nextRoundRiseSpeed
    // Size: 0x4
    // Offset: 0x120
    ::GorillaTag::ScienceExperimentManager::RiseSpeed nextRoundRiseSpeed;
    // Field size check
    static_assert(sizeof(::GorillaTag::ScienceExperimentManager::RiseSpeed) == 0x4);
    // private System.Single riseTime
    // Size: 0x4
    // Offset: 0x124
    float riseTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single riseProgress
    // Size: 0x4
    // Offset: 0x128
    float riseProgress;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single riseProgressLinear
    // Size: 0x4
    // Offset: 0x12C
    float riseProgressLinear;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single localLagRiseProgressOffset
    // Size: 0x4
    // Offset: 0x130
    float localLagRiseProgressOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: localLagRiseProgressOffset and: lastInfrequentUpdateTime
    char __padding44[0x4] = {};
    // private System.Double lastInfrequentUpdateTime
    // Size: 0x8
    // Offset: 0x138
    double lastInfrequentUpdateTime;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private System.String mentoProjectileTag
    // Size: 0x8
    // Offset: 0x140
    ::StringW mentoProjectileTag;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Double currentTime
    // Size: 0x8
    // Offset: 0x148
    double currentTime;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private System.Double prevTime
    // Size: 0x8
    // Offset: 0x150
    double prevTime;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private System.Single ringRotationProgress
    // Size: 0x4
    // Offset: 0x158
    float ringRotationProgress;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single drainBlockerSlideSpeed
    // Size: 0x4
    // Offset: 0x15C
    float drainBlockerSlideSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single[] riseTimeLookup
    // Size: 0x8
    // Offset: 0x160
    ::ArrayW<float> riseTimeLookup;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    // public UnityEngine.Transform ringParent
    // Size: 0x8
    // Offset: 0x168
    ::UnityEngine::Transform* ringParent;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Transform liquidMeshTransform
    // Size: 0x8
    // Offset: 0x170
    ::UnityEngine::Transform* liquidMeshTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Transform liquidSurfacePlane
    // Size: 0x8
    // Offset: 0x178
    ::UnityEngine::Transform* liquidSurfacePlane;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Transform entryWayLiquidMeshTransform
    // Size: 0x8
    // Offset: 0x180
    ::UnityEngine::Transform* entryWayLiquidMeshTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Transform entryWayBridgeQuadTransform
    // Size: 0x8
    // Offset: 0x188
    ::UnityEngine::Transform* entryWayBridgeQuadTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Transform drainBlocker
    // Size: 0x8
    // Offset: 0x190
    ::UnityEngine::Transform* drainBlocker;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Transform drainBlockerClosedPosition
    // Size: 0x8
    // Offset: 0x198
    ::UnityEngine::Transform* drainBlockerClosedPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Transform drainBlockerOpenPosition
    // Size: 0x8
    // Offset: 0x1A0
    ::UnityEngine::Transform* drainBlockerOpenPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public GorillaLocomotion.Swimming.WaterVolume liquidVolume
    // Size: 0x8
    // Offset: 0x1A8
    ::GorillaLocomotion::Swimming::WaterVolume* liquidVolume;
    // Field size check
    static_assert(sizeof(::GorillaLocomotion::Swimming::WaterVolume*) == 0x8);
    // public GorillaLocomotion.Swimming.WaterVolume entryLiquidVolume
    // Size: 0x8
    // Offset: 0x1B0
    ::GorillaLocomotion::Swimming::WaterVolume* entryLiquidVolume;
    // Field size check
    static_assert(sizeof(::GorillaLocomotion::Swimming::WaterVolume*) == 0x8);
    // public GorillaLocomotion.Swimming.WaterVolume bottleLiquidVolume
    // Size: 0x8
    // Offset: 0x1B8
    ::GorillaLocomotion::Swimming::WaterVolume* bottleLiquidVolume;
    // Field size check
    static_assert(sizeof(::GorillaLocomotion::Swimming::WaterVolume*) == 0x8);
    // public GorillaLocomotion.Swimming.WaterVolume refreshWaterVolume
    // Size: 0x8
    // Offset: 0x1C0
    ::GorillaLocomotion::Swimming::WaterVolume* refreshWaterVolume;
    // Field size check
    static_assert(sizeof(::GorillaLocomotion::Swimming::WaterVolume*) == 0x8);
    // public CompositeTriggerEvents gameAreaTriggerNotifier
    // Size: 0x8
    // Offset: 0x1C8
    ::GlobalNamespace::CompositeTriggerEvents* gameAreaTriggerNotifier;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::CompositeTriggerEvents*) == 0x8);
    // public SlingshotProjectileHitNotifier sodaWaterProjectileTriggerNotifier
    // Size: 0x8
    // Offset: 0x1D0
    ::GlobalNamespace::SlingshotProjectileHitNotifier* sodaWaterProjectileTriggerNotifier;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SlingshotProjectileHitNotifier*) == 0x8);
    // public UnityEngine.AudioSource eruptionAudioSource
    // Size: 0x8
    // Offset: 0x1D8
    ::UnityEngine::AudioSource* eruptionAudioSource;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // public UnityEngine.AudioSource drainAudioSource
    // Size: 0x8
    // Offset: 0x1E0
    ::UnityEngine::AudioSource* drainAudioSource;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // public UnityEngine.AudioSource rotatingRingsAudioSource
    // Size: 0x8
    // Offset: 0x1E8
    ::UnityEngine::AudioSource* rotatingRingsAudioSource;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // private UnityEngine.ParticleSystem/EmissionModule fizzParticleEmission
    // Size: 0x8
    // Offset: 0x1F0
    ::UnityEngine::ParticleSystem::EmissionModule fizzParticleEmission;
    // Field size check
    static_assert(sizeof(::UnityEngine::ParticleSystem::EmissionModule) == 0x8);
    // private System.Boolean hasPlayedEruptionEffects
    // Size: 0x1
    // Offset: 0x1F8
    bool hasPlayedEruptionEffects;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean hasPlayedDrainEffects
    // Size: 0x1
    // Offset: 0x1F9
    bool hasPlayedDrainEffects;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <ITickSystemTick.TickRunning>k__BackingField
    // Size: 0x1
    // Offset: 0x1FA
    bool TickRunning;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: TickRunning and: debugRotateRingsTime
    char __padding72[0x1] = {};
    // private System.Single debugRotateRingsTime
    // Size: 0x4
    // Offset: 0x1FC
    float debugRotateRingsTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Coroutine rotateRingsCoroutine
    // Size: 0x8
    // Offset: 0x200
    ::UnityEngine::Coroutine* rotateRingsCoroutine;
    // Field size check
    static_assert(sizeof(::UnityEngine::Coroutine*) == 0x8);
    // private System.Boolean debugRandomizingRings
    // Size: 0x1
    // Offset: 0x208
    bool debugRandomizingRings;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating interface conversion operator: operator ::Photon::Pun::IPunObservable
    operator ::Photon::Pun::IPunObservable() noexcept {
      return *reinterpret_cast<::Photon::Pun::IPunObservable*>(this);
    }
    // Creating interface conversion operator: operator ::Photon::Realtime::IInRoomCallbacks
    operator ::Photon::Realtime::IInRoomCallbacks() noexcept {
      return *reinterpret_cast<::Photon::Realtime::IInRoomCallbacks*>(this);
    }
    // Creating interface conversion operator: operator ::GlobalNamespace::ITickSystemTick
    operator ::GlobalNamespace::ITickSystemTick() noexcept {
      return *reinterpret_cast<::GlobalNamespace::ITickSystemTick*>(this);
    }
    // Get static field: static public GorillaTag.ScienceExperimentManager instance
    static ::GorillaTag::ScienceExperimentManager* _get_instance();
