// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: GorillaTag.GuidedRefs.BaseGuidedRefTargetMono
#include "GorillaTag/GuidedRefs/BaseGuidedRefTargetMono.hpp"
// Including type: UnityEngine.ParticleSystem/EmissionModule
#include "UnityEngine/ParticleSystem_EmissionModule.hpp"
// Including type: UnityEngine.ParticleSystem/MainModule
#include "UnityEngine/ParticleSystem_MainModule.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GorillaTag
namespace GorillaTag {
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: AudioSource
  class AudioSource;
  // Forward declaring type: AudioClip
  class AudioClip;
  // Skipping declaration: ParticleSystem because it is already included!
  // Skipping declaration: Object because it is already included!
}
// Completed forward declares
// Type namespace: GorillaTag
namespace GorillaTag {
  // Forward declaring type: VolcanoEffects
  class VolcanoEffects;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GorillaTag::VolcanoEffects);
DEFINE_IL2CPP_ARG_TYPE(::GorillaTag::VolcanoEffects*, "GorillaTag", "VolcanoEffects");
// Type namespace: GorillaTag
namespace GorillaTag {
  // Size: 0xF6
  #pragma pack(push, 1)
  // Autogenerated type: GorillaTag.VolcanoEffects
  // [TokenAttribute] Offset: FFFFFFFF
  class VolcanoEffects : public ::GorillaTag::GuidedRefs::BaseGuidedRefTargetMono {
    public:
    // Writing base type padding for base size: 0x31 to desired offset: 0x38
    char ___base_padding[0x7] = {};
    // Nested type: ::GorillaTag::VolcanoEffects::LavaStateFX
    class LavaStateFX;
    public:
    // private System.Boolean applyShaderGlobals
    // Size: 0x1
    // Offset: 0x38
    bool applyShaderGlobals;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: applyShaderGlobals and: forestSpeakerAudioSrc
    char __padding0[0x7] = {};
    // private UnityEngine.AudioSource forestSpeakerAudioSrc
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::AudioSource* forestSpeakerAudioSrc;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // private UnityEngine.AudioClip warnVolcanoBellyEmptied
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::AudioClip* warnVolcanoBellyEmptied;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // private UnityEngine.AudioSource volcanoAudioSource
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::AudioSource* volcanoAudioSource;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // private UnityEngine.AudioClip volcanoAcceptStone
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::AudioClip* volcanoAcceptStone;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // private UnityEngine.AudioClip volcanoAcceptLastStone
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::AudioClip* volcanoAcceptLastStone;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // private UnityEngine.AudioSource[] lavaSurfaceAudioSrcs
    // Size: 0x8
    // Offset: 0x68
    ::ArrayW<::UnityEngine::AudioSource*> lavaSurfaceAudioSrcs;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::AudioSource*>) == 0x8);
    // private UnityEngine.ParticleSystem[] lavaSpewParticleSystems
    // Size: 0x8
    // Offset: 0x70
    ::ArrayW<::UnityEngine::ParticleSystem*> lavaSpewParticleSystems;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::ParticleSystem*>) == 0x8);
    // private UnityEngine.ParticleSystem[] smokeParticleSystems
    // Size: 0x8
    // Offset: 0x78
    ::ArrayW<::UnityEngine::ParticleSystem*> smokeParticleSystems;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::ParticleSystem*>) == 0x8);
    // private GorillaTag.VolcanoEffects/LavaStateFX drainedStateFX
    // Size: 0x8
    // Offset: 0x80
    ::GorillaTag::VolcanoEffects::LavaStateFX* drainedStateFX;
    // Field size check
    static_assert(sizeof(::GorillaTag::VolcanoEffects::LavaStateFX*) == 0x8);
    // private GorillaTag.VolcanoEffects/LavaStateFX eruptingStateFX
    // Size: 0x8
    // Offset: 0x88
    ::GorillaTag::VolcanoEffects::LavaStateFX* eruptingStateFX;
    // Field size check
    static_assert(sizeof(::GorillaTag::VolcanoEffects::LavaStateFX*) == 0x8);
    // private GorillaTag.VolcanoEffects/LavaStateFX risingStateFX
    // Size: 0x8
    // Offset: 0x90
    ::GorillaTag::VolcanoEffects::LavaStateFX* risingStateFX;
    // Field size check
    static_assert(sizeof(::GorillaTag::VolcanoEffects::LavaStateFX*) == 0x8);
    // private GorillaTag.VolcanoEffects/LavaStateFX fullStateFX
    // Size: 0x8
    // Offset: 0x98
    ::GorillaTag::VolcanoEffects::LavaStateFX* fullStateFX;
    // Field size check
    static_assert(sizeof(::GorillaTag::VolcanoEffects::LavaStateFX*) == 0x8);
    // private GorillaTag.VolcanoEffects/LavaStateFX drainingStateFX
    // Size: 0x8
    // Offset: 0xA0
    ::GorillaTag::VolcanoEffects::LavaStateFX* drainingStateFX;
    // Field size check
    static_assert(sizeof(::GorillaTag::VolcanoEffects::LavaStateFX*) == 0x8);
    // private GorillaTag.VolcanoEffects/LavaStateFX currentStateFX
    // Size: 0x8
    // Offset: 0xA8
    ::GorillaTag::VolcanoEffects::LavaStateFX* currentStateFX;
    // Field size check
    static_assert(sizeof(::GorillaTag::VolcanoEffects::LavaStateFX*) == 0x8);
    // private UnityEngine.ParticleSystem/EmissionModule[] lavaSpewEmissionModules
    // Size: 0x8
    // Offset: 0xB0
    ::ArrayW<::UnityEngine::ParticleSystem::EmissionModule> lavaSpewEmissionModules;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::ParticleSystem::EmissionModule>) == 0x8);
    // private System.Single[] lavaSpewEmissionDefaultRateMultipliers
    // Size: 0x8
    // Offset: 0xB8
    ::ArrayW<float> lavaSpewEmissionDefaultRateMultipliers;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    // private UnityEngine.ParticleSystem/Burst[][] lavaSpewDefaultEmitBursts
    // Size: 0x8
    // Offset: 0xC0
    ::ArrayW<::ArrayW<::UnityEngine::ParticleSystem::Burst>> lavaSpewDefaultEmitBursts;
    // Field size check
    static_assert(sizeof(::ArrayW<::ArrayW<::UnityEngine::ParticleSystem::Burst>>) == 0x8);
    // private UnityEngine.ParticleSystem/Burst[][] lavaSpewAdjustedEmitBursts
    // Size: 0x8
    // Offset: 0xC8
    ::ArrayW<::ArrayW<::UnityEngine::ParticleSystem::Burst>> lavaSpewAdjustedEmitBursts;
    // Field size check
    static_assert(sizeof(::ArrayW<::ArrayW<::UnityEngine::ParticleSystem::Burst>>) == 0x8);
    // private UnityEngine.ParticleSystem/MainModule[] smokeMainModules
    // Size: 0x8
    // Offset: 0xD0
    ::ArrayW<::UnityEngine::ParticleSystem::MainModule> smokeMainModules;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::ParticleSystem::MainModule>) == 0x8);
    // private UnityEngine.ParticleSystem/EmissionModule[] smokeEmissionModules
    // Size: 0x8
    // Offset: 0xD8
    ::ArrayW<::UnityEngine::ParticleSystem::EmissionModule> smokeEmissionModules;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::ParticleSystem::EmissionModule>) == 0x8);
    // private System.Single[] smokeEmissionDefaultRateMultipliers
    // Size: 0x8
    // Offset: 0xE0
    ::ArrayW<float> smokeEmissionDefaultRateMultipliers;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    // private System.Int32 shaderProp_ZoneLiquidLightColor
    // Size: 0x4
    // Offset: 0xE8
    int shaderProp_ZoneLiquidLightColor;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 shaderProp_ZoneLiquidLightDistScale
    // Size: 0x4
    // Offset: 0xEC
    int shaderProp_ZoneLiquidLightDistScale;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single timeVolcanoBellyWasLastEmpty
    // Size: 0x4
    // Offset: 0xF0
    float timeVolcanoBellyWasLastEmpty;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean hasVolcanoAudioSrc
    // Size: 0x1
    // Offset: 0xF4
    bool hasVolcanoAudioSrc;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean hasForestSpeakerAudioSrc
    // Size: 0x1
    // Offset: 0xF5
    bool hasForestSpeakerAudioSrc;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get instance field reference: private System.Boolean applyShaderGlobals
    [[deprecated("Use field access instead!")]] bool& dyn_applyShaderGlobals();
    // Get instance field reference: private UnityEngine.AudioSource forestSpeakerAudioSrc
    [[deprecated("Use field access instead!")]] ::UnityEngine::AudioSource*& dyn_forestSpeakerAudioSrc();
    // Get instance field reference: private UnityEngine.AudioClip warnVolcanoBellyEmptied
    [[deprecated("Use field access instead!")]] ::UnityEngine::AudioClip*& dyn_warnVolcanoBellyEmptied();
    // Get instance field reference: private UnityEngine.AudioSource volcanoAudioSource
    [[deprecated("Use field access instead!")]] ::UnityEngine::AudioSource*& dyn_volcanoAudioSource();
    // Get instance field reference: private UnityEngine.AudioClip volcanoAcceptStone
