// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.Rendering.DebugUI
#include "UnityEngine/Rendering/DebugUI.hpp"
// Including type: System.Nullable`1
#include "System/Nullable_1.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::Rendering
namespace UnityEngine::Rendering {
  // Forward declaring type: DebugActionDesc
  class DebugActionDesc;
  // Forward declaring type: DebugActionState
  class DebugActionState;
  // Forward declaring type: DebugAction
  struct DebugAction;
  // Forward declaring type: IDebugData
  class IDebugData;
}
// Forward declaring namespace: UnityEngine::InputSystem
namespace UnityEngine::InputSystem {
  // Forward declaring type: InputActionMap
  class InputActionMap;
}
// Forward declaring namespace: System::Collections::ObjectModel
namespace System::Collections::ObjectModel {
  // Forward declaring type: ReadOnlyCollection`1<T>
  template<typename T>
  class ReadOnlyCollection_1;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Lazy`1<T>
  template<typename T>
  class Lazy_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: UnityEngine::Rendering::UI
namespace UnityEngine::Rendering::UI {
  // Forward declaring type: DebugUIHandlerCanvas
  class DebugUIHandlerCanvas;
  // Forward declaring type: DebugUIHandlerPersistentCanvas
  class DebugUIHandlerPersistentCanvas;
  // Forward declaring type: DebugUIHandlerWidget
  class DebugUIHandlerWidget;
}
// Completed forward declares
// Type namespace: UnityEngine.Rendering
namespace UnityEngine::Rendering {
  // Forward declaring type: DebugManager
  class DebugManager;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::Rendering::DebugManager);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::Rendering::DebugManager*, "UnityEngine.Rendering", "DebugManager");
// Type namespace: UnityEngine.Rendering
namespace UnityEngine::Rendering {
  // WARNING Size may be invalid!
  // Autogenerated type: UnityEngine.Rendering.DebugManager
  // [TokenAttribute] Offset: FFFFFFFF
  class DebugManager : public ::Il2CppObject {
    public:
    // Nested type: ::UnityEngine::Rendering::DebugManager::$$c
    class $$c;
    public:
    // private UnityEngine.Rendering.DebugActionDesc[] m_DebugActions
    // Size: 0x8
    // Offset: 0x10
    ::ArrayW<::UnityEngine::Rendering::DebugActionDesc*> m_DebugActions;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Rendering::DebugActionDesc*>) == 0x8);
    // private UnityEngine.Rendering.DebugActionState[] m_DebugActionStates
    // Size: 0x8
    // Offset: 0x18
    ::ArrayW<::UnityEngine::Rendering::DebugActionState*> m_DebugActionStates;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Rendering::DebugActionState*>) == 0x8);
    // private UnityEngine.InputSystem.InputActionMap debugActionMap
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::InputSystem::InputActionMap* debugActionMap;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionMap*) == 0x8);
    // private System.Collections.ObjectModel.ReadOnlyCollection`1<UnityEngine.Rendering.DebugUI/Panel> m_ReadOnlyPanels
    // Size: 0x8
    // Offset: 0x28
    ::System::Collections::ObjectModel::ReadOnlyCollection_1<::UnityEngine::Rendering::DebugUI::Panel*>* m_ReadOnlyPanels;
    // Field size check
    static_assert(sizeof(::System::Collections::ObjectModel::ReadOnlyCollection_1<::UnityEngine::Rendering::DebugUI::Panel*>*) == 0x8);
    // private readonly System.Collections.Generic.List`1<UnityEngine.Rendering.DebugUI/Panel> m_Panels
    // Size: 0x8
    // Offset: 0x30
    ::System::Collections::Generic::List_1<::UnityEngine::Rendering::DebugUI::Panel*>* m_Panels;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Rendering::DebugUI::Panel*>*) == 0x8);
    // private System.Action`1<System.Boolean> onDisplayRuntimeUIChanged
    // Size: 0x8
    // Offset: 0x38
    ::System::Action_1<bool>* onDisplayRuntimeUIChanged;
    // Field size check
    static_assert(sizeof(::System::Action_1<bool>*) == 0x8);
    // private System.Action onSetDirty
    // Size: 0x8
    // Offset: 0x40
    ::System::Action* onSetDirty;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private System.Action resetData
    // Size: 0x8
    // Offset: 0x48
    ::System::Action* resetData;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // public System.Boolean refreshEditorRequested
    // Size: 0x1
    // Offset: 0x50
    bool refreshEditorRequested;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Nullable`1<System.Int32> m_RequestedPanelIndex
    // Size: 0xFFFFFFFF
    // Offset: 0x54
    ::System::Nullable_1<int> m_RequestedPanelIndex;
    // private UnityEngine.GameObject m_Root
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::GameObject* m_Root;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.Rendering.UI.DebugUIHandlerCanvas m_RootUICanvas
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::Rendering::UI::DebugUIHandlerCanvas* m_RootUICanvas;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::UI::DebugUIHandlerCanvas*) == 0x8);
    // private UnityEngine.GameObject m_PersistentRoot
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::GameObject* m_PersistentRoot;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.Rendering.UI.DebugUIHandlerPersistentCanvas m_RootUIPersistentCanvas
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::Rendering::UI::DebugUIHandlerPersistentCanvas* m_RootUIPersistentCanvas;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::UI::DebugUIHandlerPersistentCanvas*) == 0x8);
    // private System.Boolean m_EnableRuntimeUI
    // Size: 0x1
    // Offset: 0x80
    bool m_EnableRuntimeUI;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get static field: static private readonly System.Lazy`1<UnityEngine.Rendering.DebugManager> s_Instance
    static ::System::Lazy_1<::UnityEngine::Rendering::DebugManager*>* _get_s_Instance();
    // Set static field: static private readonly System.Lazy`1<UnityEngine.Rendering.DebugManager> s_Instance
    static void _set_s_Instance(::System::Lazy_1<::UnityEngine::Rendering::DebugManager*>* value);
    // Get instance field reference: private UnityEngine.Rendering.DebugActionDesc[] m_DebugActions
    [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::Rendering::DebugActionDesc*>& dyn_m_DebugActions();
    // Get instance field reference: private UnityEngine.Rendering.DebugActionState[] m_DebugActionStates
    [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::Rendering::DebugActionState*>& dyn_m_DebugActionStates();
