// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include <stdint.h>
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: System.IEquatable`1
#include "System/IEquatable_1.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::Rendering
namespace UnityEngine::Rendering {
  // Forward declaring type: CompareFunction
  struct CompareFunction;
  // Forward declaring type: StencilOp
  struct StencilOp;
}
// Completed forward declares
// Begin il2cpp-utils forward declares
struct Il2CppObject;
// Completed il2cpp-utils forward declares
// Type namespace: UnityEngine.Rendering
namespace UnityEngine::Rendering {
  // Forward declaring type: StencilState
  struct StencilState;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::Rendering::StencilState, "UnityEngine.Rendering", "StencilState");
// Type namespace: UnityEngine.Rendering
namespace UnityEngine::Rendering {
  // Size: 0xC
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: UnityEngine.Rendering.StencilState
  // [TokenAttribute] Offset: FFFFFFFF
  struct StencilState/*, public ::System::ValueType, public ::System::IEquatable_1<::UnityEngine::Rendering::StencilState>*/ {
    public:
    public:
    // private System.Byte m_Enabled
    // Size: 0x1
    // Offset: 0x0
    uint8_t m_Enabled;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Byte m_ReadMask
    // Size: 0x1
    // Offset: 0x1
    uint8_t m_ReadMask;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Byte m_WriteMask
    // Size: 0x1
    // Offset: 0x2
    uint8_t m_WriteMask;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Byte m_Padding
    // Size: 0x1
    // Offset: 0x3
    uint8_t m_Padding;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Byte m_CompareFunctionFront
    // Size: 0x1
    // Offset: 0x4
    uint8_t m_CompareFunctionFront;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Byte m_PassOperationFront
    // Size: 0x1
    // Offset: 0x5
    uint8_t m_PassOperationFront;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Byte m_FailOperationFront
    // Size: 0x1
    // Offset: 0x6
    uint8_t m_FailOperationFront;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Byte m_ZFailOperationFront
    // Size: 0x1
    // Offset: 0x7
    uint8_t m_ZFailOperationFront;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Byte m_CompareFunctionBack
    // Size: 0x1
    // Offset: 0x8
    uint8_t m_CompareFunctionBack;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Byte m_PassOperationBack
    // Size: 0x1
    // Offset: 0x9
    uint8_t m_PassOperationBack;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Byte m_FailOperationBack
    // Size: 0x1
    // Offset: 0xA
    uint8_t m_FailOperationBack;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Byte m_ZFailOperationBack
    // Size: 0x1
    // Offset: 0xB
    uint8_t m_ZFailOperationBack;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    public:
    // Creating value type constructor for type: StencilState
