// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.Experimental.Rendering.GraphicsFormat
#include "UnityEngine/Experimental/Rendering/GraphicsFormat.hpp"
// Including type: System.ValueTuple`2
#include "System/ValueTuple_2.hpp"
// Including type: UnityEngine.Vector4
#include "UnityEngine/Vector4.hpp"
// Including type: UnityEngine.Vector2Int
#include "UnityEngine/Vector2Int.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
// Including type: UnityEngine.FilterMode
#include "UnityEngine/FilterMode.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::Rendering
namespace UnityEngine::Rendering {
  // Forward declaring type: RTHandle
  class RTHandle;
  // Forward declaring type: AtlasAllocator
  class AtlasAllocator;
  // Forward declaring type: CommandBuffer
  class CommandBuffer;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Texture
  class Texture;
}
// Completed forward declares
// Type namespace: UnityEngine.Rendering
namespace UnityEngine::Rendering {
  // Forward declaring type: Texture2DAtlas
  class Texture2DAtlas;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::Rendering::Texture2DAtlas);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::Rendering::Texture2DAtlas*, "UnityEngine.Rendering", "Texture2DAtlas");
// Type namespace: UnityEngine.Rendering
namespace UnityEngine::Rendering {
  // Size: 0x48
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.Rendering.Texture2DAtlas
  // [TokenAttribute] Offset: FFFFFFFF
  class Texture2DAtlas : public ::Il2CppObject {
    public:
    // Nested type: ::UnityEngine::Rendering::Texture2DAtlas::BlitType
    struct BlitType;
    public:
    // UnityEngine.Rendering.RTHandle m_AtlasTexture
    // Size: 0x8
    // Offset: 0x10
    ::UnityEngine::Rendering::RTHandle* m_AtlasTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::RTHandle*) == 0x8);
    // System.Int32 m_Width
    // Size: 0x4
    // Offset: 0x18
    int m_Width;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 m_Height
    // Size: 0x4
    // Offset: 0x1C
    int m_Height;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // UnityEngine.Experimental.Rendering.GraphicsFormat m_Format
    // Size: 0x4
    // Offset: 0x20
    ::UnityEngine::Experimental::Rendering::GraphicsFormat m_Format;
    // Field size check
    static_assert(sizeof(::UnityEngine::Experimental::Rendering::GraphicsFormat) == 0x4);
    // System.Boolean m_UseMipMaps
    // Size: 0x1
    // Offset: 0x24
    bool m_UseMipMaps;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_IsAtlasTextureOwner
    // Size: 0x1
    // Offset: 0x25
    bool m_IsAtlasTextureOwner;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_IsAtlasTextureOwner and: m_AtlasAllocator
    char __padding5[0x2] = {};
    // private UnityEngine.Rendering.AtlasAllocator m_AtlasAllocator
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::Rendering::AtlasAllocator* m_AtlasAllocator;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::AtlasAllocator*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.Int32,System.ValueTuple`2<UnityEngine.Vector4,UnityEngine.Vector2Int>> m_AllocationCache
    // Size: 0x8
    // Offset: 0x30
    ::System::Collections::Generic::Dictionary_2<int, ::System::ValueTuple_2<::UnityEngine::Vector4, ::UnityEngine::Vector2Int>>* m_AllocationCache;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<int, ::System::ValueTuple_2<::UnityEngine::Vector4, ::UnityEngine::Vector2Int>>*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.Int32,System.Int32> m_IsGPUTextureUpToDate
    // Size: 0x8
    // Offset: 0x38
    ::System::Collections::Generic::Dictionary_2<int, int>* m_IsGPUTextureUpToDate;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<int, int>*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.Int32,System.Int32> m_TextureHashes
    // Size: 0x8
    // Offset: 0x40
    ::System::Collections::Generic::Dictionary_2<int, int>* m_TextureHashes;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<int, int>*) == 0x8);
    public:
    // static field const value: static System.Int32 kGPUTexInvalid
    static constexpr const int kGPUTexInvalid = 0;
    // Get static field: static System.Int32 kGPUTexInvalid
    static int _get_kGPUTexInvalid();
    // Set static field: static System.Int32 kGPUTexInvalid
    static void _set_kGPUTexInvalid(int value);
    // static field const value: static System.Int32 kGPUTexValidMip0
    static constexpr const int kGPUTexValidMip0 = 1;
    // Get static field: static System.Int32 kGPUTexValidMip0
    static int _get_kGPUTexValidMip0();
    // Set static field: static System.Int32 kGPUTexValidMip0
    static void _set_kGPUTexValidMip0(int value);
    // static field const value: static System.Int32 kGPUTexValidMipAll
