// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueTuple`2
#include "System/ValueTuple_2.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::Rendering
namespace UnityEngine::Rendering {
  // Forward declaring type: VolumeStack
  class VolumeStack;
  // Forward declaring type: Volume
  class Volume;
  // Forward declaring type: VolumeComponent
  class VolumeComponent;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Type
  class Type;
  // Forward declaring type: Lazy`1<T>
  template<typename T>
  class Lazy_1;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Collider
  class Collider;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: LayerMask
  struct LayerMask;
}
// Completed forward declares
// Type namespace: UnityEngine.Rendering
namespace UnityEngine::Rendering {
  // Forward declaring type: VolumeManager
  class VolumeManager;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::Rendering::VolumeManager);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::Rendering::VolumeManager*, "UnityEngine.Rendering", "VolumeManager");
// Type namespace: UnityEngine.Rendering
namespace UnityEngine::Rendering {
  // Size: 0x50
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.Rendering.VolumeManager
  // [TokenAttribute] Offset: FFFFFFFF
  class VolumeManager : public ::Il2CppObject {
    public:
    // Nested type: ::UnityEngine::Rendering::VolumeManager::$$c
    class $$c;
    public:
    // private UnityEngine.Rendering.VolumeStack <stack>k__BackingField
    // Size: 0x8
    // Offset: 0x10
    ::UnityEngine::Rendering::VolumeStack* stack;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::VolumeStack*) == 0x8);
    // private System.Type[] <baseComponentTypeArray>k__BackingField
    // Size: 0x8
    // Offset: 0x18
    ::ArrayW<::System::Type*> baseComponentTypeArray;
    // Field size check
    static_assert(sizeof(::ArrayW<::System::Type*>) == 0x8);
    // private readonly System.Collections.Generic.Dictionary`2<System.Int32,System.Collections.Generic.List`1<UnityEngine.Rendering.Volume>> m_SortedVolumes
    // Size: 0x8
    // Offset: 0x20
    ::System::Collections::Generic::Dictionary_2<int, ::System::Collections::Generic::List_1<::UnityEngine::Rendering::Volume*>*>* m_SortedVolumes;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<int, ::System::Collections::Generic::List_1<::UnityEngine::Rendering::Volume*>*>*) == 0x8);
    // private readonly System.Collections.Generic.List`1<UnityEngine.Rendering.Volume> m_Volumes
    // Size: 0x8
    // Offset: 0x28
    ::System::Collections::Generic::List_1<::UnityEngine::Rendering::Volume*>* m_Volumes;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Rendering::Volume*>*) == 0x8);
    // private readonly System.Collections.Generic.Dictionary`2<System.Int32,System.Boolean> m_SortNeeded
    // Size: 0x8
    // Offset: 0x30
    ::System::Collections::Generic::Dictionary_2<int, bool>* m_SortNeeded;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<int, bool>*) == 0x8);
    // private readonly System.Collections.Generic.List`1<UnityEngine.Rendering.VolumeComponent> m_ComponentsDefaultState
    // Size: 0x8
    // Offset: 0x38
    ::System::Collections::Generic::List_1<::UnityEngine::Rendering::VolumeComponent*>* m_ComponentsDefaultState;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Rendering::VolumeComponent*>*) == 0x8);
    // private readonly System.Collections.Generic.List`1<UnityEngine.Collider> m_TempColliders
    // Size: 0x8
    // Offset: 0x40
    ::System::Collections::Generic::List_1<::UnityEngine::Collider*>* m_TempColliders;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Collider*>*) == 0x8);
    // private UnityEngine.Rendering.VolumeStack m_DefaultStack
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::Rendering::VolumeStack* m_DefaultStack;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::VolumeStack*) == 0x8);
    public:
    // Get static field: static private readonly System.Lazy`1<UnityEngine.Rendering.VolumeManager> s_Instance
    static ::System::Lazy_1<::UnityEngine::Rendering::VolumeManager*>* _get_s_Instance();
    // Set static field: static private readonly System.Lazy`1<UnityEngine.Rendering.VolumeManager> s_Instance
    static void _set_s_Instance(::System::Lazy_1<::UnityEngine::Rendering::VolumeManager*>* value);
    // Get static field: static private readonly System.Collections.Generic.Dictionary`2<System.Type,System.Collections.Generic.List`1<System.ValueTuple`2<System.String,System.Type>>> s_SupportedVolumeComponentsForRenderPipeline
