// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.Rendering.IVolumeDebugSettings2
#include "UnityEngine/Rendering/IVolumeDebugSettings2.hpp"
// Including type: UnityEngine.LayerMask
#include "UnityEngine/LayerMask.hpp"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::Rendering
namespace UnityEngine::Rendering {
  // Skipping declaration: <>c because it is already included!
  // Forward declaring type: IAdditionalData
  class IAdditionalData;
  // Forward declaring type: Volume
  class Volume;
  // Forward declaring type: VolumeParameter
  class VolumeParameter;
  // Forward declaring type: VolumeStack
  class VolumeStack;
  // Forward declaring type: VolumeComponent
  class VolumeComponent;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: MonoBehaviour
  class MonoBehaviour;
  // Forward declaring type: Camera
  class Camera;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: IEnumerable`1<T>
  template<typename T>
  class IEnumerable_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Type
  class Type;
  // Forward declaring type: Func`2<T, TResult>
  template<typename T, typename TResult>
  class Func_2;
}
// Forward declaring namespace: System::Reflection
namespace System::Reflection {
  // Forward declaring type: FieldInfo
  class FieldInfo;
}
// Completed forward declares
// Type namespace: UnityEngine.Rendering
namespace UnityEngine::Rendering {
  // Forward declaring type: VolumeDebugSettings`1<T>
  template<typename T>
  class VolumeDebugSettings_1;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE_GENERIC_CLASS(::UnityEngine::Rendering::VolumeDebugSettings_1, "UnityEngine.Rendering", "VolumeDebugSettings`1");
// Type namespace: UnityEngine.Rendering
namespace UnityEngine::Rendering {
  // WARNING Size may be invalid!
  // Autogenerated type: UnityEngine.Rendering.VolumeDebugSettings`1
  // [TokenAttribute] Offset: FFFFFFFF
  template<typename T>
  class VolumeDebugSettings_1 : public ::Il2CppObject/*, public ::UnityEngine::Rendering::IVolumeDebugSettings2*/ {
    public:
    // Nested type: ::UnityEngine::Rendering::VolumeDebugSettings_1::$$c<T>
    class $$c;
    // WARNING Size may be invalid!
    // Autogenerated type: UnityEngine.Rendering.VolumeDebugSettings`1/<>c
    // [TokenAttribute] Offset: FFFFFFFF
    // [CompilerGeneratedAttribute] Offset: FFFFFFFF
    class $$c : public ::il2cpp_utils::il2cpp_type_check::NestedType, public ::Il2CppObject {
      public:
      using declaring_type = VolumeDebugSettings_1<T>*;
      static constexpr std::string_view NESTED_NAME = "<>c";
      static constexpr bool IS_VALUE_TYPE = false;
      // Autogenerated static field getter
      // Get static field: static public readonly UnityEngine.Rendering.VolumeDebugSettings`1/<>c<T> <>9
      static typename ::UnityEngine::Rendering::VolumeDebugSettings_1<T>::$$c* _get_$$9() {
        static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::Rendering::VolumeDebugSettings_1::$$c::_get_$$9");
        return THROW_UNLESS((il2cpp_utils::GetFieldValue<typename ::UnityEngine::Rendering::VolumeDebugSettings_1<T>::$$c*>(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename VolumeDebugSettings_1<T>::$$c*>::get(), "<>9")));
      }
      // Autogenerated static field setter
      // Set static field: static public readonly UnityEngine.Rendering.VolumeDebugSettings`1/<>c<T> <>9
      static void _set_$$9(typename ::UnityEngine::Rendering::VolumeDebugSettings_1<T>::$$c* value) {
        static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::Rendering::VolumeDebugSettings_1::$$c::_set_$$9");
        THROW_UNLESS((il2cpp_utils::SetFieldValue(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename VolumeDebugSettings_1<T>::$$c*>::get(), "<>9", value)));
      }
      // Autogenerated static field getter
      // Get static field: static public System.Func`2<UnityEngine.Rendering.Volume,System.Boolean> <>9__35_0
      static ::System::Func_2<::UnityEngine::Rendering::Volume*, bool>* _get_$$9__35_0() {
        static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::Rendering::VolumeDebugSettings_1::$$c::_get_$$9__35_0");
        return THROW_UNLESS((il2cpp_utils::GetFieldValue<::System::Func_2<::UnityEngine::Rendering::Volume*, bool>*>(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename VolumeDebugSettings_1<T>::$$c*>::get(), "<>9__35_0")));
      }
      // Autogenerated static field setter
      // Set static field: static public System.Func`2<UnityEngine.Rendering.Volume,System.Boolean> <>9__35_0
      static void _set_$$9__35_0(::System::Func_2<::UnityEngine::Rendering::Volume*, bool>* value) {
        static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::Rendering::VolumeDebugSettings_1::$$c::_set_$$9__35_0");
        THROW_UNLESS((il2cpp_utils::SetFieldValue(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename VolumeDebugSettings_1<T>::$$c*>::get(), "<>9__35_0", value)));
      }
      // Autogenerated static field getter
      // Get static field: static public System.Func`2<System.Reflection.FieldInfo,System.Boolean> <>9__37_0
      static ::System::Func_2<::System::Reflection::FieldInfo*, bool>* _get_$$9__37_0() {
        static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::Rendering::VolumeDebugSettings_1::$$c::_get_$$9__37_0");
        return THROW_UNLESS((il2cpp_utils::GetFieldValue<::System::Func_2<::System::Reflection::FieldInfo*, bool>*>(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename VolumeDebugSettings_1<T>::$$c*>::get(), "<>9__37_0")));
      }
      // Autogenerated static field setter
      // Set static field: static public System.Func`2<System.Reflection.FieldInfo,System.Boolean> <>9__37_0
      static void _set_$$9__37_0(::System::Func_2<::System::Reflection::FieldInfo*, bool>* value) {
        static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::Rendering::VolumeDebugSettings_1::$$c::_set_$$9__37_0");
        THROW_UNLESS((il2cpp_utils::SetFieldValue(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename VolumeDebugSettings_1<T>::$$c*>::get(), "<>9__37_0", value)));
      }
      // static private System.Void .cctor()
      // Offset: 0xFFFFFFFFFFFFFFFF
      static void _cctor() {
        static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::Rendering::VolumeDebugSettings_1::$$c::.cctor");
        static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(::il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename VolumeDebugSettings_1<T>::$$c*>::get(), ".cctor", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{})));
        ::il2cpp_utils::RunMethodRethrow<void, false>(static_cast<Il2CppObject*>(nullptr), ___internal__method);
      }
      // public System.Void .ctor()
      // Offset: 0xFFFFFFFFFFFFFFFF
      template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
      static typename VolumeDebugSettings_1<T>::$$c* New_ctor() {
        static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::Rendering::VolumeDebugSettings_1::$$c::.ctor");
        return THROW_UNLESS((::il2cpp_utils::New<typename VolumeDebugSettings_1<T>::$$c*, creationType>()));
      }
      // System.Boolean <GetVolumes>b__35_0(UnityEngine.Rendering.Volume v)
      // Offset: 0xFFFFFFFFFFFFFFFF
      bool $GetVolumes$b__35_0(::UnityEngine::Rendering::Volume* v) {
        static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::Rendering::VolumeDebugSettings_1::$$c::<GetVolumes>b__35_0");
        static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(this, "<GetVolumes>b__35_0", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractType(v)})));
        return ::il2cpp_utils::RunMethodRethrow<bool, false>(this, ___internal__method, v);
      }
      // System.Boolean <GetStates>b__37_0(System.Reflection.FieldInfo t)
      // Offset: 0xFFFFFFFFFFFFFFFF
      bool $GetStates$b__37_0(::System::Reflection::FieldInfo* t) {
        static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::Rendering::VolumeDebugSettings_1::$$c::<GetStates>b__37_0");
        static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(this, "<GetStates>b__37_0", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractType(t)})));
        return ::il2cpp_utils::RunMethodRethrow<bool, false>(this, ___internal__method, t);
      }
    }; // UnityEngine.Rendering.VolumeDebugSettings`1/<>c
    // Could not write size check! Type: UnityEngine.Rendering.VolumeDebugSettings`1/<>c is generic, or has no fields that are valid for size checks!
    public:
    // private System.Int32 <selectedComponent>k__BackingField
    // Size: 0x4
    // Offset: 0x0
    int selectedComponent;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.Camera m_SelectedCamera
    // Size: 0x8
    // Offset: 0x0
    ::UnityEngine::Camera* m_SelectedCamera;
    // Field size check
    static_assert(sizeof(::UnityEngine::Camera*) == 0x8);
    // protected System.Int32 m_SelectedCameraIndex
    // Size: 0x4
    // Offset: 0x0
    int m_SelectedCameraIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.Camera[] m_CamerasArray
    // Size: 0x8
    // Offset: 0x0
    ::ArrayW<::UnityEngine::Camera*> m_CamerasArray;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Camera*>) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.Camera> m_Cameras
    // Size: 0x8
    // Offset: 0x0
    ::System::Collections::Generic::List_1<::UnityEngine::Camera*>* m_Cameras;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Camera*>*) == 0x8);
    // private System.Single[] weights
    // Size: 0x8
    // Offset: 0x0
    ::ArrayW<float> weights;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    // private UnityEngine.Rendering.Volume[] volumes
    // Size: 0x8
    // Offset: 0x0
    ::ArrayW<::UnityEngine::Rendering::Volume*> volumes;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Rendering::Volume*>) == 0x8);
    // private UnityEngine.Rendering.VolumeParameter[,] savedStates
    // Size: 0x8
    // Offset: 0x0
    ::ArrayW<::UnityEngine::Rendering::VolumeParameter*> savedStates;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Rendering::VolumeParameter*>) == 0x8);
    public:
    // Creating interface conversion operator: operator ::UnityEngine::Rendering::IVolumeDebugSettings2
    operator ::UnityEngine::Rendering::IVolumeDebugSettings2() noexcept {
      return *reinterpret_cast<::UnityEngine::Rendering::IVolumeDebugSettings2*>(this);
    }
    // Autogenerated static field getter
    // Get static field: static private System.Collections.Generic.List`1<System.ValueTuple`2<System.String,System.Type>> s_ComponentPathAndType
    static ::System::Collections::Generic::List_1<::System::ValueTuple_2<::StringW, ::System::Type*>>* _get_s_ComponentPathAndType() {
      static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::Rendering::VolumeDebugSettings_1::_get_s_ComponentPathAndType");
