// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.Rendering.Universal.LibTessDotNet.Tess
#include "UnityEngine/Rendering/Universal/LibTessDotNet/Tess.hpp"
// Including type: UnityEngine.Rendering.Universal.LibTessDotNet.MeshUtils
#include "UnityEngine/Rendering/Universal/LibTessDotNet/MeshUtils.hpp"
// Including type: UnityEngine.Rendering.Universal.LibTessDotNet.Dict`1
#include "UnityEngine/Rendering/Universal/LibTessDotNet/Dict_1.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::Rendering::Universal::LibTessDotNet::Tess::ActiveRegion);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::Rendering::Universal::LibTessDotNet::Tess::ActiveRegion*, "UnityEngine.Rendering.Universal.LibTessDotNet", "Tess/ActiveRegion");
// Type namespace: UnityEngine.Rendering.Universal.LibTessDotNet
namespace UnityEngine::Rendering::Universal::LibTessDotNet {
  // Size: 0x28
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.Rendering.Universal.LibTessDotNet.Tess/ActiveRegion
  // [TokenAttribute] Offset: FFFFFFFF
  class Tess::ActiveRegion : public ::Il2CppObject {
    public:
    public:
    // UnityEngine.Rendering.Universal.LibTessDotNet.MeshUtils/Edge _eUp
    // Size: 0x8
    // Offset: 0x10
    ::UnityEngine::Rendering::Universal::LibTessDotNet::MeshUtils::Edge* eUp;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::LibTessDotNet::MeshUtils::Edge*) == 0x8);
    // UnityEngine.Rendering.Universal.LibTessDotNet.Dict`1/Node<UnityEngine.Rendering.Universal.LibTessDotNet.Tess/ActiveRegion> _nodeUp
    // Size: 0x8
    // Offset: 0x18
    typename ::UnityEngine::Rendering::Universal::LibTessDotNet::Dict_1<::UnityEngine::Rendering::Universal::LibTessDotNet::Tess::ActiveRegion*>::Node* nodeUp;
    // Field size check
    static_assert(sizeof(typename ::UnityEngine::Rendering::Universal::LibTessDotNet::Dict_1<::UnityEngine::Rendering::Universal::LibTessDotNet::Tess::ActiveRegion*>::Node*) == 0x8);
    // System.Int32 _windingNumber
    // Size: 0x4
    // Offset: 0x20
    int windingNumber;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Boolean _inside
    // Size: 0x1
    // Offset: 0x24
    bool inside;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // System.Boolean _sentinel
    // Size: 0x1
    // Offset: 0x25
    bool sentinel;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // System.Boolean _dirty
    // Size: 0x1
    // Offset: 0x26
    bool dirty;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // System.Boolean _fixUpperEdge
    // Size: 0x1
    // Offset: 0x27
    bool fixUpperEdge;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get instance field reference: UnityEngine.Rendering.Universal.LibTessDotNet.MeshUtils/Edge _eUp
    [[deprecated("Use field access instead!")]] ::UnityEngine::Rendering::Universal::LibTessDotNet::MeshUtils::Edge*& dyn__eUp();
    // Get instance field reference: UnityEngine.Rendering.Universal.LibTessDotNet.Dict`1/Node<UnityEngine.Rendering.Universal.LibTessDotNet.Tess/ActiveRegion> _nodeUp
    [[deprecated("Use field access instead!")]] typename ::UnityEngine::Rendering::Universal::LibTessDotNet::Dict_1<::UnityEngine::Rendering::Universal::LibTessDotNet::Tess::ActiveRegion*>::Node*& dyn__nodeUp();
    // Get instance field reference: System.Int32 _windingNumber
    [[deprecated("Use field access instead!")]] int& dyn__windingNumber();
    // Get instance field reference: System.Boolean _inside
    [[deprecated("Use field access instead!")]] bool& dyn__inside();
    // Get instance field reference: System.Boolean _sentinel
    [[deprecated("Use field access instead!")]] bool& dyn__sentinel();
    // Get instance field reference: System.Boolean _dirty
    [[deprecated("Use field access instead!")]] bool& dyn__dirty();
    // Get instance field reference: System.Boolean _fixUpperEdge
    [[deprecated("Use field access instead!")]] bool& dyn__fixUpperEdge();
    // public System.Void .ctor()
    // Offset: 0x52FCC80
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static Tess::ActiveRegion* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::Rendering::Universal::LibTessDotNet::Tess::ActiveRegion::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<Tess::ActiveRegion*, creationType>()));
    }
  }; // UnityEngine.Rendering.Universal.LibTessDotNet.Tess/ActiveRegion
  #pragma pack(pop)
  static check_size<sizeof(Tess::ActiveRegion), 39 + sizeof(bool)> __UnityEngine_Rendering_Universal_LibTessDotNet_Tess_ActiveRegionSizeCheck;
  static_assert(sizeof(Tess::ActiveRegion) == 0x28);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: UnityEngine::Rendering::Universal::LibTessDotNet::Tess::ActiveRegion::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
