// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.Rendering.Universal.LibTessDotNet.Vec3
#include "UnityEngine/Rendering/Universal/LibTessDotNet/Vec3.hpp"
// Including type: UnityEngine.Rendering.Universal.LibTessDotNet.WindingRule
#include "UnityEngine/Rendering/Universal/LibTessDotNet/WindingRule.hpp"
// Including type: UnityEngine.Rendering.Universal.LibTessDotNet.MeshUtils
#include "UnityEngine/Rendering/Universal/LibTessDotNet/MeshUtils.hpp"
// Including type: UnityEngine.Rendering.Universal.LibTessDotNet.ContourVertex
#include "UnityEngine/Rendering/Universal/LibTessDotNet/ContourVertex.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::Rendering::Universal::LibTessDotNet
namespace UnityEngine::Rendering::Universal::LibTessDotNet {
  // Forward declaring type: Mesh
  class Mesh;
  // Forward declaring type: Dict`1<TValue>
  template<typename TValue>
  class Dict_1;
  // Forward declaring type: PriorityQueue`1<TValue>
  template<typename TValue>
  class PriorityQueue_1;
  // Forward declaring type: CombineCallback
  class CombineCallback;
  // Forward declaring type: ElementType
  struct ElementType;
  // Forward declaring type: ContourOrientation
  struct ContourOrientation;
}
// Completed forward declares
// Type namespace: UnityEngine.Rendering.Universal.LibTessDotNet
namespace UnityEngine::Rendering::Universal::LibTessDotNet {
  // Forward declaring type: Tess
  class Tess;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::Rendering::Universal::LibTessDotNet::Tess);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::Rendering::Universal::LibTessDotNet::Tess*, "UnityEngine.Rendering.Universal.LibTessDotNet", "Tess");
// Type namespace: UnityEngine.Rendering.Universal.LibTessDotNet
namespace UnityEngine::Rendering::Universal::LibTessDotNet {
  // Size: 0x9A
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.Rendering.Universal.LibTessDotNet.Tess
  // [TokenAttribute] Offset: FFFFFFFF
  class Tess : public ::Il2CppObject {
    public:
    // Nested type: ::UnityEngine::Rendering::Universal::LibTessDotNet::Tess::ActiveRegion
    class ActiveRegion;
    public:
    // private UnityEngine.Rendering.Universal.LibTessDotNet.Mesh _mesh
    // Size: 0x8
    // Offset: 0x10
    ::UnityEngine::Rendering::Universal::LibTessDotNet::Mesh* mesh;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::LibTessDotNet::Mesh*) == 0x8);
    // private UnityEngine.Rendering.Universal.LibTessDotNet.Vec3 _normal
    // Size: 0xC
    // Offset: 0x18
    ::UnityEngine::Rendering::Universal::LibTessDotNet::Vec3 normal;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::LibTessDotNet::Vec3) == 0xC);
    // private UnityEngine.Rendering.Universal.LibTessDotNet.Vec3 _sUnit
    // Size: 0xC
    // Offset: 0x24
    ::UnityEngine::Rendering::Universal::LibTessDotNet::Vec3 sUnit;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::LibTessDotNet::Vec3) == 0xC);
    // private UnityEngine.Rendering.Universal.LibTessDotNet.Vec3 _tUnit
    // Size: 0xC
    // Offset: 0x30
    ::UnityEngine::Rendering::Universal::LibTessDotNet::Vec3 tUnit;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::LibTessDotNet::Vec3) == 0xC);
    // private System.Single _bminX
    // Size: 0x4
    // Offset: 0x3C
    float bminX;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _bminY
    // Size: 0x4
    // Offset: 0x40
    float bminY;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _bmaxX
    // Size: 0x4
    // Offset: 0x44
    float bmaxX;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _bmaxY
    // Size: 0x4
    // Offset: 0x48
    float bmaxY;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Rendering.Universal.LibTessDotNet.WindingRule _windingRule
    // Size: 0x4
    // Offset: 0x4C
    ::UnityEngine::Rendering::Universal::LibTessDotNet::WindingRule windingRule;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::LibTessDotNet::WindingRule) == 0x4);
    // private UnityEngine.Rendering.Universal.LibTessDotNet.Dict`1<UnityEngine.Rendering.Universal.LibTessDotNet.Tess/ActiveRegion> _dict
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::Rendering::Universal::LibTessDotNet::Dict_1<::UnityEngine::Rendering::Universal::LibTessDotNet::Tess::ActiveRegion*>* dict;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::LibTessDotNet::Dict_1<::UnityEngine::Rendering::Universal::LibTessDotNet::Tess::ActiveRegion*>*) == 0x8);
    // private UnityEngine.Rendering.Universal.LibTessDotNet.PriorityQueue`1<UnityEngine.Rendering.Universal.LibTessDotNet.MeshUtils/Vertex> _pq
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::Rendering::Universal::LibTessDotNet::PriorityQueue_1<::UnityEngine::Rendering::Universal::LibTessDotNet::MeshUtils::Vertex*>* pq;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::LibTessDotNet::PriorityQueue_1<::UnityEngine::Rendering::Universal::LibTessDotNet::MeshUtils::Vertex*>*) == 0x8);
    // private UnityEngine.Rendering.Universal.LibTessDotNet.MeshUtils/Vertex _event
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::Rendering::Universal::LibTessDotNet::MeshUtils::Vertex* event;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::LibTessDotNet::MeshUtils::Vertex*) == 0x8);
    // private UnityEngine.Rendering.Universal.LibTessDotNet.CombineCallback _combineCallback
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::Rendering::Universal::LibTessDotNet::CombineCallback* combineCallback;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::LibTessDotNet::CombineCallback*) == 0x8);
    // private UnityEngine.Rendering.Universal.LibTessDotNet.ContourVertex[] _vertices
    // Size: 0x8
    // Offset: 0x70
    ::ArrayW<::UnityEngine::Rendering::Universal::LibTessDotNet::ContourVertex> vertices;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Rendering::Universal::LibTessDotNet::ContourVertex>) == 0x8);
    // private System.Int32 _vertexCount
    // Size: 0x4
    // Offset: 0x78
    int vertexCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: vertexCount and: elements
    char __padding14[0x4] = {};
    // private System.Int32[] _elements
    // Size: 0x8
    // Offset: 0x80
    ::ArrayW<int> elements;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // private System.Int32 _elementCount
    // Size: 0x4
    // Offset: 0x88
    int elementCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Single SUnitX
    // Size: 0x4
    // Offset: 0x8C
    float SUnitX;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single SUnitY
    // Size: 0x4
    // Offset: 0x90
    float SUnitY;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single SentinelCoord
    // Size: 0x4
    // Offset: 0x94
    float SentinelCoord;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean NoEmptyPolygons
    // Size: 0x1
    // Offset: 0x98
    bool NoEmptyPolygons;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean UsePooling
    // Size: 0x1
    // Offset: 0x99
    bool UsePooling;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get instance field reference: private UnityEngine.Rendering.Universal.LibTessDotNet.Mesh _mesh
    [[deprecated("Use field access instead!")]] ::UnityEngine::Rendering::Universal::LibTessDotNet::Mesh*& dyn__mesh();
    // Get instance field reference: private UnityEngine.Rendering.Universal.LibTessDotNet.Vec3 _normal
    [[deprecated("Use field access instead!")]] ::UnityEngine::Rendering::Universal::LibTessDotNet::Vec3& dyn__normal();
    // Get instance field reference: private UnityEngine.Rendering.Universal.LibTessDotNet.Vec3 _sUnit
    [[deprecated("Use field access instead!")]] ::UnityEngine::Rendering::Universal::LibTessDotNet::Vec3& dyn__sUnit();
    // Get instance field reference: private UnityEngine.Rendering.Universal.LibTessDotNet.Vec3 _tUnit
