// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.UIElements.BaseVerticalCollectionView
#include "UnityEngine/UIElements/BaseVerticalCollectionView.hpp"
// Including type: UnityEngine.UIElements.BindableElement/UxmlTraits
#include "UnityEngine/UIElements/BindableElement_UxmlTraits.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: UxmlIntAttributeDescription
  class UxmlIntAttributeDescription;
  // Forward declaring type: UxmlEnumAttributeDescription`1<T>
  template<typename T>
  class UxmlEnumAttributeDescription_1;
  // Forward declaring type: UxmlBoolAttributeDescription
  class UxmlBoolAttributeDescription;
  // Skipping declaration: VisualElement because it is already included!
  // Forward declaring type: IUxmlAttributes
  class IUxmlAttributes;
  // Forward declaring type: CreationContext
  struct CreationContext;
}
// Completed forward declares
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::UIElements::BaseVerticalCollectionView::UxmlTraits);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UIElements::BaseVerticalCollectionView::UxmlTraits*, "UnityEngine.UIElements", "BaseVerticalCollectionView/UxmlTraits");
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Size: 0xB0
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.UIElements.BaseVerticalCollectionView/UxmlTraits
  // [TokenAttribute] Offset: FFFFFFFF
  class BaseVerticalCollectionView::UxmlTraits : public ::UnityEngine::UIElements::BindableElement::UxmlTraits {
    public:
    public:
    // private readonly UnityEngine.UIElements.UxmlIntAttributeDescription m_FixedItemHeight
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::UIElements::UxmlIntAttributeDescription* m_FixedItemHeight;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UxmlIntAttributeDescription*) == 0x8);
    // private readonly UnityEngine.UIElements.UxmlEnumAttributeDescription`1<UnityEngine.UIElements.CollectionVirtualizationMethod> m_VirtualizationMethod
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::UIElements::UxmlEnumAttributeDescription_1<::UnityEngine::UIElements::CollectionVirtualizationMethod>* m_VirtualizationMethod;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UxmlEnumAttributeDescription_1<::UnityEngine::UIElements::CollectionVirtualizationMethod>*) == 0x8);
    // private readonly UnityEngine.UIElements.UxmlBoolAttributeDescription m_ShowBorder
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::UIElements::UxmlBoolAttributeDescription* m_ShowBorder;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UxmlBoolAttributeDescription*) == 0x8);
    // private readonly UnityEngine.UIElements.UxmlEnumAttributeDescription`1<UnityEngine.UIElements.SelectionType> m_SelectionType
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::UIElements::UxmlEnumAttributeDescription_1<::UnityEngine::UIElements::SelectionType>* m_SelectionType;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UxmlEnumAttributeDescription_1<::UnityEngine::UIElements::SelectionType>*) == 0x8);
    // private readonly UnityEngine.UIElements.UxmlEnumAttributeDescription`1<UnityEngine.UIElements.AlternatingRowBackground> m_ShowAlternatingRowBackgrounds
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::UIElements::UxmlEnumAttributeDescription_1<::UnityEngine::UIElements::AlternatingRowBackground>* m_ShowAlternatingRowBackgrounds;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UxmlEnumAttributeDescription_1<::UnityEngine::UIElements::AlternatingRowBackground>*) == 0x8);
    // private readonly UnityEngine.UIElements.UxmlBoolAttributeDescription m_Reorderable
    // Size: 0x8
    // Offset: 0xA0
    ::UnityEngine::UIElements::UxmlBoolAttributeDescription* m_Reorderable;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UxmlBoolAttributeDescription*) == 0x8);
    // private readonly UnityEngine.UIElements.UxmlBoolAttributeDescription m_HorizontalScrollingEnabled
    // Size: 0x8
    // Offset: 0xA8
    ::UnityEngine::UIElements::UxmlBoolAttributeDescription* m_HorizontalScrollingEnabled;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UxmlBoolAttributeDescription*) == 0x8);
    public:
    // Get instance field reference: private readonly UnityEngine.UIElements.UxmlIntAttributeDescription m_FixedItemHeight
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::UxmlIntAttributeDescription*& dyn_m_FixedItemHeight();
    // Get instance field reference: private readonly UnityEngine.UIElements.UxmlEnumAttributeDescription`1<UnityEngine.UIElements.CollectionVirtualizationMethod> m_VirtualizationMethod
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::UxmlEnumAttributeDescription_1<::UnityEngine::UIElements::CollectionVirtualizationMethod>*& dyn_m_VirtualizationMethod();
    // Get instance field reference: private readonly UnityEngine.UIElements.UxmlBoolAttributeDescription m_ShowBorder
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::UxmlBoolAttributeDescription*& dyn_m_ShowBorder();
    // Get instance field reference: private readonly UnityEngine.UIElements.UxmlEnumAttributeDescription`1<UnityEngine.UIElements.SelectionType> m_SelectionType
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::UxmlEnumAttributeDescription_1<::UnityEngine::UIElements::SelectionType>*& dyn_m_SelectionType();
    // Get instance field reference: private readonly UnityEngine.UIElements.UxmlEnumAttributeDescription`1<UnityEngine.UIElements.AlternatingRowBackground> m_ShowAlternatingRowBackgrounds
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::UxmlEnumAttributeDescription_1<::UnityEngine::UIElements::AlternatingRowBackground>*& dyn_m_ShowAlternatingRowBackgrounds();
    // Get instance field reference: private readonly UnityEngine.UIElements.UxmlBoolAttributeDescription m_Reorderable
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::UxmlBoolAttributeDescription*& dyn_m_Reorderable();
    // Get instance field reference: private readonly UnityEngine.UIElements.UxmlBoolAttributeDescription m_HorizontalScrollingEnabled
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::UxmlBoolAttributeDescription*& dyn_m_HorizontalScrollingEnabled();
    // public override System.Void Init(UnityEngine.UIElements.VisualElement ve, UnityEngine.UIElements.IUxmlAttributes bag, UnityEngine.UIElements.CreationContext cc)
    // Offset: 0x55A6608
    // Implemented from: UnityEngine.UIElements.BindableElement/UxmlTraits
    // Base method: System.Void UxmlTraits::Init(UnityEngine.UIElements.VisualElement ve, UnityEngine.UIElements.IUxmlAttributes bag, UnityEngine.UIElements.CreationContext cc)
    void Init(::UnityEngine::UIElements::VisualElement* ve, ::UnityEngine::UIElements::IUxmlAttributes* bag, ::UnityEngine::UIElements::CreationContext cc);
    // public System.Void .ctor()
    // Offset: 0x55A694C
    // Implemented from: UnityEngine.UIElements.BindableElement/UxmlTraits
    // Base method: System.Void UxmlTraits::.ctor()
    // Base method: System.Void UxmlTraits::.ctor()
    // Base method: System.Void UxmlTraits::.ctor()
    // Base method: System.Void BaseUxmlTraits::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static BaseVerticalCollectionView::UxmlTraits* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::UIElements::BaseVerticalCollectionView::UxmlTraits::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<BaseVerticalCollectionView::UxmlTraits*, creationType>()));
    }
  }; // UnityEngine.UIElements.BaseVerticalCollectionView/UxmlTraits
  #pragma pack(pop)
  static check_size<sizeof(BaseVerticalCollectionView::UxmlTraits), 168 + sizeof(::UnityEngine::UIElements::UxmlBoolAttributeDescription*)> __UnityEngine_UIElements_BaseVerticalCollectionView_UxmlTraitsSizeCheck;
  static_assert(sizeof(BaseVerticalCollectionView::UxmlTraits) == 0xB0);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: UnityEngine::UIElements::BaseVerticalCollectionView::UxmlTraits::Init
// Il2CppName: Init
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (UnityEngine::UIElements::BaseVerticalCollectionView::UxmlTraits::*)(::UnityEngine::UIElements::VisualElement*, ::UnityEngine::UIElements::IUxmlAttributes*, ::UnityEngine::UIElements::CreationContext)>(&UnityEngine::UIElements::BaseVerticalCollectionView::UxmlTraits::Init)> {
  static const MethodInfo* get() {
    static auto* ve = &::il2cpp_utils::GetClassFromName("UnityEngine.UIElements", "VisualElement")->byval_arg;
    static auto* bag = &::il2cpp_utils::GetClassFromName("UnityEngine.UIElements", "IUxmlAttributes")->byval_arg;
    static auto* cc = &::il2cpp_utils::GetClassFromName("UnityEngine.UIElements", "CreationContext")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::UIElements::BaseVerticalCollectionView::UxmlTraits*), "Init", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{ve, bag, cc});
  }
};
// Writing MetadataGetter for method: UnityEngine::UIElements::BaseVerticalCollectionView::UxmlTraits::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
