// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.UIElements.Panel
#include "UnityEngine/UIElements/Panel.hpp"
// Including type: UnityEngine.Matrix4x4
#include "UnityEngine/Matrix4x4.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: EventDispatcher
  class EventDispatcher;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Shader
  class Shader;
  // Forward declaring type: RenderTexture
  class RenderTexture;
  // Forward declaring type: ScriptableObject
  class ScriptableObject;
  // Forward declaring type: Event
  class Event;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Func`2<T, TResult>
  template<typename T, typename TResult>
  class Func_2;
}
// Completed forward declares
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: BaseRuntimePanel
  class BaseRuntimePanel;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::UIElements::BaseRuntimePanel);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UIElements::BaseRuntimePanel*, "UnityEngine.UIElements", "BaseRuntimePanel");
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Size: 0x1E8
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.UIElements.BaseRuntimePanel
  // [TokenAttribute] Offset: FFFFFFFF
  class BaseRuntimePanel : public ::UnityEngine::UIElements::Panel {
    public:
    // Writing base type padding for base size: 0x159 to desired offset: 0x160
    char ___base_padding[0x7] = {};
    // Nested type: ::UnityEngine::UIElements::BaseRuntimePanel::$$c
    class $$c;
    public:
    // private UnityEngine.GameObject m_SelectableGameObject
    // Size: 0x8
    // Offset: 0x160
    ::UnityEngine::GameObject* m_SelectableGameObject;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // readonly System.Int32 m_RuntimePanelCreationIndex
    // Size: 0x4
    // Offset: 0x168
    int m_RuntimePanelCreationIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single m_SortingPriority
    // Size: 0x4
    // Offset: 0x16C
    float m_SortingPriority;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // System.Int32 resolvedSortingIndex
    // Size: 0x4
    // Offset: 0x170
    int resolvedSortingIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: resolvedSortingIndex and: destroyed
    char __padding3[0x4] = {};
    // private System.Action destroyed
    // Size: 0x8
    // Offset: 0x178
    ::System::Action* destroyed;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private UnityEngine.Shader m_StandardWorldSpaceShader
    // Size: 0x8
    // Offset: 0x180
    ::UnityEngine::Shader* m_StandardWorldSpaceShader;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // private System.Boolean m_DrawToCameras
    // Size: 0x1
    // Offset: 0x188
    bool m_DrawToCameras;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_DrawToCameras and: targetTexture
    char __padding6[0x7] = {};
    // UnityEngine.RenderTexture targetTexture
    // Size: 0x8
    // Offset: 0x190
    ::UnityEngine::RenderTexture* targetTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::RenderTexture*) == 0x8);
    // UnityEngine.Matrix4x4 panelToWorld
    // Size: 0x40
    // Offset: 0x198
    ::UnityEngine::Matrix4x4 panelToWorld;
    // Field size check
    static_assert(sizeof(::UnityEngine::Matrix4x4) == 0x40);
    // private System.Int32 <targetDisplay>k__BackingField
    // Size: 0x4
    // Offset: 0x1D8
    int targetDisplay;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: targetDisplay and: m_ScreenToPanelSpace
    char __padding9[0x4] = {};
    // private System.Func`2<UnityEngine.Vector2,UnityEngine.Vector2> m_ScreenToPanelSpace
    // Size: 0x8
    // Offset: 0x1E0
    ::System::Func_2<::UnityEngine::Vector2, ::UnityEngine::Vector2>* m_ScreenToPanelSpace;
    // Field size check
    static_assert(sizeof(::System::Func_2<::UnityEngine::Vector2, ::UnityEngine::Vector2>*) == 0x8);
    public:
    // Get static field: static private System.Int32 s_CurrentRuntimePanelCounter
    static int _get_s_CurrentRuntimePanelCounter();
    // Set static field: static private System.Int32 s_CurrentRuntimePanelCounter
    static void _set_s_CurrentRuntimePanelCounter(int value);
    // Get static field: static readonly System.Func`2<UnityEngine.Vector2,UnityEngine.Vector2> DefaultScreenToPanelSpace
    static ::System::Func_2<::UnityEngine::Vector2, ::UnityEngine::Vector2>* _get_DefaultScreenToPanelSpace();
    // Set static field: static readonly System.Func`2<UnityEngine.Vector2,UnityEngine.Vector2> DefaultScreenToPanelSpace
