// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.UIElements.BaseField`1
#include "UnityEngine/UIElements/BaseField_1.hpp"
// Including type: UnityEngine.UIElements.IValueField`1
#include "UnityEngine/UIElements/IValueField_1.hpp"
// Including type: UnityEngine.UIElements.SliderDirection
#include "UnityEngine/UIElements/SliderDirection.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UIElements
namespace UnityEngine::UIElements {
  // Skipping declaration: SliderKey because it is already included!
  // Forward declaring type: EventBase
  class EventBase;
  // Forward declaring type: TextField
  class TextField;
  // Forward declaring type: ClampedDragger`1<T>
  template<typename T>
  class ClampedDragger_1;
  // Forward declaring type: KeyDownEvent
  class KeyDownEvent;
  // Forward declaring type: NavigationMoveEvent
  class NavigationMoveEvent;
  // Forward declaring type: GeometryChangedEvent
  class GeometryChangedEvent;
  // Forward declaring type: FocusInEvent
  class FocusInEvent;
  // Forward declaring type: FocusOutEvent
  class FocusOutEvent;
  // Forward declaring type: ChangeEvent`1<T>
  template<typename T>
  class ChangeEvent_1;
}
// Forward declaring namespace: System
namespace System {
  // Skipping declaration: IComparable`1 because it is already included!
}
// Completed forward declares
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: BaseSlider`1<TValueType>
  template<typename TValueType>
  class BaseSlider_1;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE_GENERIC_CLASS(::UnityEngine::UIElements::BaseSlider_1, "UnityEngine.UIElements", "BaseSlider`1");
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // WARNING Size may be invalid!
  // Autogenerated type: UnityEngine.UIElements.BaseSlider`1
  // [TokenAttribute] Offset: FFFFFFFF
  template<typename TValueType>
  class BaseSlider_1 : public ::UnityEngine::UIElements::BaseField_1<TValueType>/*, public ::UnityEngine::UIElements::IValueField_1<TValueType>*/ {
    public:
    // Nested type: ::UnityEngine::UIElements::BaseSlider_1::SliderKey<TValueType>
    struct SliderKey;
    // WARNING Size may be invalid!
    // Autogenerated type: UnityEngine.UIElements.BaseSlider`1/SliderKey
    // [TokenAttribute] Offset: FFFFFFFF
    struct SliderKey : public ::il2cpp_utils::il2cpp_type_check::NestedType/*, public ::System::Enum*/ {
      public:
      using declaring_type = BaseSlider_1<TValueType>*;
      static constexpr std::string_view NESTED_NAME = "SliderKey";
      static constexpr bool IS_VALUE_TYPE = true;
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: SliderKey
      constexpr SliderKey(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // Autogenerated static field getter
      // Get static field: static public UnityEngine.UIElements.BaseSlider`1/SliderKey<TValueType> None
      static typename ::UnityEngine::UIElements::BaseSlider_1<TValueType>::SliderKey _get_None() {
        static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::UIElements::BaseSlider_1::SliderKey::_get_None");
        return THROW_UNLESS(il2cpp_utils::GetFieldValue<typename ::UnityEngine::UIElements::BaseSlider_1<TValueType>::SliderKey>(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename BaseSlider_1<TValueType>::SliderKey>::get(), "None"));
      }
      // Autogenerated static field setter
      // Set static field: static public UnityEngine.UIElements.BaseSlider`1/SliderKey<TValueType> None
      static void _set_None(typename ::UnityEngine::UIElements::BaseSlider_1<TValueType>::SliderKey value) {
        static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::UIElements::BaseSlider_1::SliderKey::_set_None");
        THROW_UNLESS(il2cpp_utils::SetFieldValue(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename BaseSlider_1<TValueType>::SliderKey>::get(), "None", value));
      }
      // Autogenerated static field getter
      // Get static field: static public UnityEngine.UIElements.BaseSlider`1/SliderKey<TValueType> Lowest
      static typename ::UnityEngine::UIElements::BaseSlider_1<TValueType>::SliderKey _get_Lowest() {
        static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::UIElements::BaseSlider_1::SliderKey::_get_Lowest");
        return THROW_UNLESS(il2cpp_utils::GetFieldValue<typename ::UnityEngine::UIElements::BaseSlider_1<TValueType>::SliderKey>(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename BaseSlider_1<TValueType>::SliderKey>::get(), "Lowest"));
      }
      // Autogenerated static field setter
      // Set static field: static public UnityEngine.UIElements.BaseSlider`1/SliderKey<TValueType> Lowest
      static void _set_Lowest(typename ::UnityEngine::UIElements::BaseSlider_1<TValueType>::SliderKey value) {
        static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::UIElements::BaseSlider_1::SliderKey::_set_Lowest");
        THROW_UNLESS(il2cpp_utils::SetFieldValue(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename BaseSlider_1<TValueType>::SliderKey>::get(), "Lowest", value));
      }
      // Autogenerated static field getter
      // Get static field: static public UnityEngine.UIElements.BaseSlider`1/SliderKey<TValueType> LowerPage
      static typename ::UnityEngine::UIElements::BaseSlider_1<TValueType>::SliderKey _get_LowerPage() {
        static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::UIElements::BaseSlider_1::SliderKey::_get_LowerPage");
        return THROW_UNLESS(il2cpp_utils::GetFieldValue<typename ::UnityEngine::UIElements::BaseSlider_1<TValueType>::SliderKey>(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename BaseSlider_1<TValueType>::SliderKey>::get(), "LowerPage"));
      }
      // Autogenerated static field setter
      // Set static field: static public UnityEngine.UIElements.BaseSlider`1/SliderKey<TValueType> LowerPage
      static void _set_LowerPage(typename ::UnityEngine::UIElements::BaseSlider_1<TValueType>::SliderKey value) {
        static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::UIElements::BaseSlider_1::SliderKey::_set_LowerPage");
        THROW_UNLESS(il2cpp_utils::SetFieldValue(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename BaseSlider_1<TValueType>::SliderKey>::get(), "LowerPage", value));
      }
      // Autogenerated static field getter
      // Get static field: static public UnityEngine.UIElements.BaseSlider`1/SliderKey<TValueType> Lower
      static typename ::UnityEngine::UIElements::BaseSlider_1<TValueType>::SliderKey _get_Lower() {
        static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::UIElements::BaseSlider_1::SliderKey::_get_Lower");
        return THROW_UNLESS(il2cpp_utils::GetFieldValue<typename ::UnityEngine::UIElements::BaseSlider_1<TValueType>::SliderKey>(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename BaseSlider_1<TValueType>::SliderKey>::get(), "Lower"));
      }
      // Autogenerated static field setter
      // Set static field: static public UnityEngine.UIElements.BaseSlider`1/SliderKey<TValueType> Lower
      static void _set_Lower(typename ::UnityEngine::UIElements::BaseSlider_1<TValueType>::SliderKey value) {
        static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::UIElements::BaseSlider_1::SliderKey::_set_Lower");
        THROW_UNLESS(il2cpp_utils::SetFieldValue(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename BaseSlider_1<TValueType>::SliderKey>::get(), "Lower", value));
      }
      // Autogenerated static field getter
      // Get static field: static public UnityEngine.UIElements.BaseSlider`1/SliderKey<TValueType> Higher
      static typename ::UnityEngine::UIElements::BaseSlider_1<TValueType>::SliderKey _get_Higher() {
        static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::UIElements::BaseSlider_1::SliderKey::_get_Higher");
        return THROW_UNLESS(il2cpp_utils::GetFieldValue<typename ::UnityEngine::UIElements::BaseSlider_1<TValueType>::SliderKey>(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename BaseSlider_1<TValueType>::SliderKey>::get(), "Higher"));
      }
      // Autogenerated static field setter
      // Set static field: static public UnityEngine.UIElements.BaseSlider`1/SliderKey<TValueType> Higher
      static void _set_Higher(typename ::UnityEngine::UIElements::BaseSlider_1<TValueType>::SliderKey value) {
        static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::UIElements::BaseSlider_1::SliderKey::_set_Higher");
        THROW_UNLESS(il2cpp_utils::SetFieldValue(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename BaseSlider_1<TValueType>::SliderKey>::get(), "Higher", value));
      }
      // Autogenerated static field getter
      // Get static field: static public UnityEngine.UIElements.BaseSlider`1/SliderKey<TValueType> HigherPage
      static typename ::UnityEngine::UIElements::BaseSlider_1<TValueType>::SliderKey _get_HigherPage() {
        static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::UIElements::BaseSlider_1::SliderKey::_get_HigherPage");
        return THROW_UNLESS(il2cpp_utils::GetFieldValue<typename ::UnityEngine::UIElements::BaseSlider_1<TValueType>::SliderKey>(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename BaseSlider_1<TValueType>::SliderKey>::get(), "HigherPage"));
      }
      // Autogenerated static field setter
      // Set static field: static public UnityEngine.UIElements.BaseSlider`1/SliderKey<TValueType> HigherPage
      static void _set_HigherPage(typename ::UnityEngine::UIElements::BaseSlider_1<TValueType>::SliderKey value) {
        static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::UIElements::BaseSlider_1::SliderKey::_set_HigherPage");
        THROW_UNLESS(il2cpp_utils::SetFieldValue(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename BaseSlider_1<TValueType>::SliderKey>::get(), "HigherPage", value));
      }
      // Autogenerated static field getter
      // Get static field: static public UnityEngine.UIElements.BaseSlider`1/SliderKey<TValueType> Highest
      static typename ::UnityEngine::UIElements::BaseSlider_1<TValueType>::SliderKey _get_Highest() {
        static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::UIElements::BaseSlider_1::SliderKey::_get_Highest");
        return THROW_UNLESS(il2cpp_utils::GetFieldValue<typename ::UnityEngine::UIElements::BaseSlider_1<TValueType>::SliderKey>(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename BaseSlider_1<TValueType>::SliderKey>::get(), "Highest"));
      }
      // Autogenerated static field setter
      // Set static field: static public UnityEngine.UIElements.BaseSlider`1/SliderKey<TValueType> Highest
      static void _set_Highest(typename ::UnityEngine::UIElements::BaseSlider_1<TValueType>::SliderKey value) {
        static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::UIElements::BaseSlider_1::SliderKey::_set_Highest");
        THROW_UNLESS(il2cpp_utils::SetFieldValue(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename BaseSlider_1<TValueType>::SliderKey>::get(), "Highest", value));
      }
      // Autogenerated instance field getter
      // Get instance field: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__() {
        static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::UIElements::BaseSlider_1::SliderKey::dyn_value__");
        auto ___internal__instance = *this;
        static auto ___internal__field__offset = THROW_UNLESS(il2cpp_utils::FindField(___internal__instance, "value__"))->offset;
        return *reinterpret_cast<int*>(reinterpret_cast<char*>(this) + ___internal__field__offset);
      }
    }; // UnityEngine.UIElements.BaseSlider`1/SliderKey
    // Could not write size check! Type: UnityEngine.UIElements.BaseSlider`1/SliderKey is generic, or has no fields that are valid for size checks!
    public:
    // private UnityEngine.UIElements.VisualElement <dragContainer>k__BackingField
    // Size: 0x8
    // Offset: 0x0
    ::UnityEngine::UIElements::VisualElement* dragContainer;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::VisualElement*) == 0x8);
    // private UnityEngine.UIElements.VisualElement <dragElement>k__BackingField
    // Size: 0x8
    // Offset: 0x0
    ::UnityEngine::UIElements::VisualElement* dragElement;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::VisualElement*) == 0x8);
    // private UnityEngine.UIElements.VisualElement <trackElement>k__BackingField
    // Size: 0x8
    // Offset: 0x0
    ::UnityEngine::UIElements::VisualElement* trackElement;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::VisualElement*) == 0x8);
    // private UnityEngine.UIElements.VisualElement <dragBorderElement>k__BackingField
    // Size: 0x8
    // Offset: 0x0
    ::UnityEngine::UIElements::VisualElement* dragBorderElement;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::VisualElement*) == 0x8);
    // private UnityEngine.UIElements.TextField <inputTextField>k__BackingField
    // Size: 0x8
    // Offset: 0x0
    ::UnityEngine::UIElements::TextField* inputTextField;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::TextField*) == 0x8);
    // private System.Boolean m_IsEditingTextField
    // Size: 0x1
    // Offset: 0x0
    bool m_IsEditingTextField;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private TValueType m_LowValue
    // Size: 0xFFFFFFFF
    // Offset: 0x0
    TValueType m_LowValue;
    // private TValueType m_HighValue
    // Size: 0xFFFFFFFF
    // Offset: 0x0
    TValueType m_HighValue;
    // private System.Single m_PageSize
    // Size: 0x4
    // Offset: 0x0
    float m_PageSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_ShowInputField
    // Size: 0x1
    // Offset: 0x0
    bool m_ShowInputField;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <clamped>k__BackingField
    // Size: 0x1
    // Offset: 0x0
    bool clamped;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private UnityEngine.UIElements.ClampedDragger`1<TValueType> <clampedDragger>k__BackingField
    // Size: 0x8
    // Offset: 0x0
    ::UnityEngine::UIElements::ClampedDragger_1<TValueType>* clampedDragger;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::ClampedDragger_1<TValueType>*) == 0x8);
    // private UnityEngine.Rect m_DragElementStartPos
    // Size: 0x10
    // Offset: 0x0
    ::UnityEngine::Rect m_DragElementStartPos;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rect) == 0x10);
    // private UnityEngine.UIElements.SliderDirection m_Direction
    // Size: 0x4
    // Offset: 0x0
    ::UnityEngine::UIElements::SliderDirection m_Direction;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::SliderDirection) == 0x4);
    // private System.Boolean m_Inverted
    // Size: 0x1
    // Offset: 0x0
    bool m_Inverted;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating interface conversion operator: operator ::UnityEngine::UIElements::IValueField_1<TValueType>
    operator ::UnityEngine::UIElements::IValueField_1<TValueType>() noexcept {
      return *reinterpret_cast<::UnityEngine::UIElements::IValueField_1<TValueType>*>(this);
    }
    // Autogenerated static field getter
    // Get static field: static public readonly System.String ussClassName
    static ::StringW _get_ussClassName() {
      static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::UIElements::BaseSlider_1::_get_ussClassName");
      return THROW_UNLESS(il2cpp_utils::GetFieldValue<::StringW>(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<BaseSlider_1<TValueType>*>::get(), "ussClassName"));
    }
    // Autogenerated static field setter
    // Set static field: static public readonly System.String ussClassName
    static void _set_ussClassName(::StringW value) {
