// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.UIElements.BaseVerticalCollectionView
#include "UnityEngine/UIElements/BaseVerticalCollectionView.hpp"
// Including type: UnityEngine.UIElements.ListViewReorderMode
#include "UnityEngine/UIElements/ListViewReorderMode.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: Label
  class Label;
  // Forward declaring type: Foldout
  class Foldout;
  // Forward declaring type: TextField
  class TextField;
  // Skipping declaration: VisualElement because it is already included!
  // Forward declaring type: Button
  class Button;
  // Forward declaring type: ChangeEvent`1<T>
  template<typename T>
  class ChangeEvent_1;
  // Forward declaring type: BaseListViewController
  class BaseListViewController;
  // Forward declaring type: CollectionViewController
  class CollectionViewController;
  // Forward declaring type: ListViewDragger
  class ListViewDragger;
  // Forward declaring type: ICollectionDragAndDropController
  class ICollectionDragAndDropController;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Action
  class Action;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: IEnumerable`1<T>
  template<typename T>
  class IEnumerable_1;
}
// Completed forward declares
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: BaseListView
  class BaseListView;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::UIElements::BaseListView);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UIElements::BaseListView*, "UnityEngine.UIElements", "BaseListView");
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // WARNING Size may be invalid!
  // Autogenerated type: UnityEngine.UIElements.BaseListView
  // [TokenAttribute] Offset: FFFFFFFF
  class BaseListView : public ::UnityEngine::UIElements::BaseVerticalCollectionView {
    public:
    // Nested type: ::UnityEngine::UIElements::BaseListView::UxmlTraits
    class UxmlTraits;
    public:
    // private System.Boolean m_ShowBoundCollectionSize
    // Size: 0x1
    // Offset: 0x4A4
    bool m_ShowBoundCollectionSize;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_ShowFoldoutHeader
    // Size: 0x1
    // Offset: 0x4A5
    bool m_ShowFoldoutHeader;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.String m_HeaderTitle
    // Size: 0x8
    // Offset: 0x4A8
    ::StringW m_HeaderTitle;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Action`1<System.Collections.Generic.IEnumerable`1<System.Int32>> itemsAdded
    // Size: 0x8
    // Offset: 0x4B0
    ::System::Action_1<::System::Collections::Generic::IEnumerable_1<int>*>* itemsAdded;
    // Field size check
    static_assert(sizeof(::System::Action_1<::System::Collections::Generic::IEnumerable_1<int>*>*) == 0x8);
    // private System.Action`1<System.Collections.Generic.IEnumerable`1<System.Int32>> itemsRemoved
    // Size: 0x8
    // Offset: 0x4B8
    ::System::Action_1<::System::Collections::Generic::IEnumerable_1<int>*>* itemsRemoved;
    // Field size check
    static_assert(sizeof(::System::Action_1<::System::Collections::Generic::IEnumerable_1<int>*>*) == 0x8);
    // private UnityEngine.UIElements.Label m_ListViewLabel
    // Size: 0x8
    // Offset: 0x4C0
    ::UnityEngine::UIElements::Label* m_ListViewLabel;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::Label*) == 0x8);
    // private UnityEngine.UIElements.Foldout m_Foldout
    // Size: 0x8
    // Offset: 0x4C8
    ::UnityEngine::UIElements::Foldout* m_Foldout;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::Foldout*) == 0x8);
    // private UnityEngine.UIElements.TextField m_ArraySizeField
    // Size: 0x8
    // Offset: 0x4D0
    ::UnityEngine::UIElements::TextField* m_ArraySizeField;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::TextField*) == 0x8);
    // private System.Boolean m_IsOverMultiEditLimit
    // Size: 0x1
    // Offset: 0x4D8
    bool m_IsOverMultiEditLimit;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private UnityEngine.UIElements.VisualElement m_Footer
    // Size: 0x8
    // Offset: 0x4E0
    ::UnityEngine::UIElements::VisualElement* m_Footer;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::VisualElement*) == 0x8);
    // private UnityEngine.UIElements.Button m_AddButton
    // Size: 0x8
    // Offset: 0x4E8
    ::UnityEngine::UIElements::Button* m_AddButton;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::Button*) == 0x8);
    // private UnityEngine.UIElements.Button m_RemoveButton
    // Size: 0x8
    // Offset: 0x4F0
    ::UnityEngine::UIElements::Button* m_RemoveButton;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::Button*) == 0x8);
    // private System.Action`1<System.Collections.Generic.IEnumerable`1<System.Int32>> m_ItemAddedCallback
    // Size: 0x8
    // Offset: 0x4F8
    ::System::Action_1<::System::Collections::Generic::IEnumerable_1<int>*>* m_ItemAddedCallback;
    // Field size check
    static_assert(sizeof(::System::Action_1<::System::Collections::Generic::IEnumerable_1<int>*>*) == 0x8);
    // private System.Action`1<System.Collections.Generic.IEnumerable`1<System.Int32>> m_ItemRemovedCallback
    // Size: 0x8
    // Offset: 0x500
    ::System::Action_1<::System::Collections::Generic::IEnumerable_1<int>*>* m_ItemRemovedCallback;
    // Field size check
    static_assert(sizeof(::System::Action_1<::System::Collections::Generic::IEnumerable_1<int>*>*) == 0x8);
    // private System.Action m_ItemsSourceSizeChangedCallback
    // Size: 0x8
    // Offset: 0x508
    ::System::Action* m_ItemsSourceSizeChangedCallback;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private UnityEngine.UIElements.ListViewReorderMode m_ReorderMode
    // Size: 0x4
    // Offset: 0x510
    ::UnityEngine::UIElements::ListViewReorderMode m_ReorderMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::ListViewReorderMode) == 0x4);
    // private System.Action reorderModeChanged
    // Size: 0x8
    // Offset: 0x518
    ::System::Action* reorderModeChanged;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private System.String m_MaxMultiEditStr
    // Size: 0x8
    // Offset: 0x520
    ::StringW m_MaxMultiEditStr;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Get static field: static public readonly System.String ussClassName
    static ::StringW _get_ussClassName();
    // Set static field: static public readonly System.String ussClassName
    static void _set_ussClassName(::StringW value);
    // Get static field: static public readonly System.String itemUssClassName
    static ::StringW _get_itemUssClassName();
    // Set static field: static public readonly System.String itemUssClassName
    static void _set_itemUssClassName(::StringW value);
    // Get static field: static public readonly System.String emptyLabelUssClassName
    static ::StringW _get_emptyLabelUssClassName();
    // Set static field: static public readonly System.String emptyLabelUssClassName
    static void _set_emptyLabelUssClassName(::StringW value);
