// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.UIElements.BaseListView
#include "UnityEngine/UIElements/BaseListView.hpp"
// Including type: UnityEngine.UIElements.BaseVerticalCollectionView/UxmlTraits
#include "UnityEngine/UIElements/BaseVerticalCollectionView_UxmlTraits.hpp"
// Including type: UnityEngine.UIElements.ListViewReorderMode
#include "UnityEngine/UIElements/ListViewReorderMode.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: UxmlBoolAttributeDescription
  class UxmlBoolAttributeDescription;
  // Forward declaring type: UxmlStringAttributeDescription
  class UxmlStringAttributeDescription;
  // Forward declaring type: UxmlEnumAttributeDescription`1<T>
  template<typename T>
  class UxmlEnumAttributeDescription_1;
  // Skipping declaration: VisualElement because it is already included!
  // Forward declaring type: IUxmlAttributes
  class IUxmlAttributes;
  // Forward declaring type: CreationContext
  struct CreationContext;
}
// Completed forward declares
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::UIElements::BaseListView::UxmlTraits);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UIElements::BaseListView::UxmlTraits*, "UnityEngine.UIElements", "BaseListView/UxmlTraits");
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Size: 0xD8
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.UIElements.BaseListView/UxmlTraits
  // [TokenAttribute] Offset: FFFFFFFF
  class BaseListView::UxmlTraits : public ::UnityEngine::UIElements::BaseVerticalCollectionView::UxmlTraits {
    public:
    public:
    // private readonly UnityEngine.UIElements.UxmlBoolAttributeDescription m_ShowFoldoutHeader
    // Size: 0x8
    // Offset: 0xB0
    ::UnityEngine::UIElements::UxmlBoolAttributeDescription* m_ShowFoldoutHeader;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UxmlBoolAttributeDescription*) == 0x8);
    // private readonly UnityEngine.UIElements.UxmlStringAttributeDescription m_HeaderTitle
    // Size: 0x8
    // Offset: 0xB8
    ::UnityEngine::UIElements::UxmlStringAttributeDescription* m_HeaderTitle;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UxmlStringAttributeDescription*) == 0x8);
    // private readonly UnityEngine.UIElements.UxmlBoolAttributeDescription m_ShowAddRemoveFooter
    // Size: 0x8
    // Offset: 0xC0
    ::UnityEngine::UIElements::UxmlBoolAttributeDescription* m_ShowAddRemoveFooter;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UxmlBoolAttributeDescription*) == 0x8);
    // private readonly UnityEngine.UIElements.UxmlEnumAttributeDescription`1<UnityEngine.UIElements.ListViewReorderMode> m_ReorderMode
    // Size: 0x8
    // Offset: 0xC8
    ::UnityEngine::UIElements::UxmlEnumAttributeDescription_1<::UnityEngine::UIElements::ListViewReorderMode>* m_ReorderMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UxmlEnumAttributeDescription_1<::UnityEngine::UIElements::ListViewReorderMode>*) == 0x8);
    // private readonly UnityEngine.UIElements.UxmlBoolAttributeDescription m_ShowBoundCollectionSize
    // Size: 0x8
    // Offset: 0xD0
    ::UnityEngine::UIElements::UxmlBoolAttributeDescription* m_ShowBoundCollectionSize;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UxmlBoolAttributeDescription*) == 0x8);
    public:
    // Get instance field reference: private readonly UnityEngine.UIElements.UxmlBoolAttributeDescription m_ShowFoldoutHeader
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::UxmlBoolAttributeDescription*& dyn_m_ShowFoldoutHeader();
    // Get instance field reference: private readonly UnityEngine.UIElements.UxmlStringAttributeDescription m_HeaderTitle
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::UxmlStringAttributeDescription*& dyn_m_HeaderTitle();
    // Get instance field reference: private readonly UnityEngine.UIElements.UxmlBoolAttributeDescription m_ShowAddRemoveFooter
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::UxmlBoolAttributeDescription*& dyn_m_ShowAddRemoveFooter();
    // Get instance field reference: private readonly UnityEngine.UIElements.UxmlEnumAttributeDescription`1<UnityEngine.UIElements.ListViewReorderMode> m_ReorderMode
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::UxmlEnumAttributeDescription_1<::UnityEngine::UIElements::ListViewReorderMode>*& dyn_m_ReorderMode();
    // Get instance field reference: private readonly UnityEngine.UIElements.UxmlBoolAttributeDescription m_ShowBoundCollectionSize
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::UxmlBoolAttributeDescription*& dyn_m_ShowBoundCollectionSize();
    // public override System.Void Init(UnityEngine.UIElements.VisualElement ve, UnityEngine.UIElements.IUxmlAttributes bag, UnityEngine.UIElements.CreationContext cc)
    // Offset: 0x55A53C4
    // Implemented from: UnityEngine.UIElements.BaseVerticalCollectionView/UxmlTraits
    // Base method: System.Void UxmlTraits::Init(UnityEngine.UIElements.VisualElement ve, UnityEngine.UIElements.IUxmlAttributes bag, UnityEngine.UIElements.CreationContext cc)
    void Init(::UnityEngine::UIElements::VisualElement* ve, ::UnityEngine::UIElements::IUxmlAttributes* bag, ::UnityEngine::UIElements::CreationContext cc);
    // protected System.Void .ctor()
    // Offset: 0x55A55C4
    // Implemented from: UnityEngine.UIElements.BaseVerticalCollectionView/UxmlTraits
    // Base method: System.Void UxmlTraits::.ctor()
    // Base method: System.Void UxmlTraits::.ctor()
    // Base method: System.Void UxmlTraits::.ctor()
    // Base method: System.Void UxmlTraits::.ctor()
    // Base method: System.Void BaseUxmlTraits::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static BaseListView::UxmlTraits* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::UIElements::BaseListView::UxmlTraits::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<BaseListView::UxmlTraits*, creationType>()));
    }
  }; // UnityEngine.UIElements.BaseListView/UxmlTraits
  #pragma pack(pop)
  static check_size<sizeof(BaseListView::UxmlTraits), 208 + sizeof(::UnityEngine::UIElements::UxmlBoolAttributeDescription*)> __UnityEngine_UIElements_BaseListView_UxmlTraitsSizeCheck;
  static_assert(sizeof(BaseListView::UxmlTraits) == 0xD8);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: UnityEngine::UIElements::BaseListView::UxmlTraits::Init
// Il2CppName: Init
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (UnityEngine::UIElements::BaseListView::UxmlTraits::*)(::UnityEngine::UIElements::VisualElement*, ::UnityEngine::UIElements::IUxmlAttributes*, ::UnityEngine::UIElements::CreationContext)>(&UnityEngine::UIElements::BaseListView::UxmlTraits::Init)> {
  static const MethodInfo* get() {
    static auto* ve = &::il2cpp_utils::GetClassFromName("UnityEngine.UIElements", "VisualElement")->byval_arg;
    static auto* bag = &::il2cpp_utils::GetClassFromName("UnityEngine.UIElements", "IUxmlAttributes")->byval_arg;
    static auto* cc = &::il2cpp_utils::GetClassFromName("UnityEngine.UIElements", "CreationContext")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::UIElements::BaseListView::UxmlTraits*), "Init", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{ve, bag, cc});
  }
};
// Writing MetadataGetter for method: UnityEngine::UIElements::BaseListView::UxmlTraits::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
