// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.UIElements.BoundsIntField
#include "UnityEngine/UIElements/BoundsIntField.hpp"
// Including type: UnityEngine.UIElements.BaseField`1/UxmlTraits
#include "UnityEngine/UIElements/BaseField_1.hpp"
// Including type: UnityEngine.BoundsInt
#include "UnityEngine/BoundsInt.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: UxmlIntAttributeDescription
  class UxmlIntAttributeDescription;
  // Skipping declaration: VisualElement because it is already included!
  // Forward declaring type: IUxmlAttributes
  class IUxmlAttributes;
  // Skipping declaration: CreationContext because it is already included!
}
// Completed forward declares
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::UIElements::BoundsIntField::UxmlTraits);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UIElements::BoundsIntField::UxmlTraits*, "UnityEngine.UIElements", "BoundsIntField/UxmlTraits");
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // WARNING Size may be invalid!
  // Autogenerated type: UnityEngine.UIElements.BoundsIntField/UxmlTraits
  // [TokenAttribute] Offset: FFFFFFFF
  class BoundsIntField::UxmlTraits : public ::UnityEngine::UIElements::BaseField_1<::UnityEngine::BoundsInt>::UxmlTraits {
    public:
    public:
    // private UnityEngine.UIElements.UxmlIntAttributeDescription m_PositionXValue
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::UIElements::UxmlIntAttributeDescription* m_PositionXValue;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UxmlIntAttributeDescription*) == 0x8);
    // private UnityEngine.UIElements.UxmlIntAttributeDescription m_PositionYValue
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::UIElements::UxmlIntAttributeDescription* m_PositionYValue;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UxmlIntAttributeDescription*) == 0x8);
    // private UnityEngine.UIElements.UxmlIntAttributeDescription m_PositionZValue
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::UIElements::UxmlIntAttributeDescription* m_PositionZValue;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UxmlIntAttributeDescription*) == 0x8);
    // private UnityEngine.UIElements.UxmlIntAttributeDescription m_SizeXValue
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::UIElements::UxmlIntAttributeDescription* m_SizeXValue;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UxmlIntAttributeDescription*) == 0x8);
    // private UnityEngine.UIElements.UxmlIntAttributeDescription m_SizeYValue
    // Size: 0x8
    // Offset: 0xA0
    ::UnityEngine::UIElements::UxmlIntAttributeDescription* m_SizeYValue;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UxmlIntAttributeDescription*) == 0x8);
    // private UnityEngine.UIElements.UxmlIntAttributeDescription m_SizeZValue
    // Size: 0x8
    // Offset: 0xA8
    ::UnityEngine::UIElements::UxmlIntAttributeDescription* m_SizeZValue;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UxmlIntAttributeDescription*) == 0x8);
    public:
    // Get instance field reference: private UnityEngine.UIElements.UxmlIntAttributeDescription m_PositionXValue
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::UxmlIntAttributeDescription*& dyn_m_PositionXValue();
    // Get instance field reference: private UnityEngine.UIElements.UxmlIntAttributeDescription m_PositionYValue
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::UxmlIntAttributeDescription*& dyn_m_PositionYValue();
    // Get instance field reference: private UnityEngine.UIElements.UxmlIntAttributeDescription m_PositionZValue
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::UxmlIntAttributeDescription*& dyn_m_PositionZValue();
    // Get instance field reference: private UnityEngine.UIElements.UxmlIntAttributeDescription m_SizeXValue
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::UxmlIntAttributeDescription*& dyn_m_SizeXValue();
    // Get instance field reference: private UnityEngine.UIElements.UxmlIntAttributeDescription m_SizeYValue
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::UxmlIntAttributeDescription*& dyn_m_SizeYValue();
    // Get instance field reference: private UnityEngine.UIElements.UxmlIntAttributeDescription m_SizeZValue
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::UxmlIntAttributeDescription*& dyn_m_SizeZValue();
    // public override System.Void Init(UnityEngine.UIElements.VisualElement ve, UnityEngine.UIElements.IUxmlAttributes bag, UnityEngine.UIElements.CreationContext cc)
    // Offset: 0x55AE958
    // Implemented from: UnityEngine.UIElements.BaseField`1/UxmlTraits
    // Base method: System.Void UxmlTraits::Init(UnityEngine.UIElements.VisualElement ve, UnityEngine.UIElements.IUxmlAttributes bag, UnityEngine.UIElements.CreationContext cc)
    void Init(::UnityEngine::UIElements::VisualElement* ve, ::UnityEngine::UIElements::IUxmlAttributes* bag, ::UnityEngine::UIElements::CreationContext cc);
    // public System.Void .ctor()
    // Offset: 0x55AEBB0
    // Implemented from: UnityEngine.UIElements.BaseField`1/UxmlTraits
    // Base method: System.Void UxmlTraits::.ctor()
    // Base method: System.Void UxmlTraits::.ctor()
    // Base method: System.Void UxmlTraits::.ctor()
    // Base method: System.Void UxmlTraits::.ctor()
    // Base method: System.Void BaseUxmlTraits::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static BoundsIntField::UxmlTraits* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::UIElements::BoundsIntField::UxmlTraits::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<BoundsIntField::UxmlTraits*, creationType>()));
    }
  }; // UnityEngine.UIElements.BoundsIntField/UxmlTraits
  // WARNING Not writing size check since size may be invalid!
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: UnityEngine::UIElements::BoundsIntField::UxmlTraits::Init
// Il2CppName: Init
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (UnityEngine::UIElements::BoundsIntField::UxmlTraits::*)(::UnityEngine::UIElements::VisualElement*, ::UnityEngine::UIElements::IUxmlAttributes*, ::UnityEngine::UIElements::CreationContext)>(&UnityEngine::UIElements::BoundsIntField::UxmlTraits::Init)> {
  static const MethodInfo* get() {
    static auto* ve = &::il2cpp_utils::GetClassFromName("UnityEngine.UIElements", "VisualElement")->byval_arg;
    static auto* bag = &::il2cpp_utils::GetClassFromName("UnityEngine.UIElements", "IUxmlAttributes")->byval_arg;
    static auto* cc = &::il2cpp_utils::GetClassFromName("UnityEngine.UIElements", "CreationContext")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::UIElements::BoundsIntField::UxmlTraits*), "Init", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{ve, bag, cc});
  }
};
// Writing MetadataGetter for method: UnityEngine::UIElements::BoundsIntField::UxmlTraits::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
