// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.UIElements.BoundsField
#include "UnityEngine/UIElements/BoundsField.hpp"
// Including type: UnityEngine.UIElements.BaseField`1/UxmlTraits
#include "UnityEngine/UIElements/BaseField_1.hpp"
// Including type: UnityEngine.Bounds
#include "UnityEngine/Bounds.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: UxmlFloatAttributeDescription
  class UxmlFloatAttributeDescription;
  // Skipping declaration: VisualElement because it is already included!
  // Forward declaring type: IUxmlAttributes
  class IUxmlAttributes;
  // Skipping declaration: CreationContext because it is already included!
}
// Completed forward declares
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::UIElements::BoundsField::UxmlTraits);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UIElements::BoundsField::UxmlTraits*, "UnityEngine.UIElements", "BoundsField/UxmlTraits");
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // WARNING Size may be invalid!
  // Autogenerated type: UnityEngine.UIElements.BoundsField/UxmlTraits
  // [TokenAttribute] Offset: FFFFFFFF
  class BoundsField::UxmlTraits : public ::UnityEngine::UIElements::BaseField_1<::UnityEngine::Bounds>::UxmlTraits {
    public:
    public:
    // private UnityEngine.UIElements.UxmlFloatAttributeDescription m_CenterXValue
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::UIElements::UxmlFloatAttributeDescription* m_CenterXValue;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UxmlFloatAttributeDescription*) == 0x8);
    // private UnityEngine.UIElements.UxmlFloatAttributeDescription m_CenterYValue
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::UIElements::UxmlFloatAttributeDescription* m_CenterYValue;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UxmlFloatAttributeDescription*) == 0x8);
    // private UnityEngine.UIElements.UxmlFloatAttributeDescription m_CenterZValue
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::UIElements::UxmlFloatAttributeDescription* m_CenterZValue;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UxmlFloatAttributeDescription*) == 0x8);
    // private UnityEngine.UIElements.UxmlFloatAttributeDescription m_ExtentsXValue
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::UIElements::UxmlFloatAttributeDescription* m_ExtentsXValue;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UxmlFloatAttributeDescription*) == 0x8);
    // private UnityEngine.UIElements.UxmlFloatAttributeDescription m_ExtentsYValue
    // Size: 0x8
    // Offset: 0xA0
    ::UnityEngine::UIElements::UxmlFloatAttributeDescription* m_ExtentsYValue;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UxmlFloatAttributeDescription*) == 0x8);
    // private UnityEngine.UIElements.UxmlFloatAttributeDescription m_ExtentsZValue
    // Size: 0x8
    // Offset: 0xA8
    ::UnityEngine::UIElements::UxmlFloatAttributeDescription* m_ExtentsZValue;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UxmlFloatAttributeDescription*) == 0x8);
    public:
    // Get instance field reference: private UnityEngine.UIElements.UxmlFloatAttributeDescription m_CenterXValue
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::UxmlFloatAttributeDescription*& dyn_m_CenterXValue();
    // Get instance field reference: private UnityEngine.UIElements.UxmlFloatAttributeDescription m_CenterYValue
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::UxmlFloatAttributeDescription*& dyn_m_CenterYValue();
    // Get instance field reference: private UnityEngine.UIElements.UxmlFloatAttributeDescription m_CenterZValue
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::UxmlFloatAttributeDescription*& dyn_m_CenterZValue();
    // Get instance field reference: private UnityEngine.UIElements.UxmlFloatAttributeDescription m_ExtentsXValue
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::UxmlFloatAttributeDescription*& dyn_m_ExtentsXValue();
    // Get instance field reference: private UnityEngine.UIElements.UxmlFloatAttributeDescription m_ExtentsYValue
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::UxmlFloatAttributeDescription*& dyn_m_ExtentsYValue();
    // Get instance field reference: private UnityEngine.UIElements.UxmlFloatAttributeDescription m_ExtentsZValue
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::UxmlFloatAttributeDescription*& dyn_m_ExtentsZValue();
    // public override System.Void Init(UnityEngine.UIElements.VisualElement ve, UnityEngine.UIElements.IUxmlAttributes bag, UnityEngine.UIElements.CreationContext cc)
    // Offset: 0x55ADB78
    // Implemented from: UnityEngine.UIElements.BaseField`1/UxmlTraits
    // Base method: System.Void UxmlTraits::Init(UnityEngine.UIElements.VisualElement ve, UnityEngine.UIElements.IUxmlAttributes bag, UnityEngine.UIElements.CreationContext cc)
    void Init(::UnityEngine::UIElements::VisualElement* ve, ::UnityEngine::UIElements::IUxmlAttributes* bag, ::UnityEngine::UIElements::CreationContext cc);
    // public System.Void .ctor()
    // Offset: 0x55ADDD4
    // Implemented from: UnityEngine.UIElements.BaseField`1/UxmlTraits
    // Base method: System.Void UxmlTraits::.ctor()
    // Base method: System.Void UxmlTraits::.ctor()
    // Base method: System.Void UxmlTraits::.ctor()
    // Base method: System.Void UxmlTraits::.ctor()
    // Base method: System.Void BaseUxmlTraits::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static BoundsField::UxmlTraits* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::UIElements::BoundsField::UxmlTraits::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<BoundsField::UxmlTraits*, creationType>()));
    }
  }; // UnityEngine.UIElements.BoundsField/UxmlTraits
  // WARNING Not writing size check since size may be invalid!
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: UnityEngine::UIElements::BoundsField::UxmlTraits::Init
// Il2CppName: Init
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (UnityEngine::UIElements::BoundsField::UxmlTraits::*)(::UnityEngine::UIElements::VisualElement*, ::UnityEngine::UIElements::IUxmlAttributes*, ::UnityEngine::UIElements::CreationContext)>(&UnityEngine::UIElements::BoundsField::UxmlTraits::Init)> {
  static const MethodInfo* get() {
    static auto* ve = &::il2cpp_utils::GetClassFromName("UnityEngine.UIElements", "VisualElement")->byval_arg;
    static auto* bag = &::il2cpp_utils::GetClassFromName("UnityEngine.UIElements", "IUxmlAttributes")->byval_arg;
    static auto* cc = &::il2cpp_utils::GetClassFromName("UnityEngine.UIElements", "CreationContext")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::UIElements::BoundsField::UxmlTraits*), "Init", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{ve, bag, cc});
  }
};
// Writing MetadataGetter for method: UnityEngine::UIElements::BoundsField::UxmlTraits::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
