// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.UIElements.PointerManipulator
#include "UnityEngine/UIElements/PointerManipulator.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Action
  class Action;
}
// Forward declaring namespace: UnityEngine::UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: EventBase
  class EventBase;
  // Forward declaring type: IVisualElementScheduledItem
  class IVisualElementScheduledItem;
  // Forward declaring type: InvokePolicy
  struct InvokePolicy;
  // Forward declaring type: TimerState
  struct TimerState;
  // Forward declaring type: MouseDownEvent
  class MouseDownEvent;
  // Forward declaring type: MouseMoveEvent
  class MouseMoveEvent;
  // Forward declaring type: MouseUpEvent
  class MouseUpEvent;
  // Forward declaring type: MouseCaptureOutEvent
  class MouseCaptureOutEvent;
  // Forward declaring type: PointerDownEvent
  class PointerDownEvent;
  // Forward declaring type: PointerMoveEvent
  class PointerMoveEvent;
  // Forward declaring type: PointerUpEvent
  class PointerUpEvent;
  // Forward declaring type: PointerCancelEvent
  class PointerCancelEvent;
  // Forward declaring type: PointerCaptureOutEvent
  class PointerCaptureOutEvent;
}
// Completed forward declares
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: Clickable
  class Clickable;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::UIElements::Clickable);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UIElements::Clickable*, "UnityEngine.UIElements", "Clickable");
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Size: 0x70
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.UIElements.Clickable
  // [TokenAttribute] Offset: FFFFFFFF
  class Clickable : public ::UnityEngine::UIElements::PointerManipulator {
    public:
    public:
    // private System.Action`1<UnityEngine.UIElements.EventBase> clickedWithEventInfo
    // Size: 0x8
    // Offset: 0x30
    ::System::Action_1<::UnityEngine::UIElements::EventBase*>* clickedWithEventInfo;
    // Field size check
    static_assert(sizeof(::System::Action_1<::UnityEngine::UIElements::EventBase*>*) == 0x8);
    // private System.Action clicked
    // Size: 0x8
    // Offset: 0x38
    ::System::Action* clicked;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private readonly System.Int64 m_Delay
    // Size: 0x8
    // Offset: 0x40
    int64_t m_Delay;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private readonly System.Int64 m_Interval
    // Size: 0x8
    // Offset: 0x48
    int64_t m_Interval;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private System.Boolean <active>k__BackingField
    // Size: 0x1
    // Offset: 0x50
    bool active;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: active and: lastMousePosition
    char __padding4[0x3] = {};
    // private UnityEngine.Vector2 <lastMousePosition>k__BackingField
    // Size: 0x8
    // Offset: 0x54
    ::UnityEngine::Vector2 lastMousePosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private System.Int32 m_ActivePointerId
    // Size: 0x4
    // Offset: 0x5C
    int m_ActivePointerId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean m_AcceptClicksIfDisabled
    // Size: 0x1
    // Offset: 0x60
    bool m_AcceptClicksIfDisabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_AcceptClicksIfDisabled and: m_Repeater
    char __padding7[0x7] = {};
    // private UnityEngine.UIElements.IVisualElementScheduledItem m_Repeater
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::UIElements::IVisualElementScheduledItem* m_Repeater;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::IVisualElementScheduledItem*) == 0x8);
    public:
    // Get instance field reference: private System.Action`1<UnityEngine.UIElements.EventBase> clickedWithEventInfo
    [[deprecated("Use field access instead!")]] ::System::Action_1<::UnityEngine::UIElements::EventBase*>*& dyn_clickedWithEventInfo();
    // Get instance field reference: private System.Action clicked
    [[deprecated("Use field access instead!")]] ::System::Action*& dyn_clicked();
    // Get instance field reference: private readonly System.Int64 m_Delay
    [[deprecated("Use field access instead!")]] int64_t& dyn_m_Delay();
    // Get instance field reference: private readonly System.Int64 m_Interval
    [[deprecated("Use field access instead!")]] int64_t& dyn_m_Interval();
