// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.UIElements.Background
#include "UnityEngine/UIElements/Background.hpp"
// Including type: UnityEngine.UIElements.Length
#include "UnityEngine/UIElements/Length.hpp"
// Including type: UnityEngine.UIElements.ColumnDataType
#include "UnityEngine/UIElements/ColumnDataType.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: VisualElement
  class VisualElement;
  // Forward declaring type: Columns
  class Columns;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Func`1<TResult>
  template<typename TResult>
  class Func_1;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
}
// Completed forward declares
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: Column
  class Column;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::UIElements::Column);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UIElements::Column*, "UnityEngine.UIElements", "Column");
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Size: 0xC0
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.UIElements.Column
  // [TokenAttribute] Offset: FFFFFFFF
  class Column : public ::Il2CppObject {
    public:
    // Nested type: ::UnityEngine::UIElements::Column::UxmlObjectFactory_1<T>
    template<typename T>
    class UxmlObjectFactory_1;
    // Nested type: ::UnityEngine::UIElements::Column::UxmlObjectTraits_1<T>
    template<typename T>
    class UxmlObjectTraits_1;
    public:
    // private System.String m_Name
    // Size: 0x8
    // Offset: 0x10
    ::StringW m_Name;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String m_Title
    // Size: 0x8
    // Offset: 0x18
    ::StringW m_Title;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private UnityEngine.UIElements.Background m_Icon
    // Size: 0x20
    // Offset: 0x20
    ::UnityEngine::UIElements::Background m_Icon;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::Background) == 0x20);
    // private System.Boolean m_Visible
    // Size: 0x1
    // Offset: 0x40
    bool m_Visible;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_Visible and: m_Width
    char __padding3[0x3] = {};
    // private UnityEngine.UIElements.Length m_Width
    // Size: 0x8
    // Offset: 0x44
    ::UnityEngine::UIElements::Length m_Width;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::Length) == 0x8);
    // private UnityEngine.UIElements.Length m_MinWidth
    // Size: 0x8
    // Offset: 0x4C
    ::UnityEngine::UIElements::Length m_MinWidth;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::Length) == 0x8);
    // private UnityEngine.UIElements.Length m_MaxWidth
    // Size: 0x8
    // Offset: 0x54
    ::UnityEngine::UIElements::Length m_MaxWidth;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::Length) == 0x8);
    // private System.Single m_DesiredWidth
    // Size: 0x4
    // Offset: 0x5C
    float m_DesiredWidth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_Stretchable
    // Size: 0x1
    // Offset: 0x60
    bool m_Stretchable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_Sortable
    // Size: 0x1
    // Offset: 0x61
    bool m_Sortable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_Optional
    // Size: 0x1
    // Offset: 0x62
    bool m_Optional;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_Resizable
    // Size: 0x1
    // Offset: 0x63
    bool m_Resizable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_Resizable and: m_MakeHeader
    char __padding11[0x4] = {};
    // private System.Func`1<UnityEngine.UIElements.VisualElement> m_MakeHeader
    // Size: 0x8
    // Offset: 0x68
    ::System::Func_1<::UnityEngine::UIElements::VisualElement*>* m_MakeHeader;
    // Field size check
    static_assert(sizeof(::System::Func_1<::UnityEngine::UIElements::VisualElement*>*) == 0x8);
    // private System.Action`1<UnityEngine.UIElements.VisualElement> m_BindHeader
    // Size: 0x8
    // Offset: 0x70
    ::System::Action_1<::UnityEngine::UIElements::VisualElement*>* m_BindHeader;
    // Field size check
    static_assert(sizeof(::System::Action_1<::UnityEngine::UIElements::VisualElement*>*) == 0x8);
    // private System.Action`1<UnityEngine.UIElements.VisualElement> m_UnbindHeader
    // Size: 0x8
    // Offset: 0x78
    ::System::Action_1<::UnityEngine::UIElements::VisualElement*>* m_UnbindHeader;
    // Field size check
    static_assert(sizeof(::System::Action_1<::UnityEngine::UIElements::VisualElement*>*) == 0x8);
    // private System.Action`1<UnityEngine.UIElements.VisualElement> m_DestroyHeader
    // Size: 0x8
    // Offset: 0x80
    ::System::Action_1<::UnityEngine::UIElements::VisualElement*>* m_DestroyHeader;
    // Field size check
    static_assert(sizeof(::System::Action_1<::UnityEngine::UIElements::VisualElement*>*) == 0x8);
    // private System.Func`1<UnityEngine.UIElements.VisualElement> m_MakeCell
    // Size: 0x8
    // Offset: 0x88
    ::System::Func_1<::UnityEngine::UIElements::VisualElement*>* m_MakeCell;
    // Field size check
    static_assert(sizeof(::System::Func_1<::UnityEngine::UIElements::VisualElement*>*) == 0x8);
    // private System.Action`2<UnityEngine.UIElements.VisualElement,System.Int32> m_BindCell
    // Size: 0x8
    // Offset: 0x90
    ::System::Action_2<::UnityEngine::UIElements::VisualElement*, int>* m_BindCell;
    // Field size check
    static_assert(sizeof(::System::Action_2<::UnityEngine::UIElements::VisualElement*, int>*) == 0x8);
    // private System.Action`2<UnityEngine.UIElements.VisualElement,System.Int32> m_UnbindCellItem
    // Size: 0x8
    // Offset: 0x98
    ::System::Action_2<::UnityEngine::UIElements::VisualElement*, int>* m_UnbindCellItem;
    // Field size check
    static_assert(sizeof(::System::Action_2<::UnityEngine::UIElements::VisualElement*, int>*) == 0x8);
    // private System.Action`1<UnityEngine.UIElements.VisualElement> <destroyCell>k__BackingField
    // Size: 0x8
    // Offset: 0xA0
    ::System::Action_1<::UnityEngine::UIElements::VisualElement*>* destroyCell;
    // Field size check
    static_assert(sizeof(::System::Action_1<::UnityEngine::UIElements::VisualElement*>*) == 0x8);
    // private UnityEngine.UIElements.Columns <collection>k__BackingField
    // Size: 0x8
    // Offset: 0xA8
    ::UnityEngine::UIElements::Columns* collection;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::Columns*) == 0x8);
    // private System.Action`2<UnityEngine.UIElements.Column,UnityEngine.UIElements.ColumnDataType> changed
    // Size: 0x8
    // Offset: 0xB0
    ::System::Action_2<::UnityEngine::UIElements::Column*, ::UnityEngine::UIElements::ColumnDataType>* changed;
    // Field size check
    static_assert(sizeof(::System::Action_2<::UnityEngine::UIElements::Column*, ::UnityEngine::UIElements::ColumnDataType>*) == 0x8);
    // private System.Action`1<UnityEngine.UIElements.Column> resized
    // Size: 0x8
    // Offset: 0xB8
    ::System::Action_1<::UnityEngine::UIElements::Column*>* resized;
    // Field size check
    static_assert(sizeof(::System::Action_1<::UnityEngine::UIElements::Column*>*) == 0x8);
    public:
    // Get static field: static private readonly System.String k_InvalidTemplateError
    static ::StringW _get_k_InvalidTemplateError();
    // Set static field: static private readonly System.String k_InvalidTemplateError
    static void _set_k_InvalidTemplateError(::StringW value);
    // Get instance field reference: private System.String m_Name
    [[deprecated("Use field access instead!")]] ::StringW& dyn_m_Name();
    // Get instance field reference: private System.String m_Title
    [[deprecated("Use field access instead!")]] ::StringW& dyn_m_Title();
    // Get instance field reference: private UnityEngine.UIElements.Background m_Icon
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::Background& dyn_m_Icon();
