// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Collections.Generic.ICollection`1
#include "System/Collections/Generic/ICollection_1.hpp"
// Including type: UnityEngine.UIElements.ColumnsDataType
#include "UnityEngine/UIElements/ColumnsDataType.hpp"
// Including type: UnityEngine.UIElements.ColumnDataType
#include "UnityEngine/UIElements/ColumnDataType.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
  // Forward declaring type: Action`3<T1, T2, T3>
  template<typename T1, typename T2, typename T3>
  class Action_3;
}
// Forward declaring namespace: UnityEngine::UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: Column
  class Column;
  // Skipping declaration: StretchMode because it is already included!
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: IList`1<T>
  template<typename T>
  class IList_1;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Skipping declaration: IEnumerable`1 because it is already included!
  // Forward declaring type: IEnumerator`1<T>
  template<typename T>
  class IEnumerator_1;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: Columns
  class Columns;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::UIElements::Columns);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UIElements::Columns*, "UnityEngine.UIElements", "Columns");
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Size: 0x70
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.UIElements.Columns
  // [TokenAttribute] Offset: FFFFFFFF
  // [DefaultMemberAttribute] Offset: FFFFFFFF
  class Columns : public ::Il2CppObject/*, public ::System::Collections::Generic::ICollection_1<::UnityEngine::UIElements::Column*>*/ {
    public:
    // Nested type: ::UnityEngine::UIElements::Columns::StretchMode
    struct StretchMode;
    // Nested type: ::UnityEngine::UIElements::Columns::UxmlObjectFactory_1<T>
    template<typename T>
    class UxmlObjectFactory_1;
    // Nested type: ::UnityEngine::UIElements::Columns::UxmlObjectTraits_1<T>
    template<typename T>
    class UxmlObjectTraits_1;
    // Nested type: ::UnityEngine::UIElements::Columns::$$c
    class $$c;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.UIElements.Columns/StretchMode
    // [TokenAttribute] Offset: FFFFFFFF
    struct StretchMode/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: StretchMode
      constexpr StretchMode(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.UIElements.Columns/StretchMode Grow
      static constexpr const int Grow = 0;
      // Get static field: static public UnityEngine.UIElements.Columns/StretchMode Grow
      static ::UnityEngine::UIElements::Columns::StretchMode _get_Grow();
      // Set static field: static public UnityEngine.UIElements.Columns/StretchMode Grow
      static void _set_Grow(::UnityEngine::UIElements::Columns::StretchMode value);
      // static field const value: static public UnityEngine.UIElements.Columns/StretchMode GrowAndFill
      static constexpr const int GrowAndFill = 1;
      // Get static field: static public UnityEngine.UIElements.Columns/StretchMode GrowAndFill
      static ::UnityEngine::UIElements::Columns::StretchMode _get_GrowAndFill();
      // Set static field: static public UnityEngine.UIElements.Columns/StretchMode GrowAndFill
      static void _set_GrowAndFill(::UnityEngine::UIElements::Columns::StretchMode value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.UIElements.Columns/StretchMode
    #pragma pack(pop)
    static check_size<sizeof(Columns::StretchMode), 0 + sizeof(int)> __UnityEngine_UIElements_Columns_StretchModeSizeCheck;
    static_assert(sizeof(Columns::StretchMode) == 0x4);
    public:
    // private System.Collections.Generic.IList`1<UnityEngine.UIElements.Column> m_Columns
    // Size: 0x8
    // Offset: 0x10
    ::System::Collections::Generic::IList_1<::UnityEngine::UIElements::Column*>* m_Columns;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::IList_1<::UnityEngine::UIElements::Column*>*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.UIElements.Column> m_DisplayColumns
    // Size: 0x8
    // Offset: 0x18
    ::System::Collections::Generic::List_1<::UnityEngine::UIElements::Column*>* m_DisplayColumns;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::UIElements::Column*>*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.UIElements.Column> m_VisibleColumns
    // Size: 0x8
    // Offset: 0x20
    ::System::Collections::Generic::List_1<::UnityEngine::UIElements::Column*>* m_VisibleColumns;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::UIElements::Column*>*) == 0x8);
    // private System.Boolean m_VisibleColumnsDirty
    // Size: 0x1
    // Offset: 0x28
    bool m_VisibleColumnsDirty;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_VisibleColumnsDirty and: m_StretchMode
    char __padding3[0x3] = {};
    // private UnityEngine.UIElements.Columns/StretchMode m_StretchMode
    // Size: 0x4
    // Offset: 0x2C
    ::UnityEngine::UIElements::Columns::StretchMode m_StretchMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::Columns::StretchMode) == 0x4);
    // private System.Boolean m_Reorderable
    // Size: 0x1
    // Offset: 0x30
    bool m_Reorderable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_Resizable
    // Size: 0x1
    // Offset: 0x31
    bool m_Resizable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_ResizePreview
    // Size: 0x1
    // Offset: 0x32
    bool m_ResizePreview;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_ResizePreview and: m_PrimaryColumnName
    char __padding7[0x5] = {};
    // private System.String m_PrimaryColumnName
    // Size: 0x8
    // Offset: 0x38
    ::StringW m_PrimaryColumnName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Action`1<UnityEngine.UIElements.ColumnsDataType> changed
    // Size: 0x8
    // Offset: 0x40
    ::System::Action_1<::UnityEngine::UIElements::ColumnsDataType>* changed;
    // Field size check
    static_assert(sizeof(::System::Action_1<::UnityEngine::UIElements::ColumnsDataType>*) == 0x8);
    // private System.Action`2<UnityEngine.UIElements.Column,System.Int32> columnAdded
    // Size: 0x8
    // Offset: 0x48
    ::System::Action_2<::UnityEngine::UIElements::Column*, int>* columnAdded;
    // Field size check
    static_assert(sizeof(::System::Action_2<::UnityEngine::UIElements::Column*, int>*) == 0x8);
    // private System.Action`1<UnityEngine.UIElements.Column> columnRemoved
    // Size: 0x8
    // Offset: 0x50
    ::System::Action_1<::UnityEngine::UIElements::Column*>* columnRemoved;
    // Field size check
    static_assert(sizeof(::System::Action_1<::UnityEngine::UIElements::Column*>*) == 0x8);
    // private System.Action`2<UnityEngine.UIElements.Column,UnityEngine.UIElements.ColumnDataType> columnChanged
    // Size: 0x8
    // Offset: 0x58
    ::System::Action_2<::UnityEngine::UIElements::Column*, ::UnityEngine::UIElements::ColumnDataType>* columnChanged;
    // Field size check
    static_assert(sizeof(::System::Action_2<::UnityEngine::UIElements::Column*, ::UnityEngine::UIElements::ColumnDataType>*) == 0x8);
    // private System.Action`1<UnityEngine.UIElements.Column> columnResized
    // Size: 0x8
    // Offset: 0x60
    ::System::Action_1<::UnityEngine::UIElements::Column*>* columnResized;
    // Field size check
    static_assert(sizeof(::System::Action_1<::UnityEngine::UIElements::Column*>*) == 0x8);
    // private System.Action`3<UnityEngine.UIElements.Column,System.Int32,System.Int32> columnReordered
    // Size: 0x8
    // Offset: 0x68
    ::System::Action_3<::UnityEngine::UIElements::Column*, int, int>* columnReordered;
    // Field size check
    static_assert(sizeof(::System::Action_3<::UnityEngine::UIElements::Column*, int, int>*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::System::Collections::Generic::ICollection_1<::UnityEngine::UIElements::Column*>
    operator ::System::Collections::Generic::ICollection_1<::UnityEngine::UIElements::Column*>() noexcept {
      return *reinterpret_cast<::System::Collections::Generic::ICollection_1<::UnityEngine::UIElements::Column*>*>(this);
    }
    // Get instance field reference: private System.Collections.Generic.IList`1<UnityEngine.UIElements.Column> m_Columns
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::IList_1<::UnityEngine::UIElements::Column*>*& dyn_m_Columns();
