// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: Column
  class Column;
  // Forward declaring type: Columns
  class Columns;
  // Forward declaring type: ColumnDataType
  struct ColumnDataType;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
}
// Completed forward declares
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: ColumnLayout
  class ColumnLayout;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::UIElements::ColumnLayout);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UIElements::ColumnLayout*, "UnityEngine.UIElements", "ColumnLayout");
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Size: 0x70
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.UIElements.ColumnLayout
  // [TokenAttribute] Offset: FFFFFFFF
  class ColumnLayout : public ::Il2CppObject {
    public:
    // Nested type: ::UnityEngine::UIElements::ColumnLayout::$$c
    class $$c;
    // Nested type: ::UnityEngine::UIElements::ColumnLayout::$$c__DisplayClass42_0
    class $$c__DisplayClass42_0;
    // Nested type: ::UnityEngine::UIElements::ColumnLayout::$$c__DisplayClass42_1
    class $$c__DisplayClass42_1;
    // Nested type: ::UnityEngine::UIElements::ColumnLayout::$$c__DisplayClass42_2
    class $$c__DisplayClass42_2;
    // Nested type: ::UnityEngine::UIElements::ColumnLayout::$$c__DisplayClass42_3
    class $$c__DisplayClass42_3;
    public:
    // private System.Collections.Generic.List`1<UnityEngine.UIElements.Column> m_StretchableColumns
    // Size: 0x8
    // Offset: 0x10
    ::System::Collections::Generic::List_1<::UnityEngine::UIElements::Column*>* m_StretchableColumns;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::UIElements::Column*>*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.UIElements.Column> m_FixedColumns
    // Size: 0x8
    // Offset: 0x18
    ::System::Collections::Generic::List_1<::UnityEngine::UIElements::Column*>* m_FixedColumns;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::UIElements::Column*>*) == 0x8);
    // private UnityEngine.UIElements.Columns m_Columns
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::UIElements::Columns* m_Columns;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::Columns*) == 0x8);
    // private System.Single m_ColumnsWidth
    // Size: 0x4
    // Offset: 0x28
    float m_ColumnsWidth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_ColumnsWidthDirty
    // Size: 0x1
    // Offset: 0x2C
    bool m_ColumnsWidthDirty;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_ColumnsWidthDirty and: m_MaxColumnsWidth
    char __padding4[0x3] = {};
    // private System.Single m_MaxColumnsWidth
    // Size: 0x4
    // Offset: 0x30
    float m_MaxColumnsWidth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_MinColumnsWidth
    // Size: 0x4
    // Offset: 0x34
    float m_MinColumnsWidth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_IsDirty
    // Size: 0x1
    // Offset: 0x38
    bool m_IsDirty;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_IsDirty and: m_PreviousWidth
    char __padding7[0x3] = {};
    // private System.Single m_PreviousWidth
    // Size: 0x4
    // Offset: 0x3C
    float m_PreviousWidth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_DragResizeInPreviewMode
    // Size: 0x1
    // Offset: 0x40
    bool m_DragResizeInPreviewMode;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_DragResizing
    // Size: 0x1
    // Offset: 0x41
    bool m_DragResizing;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_DragResizing and: m_DragStartPos
    char __padding10[0x2] = {};
    // private System.Single m_DragStartPos
    // Size: 0x4
    // Offset: 0x44
    float m_DragStartPos;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_DragLastPos
    // Size: 0x4
    // Offset: 0x48
    float m_DragLastPos;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_DragInitialColumnWidth
    // Size: 0x4
    // Offset: 0x4C
    float m_DragInitialColumnWidth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Collections.Generic.List`1<UnityEngine.UIElements.Column> m_DragStretchableColumns
    // Size: 0x8
    // Offset: 0x50
    ::System::Collections::Generic::List_1<::UnityEngine::UIElements::Column*>* m_DragStretchableColumns;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::UIElements::Column*>*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.UIElements.Column> m_DragFixedColumns
    // Size: 0x8
    // Offset: 0x58
    ::System::Collections::Generic::List_1<::UnityEngine::UIElements::Column*>* m_DragFixedColumns;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::UIElements::Column*>*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<UnityEngine.UIElements.Column,System.Single> m_PreviewDesiredWidths
    // Size: 0x8
    // Offset: 0x60
    ::System::Collections::Generic::Dictionary_2<::UnityEngine::UIElements::Column*, float>* m_PreviewDesiredWidths;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::UnityEngine::UIElements::Column*, float>*) == 0x8);
    // private System.Action layoutRequested
    // Size: 0x8
    // Offset: 0x68
    ::System::Action* layoutRequested;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    public:
    // Get instance field reference: private System.Collections.Generic.List`1<UnityEngine.UIElements.Column> m_StretchableColumns
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::UnityEngine::UIElements::Column*>*& dyn_m_StretchableColumns();
    // Get instance field reference: private System.Collections.Generic.List`1<UnityEngine.UIElements.Column> m_FixedColumns
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::UnityEngine::UIElements::Column*>*& dyn_m_FixedColumns();
    // Get instance field reference: private UnityEngine.UIElements.Columns m_Columns
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::Columns*& dyn_m_Columns();
    // Get instance field reference: private System.Single m_ColumnsWidth
