// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: UnityEngine.UIElements.StyleDataRef`1
#include "UnityEngine/UIElements/StyleDataRef_1.hpp"
// Including type: UnityEngine.UIElements.InheritedData
#include "UnityEngine/UIElements/InheritedData.hpp"
// Including type: UnityEngine.UIElements.LayoutData
#include "UnityEngine/UIElements/LayoutData.hpp"
// Including type: UnityEngine.UIElements.RareData
#include "UnityEngine/UIElements/RareData.hpp"
// Including type: UnityEngine.UIElements.TransformData
#include "UnityEngine/UIElements/TransformData.hpp"
// Including type: UnityEngine.UIElements.TransitionData
#include "UnityEngine/UIElements/TransitionData.hpp"
// Including type: UnityEngine.UIElements.VisualData
#include "UnityEngine/UIElements/VisualData.hpp"
// Including type: UnityEngine.UIElements.StyleSheets.StylePropertyValue
#include "UnityEngine/UIElements/StyleSheets/StylePropertyValue.hpp"
// Including type: UnityEngine.UIElements.ComputedTransitionProperty
#include "UnityEngine/UIElements/ComputedTransitionProperty.hpp"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"

  // Forward declaring type: VisualElement
  class VisualElement;
  // Forward declaring type: StyleTranslate
  struct StyleTranslate;
  // Skipping declaration: Align because it is already included!
  // Skipping declaration: Background because it is already included!
  // Skipping declaration: BackgroundPosition because it is already included!
  // Skipping declaration: BackgroundRepeat because it is already included!
  // Skipping declaration: BackgroundSize because it is already included!
  // Skipping declaration: Length because it is already included!
  // Skipping declaration: Cursor because it is already included!
  // Skipping declaration: DisplayStyle because it is already included!
  // Skipping declaration: FlexDirection because it is already included!
  // Skipping declaration: Wrap because it is already included!
  // Skipping declaration: Justify because it is already included!
  // Skipping declaration: OverflowInternal because it is already included!
  // Skipping declaration: Position because it is already included!
  // Skipping declaration: Rotate because it is already included!
  // Skipping declaration: Scale because it is already included!
  // Skipping declaration: TextOverflow because it is already included!
  // Skipping declaration: TextShadow because it is already included!
  // Skipping declaration: TransformOrigin because it is already included!
  // Skipping declaration: Translate because it is already included!
  // Skipping declaration: FontDefinition because it is already included!
  // Skipping declaration: OverflowClipBox because it is already included!
  // Skipping declaration: TextOverflowPosition because it is already included!
  // Skipping declaration: Visibility because it is already included!
  // Skipping declaration: WhiteSpace because it is already included!
  // Forward declaring type: VersionChangeType
  struct VersionChangeType;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Func`2<T, TResult>
  template<typename T, typename TResult>
  class Func_2;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Skipping declaration: Color because it is already included!
  // Forward declaring type: Font
  class Font;
  // Skipping declaration: FontStyle because it is already included!
  // Skipping declaration: TextAnchor because it is already included!
}
// Completed forward declares
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: ComputedStyle
  struct ComputedStyle;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UIElements::ComputedStyle, "UnityEngine.UIElements", "ComputedStyle");
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // WARNING Size may be invalid!
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: UnityEngine.UIElements.ComputedStyle
  // [TokenAttribute] Offset: FFFFFFFF
  struct ComputedStyle/*, public ::System::ValueType*/ {
    public:
    public:
    // public UnityEngine.UIElements.StyleDataRef`1<UnityEngine.UIElements.InheritedData> inheritedData
    // Size: 0xFFFFFFFF
    // Offset: 0x0
    ::UnityEngine::UIElements::StyleDataRef_1<::UnityEngine::UIElements::InheritedData> inheritedData;
    // public UnityEngine.UIElements.StyleDataRef`1<UnityEngine.UIElements.LayoutData> layoutData
    // Size: 0xFFFFFFFF
    // Offset: 0x8
    ::UnityEngine::UIElements::StyleDataRef_1<::UnityEngine::UIElements::LayoutData> layoutData;
    // public UnityEngine.UIElements.StyleDataRef`1<UnityEngine.UIElements.RareData> rareData
    // Size: 0xFFFFFFFF
    // Offset: 0x10
    ::UnityEngine::UIElements::StyleDataRef_1<::UnityEngine::UIElements::RareData> rareData;
    // public UnityEngine.UIElements.StyleDataRef`1<UnityEngine.UIElements.TransformData> transformData
    // Size: 0xFFFFFFFF
    // Offset: 0x18
    ::UnityEngine::UIElements::StyleDataRef_1<::UnityEngine::UIElements::TransformData> transformData;
    // public UnityEngine.UIElements.StyleDataRef`1<UnityEngine.UIElements.TransitionData> transitionData
    // Size: 0xFFFFFFFF
    // Offset: 0x20
    ::UnityEngine::UIElements::StyleDataRef_1<::UnityEngine::UIElements::TransitionData> transitionData;
    // public UnityEngine.UIElements.StyleDataRef`1<UnityEngine.UIElements.VisualData> visualData
    // Size: 0xFFFFFFFF
    // Offset: 0x28
    ::UnityEngine::UIElements::StyleDataRef_1<::UnityEngine::UIElements::VisualData> visualData;
    // public UnityEngine.Yoga.YogaNode yogaNode
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Yoga::YogaNode* yogaNode;
    // Field size check
    static_assert(sizeof(::UnityEngine::Yoga::YogaNode*) == 0x8);
    // public System.Collections.Generic.Dictionary`2<System.String,UnityEngine.UIElements.StyleSheets.StylePropertyValue> customProperties
    // Size: 0x8
    // Offset: 0x38
    ::System::Collections::Generic::Dictionary_2<::StringW, ::UnityEngine::UIElements::StyleSheets::StylePropertyValue>* customProperties;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, ::UnityEngine::UIElements::StyleSheets::StylePropertyValue>*) == 0x8);
    // public System.Int64 matchingRulesHash
    // Size: 0x8
    // Offset: 0x40
    int64_t matchingRulesHash;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // public System.Single dpiScaling
    // Size: 0x4
    // Offset: 0x48
    float dpiScaling;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.UIElements.ComputedTransitionProperty[] computedTransitions
    // Size: 0x8
    // Offset: 0x50
    ::ArrayW<::UnityEngine::UIElements::ComputedTransitionProperty> computedTransitions;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::UIElements::ComputedTransitionProperty>) == 0x8);
    public:
    // Creating value type constructor for type: ComputedStyle
