// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.EventModifiers
#include "UnityEngine/EventModifiers.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
// Including type: System.Nullable`1
#include "System/Nullable_1.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: BaseRuntimePanel
  class BaseRuntimePanel;
  // Forward declaring type: Focusable
  class Focusable;
  // Forward declaring type: EventBase
  class EventBase;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Event
  class Event;
  // Forward declaring type: Touch
  struct Touch;
  // Forward declaring type: PenData
  struct PenData;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Func`1<TResult>
  template<typename TResult>
  class Func_1;
  // Forward declaring type: Func`2<T, TResult>
  template<typename T, typename TResult>
  class Func_2;
  // Forward declaring type: Func`4<T1, T2, T3, TResult>
  template<typename T1, typename T2, typename T3, typename TResult>
  class Func_4;
}
// Completed forward declares
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: DefaultEventSystem
  class DefaultEventSystem;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::UIElements::DefaultEventSystem);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UIElements::DefaultEventSystem*, "UnityEngine.UIElements", "DefaultEventSystem");
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Size: 0x94
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.UIElements.DefaultEventSystem
  // [TokenAttribute] Offset: FFFFFFFF
  class DefaultEventSystem : public ::Il2CppObject {
    public:
    // Nested type: ::UnityEngine::UIElements::DefaultEventSystem::UpdateMode
    struct UpdateMode;
    // Nested type: ::UnityEngine::UIElements::DefaultEventSystem::FocusBasedEventSequenceContext
    struct FocusBasedEventSequenceContext;
    // Nested type: ::UnityEngine::UIElements::DefaultEventSystem::IInput
    class IInput;
    // Nested type: ::UnityEngine::UIElements::DefaultEventSystem::Input
    class Input;
    // Nested type: ::UnityEngine::UIElements::DefaultEventSystem::NoInput
    class NoInput;
    // Nested type: ::UnityEngine::UIElements::DefaultEventSystem::$$c
    class $$c;
    public:
    // private UnityEngine.UIElements.DefaultEventSystem/IInput m_Input
    // Size: 0x8
    // Offset: 0x10
    ::UnityEngine::UIElements::DefaultEventSystem::IInput* m_Input;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::DefaultEventSystem::IInput*) == 0x8);
    // private readonly System.String m_HorizontalAxis
    // Size: 0x8
    // Offset: 0x18
    ::StringW m_HorizontalAxis;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private readonly System.String m_VerticalAxis
    // Size: 0x8
    // Offset: 0x20
    ::StringW m_VerticalAxis;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private readonly System.String m_SubmitButton
    // Size: 0x8
    // Offset: 0x28
    ::StringW m_SubmitButton;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private readonly System.String m_CancelButton
    // Size: 0x8
    // Offset: 0x30
    ::StringW m_CancelButton;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private readonly System.Single m_InputActionsPerSecond
    // Size: 0x4
    // Offset: 0x38
    float m_InputActionsPerSecond;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private readonly System.Single m_RepeatDelay
    // Size: 0x4
    // Offset: 0x3C
    float m_RepeatDelay;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_SendingTouchEvents
    // Size: 0x1
    // Offset: 0x40
    bool m_SendingTouchEvents;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_SendingPenEvent
    // Size: 0x1
    // Offset: 0x41
    bool m_SendingPenEvent;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_SendingPenEvent and: m_Event
    char __padding8[0x6] = {};
    // private UnityEngine.Event m_Event
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::Event* m_Event;
    // Field size check
    static_assert(sizeof(::UnityEngine::Event*) == 0x8);
    // private UnityEngine.UIElements.BaseRuntimePanel m_FocusedPanel
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::UIElements::BaseRuntimePanel* m_FocusedPanel;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::BaseRuntimePanel*) == 0x8);
    // private UnityEngine.UIElements.BaseRuntimePanel m_PreviousFocusedPanel
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::UIElements::BaseRuntimePanel* m_PreviousFocusedPanel;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::BaseRuntimePanel*) == 0x8);
    // private UnityEngine.UIElements.Focusable m_PreviousFocusedElement
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::UIElements::Focusable* m_PreviousFocusedElement;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::Focusable*) == 0x8);
    // private UnityEngine.EventModifiers m_CurrentModifiers
    // Size: 0x4
    // Offset: 0x68
    ::UnityEngine::EventModifiers m_CurrentModifiers;
    // Field size check
    static_assert(sizeof(::UnityEngine::EventModifiers) == 0x4);
    // private System.Int32 m_LastMousePressButton
    // Size: 0x4
    // Offset: 0x6C
    int m_LastMousePressButton;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single m_NextMousePressTime
    // Size: 0x4
    // Offset: 0x70
    float m_NextMousePressTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 m_LastMouseClickCount
    // Size: 0x4
    // Offset: 0x74
    int m_LastMouseClickCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.Vector2 m_LastMousePosition
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::Vector2 m_LastMousePosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private System.Boolean m_MouseProcessedAtLeastOnce
    // Size: 0x1
    // Offset: 0x80
    bool m_MouseProcessedAtLeastOnce;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_MouseProcessedAtLeastOnce and: m_ConsecutiveMoveCount
    char __padding18[0x3] = {};
    // private System.Int32 m_ConsecutiveMoveCount
    // Size: 0x4
    // Offset: 0x84
    int m_ConsecutiveMoveCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.Vector2 m_LastMoveVector
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::Vector2 m_LastMoveVector;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private System.Single m_PrevActionTime
    // Size: 0x4
    // Offset: 0x90
    float m_PrevActionTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Get static field: static System.Func`1<System.Boolean> IsEditorRemoteConnected
    static ::System::Func_1<bool>* _get_IsEditorRemoteConnected();
    // Set static field: static System.Func`1<System.Boolean> IsEditorRemoteConnected
    static void _set_IsEditorRemoteConnected(::System::Func_1<bool>* value);
    // Get instance field reference: private UnityEngine.UIElements.DefaultEventSystem/IInput m_Input
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::DefaultEventSystem::IInput*& dyn_m_Input();
    // Get instance field reference: private readonly System.String m_HorizontalAxis
    [[deprecated("Use field access instead!")]] ::StringW& dyn_m_HorizontalAxis();
    // Get instance field reference: private readonly System.String m_VerticalAxis
    [[deprecated("Use field access instead!")]] ::StringW& dyn_m_VerticalAxis();
