// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.UIElements.DropdownMenuItem
#include "UnityEngine/UIElements/DropdownMenuItem.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: DropdownMenuEventInfo
  class DropdownMenuEventInfo;
  // Skipping declaration: Status because it is already included!
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Func`2<T, TResult>
  template<typename T, typename TResult>
  class Func_2;
}
// Completed forward declares
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: DropdownMenuAction
  class DropdownMenuAction;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::UIElements::DropdownMenuAction);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UIElements::DropdownMenuAction*, "UnityEngine.UIElements", "DropdownMenuAction");
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Size: 0x40
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.UIElements.DropdownMenuAction
  // [TokenAttribute] Offset: FFFFFFFF
  class DropdownMenuAction : public ::UnityEngine::UIElements::DropdownMenuItem {
    public:
    // Nested type: ::UnityEngine::UIElements::DropdownMenuAction::Status
    struct Status;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.UIElements.DropdownMenuAction/Status
    // [TokenAttribute] Offset: FFFFFFFF
    // [FlagsAttribute] Offset: FFFFFFFF
    struct Status/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: Status
      constexpr Status(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.UIElements.DropdownMenuAction/Status None
      static constexpr const int None = 0;
      // Get static field: static public UnityEngine.UIElements.DropdownMenuAction/Status None
      static ::UnityEngine::UIElements::DropdownMenuAction::Status _get_None();
      // Set static field: static public UnityEngine.UIElements.DropdownMenuAction/Status None
      static void _set_None(::UnityEngine::UIElements::DropdownMenuAction::Status value);
      // static field const value: static public UnityEngine.UIElements.DropdownMenuAction/Status Normal
      static constexpr const int Normal = 1;
      // Get static field: static public UnityEngine.UIElements.DropdownMenuAction/Status Normal
      static ::UnityEngine::UIElements::DropdownMenuAction::Status _get_Normal();
      // Set static field: static public UnityEngine.UIElements.DropdownMenuAction/Status Normal
      static void _set_Normal(::UnityEngine::UIElements::DropdownMenuAction::Status value);
      // static field const value: static public UnityEngine.UIElements.DropdownMenuAction/Status Disabled
      static constexpr const int Disabled = 2;
      // Get static field: static public UnityEngine.UIElements.DropdownMenuAction/Status Disabled
      static ::UnityEngine::UIElements::DropdownMenuAction::Status _get_Disabled();
      // Set static field: static public UnityEngine.UIElements.DropdownMenuAction/Status Disabled
      static void _set_Disabled(::UnityEngine::UIElements::DropdownMenuAction::Status value);
      // static field const value: static public UnityEngine.UIElements.DropdownMenuAction/Status Checked
      static constexpr const int Checked = 4;
      // Get static field: static public UnityEngine.UIElements.DropdownMenuAction/Status Checked
      static ::UnityEngine::UIElements::DropdownMenuAction::Status _get_Checked();
      // Set static field: static public UnityEngine.UIElements.DropdownMenuAction/Status Checked
      static void _set_Checked(::UnityEngine::UIElements::DropdownMenuAction::Status value);
      // static field const value: static public UnityEngine.UIElements.DropdownMenuAction/Status Hidden
      static constexpr const int Hidden = 8;
      // Get static field: static public UnityEngine.UIElements.DropdownMenuAction/Status Hidden
      static ::UnityEngine::UIElements::DropdownMenuAction::Status _get_Hidden();
      // Set static field: static public UnityEngine.UIElements.DropdownMenuAction/Status Hidden
      static void _set_Hidden(::UnityEngine::UIElements::DropdownMenuAction::Status value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.UIElements.DropdownMenuAction/Status
    #pragma pack(pop)
    static check_size<sizeof(DropdownMenuAction::Status), 0 + sizeof(int)> __UnityEngine_UIElements_DropdownMenuAction_StatusSizeCheck;
    static_assert(sizeof(DropdownMenuAction::Status) == 0x4);
    public:
    // private readonly System.String <name>k__BackingField
    // Size: 0x8
    // Offset: 0x10
    ::StringW name;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private UnityEngine.UIElements.DropdownMenuAction/Status <status>k__BackingField
    // Size: 0x4
    // Offset: 0x18
    ::UnityEngine::UIElements::DropdownMenuAction::Status status;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::DropdownMenuAction::Status) == 0x4);
    // Padding between fields: status and: eventInfo
    char __padding1[0x4] = {};
    // private UnityEngine.UIElements.DropdownMenuEventInfo <eventInfo>k__BackingField
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::UIElements::DropdownMenuEventInfo* eventInfo;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::DropdownMenuEventInfo*) == 0x8);
    // private System.Object <userData>k__BackingField
    // Size: 0x8
    // Offset: 0x28
    ::Il2CppObject* userData;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private readonly System.Action`1<UnityEngine.UIElements.DropdownMenuAction> actionCallback
    // Size: 0x8
    // Offset: 0x30
    ::System::Action_1<::UnityEngine::UIElements::DropdownMenuAction*>* actionCallback;
    // Field size check
    static_assert(sizeof(::System::Action_1<::UnityEngine::UIElements::DropdownMenuAction*>*) == 0x8);
    // private readonly System.Func`2<UnityEngine.UIElements.DropdownMenuAction,UnityEngine.UIElements.DropdownMenuAction/Status> actionStatusCallback
    // Size: 0x8
    // Offset: 0x38
    ::System::Func_2<::UnityEngine::UIElements::DropdownMenuAction*, ::UnityEngine::UIElements::DropdownMenuAction::Status>* actionStatusCallback;
    // Field size check
    static_assert(sizeof(::System::Func_2<::UnityEngine::UIElements::DropdownMenuAction*, ::UnityEngine::UIElements::DropdownMenuAction::Status>*) == 0x8);
    public:
    // Get instance field reference: private readonly System.String <name>k__BackingField
    [[deprecated("Use field access instead!")]] ::StringW& dyn_$name$k__BackingField();
    // Get instance field reference: private UnityEngine.UIElements.DropdownMenuAction/Status <status>k__BackingField
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::DropdownMenuAction::Status& dyn_$status$k__BackingField();
    // Get instance field reference: private UnityEngine.UIElements.DropdownMenuEventInfo <eventInfo>k__BackingField
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::DropdownMenuEventInfo*& dyn_$eventInfo$k__BackingField();
    // Get instance field reference: private System.Object <userData>k__BackingField
    [[deprecated("Use field access instead!")]] ::Il2CppObject*& dyn_$userData$k__BackingField();
    // Get instance field reference: private readonly System.Action`1<UnityEngine.UIElements.DropdownMenuAction> actionCallback
    [[deprecated("Use field access instead!")]] ::System::Action_1<::UnityEngine::UIElements::DropdownMenuAction*>*& dyn_actionCallback();
    // Get instance field reference: private readonly System.Func`2<UnityEngine.UIElements.DropdownMenuAction,UnityEngine.UIElements.DropdownMenuAction/Status> actionStatusCallback
    [[deprecated("Use field access instead!")]] ::System::Func_2<::UnityEngine::UIElements::DropdownMenuAction*, ::UnityEngine::UIElements::DropdownMenuAction::Status>*& dyn_actionStatusCallback();
    // private System.Void set_status(UnityEngine.UIElements.DropdownMenuAction/Status value)
    // Offset: 0x56441B8
    void set_status(::UnityEngine::UIElements::DropdownMenuAction::Status value);
    // private System.Void set_eventInfo(UnityEngine.UIElements.DropdownMenuEventInfo value)
    // Offset: 0x56441C0
    void set_eventInfo(::UnityEngine::UIElements::DropdownMenuEventInfo* value);
    // private System.Void set_userData(System.Object value)
    // Offset: 0x56441C8
    void set_userData(::Il2CppObject* value);
    // static public UnityEngine.UIElements.DropdownMenuAction/Status AlwaysEnabled(UnityEngine.UIElements.DropdownMenuAction a)
    // Offset: 0x56441D0
    static ::UnityEngine::UIElements::DropdownMenuAction::Status AlwaysEnabled(::UnityEngine::UIElements::DropdownMenuAction* a);
    // static public UnityEngine.UIElements.DropdownMenuAction/Status AlwaysDisabled(UnityEngine.UIElements.DropdownMenuAction a)
    // Offset: 0x56441D8
    static ::UnityEngine::UIElements::DropdownMenuAction::Status AlwaysDisabled(::UnityEngine::UIElements::DropdownMenuAction* a);
    // public System.Void .ctor(System.String actionName, System.Action`1<UnityEngine.UIElements.DropdownMenuAction> actionCallback, System.Func`2<UnityEngine.UIElements.DropdownMenuAction,UnityEngine.UIElements.DropdownMenuAction/Status> actionStatusCallback, System.Object userData)
    // Offset: 0x56441E0
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static DropdownMenuAction* New_ctor(::StringW actionName, ::System::Action_1<::UnityEngine::UIElements::DropdownMenuAction*>* actionCallback, ::System::Func_2<::UnityEngine::UIElements::DropdownMenuAction*, ::UnityEngine::UIElements::DropdownMenuAction::Status>* actionStatusCallback, ::Il2CppObject* userData) {
      static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::UIElements::DropdownMenuAction::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<DropdownMenuAction*, creationType>(actionName, actionCallback, actionStatusCallback, userData)));
    }
    // public System.Void UpdateActionStatus(UnityEngine.UIElements.DropdownMenuEventInfo eventInfo)
    // Offset: 0x5644254
    void UpdateActionStatus(::UnityEngine::UIElements::DropdownMenuEventInfo* eventInfo);
  }; // UnityEngine.UIElements.DropdownMenuAction
  #pragma pack(pop)
  static check_size<sizeof(DropdownMenuAction), 56 + sizeof(::System::Func_2<::UnityEngine::UIElements::DropdownMenuAction*, ::UnityEngine::UIElements::DropdownMenuAction::Status>*)> __UnityEngine_UIElements_DropdownMenuActionSizeCheck;
  static_assert(sizeof(DropdownMenuAction) == 0x40);
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UIElements::DropdownMenuAction::Status, "UnityEngine.UIElements", "DropdownMenuAction/Status");
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: UnityEngine::UIElements::DropdownMenuAction::set_status
// Il2CppName: set_status
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (UnityEngine::UIElements::DropdownMenuAction::*)(::UnityEngine::UIElements::DropdownMenuAction::Status)>(&UnityEngine::UIElements::DropdownMenuAction::set_status)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("UnityEngine.UIElements", "DropdownMenuAction/Status")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::UIElements::DropdownMenuAction*), "set_status", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: UnityEngine::UIElements::DropdownMenuAction::set_eventInfo
// Il2CppName: set_eventInfo
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (UnityEngine::UIElements::DropdownMenuAction::*)(::UnityEngine::UIElements::DropdownMenuEventInfo*)>(&UnityEngine::UIElements::DropdownMenuAction::set_eventInfo)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("UnityEngine.UIElements", "DropdownMenuEventInfo")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::UIElements::DropdownMenuAction*), "set_eventInfo", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: UnityEngine::UIElements::DropdownMenuAction::set_userData
// Il2CppName: set_userData
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (UnityEngine::UIElements::DropdownMenuAction::*)(::Il2CppObject*)>(&UnityEngine::UIElements::DropdownMenuAction::set_userData)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("System", "Object")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::UIElements::DropdownMenuAction*), "set_userData", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: UnityEngine::UIElements::DropdownMenuAction::AlwaysEnabled
// Il2CppName: AlwaysEnabled
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::UIElements::DropdownMenuAction::Status (*)(::UnityEngine::UIElements::DropdownMenuAction*)>(&UnityEngine::UIElements::DropdownMenuAction::AlwaysEnabled)> {
  static const MethodInfo* get() {
    static auto* a = &::il2cpp_utils::GetClassFromName("UnityEngine.UIElements", "DropdownMenuAction")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::UIElements::DropdownMenuAction*), "AlwaysEnabled", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{a});
  }
};
// Writing MetadataGetter for method: UnityEngine::UIElements::DropdownMenuAction::AlwaysDisabled
// Il2CppName: AlwaysDisabled
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::UIElements::DropdownMenuAction::Status (*)(::UnityEngine::UIElements::DropdownMenuAction*)>(&UnityEngine::UIElements::DropdownMenuAction::AlwaysDisabled)> {
  static const MethodInfo* get() {
    static auto* a = &::il2cpp_utils::GetClassFromName("UnityEngine.UIElements", "DropdownMenuAction")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::UIElements::DropdownMenuAction*), "AlwaysDisabled", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{a});
  }
};
// Writing MetadataGetter for method: UnityEngine::UIElements::DropdownMenuAction::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: UnityEngine::UIElements::DropdownMenuAction::UpdateActionStatus
// Il2CppName: UpdateActionStatus
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (UnityEngine::UIElements::DropdownMenuAction::*)(::UnityEngine::UIElements::DropdownMenuEventInfo*)>(&UnityEngine::UIElements::DropdownMenuAction::UpdateActionStatus)> {
  static const MethodInfo* get() {
    static auto* eventInfo = &::il2cpp_utils::GetClassFromName("UnityEngine.UIElements", "DropdownMenuEventInfo")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::UIElements::DropdownMenuAction*), "UpdateActionStatus", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{eventInfo});
  }
};
