// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.UIElements.VerticalVirtualizationController`1
#include "UnityEngine/UIElements/VerticalVirtualizationController_1.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UIElements
namespace UnityEngine::UIElements {
  // Skipping declaration: ContentHeightCacheInfo because it is already included!
  // Skipping declaration: VirtualizationChange because it is already included!
  // Skipping declaration: ScrollDirection because it is already included!
  // Forward declaring type: ReusableCollectionItem
  class ReusableCollectionItem;
  // Forward declaring type: IVisualElementScheduledItem
  class IVisualElementScheduledItem;
  // Forward declaring type: BaseVerticalCollectionView
  class BaseVerticalCollectionView;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: HashSet`1<T>
  template<typename T>
  class HashSet_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Predicate`1<T>
  template<typename T>
  class Predicate_1;
}
// Completed forward declares
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: DynamicHeightVirtualizationController`1<T>
  template<typename T>
  class DynamicHeightVirtualizationController_1;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE_GENERIC_CLASS(::UnityEngine::UIElements::DynamicHeightVirtualizationController_1, "UnityEngine.UIElements", "DynamicHeightVirtualizationController`1");
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // WARNING Size may be invalid!
  // Autogenerated type: UnityEngine.UIElements.DynamicHeightVirtualizationController`1
  // [TokenAttribute] Offset: FFFFFFFF
  template<typename T>
  class DynamicHeightVirtualizationController_1 : public ::UnityEngine::UIElements::VerticalVirtualizationController_1<T> {
    public:
    // Nested type: ::UnityEngine::UIElements::DynamicHeightVirtualizationController_1::ContentHeightCacheInfo<T>
    struct ContentHeightCacheInfo;
    // Nested type: ::UnityEngine::UIElements::DynamicHeightVirtualizationController_1::VirtualizationChange<T>
    struct VirtualizationChange;
    // Nested type: ::UnityEngine::UIElements::DynamicHeightVirtualizationController_1::ScrollDirection<T>
    struct ScrollDirection;
    // WARNING Size may be invalid!
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.UIElements.DynamicHeightVirtualizationController`1/ContentHeightCacheInfo
    // [TokenAttribute] Offset: FFFFFFFF
    // [IsReadOnlyAttribute] Offset: FFFFFFFF
    struct ContentHeightCacheInfo : public ::il2cpp_utils::il2cpp_type_check::NestedType/*, public ::System::ValueType*/ {
      public:
      using declaring_type = DynamicHeightVirtualizationController_1<T>*;
      static constexpr std::string_view NESTED_NAME = "ContentHeightCacheInfo";
      static constexpr bool IS_VALUE_TYPE = true;
      public:
      // public readonly System.Single sum
      // Size: 0x4
      // Offset: 0x0
      float sum;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public readonly System.Int32 count
      // Size: 0x4
      // Offset: 0x0
      int count;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: ContentHeightCacheInfo
      constexpr ContentHeightCacheInfo(float sum_ = {}, int count_ = {}) noexcept : sum{sum_}, count{count_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Autogenerated instance field getter
      // Get instance field: public readonly System.Single sum
      [[deprecated("Use field access instead!")]] float& dyn_sum() {
        static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::UIElements::DynamicHeightVirtualizationController_1::ContentHeightCacheInfo::dyn_sum");
        auto ___internal__instance = *this;
        static auto ___internal__field__offset = THROW_UNLESS(il2cpp_utils::FindField(___internal__instance, "sum"))->offset;
        return *reinterpret_cast<float*>(reinterpret_cast<char*>(this) + ___internal__field__offset);
      }
      // Autogenerated instance field getter
      // Get instance field: public readonly System.Int32 count
      [[deprecated("Use field access instead!")]] int& dyn_count() {
        static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::UIElements::DynamicHeightVirtualizationController_1::ContentHeightCacheInfo::dyn_count");
        auto ___internal__instance = *this;
        static auto ___internal__field__offset = THROW_UNLESS(il2cpp_utils::FindField(___internal__instance, "count"))->offset;
        return *reinterpret_cast<int*>(reinterpret_cast<char*>(this) + ___internal__field__offset);
      }
      // public System.Void .ctor(System.Single sum, System.Int32 count)
      // Offset: 0xFFFFFFFFFFFFFFFF
      // ABORTED: conflicts with another method.  ContentHeightCacheInfo(float sum, int count)
    }; // UnityEngine.UIElements.DynamicHeightVirtualizationController`1/ContentHeightCacheInfo
    // Could not write size check! Type: UnityEngine.UIElements.DynamicHeightVirtualizationController`1/ContentHeightCacheInfo is generic, or has no fields that are valid for size checks!
    // WARNING Size may be invalid!
    // Autogenerated type: UnityEngine.UIElements.DynamicHeightVirtualizationController`1/VirtualizationChange
    // [TokenAttribute] Offset: FFFFFFFF
    struct VirtualizationChange : public ::il2cpp_utils::il2cpp_type_check::NestedType/*, public ::System::Enum*/ {
      public:
      using declaring_type = DynamicHeightVirtualizationController_1<T>*;
      static constexpr std::string_view NESTED_NAME = "VirtualizationChange";
      static constexpr bool IS_VALUE_TYPE = true;
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: VirtualizationChange
      constexpr VirtualizationChange(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // Autogenerated static field getter
      // Get static field: static public UnityEngine.UIElements.DynamicHeightVirtualizationController`1/VirtualizationChange<T> None
      static typename ::UnityEngine::UIElements::DynamicHeightVirtualizationController_1<T>::VirtualizationChange _get_None() {
        static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::UIElements::DynamicHeightVirtualizationController_1::VirtualizationChange::_get_None");
        return THROW_UNLESS(il2cpp_utils::GetFieldValue<typename ::UnityEngine::UIElements::DynamicHeightVirtualizationController_1<T>::VirtualizationChange>(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename DynamicHeightVirtualizationController_1<T>::VirtualizationChange>::get(), "None"));
      }
      // Autogenerated static field setter
      // Set static field: static public UnityEngine.UIElements.DynamicHeightVirtualizationController`1/VirtualizationChange<T> None
      static void _set_None(typename ::UnityEngine::UIElements::DynamicHeightVirtualizationController_1<T>::VirtualizationChange value) {
        static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::UIElements::DynamicHeightVirtualizationController_1::VirtualizationChange::_set_None");
        THROW_UNLESS(il2cpp_utils::SetFieldValue(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename DynamicHeightVirtualizationController_1<T>::VirtualizationChange>::get(), "None", value));
      }
      // Autogenerated static field getter
      // Get static field: static public UnityEngine.UIElements.DynamicHeightVirtualizationController`1/VirtualizationChange<T> Resize
      static typename ::UnityEngine::UIElements::DynamicHeightVirtualizationController_1<T>::VirtualizationChange _get_Resize() {
        static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::UIElements::DynamicHeightVirtualizationController_1::VirtualizationChange::_get_Resize");
        return THROW_UNLESS(il2cpp_utils::GetFieldValue<typename ::UnityEngine::UIElements::DynamicHeightVirtualizationController_1<T>::VirtualizationChange>(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename DynamicHeightVirtualizationController_1<T>::VirtualizationChange>::get(), "Resize"));
      }
      // Autogenerated static field setter
      // Set static field: static public UnityEngine.UIElements.DynamicHeightVirtualizationController`1/VirtualizationChange<T> Resize
      static void _set_Resize(typename ::UnityEngine::UIElements::DynamicHeightVirtualizationController_1<T>::VirtualizationChange value) {
        static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::UIElements::DynamicHeightVirtualizationController_1::VirtualizationChange::_set_Resize");
        THROW_UNLESS(il2cpp_utils::SetFieldValue(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename DynamicHeightVirtualizationController_1<T>::VirtualizationChange>::get(), "Resize", value));
      }
      // Autogenerated static field getter
      // Get static field: static public UnityEngine.UIElements.DynamicHeightVirtualizationController`1/VirtualizationChange<T> Scroll
      static typename ::UnityEngine::UIElements::DynamicHeightVirtualizationController_1<T>::VirtualizationChange _get_Scroll() {
        static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::UIElements::DynamicHeightVirtualizationController_1::VirtualizationChange::_get_Scroll");
        return THROW_UNLESS(il2cpp_utils::GetFieldValue<typename ::UnityEngine::UIElements::DynamicHeightVirtualizationController_1<T>::VirtualizationChange>(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename DynamicHeightVirtualizationController_1<T>::VirtualizationChange>::get(), "Scroll"));
      }
      // Autogenerated static field setter
      // Set static field: static public UnityEngine.UIElements.DynamicHeightVirtualizationController`1/VirtualizationChange<T> Scroll
      static void _set_Scroll(typename ::UnityEngine::UIElements::DynamicHeightVirtualizationController_1<T>::VirtualizationChange value) {
        static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::UIElements::DynamicHeightVirtualizationController_1::VirtualizationChange::_set_Scroll");
        THROW_UNLESS(il2cpp_utils::SetFieldValue(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename DynamicHeightVirtualizationController_1<T>::VirtualizationChange>::get(), "Scroll", value));
      }
      // Autogenerated static field getter
      // Get static field: static public UnityEngine.UIElements.DynamicHeightVirtualizationController`1/VirtualizationChange<T> ForcedScroll
      static typename ::UnityEngine::UIElements::DynamicHeightVirtualizationController_1<T>::VirtualizationChange _get_ForcedScroll() {
        static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::UIElements::DynamicHeightVirtualizationController_1::VirtualizationChange::_get_ForcedScroll");
        return THROW_UNLESS(il2cpp_utils::GetFieldValue<typename ::UnityEngine::UIElements::DynamicHeightVirtualizationController_1<T>::VirtualizationChange>(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename DynamicHeightVirtualizationController_1<T>::VirtualizationChange>::get(), "ForcedScroll"));
      }
      // Autogenerated static field setter
      // Set static field: static public UnityEngine.UIElements.DynamicHeightVirtualizationController`1/VirtualizationChange<T> ForcedScroll
      static void _set_ForcedScroll(typename ::UnityEngine::UIElements::DynamicHeightVirtualizationController_1<T>::VirtualizationChange value) {
        static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::UIElements::DynamicHeightVirtualizationController_1::VirtualizationChange::_set_ForcedScroll");
        THROW_UNLESS(il2cpp_utils::SetFieldValue(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename DynamicHeightVirtualizationController_1<T>::VirtualizationChange>::get(), "ForcedScroll", value));
      }
      // Autogenerated instance field getter
      // Get instance field: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__() {
        static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::UIElements::DynamicHeightVirtualizationController_1::VirtualizationChange::dyn_value__");
        auto ___internal__instance = *this;
        static auto ___internal__field__offset = THROW_UNLESS(il2cpp_utils::FindField(___internal__instance, "value__"))->offset;
        return *reinterpret_cast<int*>(reinterpret_cast<char*>(this) + ___internal__field__offset);
      }
    }; // UnityEngine.UIElements.DynamicHeightVirtualizationController`1/VirtualizationChange
    // Could not write size check! Type: UnityEngine.UIElements.DynamicHeightVirtualizationController`1/VirtualizationChange is generic, or has no fields that are valid for size checks!
    // WARNING Size may be invalid!
    // Autogenerated type: UnityEngine.UIElements.DynamicHeightVirtualizationController`1/ScrollDirection
    // [TokenAttribute] Offset: FFFFFFFF
    struct ScrollDirection : public ::il2cpp_utils::il2cpp_type_check::NestedType/*, public ::System::Enum*/ {
      public:
      using declaring_type = DynamicHeightVirtualizationController_1<T>*;
      static constexpr std::string_view NESTED_NAME = "ScrollDirection";
      static constexpr bool IS_VALUE_TYPE = true;
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: ScrollDirection
      constexpr ScrollDirection(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // Autogenerated static field getter
      // Get static field: static public UnityEngine.UIElements.DynamicHeightVirtualizationController`1/ScrollDirection<T> Idle
      static typename ::UnityEngine::UIElements::DynamicHeightVirtualizationController_1<T>::ScrollDirection _get_Idle() {
        static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::UIElements::DynamicHeightVirtualizationController_1::ScrollDirection::_get_Idle");
        return THROW_UNLESS(il2cpp_utils::GetFieldValue<typename ::UnityEngine::UIElements::DynamicHeightVirtualizationController_1<T>::ScrollDirection>(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename DynamicHeightVirtualizationController_1<T>::ScrollDirection>::get(), "Idle"));
      }
      // Autogenerated static field setter
      // Set static field: static public UnityEngine.UIElements.DynamicHeightVirtualizationController`1/ScrollDirection<T> Idle
      static void _set_Idle(typename ::UnityEngine::UIElements::DynamicHeightVirtualizationController_1<T>::ScrollDirection value) {
        static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::UIElements::DynamicHeightVirtualizationController_1::ScrollDirection::_set_Idle");
        THROW_UNLESS(il2cpp_utils::SetFieldValue(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename DynamicHeightVirtualizationController_1<T>::ScrollDirection>::get(), "Idle", value));
      }
      // Autogenerated static field getter
      // Get static field: static public UnityEngine.UIElements.DynamicHeightVirtualizationController`1/ScrollDirection<T> Up
      static typename ::UnityEngine::UIElements::DynamicHeightVirtualizationController_1<T>::ScrollDirection _get_Up() {
        static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::UIElements::DynamicHeightVirtualizationController_1::ScrollDirection::_get_Up");
        return THROW_UNLESS(il2cpp_utils::GetFieldValue<typename ::UnityEngine::UIElements::DynamicHeightVirtualizationController_1<T>::ScrollDirection>(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename DynamicHeightVirtualizationController_1<T>::ScrollDirection>::get(), "Up"));
      }
      // Autogenerated static field setter
      // Set static field: static public UnityEngine.UIElements.DynamicHeightVirtualizationController`1/ScrollDirection<T> Up
      static void _set_Up(typename ::UnityEngine::UIElements::DynamicHeightVirtualizationController_1<T>::ScrollDirection value) {
        static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::UIElements::DynamicHeightVirtualizationController_1::ScrollDirection::_set_Up");
        THROW_UNLESS(il2cpp_utils::SetFieldValue(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename DynamicHeightVirtualizationController_1<T>::ScrollDirection>::get(), "Up", value));
      }
      // Autogenerated static field getter
      // Get static field: static public UnityEngine.UIElements.DynamicHeightVirtualizationController`1/ScrollDirection<T> Down
      static typename ::UnityEngine::UIElements::DynamicHeightVirtualizationController_1<T>::ScrollDirection _get_Down() {
        static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::UIElements::DynamicHeightVirtualizationController_1::ScrollDirection::_get_Down");
        return THROW_UNLESS(il2cpp_utils::GetFieldValue<typename ::UnityEngine::UIElements::DynamicHeightVirtualizationController_1<T>::ScrollDirection>(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename DynamicHeightVirtualizationController_1<T>::ScrollDirection>::get(), "Down"));
      }
      // Autogenerated static field setter
      // Set static field: static public UnityEngine.UIElements.DynamicHeightVirtualizationController`1/ScrollDirection<T> Down
      static void _set_Down(typename ::UnityEngine::UIElements::DynamicHeightVirtualizationController_1<T>::ScrollDirection value) {
        static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::UIElements::DynamicHeightVirtualizationController_1::ScrollDirection::_set_Down");
        THROW_UNLESS(il2cpp_utils::SetFieldValue(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename DynamicHeightVirtualizationController_1<T>::ScrollDirection>::get(), "Down", value));
      }
      // Autogenerated instance field getter
      // Get instance field: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__() {
        static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::UIElements::DynamicHeightVirtualizationController_1::ScrollDirection::dyn_value__");
        auto ___internal__instance = *this;
        static auto ___internal__field__offset = THROW_UNLESS(il2cpp_utils::FindField(___internal__instance, "value__"))->offset;
        return *reinterpret_cast<int*>(reinterpret_cast<char*>(this) + ___internal__field__offset);
      }
    }; // UnityEngine.UIElements.DynamicHeightVirtualizationController`1/ScrollDirection
    // Could not write size check! Type: UnityEngine.UIElements.DynamicHeightVirtualizationController`1/ScrollDirection is generic, or has no fields that are valid for size checks!
    public:
    // private System.Int32 m_HighestCachedIndex
    // Size: 0x4
    // Offset: 0x0
    int m_HighestCachedIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private readonly System.Collections.Generic.Dictionary`2<System.Int32,System.Single> m_ItemHeightCache
    // Size: 0x8
    // Offset: 0x0
    ::System::Collections::Generic::Dictionary_2<int, float>* m_ItemHeightCache;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<int, float>*) == 0x8);
    // private readonly System.Collections.Generic.Dictionary`2<System.Int32,UnityEngine.UIElements.DynamicHeightVirtualizationController`1/ContentHeightCacheInfo<T>> m_ContentHeightCache
    // Size: 0x8
    // Offset: 0x0
    ::System::Collections::Generic::Dictionary_2<int, typename ::UnityEngine::UIElements::DynamicHeightVirtualizationController_1<T>::ContentHeightCacheInfo>* m_ContentHeightCache;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<int, typename ::UnityEngine::UIElements::DynamicHeightVirtualizationController_1<T>::ContentHeightCacheInfo>*) == 0x8);
    // private readonly System.Collections.Generic.HashSet`1<System.Int32> m_WaitingCache
    // Size: 0x8
    // Offset: 0x0
    ::System::Collections::Generic::HashSet_1<int>* m_WaitingCache;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::HashSet_1<int>*) == 0x8);
    // private System.Int32 m_ForcedFirstVisibleItem
    // Size: 0x4
    // Offset: 0x0
    int m_ForcedFirstVisibleItem;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_ForcedLastVisibleItem
    // Size: 0x4
    // Offset: 0x0
    int m_ForcedLastVisibleItem;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean m_StickToBottom
    // Size: 0x1
    // Offset: 0x0
    bool m_StickToBottom;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private UnityEngine.UIElements.DynamicHeightVirtualizationController`1/VirtualizationChange<T> m_LastChange
    // Size: 0xFFFFFFFF
    // Offset: 0x0
    typename ::UnityEngine::UIElements::DynamicHeightVirtualizationController_1<T>::VirtualizationChange m_LastChange;
    // private UnityEngine.UIElements.DynamicHeightVirtualizationController`1/ScrollDirection<T> m_ScrollDirection
    // Size: 0xFFFFFFFF
    // Offset: 0x0
    typename ::UnityEngine::UIElements::DynamicHeightVirtualizationController_1<T>::ScrollDirection m_ScrollDirection;
    // private UnityEngine.Vector2 m_DelayedScrollOffset
    // Size: 0x8
    // Offset: 0x0
    ::UnityEngine::Vector2 m_DelayedScrollOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private System.Single m_AccumulatedHeight
    // Size: 0x4
    // Offset: 0x0
    float m_AccumulatedHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_MinimumItemHeight
    // Size: 0x4
    // Offset: 0x0
    float m_MinimumItemHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Action m_FillCallback
    // Size: 0x8
    // Offset: 0x0
    ::System::Action* m_FillCallback;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private System.Action m_ScrollCallback
    // Size: 0x8
    // Offset: 0x0
    ::System::Action* m_ScrollCallback;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private System.Action m_ScrollResetCallback
    // Size: 0x8
    // Offset: 0x0
    ::System::Action* m_ScrollResetCallback;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private System.Action`1<UnityEngine.UIElements.ReusableCollectionItem> m_GeometryChangedCallback
    // Size: 0x8
    // Offset: 0x0
    ::System::Action_1<::UnityEngine::UIElements::ReusableCollectionItem*>* m_GeometryChangedCallback;
    // Field size check
    static_assert(sizeof(::System::Action_1<::UnityEngine::UIElements::ReusableCollectionItem*>*) == 0x8);
    // private UnityEngine.UIElements.IVisualElementScheduledItem m_ScheduledItem
    // Size: 0x8
    // Offset: 0x0
    ::UnityEngine::UIElements::IVisualElementScheduledItem* m_ScheduledItem;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::IVisualElementScheduledItem*) == 0x8);
    // private UnityEngine.UIElements.IVisualElementScheduledItem m_ScrollScheduledItem
    // Size: 0x8
    // Offset: 0x0
    ::UnityEngine::UIElements::IVisualElementScheduledItem* m_ScrollScheduledItem;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::IVisualElementScheduledItem*) == 0x8);
    // private UnityEngine.UIElements.IVisualElementScheduledItem m_ScrollResetScheduledItem
    // Size: 0x8
    // Offset: 0x0
    ::UnityEngine::UIElements::IVisualElementScheduledItem* m_ScrollResetScheduledItem;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::IVisualElementScheduledItem*) == 0x8);
    // private System.Predicate`1<System.Int32> m_IndexOutOfBoundsPredicate
    // Size: 0x8
    // Offset: 0x0
    ::System::Predicate_1<int>* m_IndexOutOfBoundsPredicate;
    // Field size check
    static_assert(sizeof(::System::Predicate_1<int>*) == 0x8);
    public:
    // Autogenerated instance field getter
    // Get instance field: private System.Int32 m_HighestCachedIndex
    [[deprecated("Use field access instead!")]] int& dyn_m_HighestCachedIndex() {
      static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::UIElements::DynamicHeightVirtualizationController_1::dyn_m_HighestCachedIndex");
      auto ___internal__instance = this;
      static auto ___internal__field__offset = THROW_UNLESS(il2cpp_utils::FindField(___internal__instance, "m_HighestCachedIndex"))->offset;
      return *reinterpret_cast<int*>(reinterpret_cast<char*>(this) + ___internal__field__offset);
    }
    // Autogenerated instance field getter
    // Get instance field: private readonly System.Collections.Generic.Dictionary`2<System.Int32,System.Single> m_ItemHeightCache
