// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: Focusable
  class Focusable;
  // Forward declaring type: IFocusRing
  class IFocusRing;
  // Forward declaring type: TextElement
  class TextElement;
  // Forward declaring type: VisualElement
  class VisualElement;
  // Forward declaring type: FocusChangeDirection
  class FocusChangeDirection;
  // Forward declaring type: DispatchMode
  struct DispatchMode;
  // Forward declaring type: EventBase
  class EventBase;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: FocusController
  class FocusController;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::UIElements::FocusController);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UIElements::FocusController*, "UnityEngine.UIElements", "FocusController");
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Size: 0x40
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.UIElements.FocusController
  // [TokenAttribute] Offset: FFFFFFFF
  class FocusController : public ::Il2CppObject {
    public:
    // Nested type: ::UnityEngine::UIElements::FocusController::FocusedElement
    struct FocusedElement;
    // Size: 0x10
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.UIElements.FocusController/FocusedElement
    // [TokenAttribute] Offset: FFFFFFFF
    struct FocusedElement/*, public ::System::ValueType*/ {
      public:
      public:
      // public UnityEngine.UIElements.VisualElement m_SubTreeRoot
      // Size: 0x8
      // Offset: 0x0
      ::UnityEngine::UIElements::VisualElement* m_SubTreeRoot;
      // Field size check
      static_assert(sizeof(::UnityEngine::UIElements::VisualElement*) == 0x8);
      // public UnityEngine.UIElements.Focusable m_FocusedElement
      // Size: 0x8
      // Offset: 0x8
      ::UnityEngine::UIElements::Focusable* m_FocusedElement;
      // Field size check
      static_assert(sizeof(::UnityEngine::UIElements::Focusable*) == 0x8);
      public:
      // Creating value type constructor for type: FocusedElement
      constexpr FocusedElement(::UnityEngine::UIElements::VisualElement* m_SubTreeRoot_ = {}, ::UnityEngine::UIElements::Focusable* m_FocusedElement_ = {}) noexcept : m_SubTreeRoot{m_SubTreeRoot_}, m_FocusedElement{m_FocusedElement_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public UnityEngine.UIElements.VisualElement m_SubTreeRoot
      [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::VisualElement*& dyn_m_SubTreeRoot();
      // Get instance field reference: public UnityEngine.UIElements.Focusable m_FocusedElement
      [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::Focusable*& dyn_m_FocusedElement();
    }; // UnityEngine.UIElements.FocusController/FocusedElement
    #pragma pack(pop)
    static check_size<sizeof(FocusController::FocusedElement), 8 + sizeof(::UnityEngine::UIElements::Focusable*)> __UnityEngine_UIElements_FocusController_FocusedElementSizeCheck;
    static_assert(sizeof(FocusController::FocusedElement) == 0x10);
    public:
    // private readonly UnityEngine.UIElements.IFocusRing <focusRing>k__BackingField
    // Size: 0x8
    // Offset: 0x10
    ::UnityEngine::UIElements::IFocusRing* focusRing;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::IFocusRing*) == 0x8);
    // private UnityEngine.UIElements.TextElement m_SelectedTextElement
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::UIElements::TextElement* m_SelectedTextElement;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::TextElement*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.UIElements.FocusController/FocusedElement> m_FocusedElements
    // Size: 0x8
    // Offset: 0x20
    ::System::Collections::Generic::List_1<::UnityEngine::UIElements::FocusController::FocusedElement>* m_FocusedElements;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::UIElements::FocusController::FocusedElement>*) == 0x8);
    // private UnityEngine.UIElements.Focusable m_LastFocusedElement
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::UIElements::Focusable* m_LastFocusedElement;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::Focusable*) == 0x8);
    // UnityEngine.UIElements.Focusable m_LastPendingFocusedElement
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::UIElements::Focusable* m_LastPendingFocusedElement;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::Focusable*) == 0x8);
    // private System.Int32 m_PendingFocusCount
    // Size: 0x4
    // Offset: 0x38
    int m_PendingFocusCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 <imguiKeyboardControl>k__BackingField
    // Size: 0x4
    // Offset: 0x3C
    int imguiKeyboardControl;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Get instance field reference: private readonly UnityEngine.UIElements.IFocusRing <focusRing>k__BackingField
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::IFocusRing*& dyn_$focusRing$k__BackingField();
    // Get instance field reference: private UnityEngine.UIElements.TextElement m_SelectedTextElement
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::TextElement*& dyn_m_SelectedTextElement();
    // Get instance field reference: private System.Collections.Generic.List`1<UnityEngine.UIElements.FocusController/FocusedElement> m_FocusedElements
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::UnityEngine::UIElements::FocusController::FocusedElement>*& dyn_m_FocusedElements();
