// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.UIElements.IGenericMenu
#include "UnityEngine/UIElements/IGenericMenu.hpp"
// Including type: UnityEngine.Rect
#include "UnityEngine/Rect.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: VisualElement
  class VisualElement;
  // Forward declaring type: ScrollView
  class ScrollView;
  // Forward declaring type: KeyboardNavigationManipulator
  class KeyboardNavigationManipulator;
  // Forward declaring type: AttachToPanelEvent
  class AttachToPanelEvent;
  // Forward declaring type: DetachFromPanelEvent
  class DetachFromPanelEvent;
  // Forward declaring type: KeyboardNavigationOperation
  struct KeyboardNavigationOperation;
  // Forward declaring type: EventBase
  class EventBase;
  // Forward declaring type: PointerDownEvent
  class PointerDownEvent;
  // Forward declaring type: PointerMoveEvent
  class PointerMoveEvent;
  // Forward declaring type: PointerUpEvent
  class PointerUpEvent;
  // Forward declaring type: FocusOutEvent
  class FocusOutEvent;
  // Forward declaring type: GeometryChangedEvent
  class GeometryChangedEvent;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Completed forward declares
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: GenericDropdownMenu
  class GenericDropdownMenu;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::UIElements::GenericDropdownMenu);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UIElements::GenericDropdownMenu*, "UnityEngine.UIElements", "GenericDropdownMenu");
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Size: 0x64
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.UIElements.GenericDropdownMenu
  // [TokenAttribute] Offset: FFFFFFFF
  class GenericDropdownMenu : public ::Il2CppObject/*, public ::UnityEngine::UIElements::IGenericMenu*/ {
    public:
    // Nested type: ::UnityEngine::UIElements::GenericDropdownMenu::MenuItem
    class MenuItem;
    // Nested type: ::UnityEngine::UIElements::GenericDropdownMenu::$$c__DisplayClass39_0
    struct $$c__DisplayClass39_0;
    public:
    // private System.Collections.Generic.List`1<UnityEngine.UIElements.GenericDropdownMenu/MenuItem> m_Items
    // Size: 0x8
    // Offset: 0x10
    ::System::Collections::Generic::List_1<::UnityEngine::UIElements::GenericDropdownMenu::MenuItem*>* m_Items;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::UIElements::GenericDropdownMenu::MenuItem*>*) == 0x8);
    // private UnityEngine.UIElements.VisualElement m_MenuContainer
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::UIElements::VisualElement* m_MenuContainer;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::VisualElement*) == 0x8);
    // private UnityEngine.UIElements.VisualElement m_OuterContainer
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::UIElements::VisualElement* m_OuterContainer;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::VisualElement*) == 0x8);
    // private UnityEngine.UIElements.ScrollView m_ScrollView
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::UIElements::ScrollView* m_ScrollView;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::ScrollView*) == 0x8);
    // private UnityEngine.UIElements.VisualElement m_PanelRootVisualContainer
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::UIElements::VisualElement* m_PanelRootVisualContainer;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::VisualElement*) == 0x8);
    // private UnityEngine.UIElements.VisualElement m_TargetElement
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::UIElements::VisualElement* m_TargetElement;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::VisualElement*) == 0x8);
    // private UnityEngine.Rect m_DesiredRect
    // Size: 0x10
    // Offset: 0x40
    ::UnityEngine::Rect m_DesiredRect;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rect) == 0x10);
    // private UnityEngine.UIElements.KeyboardNavigationManipulator m_NavigationManipulator
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::UIElements::KeyboardNavigationManipulator* m_NavigationManipulator;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::KeyboardNavigationManipulator*) == 0x8);
    // private System.Boolean <isSingleSelectionDropdown>k__BackingField
    // Size: 0x1
    // Offset: 0x58
    bool isSingleSelectionDropdown;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <closeOnParentResize>k__BackingField
    // Size: 0x1
    // Offset: 0x59
    bool closeOnParentResize;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: closeOnParentResize and: m_MousePosition
    char __padding9[0x2] = {};
    // private UnityEngine.Vector2 m_MousePosition
    // Size: 0x8
    // Offset: 0x5C
    ::UnityEngine::Vector2 m_MousePosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    public:
    // Creating interface conversion operator: operator ::UnityEngine::UIElements::IGenericMenu
    operator ::UnityEngine::UIElements::IGenericMenu() noexcept {
      return *reinterpret_cast<::UnityEngine::UIElements::IGenericMenu*>(this);
    }
    // Get static field: static public readonly System.String ussClassName
    static ::StringW _get_ussClassName();
    // Set static field: static public readonly System.String ussClassName
    static void _set_ussClassName(::StringW value);
    // Get static field: static public readonly System.String itemUssClassName
    static ::StringW _get_itemUssClassName();
    // Set static field: static public readonly System.String itemUssClassName
    static void _set_itemUssClassName(::StringW value);
    // Get static field: static public readonly System.String labelUssClassName
