// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.UIElements.VisualElement
#include "UnityEngine/UIElements/VisualElement.hpp"
// Including type: System.IDisposable
#include "System/IDisposable.hpp"
// Including type: UnityEngine.GUILayoutUtility
#include "UnityEngine/GUILayoutUtility.hpp"
// Including type: UnityEngine.UIElements.ContextType
#include "UnityEngine/UIElements/ContextType.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: FocusChangeDirection
  class FocusChangeDirection;
  // Forward declaring type: MeshGenerationContext
  class MeshGenerationContext;
  // Forward declaring type: EventBase
  class EventBase;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: ObjectGUIState
  class ObjectGUIState;
  // Forward declaring type: Event
  class Event;
  // Skipping declaration: Vector2 because it is already included!
}
// Completed forward declares
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: IMGUIContainer
  class IMGUIContainer;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::UIElements::IMGUIContainer);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UIElements::IMGUIContainer*, "UnityEngine.UIElements", "IMGUIContainer");
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // WARNING Size may be invalid!
  // Autogenerated type: UnityEngine.UIElements.IMGUIContainer
  // [TokenAttribute] Offset: FFFFFFFF
  class IMGUIContainer : public ::UnityEngine::UIElements::VisualElement/*, public ::System::IDisposable*/ {
    public:
    // Nested type: ::UnityEngine::UIElements::IMGUIContainer::UxmlFactory
    class UxmlFactory;
    // Nested type: ::UnityEngine::UIElements::IMGUIContainer::UxmlTraits
    class UxmlTraits;
    // Nested type: ::UnityEngine::UIElements::IMGUIContainer::GUIGlobals
    struct GUIGlobals;
    // Size: 0x78
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.UIElements.IMGUIContainer/GUIGlobals
    // [TokenAttribute] Offset: FFFFFFFF
    struct GUIGlobals/*, public ::System::ValueType*/ {
      public:
      public:
      // public UnityEngine.Matrix4x4 matrix
      // Size: 0x40
      // Offset: 0x0
      ::UnityEngine::Matrix4x4 matrix;
      // Field size check
      static_assert(sizeof(::UnityEngine::Matrix4x4) == 0x40);
      // public UnityEngine.Color color
      // Size: 0x10
      // Offset: 0x40
      ::UnityEngine::Color color;
      // Field size check
      static_assert(sizeof(::UnityEngine::Color) == 0x10);
      // public UnityEngine.Color contentColor
      // Size: 0x10
      // Offset: 0x50
      ::UnityEngine::Color contentColor;
      // Field size check
      static_assert(sizeof(::UnityEngine::Color) == 0x10);
      // public UnityEngine.Color backgroundColor
      // Size: 0x10
      // Offset: 0x60
      ::UnityEngine::Color backgroundColor;
      // Field size check
      static_assert(sizeof(::UnityEngine::Color) == 0x10);
      // public System.Boolean enabled
      // Size: 0x1
      // Offset: 0x70
      bool enabled;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // public System.Boolean changed
      // Size: 0x1
      // Offset: 0x71
      bool changed;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // Padding between fields: changed and: displayIndex
      char __padding5[0x2] = {};
      // public System.Int32 displayIndex
      // Size: 0x4
      // Offset: 0x74
      int displayIndex;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: GUIGlobals
      constexpr GUIGlobals(::UnityEngine::Matrix4x4 matrix_ = {}, ::UnityEngine::Color color_ = {}, ::UnityEngine::Color contentColor_ = {}, ::UnityEngine::Color backgroundColor_ = {}, bool enabled_ = {}, bool changed_ = {}, int displayIndex_ = {}) noexcept : matrix{matrix_}, color{color_}, contentColor{contentColor_}, backgroundColor{backgroundColor_}, enabled{enabled_}, changed{changed_}, displayIndex{displayIndex_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public UnityEngine.Matrix4x4 matrix
      [[deprecated("Use field access instead!")]] ::UnityEngine::Matrix4x4& dyn_matrix();
      // Get instance field reference: public UnityEngine.Color color
      [[deprecated("Use field access instead!")]] ::UnityEngine::Color& dyn_color();
      // Get instance field reference: public UnityEngine.Color contentColor
      [[deprecated("Use field access instead!")]] ::UnityEngine::Color& dyn_contentColor();
      // Get instance field reference: public UnityEngine.Color backgroundColor
      [[deprecated("Use field access instead!")]] ::UnityEngine::Color& dyn_backgroundColor();
      // Get instance field reference: public System.Boolean enabled
      [[deprecated("Use field access instead!")]] bool& dyn_enabled();
      // Get instance field reference: public System.Boolean changed
      [[deprecated("Use field access instead!")]] bool& dyn_changed();
      // Get instance field reference: public System.Int32 displayIndex
      [[deprecated("Use field access instead!")]] int& dyn_displayIndex();
    }; // UnityEngine.UIElements.IMGUIContainer/GUIGlobals
    #pragma pack(pop)
    static check_size<sizeof(IMGUIContainer::GUIGlobals), 116 + sizeof(int)> __UnityEngine_UIElements_IMGUIContainer_GUIGlobalsSizeCheck;
    static_assert(sizeof(IMGUIContainer::GUIGlobals) == 0x78);
    public:
    // private System.Action m_OnGUIHandler
    // Size: 0x8
    // Offset: 0x3C0
    ::System::Action* m_OnGUIHandler;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private UnityEngine.ObjectGUIState m_ObjectGUIState
    // Size: 0x8
    // Offset: 0x3C8
    ::UnityEngine::ObjectGUIState* m_ObjectGUIState;
    // Field size check
    static_assert(sizeof(::UnityEngine::ObjectGUIState*) == 0x8);
    // System.Boolean useOwnerObjectGUIState
    // Size: 0x1
    // Offset: 0x3D0
    bool useOwnerObjectGUIState;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private UnityEngine.Rect <lastWorldClip>k__BackingField
    // Size: 0x10
    // Offset: 0x3D4
    ::UnityEngine::Rect lastWorldClip;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rect) == 0x10);
    // private System.Boolean m_CullingEnabled
    // Size: 0x1
    // Offset: 0x3E4
    bool m_CullingEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_IsFocusDelegated
    // Size: 0x1
    // Offset: 0x3E5
    bool m_IsFocusDelegated;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_RefreshCachedLayout
    // Size: 0x1
    // Offset: 0x3E6
    bool m_RefreshCachedLayout;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private UnityEngine.GUILayoutUtility/LayoutCache m_Cache
    // Size: 0x8
    // Offset: 0x3E8
    ::UnityEngine::GUILayoutUtility::LayoutCache* m_Cache;
    // Field size check
    static_assert(sizeof(::UnityEngine::GUILayoutUtility::LayoutCache*) == 0x8);
    // private UnityEngine.Rect m_CachedClippingRect
    // Size: 0x10
    // Offset: 0x3F0
    ::UnityEngine::Rect m_CachedClippingRect;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rect) == 0x10);
    // private UnityEngine.Matrix4x4 m_CachedTransform
    // Size: 0x40
    // Offset: 0x400
    ::UnityEngine::Matrix4x4 m_CachedTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Matrix4x4) == 0x40);
    // private UnityEngine.UIElements.ContextType <contextType>k__BackingField
    // Size: 0x4
    // Offset: 0x440
    ::UnityEngine::UIElements::ContextType contextType;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::ContextType) == 0x4);
    // private System.Boolean lostFocus
    // Size: 0x1
    // Offset: 0x444
    bool lostFocus;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean receivedFocus
    // Size: 0x1
    // Offset: 0x445
    bool receivedFocus;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private UnityEngine.UIElements.FocusChangeDirection focusChangeDirection
    // Size: 0x8
    // Offset: 0x448
    ::UnityEngine::UIElements::FocusChangeDirection* focusChangeDirection;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::FocusChangeDirection*) == 0x8);
    // private System.Boolean hasFocusableControls
    // Size: 0x1
    // Offset: 0x450
    bool hasFocusableControls;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Int32 newKeyboardFocusControlID
    // Size: 0x4
    // Offset: 0x454
    int newKeyboardFocusControlID;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean <focusOnlyIfHasFocusableControls>k__BackingField
    // Size: 0x1
    // Offset: 0x458
    bool focusOnlyIfHasFocusableControls;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private UnityEngine.UIElements.IMGUIContainer/GUIGlobals m_GUIGlobals
    // Size: 0x78
    // Offset: 0x45C
    ::UnityEngine::UIElements::IMGUIContainer::GUIGlobals m_GUIGlobals;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::IMGUIContainer::GUIGlobals) == 0x78);
    public:
    // Creating interface conversion operator: operator ::System::IDisposable
    operator ::System::IDisposable() noexcept {
      return *reinterpret_cast<::System::IDisposable*>(this);
    }
    // Get static field: static public readonly System.String ussClassName
    static ::StringW _get_ussClassName();
    // Set static field: static public readonly System.String ussClassName
    static void _set_ussClassName(::StringW value);
    // Get static field: static readonly System.String ussFoldoutChildDepthClassName
    static ::StringW _get_ussFoldoutChildDepthClassName();
    // Set static field: static readonly System.String ussFoldoutChildDepthClassName
    static void _set_ussFoldoutChildDepthClassName(::StringW value);
