// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.UIElements.StyleValueCollection
#include "UnityEngine/UIElements/StyleValueCollection.hpp"
// Including type: UnityEngine.UIElements.IStyle
#include "UnityEngine/UIElements/IStyle.hpp"
// Including type: UnityEngine.UIElements.StyleSheets.StyleValueManaged
#include "UnityEngine/UIElements/StyleSheets/StyleValueManaged.hpp"
// Including type: UnityEngine.UIElements.StyleCursor
#include "UnityEngine/UIElements/StyleCursor.hpp"
// Including type: UnityEngine.UIElements.StyleTextShadow
#include "UnityEngine/UIElements/StyleTextShadow.hpp"
// Including type: UnityEngine.UIElements.StyleTransformOrigin
#include "UnityEngine/UIElements/StyleTransformOrigin.hpp"
// Including type: UnityEngine.UIElements.StyleTranslate
#include "UnityEngine/UIElements/StyleTranslate.hpp"
// Including type: UnityEngine.UIElements.StyleRotate
#include "UnityEngine/UIElements/StyleRotate.hpp"
// Including type: UnityEngine.UIElements.StyleScale
#include "UnityEngine/UIElements/StyleScale.hpp"
// Including type: UnityEngine.UIElements.StyleBackgroundSize
#include "UnityEngine/UIElements/StyleBackgroundSize.hpp"
// Including type: UnityEngine.UIElements.StyleEnum`1
#include "UnityEngine/UIElements/StyleEnum_1.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UIElements::StyleSheets
namespace UnityEngine::UIElements::StyleSheets {
  // Forward declaring type: StylePropertyReader
  class StylePropertyReader;
  // Skipping declaration: StyleValue because it is already included!
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine::UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: VisualElement
  class VisualElement;
  // Forward declaring type: StyleColor
  struct StyleColor;
  // Forward declaring type: StyleLength
  struct StyleLength;
  // Forward declaring type: StyleFloat
  struct StyleFloat;
  // Forward declaring type: StyleFont
  struct StyleFont;
  // Forward declaring type: StyleFontDefinition
  struct StyleFontDefinition;
  // Forward declaring type: StyleSheet
  class StyleSheet;
  // Forward declaring type: StyleRule
  class StyleRule;
  // Forward declaring type: ComputedStyle
  struct ComputedStyle;
}
// Forward declaring namespace: System
namespace System {
  // Skipping declaration: IConvertible because it is already included!
}
// Completed forward declares
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: InlineStyleAccess
  class InlineStyleAccess;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::UIElements::InlineStyleAccess);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UIElements::InlineStyleAccess*, "UnityEngine.UIElements", "InlineStyleAccess");
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Size: 0x120
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.UIElements.InlineStyleAccess
  // [TokenAttribute] Offset: FFFFFFFF
  class InlineStyleAccess : public ::UnityEngine::UIElements::StyleValueCollection/*, public ::UnityEngine::UIElements::IStyle*/ {
    public:
    // Nested type: ::UnityEngine::UIElements::InlineStyleAccess::InlineRule
    struct InlineRule;
    // Size: 0x18
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.UIElements.InlineStyleAccess/InlineRule
    // [TokenAttribute] Offset: FFFFFFFF
    struct InlineRule/*, public ::System::ValueType*/ {
      public:
      public:
      // public UnityEngine.UIElements.StyleSheet sheet
      // Size: 0x8
      // Offset: 0x0
      ::UnityEngine::UIElements::StyleSheet* sheet;
      // Field size check
      static_assert(sizeof(::UnityEngine::UIElements::StyleSheet*) == 0x8);
      // public UnityEngine.UIElements.StyleRule rule
      // Size: 0x8
      // Offset: 0x8
      ::UnityEngine::UIElements::StyleRule* rule;
      // Field size check
      static_assert(sizeof(::UnityEngine::UIElements::StyleRule*) == 0x8);
      // public UnityEngine.UIElements.StyleSheets.StylePropertyId[] propertyIds
      // Size: 0x8
      // Offset: 0x10
      ::ArrayW<::UnityEngine::UIElements::StyleSheets::StylePropertyId> propertyIds;
      // Field size check
      static_assert(sizeof(::ArrayW<::UnityEngine::UIElements::StyleSheets::StylePropertyId>) == 0x8);
      public:
      // Creating value type constructor for type: InlineRule
      constexpr InlineRule(::UnityEngine::UIElements::StyleSheet* sheet_ = {}, ::UnityEngine::UIElements::StyleRule* rule_ = {}, ::ArrayW<::UnityEngine::UIElements::StyleSheets::StylePropertyId> propertyIds_ = ::ArrayW<::UnityEngine::UIElements::StyleSheets::StylePropertyId>(static_cast<void*>(nullptr))) noexcept : sheet{sheet_}, rule{rule_}, propertyIds{propertyIds_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public UnityEngine.UIElements.StyleSheet sheet
      [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::StyleSheet*& dyn_sheet();
      // Get instance field reference: public UnityEngine.UIElements.StyleRule rule
      [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::StyleRule*& dyn_rule();
      // Get instance field reference: public UnityEngine.UIElements.StyleSheets.StylePropertyId[] propertyIds
      [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::UIElements::StyleSheets::StylePropertyId>& dyn_propertyIds();
    }; // UnityEngine.UIElements.InlineStyleAccess/InlineRule
    #pragma pack(pop)
    static check_size<sizeof(InlineStyleAccess::InlineRule), 16 + sizeof(::ArrayW<::UnityEngine::UIElements::StyleSheets::StylePropertyId>)> __UnityEngine_UIElements_InlineStyleAccess_InlineRuleSizeCheck;
    static_assert(sizeof(InlineStyleAccess::InlineRule) == 0x18);
    public:
    // private System.Collections.Generic.List`1<UnityEngine.UIElements.StyleSheets.StyleValueManaged> m_ValuesManaged
    // Size: 0x8
    // Offset: 0x18
    ::System::Collections::Generic::List_1<::UnityEngine::UIElements::StyleSheets::StyleValueManaged>* m_ValuesManaged;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::UIElements::StyleSheets::StyleValueManaged>*) == 0x8);
    // private UnityEngine.UIElements.VisualElement <ve>k__BackingField
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::UIElements::VisualElement* ve;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::VisualElement*) == 0x8);
    // private System.Boolean m_HasInlineCursor
    // Size: 0x1
    // Offset: 0x28
    bool m_HasInlineCursor;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_HasInlineCursor and: m_InlineCursor
    char __padding2[0x7] = {};
    // private UnityEngine.UIElements.StyleCursor m_InlineCursor
    // Size: 0x1C
    // Offset: 0x30
    ::UnityEngine::UIElements::StyleCursor m_InlineCursor;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::StyleCursor) == 0x1C);
    // Padding between fields: m_InlineCursor and: m_HasInlineTextShadow
    char __padding3[0x4] = {};
    // private System.Boolean m_HasInlineTextShadow
    // Size: 0x1
    // Offset: 0x50
    bool m_HasInlineTextShadow;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_HasInlineTextShadow and: m_InlineTextShadow
    char __padding4[0x3] = {};
    // private UnityEngine.UIElements.StyleTextShadow m_InlineTextShadow
    // Size: 0x20
    // Offset: 0x54
    ::UnityEngine::UIElements::StyleTextShadow m_InlineTextShadow;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::StyleTextShadow) == 0x20);
    // private System.Boolean m_HasInlineTransformOrigin
    // Size: 0x1
    // Offset: 0x74
    bool m_HasInlineTransformOrigin;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_HasInlineTransformOrigin and: m_InlineTransformOrigin
    char __padding6[0x3] = {};
    // private UnityEngine.UIElements.StyleTransformOrigin m_InlineTransformOrigin
    // Size: 0x18
    // Offset: 0x78
    ::UnityEngine::UIElements::StyleTransformOrigin m_InlineTransformOrigin;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::StyleTransformOrigin) == 0x18);
    // private System.Boolean m_HasInlineTranslate
    // Size: 0x1
    // Offset: 0x90
    bool m_HasInlineTranslate;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_HasInlineTranslate and: m_InlineTranslateOperation
    char __padding8[0x3] = {};
    // private UnityEngine.UIElements.StyleTranslate m_InlineTranslateOperation
    // Size: 0x1C
    // Offset: 0x94
    ::UnityEngine::UIElements::StyleTranslate m_InlineTranslateOperation;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::StyleTranslate) == 0x1C);
    // private System.Boolean m_HasInlineRotate
    // Size: 0x1
    // Offset: 0xB0
    bool m_HasInlineRotate;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_HasInlineRotate and: m_InlineRotateOperation
    char __padding10[0x3] = {};
    // private UnityEngine.UIElements.StyleRotate m_InlineRotateOperation
    // Size: 0x1C
    // Offset: 0xB4
    ::UnityEngine::UIElements::StyleRotate m_InlineRotateOperation;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::StyleRotate) == 0x1C);
    // private System.Boolean m_HasInlineScale
    // Size: 0x1
    // Offset: 0xD0
    bool m_HasInlineScale;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_HasInlineScale and: m_InlineScale
    char __padding12[0x3] = {};
    // private UnityEngine.UIElements.StyleScale m_InlineScale
    // Size: 0x14
    // Offset: 0xD4
    ::UnityEngine::UIElements::StyleScale m_InlineScale;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::StyleScale) == 0x14);
    // private System.Boolean m_HasInlineBackgroundSize
    // Size: 0x1
    // Offset: 0xE8
    bool m_HasInlineBackgroundSize;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_HasInlineBackgroundSize and: m_InlineBackgroundSize
    char __padding14[0x3] = {};
    // public UnityEngine.UIElements.StyleBackgroundSize m_InlineBackgroundSize
    // Size: 0x18
    // Offset: 0xEC
    ::UnityEngine::UIElements::StyleBackgroundSize m_InlineBackgroundSize;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::StyleBackgroundSize) == 0x18);
    // Padding between fields: m_InlineBackgroundSize and: m_InlineRule
    char __padding15[0x4] = {};
    // private UnityEngine.UIElements.InlineStyleAccess/InlineRule m_InlineRule
    // Size: 0x18
    // Offset: 0x108
    ::UnityEngine::UIElements::InlineStyleAccess::InlineRule m_InlineRule;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::InlineStyleAccess::InlineRule) == 0x18);
    public:
    // Creating interface conversion operator: operator ::UnityEngine::UIElements::IStyle
    operator ::UnityEngine::UIElements::IStyle() noexcept {
      return *reinterpret_cast<::UnityEngine::UIElements::IStyle*>(this);
    }
    // Deleting conversion operator: operator ::System::Collections::Generic::List_1<::UnityEngine::UIElements::StyleSheets::StyleValue>*
    constexpr operator ::System::Collections::Generic::List_1<::UnityEngine::UIElements::StyleSheets::StyleValue>*() const noexcept = delete;
    // Get static field: static private UnityEngine.UIElements.StyleSheets.StylePropertyReader s_StylePropertyReader
    static ::UnityEngine::UIElements::StyleSheets::StylePropertyReader* _get_s_StylePropertyReader();
