// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.UIElements.DragEventsProcessor
#include "UnityEngine/UIElements/DragEventsProcessor.hpp"
// Including type: UnityEngine.UIElements.DragAndDropPosition
#include "UnityEngine/UIElements/DragAndDropPosition.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: VisualElement
  class VisualElement;
  // Forward declaring type: ICollectionDragAndDropController
  class ICollectionDragAndDropController;
  // Forward declaring type: BaseVerticalCollectionView
  class BaseVerticalCollectionView;
  // Forward declaring type: ScrollView
  class ScrollView;
  // Forward declaring type: DragVisualMode
  struct DragVisualMode;
  // Skipping declaration: DragPosition because it is already included!
  // Forward declaring type: DragAndDropArgs
  struct DragAndDropArgs;
  // Forward declaring type: ReusableCollectionItem
  class ReusableCollectionItem;
  // Forward declaring type: GeometryChangedEvent
  class GeometryChangedEvent;
  // Forward declaring type: StartDragArgs
  struct StartDragArgs;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Skipping declaration: Vector3 because it is already included!
  // Forward declaring type: Vector2
  struct Vector2;
}
// Completed forward declares
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: ListViewDragger
  class ListViewDragger;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::UIElements::ListViewDragger);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UIElements::ListViewDragger*, "UnityEngine.UIElements", "ListViewDragger");
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Size: 0x78
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.UIElements.ListViewDragger
  // [TokenAttribute] Offset: FFFFFFFF
  class ListViewDragger : public ::UnityEngine::UIElements::DragEventsProcessor {
    public:
    // Nested type: ::UnityEngine::UIElements::ListViewDragger::DragPosition
    struct DragPosition;
    // Size: 0x1C
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.UIElements.ListViewDragger/DragPosition
    // [TokenAttribute] Offset: FFFFFFFF
    struct DragPosition/*, public ::System::ValueType, public ::System::IEquatable_1<::UnityEngine::UIElements::ListViewDragger::DragPosition>*/ {
      public:
      public:
      // public System.Int32 insertAtIndex
      // Size: 0x4
      // Offset: 0x0
      int insertAtIndex;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Int32 parentId
      // Size: 0x4
      // Offset: 0x4
      int parentId;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Int32 childIndex
      // Size: 0x4
      // Offset: 0x8
      int childIndex;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Padding between fields: childIndex and: recycledItem
      char __padding2[0x4] = {};
      // public UnityEngine.UIElements.ReusableCollectionItem recycledItem
      // Size: 0x8
      // Offset: 0x10
      ::UnityEngine::UIElements::ReusableCollectionItem* recycledItem;
      // Field size check
      static_assert(sizeof(::UnityEngine::UIElements::ReusableCollectionItem*) == 0x8);
      // public UnityEngine.UIElements.DragAndDropPosition dropPosition
      // Size: 0x4
      // Offset: 0x18
      ::UnityEngine::UIElements::DragAndDropPosition dropPosition;
      // Field size check
      static_assert(sizeof(::UnityEngine::UIElements::DragAndDropPosition) == 0x4);
      public:
      // Creating value type constructor for type: DragPosition
      constexpr DragPosition(int insertAtIndex_ = {}, int parentId_ = {}, int childIndex_ = {}, ::UnityEngine::UIElements::ReusableCollectionItem* recycledItem_ = {}, ::UnityEngine::UIElements::DragAndDropPosition dropPosition_ = {}) noexcept : insertAtIndex{insertAtIndex_}, parentId{parentId_}, childIndex{childIndex_}, recycledItem{recycledItem_}, dropPosition{dropPosition_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Creating interface conversion operator: operator ::System::IEquatable_1<::UnityEngine::UIElements::ListViewDragger::DragPosition>
      operator ::System::IEquatable_1<::UnityEngine::UIElements::ListViewDragger::DragPosition>() noexcept {
        return *reinterpret_cast<::System::IEquatable_1<::UnityEngine::UIElements::ListViewDragger::DragPosition>*>(this);
      }
      // Get instance field reference: public System.Int32 insertAtIndex
      [[deprecated("Use field access instead!")]] int& dyn_insertAtIndex();
      // Get instance field reference: public System.Int32 parentId
      [[deprecated("Use field access instead!")]] int& dyn_parentId();
      // Get instance field reference: public System.Int32 childIndex
      [[deprecated("Use field access instead!")]] int& dyn_childIndex();
      // Get instance field reference: public UnityEngine.UIElements.ReusableCollectionItem recycledItem
      [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::ReusableCollectionItem*& dyn_recycledItem();
      // Get instance field reference: public UnityEngine.UIElements.DragAndDropPosition dropPosition
      [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::DragAndDropPosition& dyn_dropPosition();
      // public System.Boolean Equals(UnityEngine.UIElements.ListViewDragger/DragPosition other)
      // Offset: 0x563E8CC
      bool Equals(::UnityEngine::UIElements::ListViewDragger::DragPosition other);
      // public override System.Boolean Equals(System.Object obj)
      // Offset: 0x56406C4
      // Implemented from: System.ValueType
      // Base method: System.Boolean ValueType::Equals(System.Object obj)
      bool Equals(::Il2CppObject* obj);
      // public override System.Int32 GetHashCode()
      // Offset: 0x564074C
      // Implemented from: System.ValueType
      // Base method: System.Int32 ValueType::GetHashCode()
      int GetHashCode();
    }; // UnityEngine.UIElements.ListViewDragger/DragPosition
    #pragma pack(pop)
    static check_size<sizeof(ListViewDragger::DragPosition), 24 + sizeof(::UnityEngine::UIElements::DragAndDropPosition)> __UnityEngine_UIElements_ListViewDragger_DragPositionSizeCheck;
    static_assert(sizeof(ListViewDragger::DragPosition) == 0x1C);
    public:
    // private UnityEngine.UIElements.ListViewDragger/DragPosition m_LastDragPosition
    // Size: 0x1C
    // Offset: 0x30
    ::UnityEngine::UIElements::ListViewDragger::DragPosition m_LastDragPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::ListViewDragger::DragPosition) == 0x1C);
    // Padding between fields: m_LastDragPosition and: m_DragHoverBar
    char __padding0[0x4] = {};
    // private UnityEngine.UIElements.VisualElement m_DragHoverBar
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::UIElements::VisualElement* m_DragHoverBar;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::VisualElement*) == 0x8);
    // private UnityEngine.UIElements.VisualElement m_DragHoverItemMarker
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::UIElements::VisualElement* m_DragHoverItemMarker;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::VisualElement*) == 0x8);
    // private UnityEngine.UIElements.VisualElement m_DragHoverSiblingMarker
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::UIElements::VisualElement* m_DragHoverSiblingMarker;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::VisualElement*) == 0x8);
    // private System.Single m_LeftIndentation
    // Size: 0x4
    // Offset: 0x68
    float m_LeftIndentation;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_SiblingBottom
    // Size: 0x4
    // Offset: 0x6C
    float m_SiblingBottom;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.UIElements.ICollectionDragAndDropController <dragAndDropController>k__BackingField
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::UIElements::ICollectionDragAndDropController* dragAndDropController;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::ICollectionDragAndDropController*) == 0x8);
    public:
    // Get instance field reference: private UnityEngine.UIElements.ListViewDragger/DragPosition m_LastDragPosition
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::ListViewDragger::DragPosition& dyn_m_LastDragPosition();
    // Get instance field reference: private UnityEngine.UIElements.VisualElement m_DragHoverBar
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::VisualElement*& dyn_m_DragHoverBar();
    // Get instance field reference: private UnityEngine.UIElements.VisualElement m_DragHoverItemMarker
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::VisualElement*& dyn_m_DragHoverItemMarker();
