// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.UIElements.MeshGenerationContextUtils
#include "UnityEngine/UIElements/MeshGenerationContextUtils.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: UnityEngine.Rect
#include "UnityEngine/Rect.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: UnityEngine.UIElements.BackgroundPosition
#include "UnityEngine/UIElements/BackgroundPosition.hpp"
// Including type: UnityEngine.UIElements.BackgroundRepeat
#include "UnityEngine/UIElements/BackgroundRepeat.hpp"
// Including type: UnityEngine.UIElements.BackgroundSize
#include "UnityEngine/UIElements/BackgroundSize.hpp"
// Including type: UnityEngine.ScaleMode
#include "UnityEngine/ScaleMode.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
// Including type: UnityEngine.UIElements.ColorPage
#include "UnityEngine/UIElements/ColorPage.hpp"
// Including type: UnityEngine.UIElements.MeshGenerationContext/MeshFlags
#include "UnityEngine/UIElements/MeshGenerationContext_MeshFlags.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Texture
  class Texture;
  // Forward declaring type: Sprite
  class Sprite;
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: SpritePackingRotation
  struct SpritePackingRotation;
  // Skipping declaration: Vector4 because it is already included!
}
// Forward declaring namespace: UnityEngine::UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: VectorImage
  class VectorImage;
  // Forward declaring type: ContextType
  struct ContextType;
}
// Completed forward declares
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UIElements::MeshGenerationContextUtils::RectangleParams, "UnityEngine.UIElements", "MeshGenerationContextUtils/RectangleParams");
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Size: 0x10C
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: UnityEngine.UIElements.MeshGenerationContextUtils/RectangleParams
  // [TokenAttribute] Offset: FFFFFFFF
  struct MeshGenerationContextUtils::RectangleParams/*, public ::System::ValueType*/ {
    public:
    public:
    // public UnityEngine.Rect rect
    // Size: 0x10
    // Offset: 0x0
    ::UnityEngine::Rect rect;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rect) == 0x10);
    // public UnityEngine.Rect uv
    // Size: 0x10
    // Offset: 0x10
    ::UnityEngine::Rect uv;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rect) == 0x10);
    // public UnityEngine.Color color
    // Size: 0x10
    // Offset: 0x20
    ::UnityEngine::Color color;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // public UnityEngine.Rect subRect
    // Size: 0x10
    // Offset: 0x30
    ::UnityEngine::Rect subRect;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rect) == 0x10);
    // public UnityEngine.UIElements.BackgroundPosition backgroundPositionX
    // Size: 0xC
    // Offset: 0x40
    ::UnityEngine::UIElements::BackgroundPosition backgroundPositionX;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::BackgroundPosition) == 0xC);
    // public UnityEngine.UIElements.BackgroundPosition backgroundPositionY
    // Size: 0xC
    // Offset: 0x4C
    ::UnityEngine::UIElements::BackgroundPosition backgroundPositionY;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::BackgroundPosition) == 0xC);
    // public UnityEngine.UIElements.BackgroundRepeat backgroundRepeat
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::UIElements::BackgroundRepeat backgroundRepeat;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::BackgroundRepeat) == 0x8);
    // public UnityEngine.UIElements.BackgroundSize backgroundSize
    // Size: 0x14
    // Offset: 0x60
    ::UnityEngine::UIElements::BackgroundSize backgroundSize;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::BackgroundSize) == 0x14);
    // Padding between fields: backgroundSize and: texture
    char __padding7[0x4] = {};
    // public UnityEngine.Texture texture
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::Texture* texture;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture*) == 0x8);
    // public UnityEngine.Sprite sprite
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::Sprite* sprite;
    // Field size check
    static_assert(sizeof(::UnityEngine::Sprite*) == 0x8);
    // public UnityEngine.UIElements.VectorImage vectorImage
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::UIElements::VectorImage* vectorImage;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::VectorImage*) == 0x8);
    // public UnityEngine.Material material
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::Material* material;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // public UnityEngine.ScaleMode scaleMode
    // Size: 0x4
    // Offset: 0x98
    ::UnityEngine::ScaleMode scaleMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::ScaleMode) == 0x4);
    // public UnityEngine.Color playmodeTintColor
    // Size: 0x10
    // Offset: 0x9C
    ::UnityEngine::Color playmodeTintColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // public UnityEngine.Vector2 topLeftRadius
    // Size: 0x8
    // Offset: 0xAC
    ::UnityEngine::Vector2 topLeftRadius;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // public UnityEngine.Vector2 topRightRadius
    // Size: 0x8
    // Offset: 0xB4
    ::UnityEngine::Vector2 topRightRadius;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // public UnityEngine.Vector2 bottomRightRadius
    // Size: 0x8
    // Offset: 0xBC
    ::UnityEngine::Vector2 bottomRightRadius;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // public UnityEngine.Vector2 bottomLeftRadius
    // Size: 0x8
    // Offset: 0xC4
    ::UnityEngine::Vector2 bottomLeftRadius;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // public UnityEngine.Vector2 contentSize
    // Size: 0x8
    // Offset: 0xCC
    ::UnityEngine::Vector2 contentSize;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // public UnityEngine.Vector2 textureSize
    // Size: 0x8
    // Offset: 0xD4
    ::UnityEngine::Vector2 textureSize;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // public System.Int32 leftSlice
    // Size: 0x4
    // Offset: 0xDC
    int leftSlice;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 topSlice
    // Size: 0x4
    // Offset: 0xE0
    int topSlice;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 rightSlice
    // Size: 0x4
    // Offset: 0xE4
    int rightSlice;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 bottomSlice
    // Size: 0x4
    // Offset: 0xE8
    int bottomSlice;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Single sliceScale
    // Size: 0x4
    // Offset: 0xEC
    float sliceScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // UnityEngine.Rect spriteGeomRect
    // Size: 0x10
    // Offset: 0xF0
    ::UnityEngine::Rect spriteGeomRect;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rect) == 0x10);
    // UnityEngine.UIElements.ColorPage colorPage
    // Size: 0x8
    // Offset: 0x100
    ::UnityEngine::UIElements::ColorPage colorPage;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::ColorPage) == 0x8);
    // UnityEngine.UIElements.MeshGenerationContext/MeshFlags meshFlags
    // Size: 0x4
    // Offset: 0x108
    ::UnityEngine::UIElements::MeshGenerationContext::MeshFlags meshFlags;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::MeshGenerationContext::MeshFlags) == 0x4);
    public:
    // Creating value type constructor for type: RectangleParams
