// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.UIElements.MeshGenerationContextUtils
#include "UnityEngine/UIElements/MeshGenerationContextUtils.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: UnityEngine.Rect
#include "UnityEngine/Rect.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
// Including type: UnityEngine.UIElements.ColorPage
#include "UnityEngine/UIElements/ColorPage.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Material
  class Material;
}
// Completed forward declares
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UIElements::MeshGenerationContextUtils::BorderParams, "UnityEngine.UIElements", "MeshGenerationContextUtils/BorderParams");
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Size: 0xB8
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: UnityEngine.UIElements.MeshGenerationContextUtils/BorderParams
  // [TokenAttribute] Offset: FFFFFFFF
  struct MeshGenerationContextUtils::BorderParams/*, public ::System::ValueType*/ {
    public:
    public:
    // public UnityEngine.Rect rect
    // Size: 0x10
    // Offset: 0x0
    ::UnityEngine::Rect rect;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rect) == 0x10);
    // public UnityEngine.Color playmodeTintColor
    // Size: 0x10
    // Offset: 0x10
    ::UnityEngine::Color playmodeTintColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // public UnityEngine.Color leftColor
    // Size: 0x10
    // Offset: 0x20
    ::UnityEngine::Color leftColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // public UnityEngine.Color topColor
    // Size: 0x10
    // Offset: 0x30
    ::UnityEngine::Color topColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // public UnityEngine.Color rightColor
    // Size: 0x10
    // Offset: 0x40
    ::UnityEngine::Color rightColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // public UnityEngine.Color bottomColor
    // Size: 0x10
    // Offset: 0x50
    ::UnityEngine::Color bottomColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // public System.Single leftWidth
    // Size: 0x4
    // Offset: 0x60
    float leftWidth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single topWidth
    // Size: 0x4
    // Offset: 0x64
    float topWidth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single rightWidth
    // Size: 0x4
    // Offset: 0x68
    float rightWidth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single bottomWidth
    // Size: 0x4
    // Offset: 0x6C
    float bottomWidth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.Vector2 topLeftRadius
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::Vector2 topLeftRadius;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // public UnityEngine.Vector2 topRightRadius
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::Vector2 topRightRadius;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // public UnityEngine.Vector2 bottomRightRadius
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::Vector2 bottomRightRadius;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // public UnityEngine.Vector2 bottomLeftRadius
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::Vector2 bottomLeftRadius;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // public UnityEngine.Material material
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::Material* material;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // UnityEngine.UIElements.ColorPage leftColorPage
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::UIElements::ColorPage leftColorPage;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::ColorPage) == 0x8);
    // UnityEngine.UIElements.ColorPage topColorPage
    // Size: 0x8
    // Offset: 0xA0
    ::UnityEngine::UIElements::ColorPage topColorPage;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::ColorPage) == 0x8);
    // UnityEngine.UIElements.ColorPage rightColorPage
    // Size: 0x8
    // Offset: 0xA8
    ::UnityEngine::UIElements::ColorPage rightColorPage;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::ColorPage) == 0x8);
    // UnityEngine.UIElements.ColorPage bottomColorPage
    // Size: 0x8
    // Offset: 0xB0
    ::UnityEngine::UIElements::ColorPage bottomColorPage;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::ColorPage) == 0x8);
    public:
    // Creating value type constructor for type: BorderParams
    constexpr BorderParams(::UnityEngine::Rect rect_ = {}, ::UnityEngine::Color playmodeTintColor_ = {}, ::UnityEngine::Color leftColor_ = {}, ::UnityEngine::Color topColor_ = {}, ::UnityEngine::Color rightColor_ = {}, ::UnityEngine::Color bottomColor_ = {}, float leftWidth_ = {}, float topWidth_ = {}, float rightWidth_ = {}, float bottomWidth_ = {}, ::UnityEngine::Vector2 topLeftRadius_ = {}, ::UnityEngine::Vector2 topRightRadius_ = {}, ::UnityEngine::Vector2 bottomRightRadius_ = {}, ::UnityEngine::Vector2 bottomLeftRadius_ = {}, ::UnityEngine::Material* material_ = {}, ::UnityEngine::UIElements::ColorPage leftColorPage_ = {}, ::UnityEngine::UIElements::ColorPage topColorPage_ = {}, ::UnityEngine::UIElements::ColorPage rightColorPage_ = {}, ::UnityEngine::UIElements::ColorPage bottomColorPage_ = {}) noexcept : rect{rect_}, playmodeTintColor{playmodeTintColor_}, leftColor{leftColor_}, topColor{topColor_}, rightColor{rightColor_}, bottomColor{bottomColor_}, leftWidth{leftWidth_}, topWidth{topWidth_}, rightWidth{rightWidth_}, bottomWidth{bottomWidth_}, topLeftRadius{topLeftRadius_}, topRightRadius{topRightRadius_}, bottomRightRadius{bottomRightRadius_}, bottomLeftRadius{bottomLeftRadius_}, material{material_}, leftColorPage{leftColorPage_}, topColorPage{topColorPage_}, rightColorPage{rightColorPage_}, bottomColorPage{bottomColorPage_} {}
    // Creating interface conversion operator: operator ::System::ValueType
    operator ::System::ValueType() noexcept {
      return *reinterpret_cast<::System::ValueType*>(this);
    }
    // Get instance field reference: public UnityEngine.Rect rect
    [[deprecated("Use field access instead!")]] ::UnityEngine::Rect& dyn_rect();
    // Get instance field reference: public UnityEngine.Color playmodeTintColor
    [[deprecated("Use field access instead!")]] ::UnityEngine::Color& dyn_playmodeTintColor();
    // Get instance field reference: public UnityEngine.Color leftColor
    [[deprecated("Use field access instead!")]] ::UnityEngine::Color& dyn_leftColor();
    // Get instance field reference: public UnityEngine.Color topColor
    [[deprecated("Use field access instead!")]] ::UnityEngine::Color& dyn_topColor();
    // Get instance field reference: public UnityEngine.Color rightColor
    [[deprecated("Use field access instead!")]] ::UnityEngine::Color& dyn_rightColor();
    // Get instance field reference: public UnityEngine.Color bottomColor
    [[deprecated("Use field access instead!")]] ::UnityEngine::Color& dyn_bottomColor();
    // Get instance field reference: public System.Single leftWidth
    [[deprecated("Use field access instead!")]] float& dyn_leftWidth();
    // Get instance field reference: public System.Single topWidth
    [[deprecated("Use field access instead!")]] float& dyn_topWidth();
    // Get instance field reference: public System.Single rightWidth
    [[deprecated("Use field access instead!")]] float& dyn_rightWidth();
    // Get instance field reference: public System.Single bottomWidth
    [[deprecated("Use field access instead!")]] float& dyn_bottomWidth();
    // Get instance field reference: public UnityEngine.Vector2 topLeftRadius
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector2& dyn_topLeftRadius();
    // Get instance field reference: public UnityEngine.Vector2 topRightRadius
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector2& dyn_topRightRadius();
    // Get instance field reference: public UnityEngine.Vector2 bottomRightRadius
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector2& dyn_bottomRightRadius();
    // Get instance field reference: public UnityEngine.Vector2 bottomLeftRadius
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector2& dyn_bottomLeftRadius();
    // Get instance field reference: public UnityEngine.Material material
    [[deprecated("Use field access instead!")]] ::UnityEngine::Material*& dyn_material();
    // Get instance field reference: UnityEngine.UIElements.ColorPage leftColorPage
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::ColorPage& dyn_leftColorPage();
    // Get instance field reference: UnityEngine.UIElements.ColorPage topColorPage
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::ColorPage& dyn_topColorPage();
    // Get instance field reference: UnityEngine.UIElements.ColorPage rightColorPage
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::ColorPage& dyn_rightColorPage();
    // Get instance field reference: UnityEngine.UIElements.ColorPage bottomColorPage
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::ColorPage& dyn_bottomColorPage();
    // UnityEngine.UIElements.MeshBuilderNative/NativeBorderParams ToNativeParams()
    // Offset: 0x566E51C
    ::UnityEngine::UIElements::MeshBuilderNative::NativeBorderParams ToNativeParams();
  }; // UnityEngine.UIElements.MeshGenerationContextUtils/BorderParams
  #pragma pack(pop)
  static check_size<sizeof(MeshGenerationContextUtils::BorderParams), 176 + sizeof(::UnityEngine::UIElements::ColorPage)> __UnityEngine_UIElements_MeshGenerationContextUtils_BorderParamsSizeCheck;
  static_assert(sizeof(MeshGenerationContextUtils::BorderParams) == 0xB8);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: UnityEngine::UIElements::MeshGenerationContextUtils::BorderParams::ToNativeParams
// Il2CppName: ToNativeParams
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::UIElements::MeshBuilderNative::NativeBorderParams (UnityEngine::UIElements::MeshGenerationContextUtils::BorderParams::*)()>(&UnityEngine::UIElements::MeshGenerationContextUtils::BorderParams::ToNativeParams)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::UIElements::MeshGenerationContextUtils::BorderParams), "ToNativeParams", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
