// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.UIElements.BaseField`1
#include "UnityEngine/UIElements/BaseField_1.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: GeometryChangedEvent
  class GeometryChangedEvent;
  // Forward declaring type: EventBase
  class EventBase;
  // Forward declaring type: ClampedDragger`1<T>
  template<typename T>
  class ClampedDragger_1;
}
// Completed forward declares
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: MinMaxSlider
  class MinMaxSlider;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::UIElements::MinMaxSlider);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UIElements::MinMaxSlider*, "UnityEngine.UIElements", "MinMaxSlider");
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // WARNING Size may be invalid!
  // Autogenerated type: UnityEngine.UIElements.MinMaxSlider
  // [TokenAttribute] Offset: FFFFFFFF
  class MinMaxSlider : public ::UnityEngine::UIElements::BaseField_1<::UnityEngine::Vector2> {
    public:
    // Nested type: ::UnityEngine::UIElements::MinMaxSlider::UxmlFactory
    class UxmlFactory;
    // Nested type: ::UnityEngine::UIElements::MinMaxSlider::UxmlTraits
    class UxmlTraits;
    // Nested type: ::UnityEngine::UIElements::MinMaxSlider::DragState
    struct DragState;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.UIElements.MinMaxSlider/DragState
    // [TokenAttribute] Offset: FFFFFFFF
    struct DragState/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: DragState
      constexpr DragState(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.UIElements.MinMaxSlider/DragState NoThumb
      static constexpr const int NoThumb = 0;
      // Get static field: static public UnityEngine.UIElements.MinMaxSlider/DragState NoThumb
      static ::UnityEngine::UIElements::MinMaxSlider::DragState _get_NoThumb();
      // Set static field: static public UnityEngine.UIElements.MinMaxSlider/DragState NoThumb
      static void _set_NoThumb(::UnityEngine::UIElements::MinMaxSlider::DragState value);
      // static field const value: static public UnityEngine.UIElements.MinMaxSlider/DragState MinThumb
      static constexpr const int MinThumb = 1;
      // Get static field: static public UnityEngine.UIElements.MinMaxSlider/DragState MinThumb
      static ::UnityEngine::UIElements::MinMaxSlider::DragState _get_MinThumb();
      // Set static field: static public UnityEngine.UIElements.MinMaxSlider/DragState MinThumb
      static void _set_MinThumb(::UnityEngine::UIElements::MinMaxSlider::DragState value);
      // static field const value: static public UnityEngine.UIElements.MinMaxSlider/DragState MiddleThumb
      static constexpr const int MiddleThumb = 2;
      // Get static field: static public UnityEngine.UIElements.MinMaxSlider/DragState MiddleThumb
      static ::UnityEngine::UIElements::MinMaxSlider::DragState _get_MiddleThumb();
      // Set static field: static public UnityEngine.UIElements.MinMaxSlider/DragState MiddleThumb
      static void _set_MiddleThumb(::UnityEngine::UIElements::MinMaxSlider::DragState value);
      // static field const value: static public UnityEngine.UIElements.MinMaxSlider/DragState MaxThumb
      static constexpr const int MaxThumb = 3;
      // Get static field: static public UnityEngine.UIElements.MinMaxSlider/DragState MaxThumb
      static ::UnityEngine::UIElements::MinMaxSlider::DragState _get_MaxThumb();
      // Set static field: static public UnityEngine.UIElements.MinMaxSlider/DragState MaxThumb
      static void _set_MaxThumb(::UnityEngine::UIElements::MinMaxSlider::DragState value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.UIElements.MinMaxSlider/DragState
    #pragma pack(pop)
    static check_size<sizeof(MinMaxSlider::DragState), 0 + sizeof(int)> __UnityEngine_UIElements_MinMaxSlider_DragStateSizeCheck;
    static_assert(sizeof(MinMaxSlider::DragState) == 0x4);
    public:
    // private UnityEngine.UIElements.VisualElement <dragElement>k__BackingField
    // Size: 0x8
    // Offset: 0x428
    ::UnityEngine::UIElements::VisualElement* dragElement;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::VisualElement*) == 0x8);
    // private UnityEngine.UIElements.VisualElement <dragMinThumb>k__BackingField
    // Size: 0x8
    // Offset: 0x430
    ::UnityEngine::UIElements::VisualElement* dragMinThumb;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::VisualElement*) == 0x8);
    // private UnityEngine.UIElements.VisualElement <dragMaxThumb>k__BackingField
    // Size: 0x8
    // Offset: 0x438
    ::UnityEngine::UIElements::VisualElement* dragMaxThumb;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::VisualElement*) == 0x8);
    // private UnityEngine.UIElements.ClampedDragger`1<System.Single> <clampedDragger>k__BackingField
    // Size: 0x8
    // Offset: 0x440
    ::UnityEngine::UIElements::ClampedDragger_1<float>* clampedDragger;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::ClampedDragger_1<float>*) == 0x8);
    // private UnityEngine.Vector2 m_DragElementStartPos
    // Size: 0x8
    // Offset: 0x448
    ::UnityEngine::Vector2 m_DragElementStartPos;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private UnityEngine.Vector2 m_ValueStartPos
    // Size: 0x8
    // Offset: 0x450
    ::UnityEngine::Vector2 m_ValueStartPos;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private UnityEngine.Rect m_DragMinThumbRect
    // Size: 0x10
    // Offset: 0x458
    ::UnityEngine::Rect m_DragMinThumbRect;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rect) == 0x10);
    // private UnityEngine.Rect m_DragMaxThumbRect
    // Size: 0x10
    // Offset: 0x468
    ::UnityEngine::Rect m_DragMaxThumbRect;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rect) == 0x10);
    // private UnityEngine.UIElements.MinMaxSlider/DragState m_DragState
    // Size: 0x4
    // Offset: 0x478
    ::UnityEngine::UIElements::MinMaxSlider::DragState m_DragState;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::MinMaxSlider::DragState) == 0x4);
    // private System.Single m_MinLimit
    // Size: 0x4
    // Offset: 0x47C
    float m_MinLimit;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_MaxLimit
    // Size: 0x4
    // Offset: 0x480
    float m_MaxLimit;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Get static field: static public readonly System.String ussClassName
    static ::StringW _get_ussClassName();
    // Set static field: static public readonly System.String ussClassName
    static void _set_ussClassName(::StringW value);
    // Get static field: static public readonly System.String labelUssClassName
    static ::StringW _get_labelUssClassName();
    // Set static field: static public readonly System.String labelUssClassName
    static void _set_labelUssClassName(::StringW value);
    // Get static field: static public readonly System.String inputUssClassName
    static ::StringW _get_inputUssClassName();
    // Set static field: static public readonly System.String inputUssClassName
    static void _set_inputUssClassName(::StringW value);
    // Get static field: static public readonly System.String trackerUssClassName
