// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.UIElements.PanelEventHandler
#include "UnityEngine/UIElements/PanelEventHandler.hpp"
// Including type: UnityEngine.UIElements.IPointerEvent
#include "UnityEngine/UIElements/IPointerEvent.hpp"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
// Including type: UnityEngine.PenStatus
#include "UnityEngine/PenStatus.hpp"
// Including type: UnityEngine.EventModifiers
#include "UnityEngine/EventModifiers.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::EventSystems
namespace UnityEngine::EventSystems {
  // Forward declaring type: PointerEventData
  class PointerEventData;
}
// Completed forward declares
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::UIElements::PanelEventHandler::PointerEvent);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UIElements::PanelEventHandler::PointerEvent*, "UnityEngine.UIElements", "PanelEventHandler/PointerEvent");
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Size: 0x8C
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.UIElements.PanelEventHandler/PointerEvent
  // [TokenAttribute] Offset: FFFFFFFF
  class PanelEventHandler::PointerEvent : public ::Il2CppObject/*, public ::UnityEngine::UIElements::IPointerEvent*/ {
    public:
    public:
    // private System.Int32 <pointerId>k__BackingField
    // Size: 0x4
    // Offset: 0x10
    int pointerId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: pointerId and: pointerType
    char __padding0[0x4] = {};
    // private System.String <pointerType>k__BackingField
    // Size: 0x8
    // Offset: 0x18
    ::StringW pointerType;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean <isPrimary>k__BackingField
    // Size: 0x1
    // Offset: 0x20
    bool isPrimary;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isPrimary and: button
    char __padding2[0x3] = {};
    // private System.Int32 <button>k__BackingField
    // Size: 0x4
    // Offset: 0x24
    int button;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 <pressedButtons>k__BackingField
    // Size: 0x4
    // Offset: 0x28
    int pressedButtons;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.Vector3 <position>k__BackingField
    // Size: 0xC
    // Offset: 0x2C
    ::UnityEngine::Vector3 position;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 <localPosition>k__BackingField
    // Size: 0xC
    // Offset: 0x38
    ::UnityEngine::Vector3 localPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 <deltaPosition>k__BackingField
    // Size: 0xC
    // Offset: 0x44
    ::UnityEngine::Vector3 deltaPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Single <deltaTime>k__BackingField
    // Size: 0x4
    // Offset: 0x50
    float deltaTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 <clickCount>k__BackingField
    // Size: 0x4
    // Offset: 0x54
    int clickCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single <pressure>k__BackingField
    // Size: 0x4
    // Offset: 0x58
    float pressure;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <tangentialPressure>k__BackingField
    // Size: 0x4
    // Offset: 0x5C
    float tangentialPressure;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <altitudeAngle>k__BackingField
    // Size: 0x4
    // Offset: 0x60
    float altitudeAngle;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <azimuthAngle>k__BackingField
    // Size: 0x4
    // Offset: 0x64
    float azimuthAngle;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <twist>k__BackingField
    // Size: 0x4
    // Offset: 0x68
    float twist;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector2 <tilt>k__BackingField
    // Size: 0x8
    // Offset: 0x6C
    ::UnityEngine::Vector2 tilt;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private UnityEngine.PenStatus <penStatus>k__BackingField
    // Size: 0x4
    // Offset: 0x74
    ::UnityEngine::PenStatus penStatus;
    // Field size check
    static_assert(sizeof(::UnityEngine::PenStatus) == 0x4);
    // private UnityEngine.Vector2 <radius>k__BackingField
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::Vector2 radius;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private UnityEngine.Vector2 <radiusVariance>k__BackingField
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::Vector2 radiusVariance;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private UnityEngine.EventModifiers <modifiers>k__BackingField
    // Size: 0x4
    // Offset: 0x88
    ::UnityEngine::EventModifiers modifiers;
    // Field size check
    static_assert(sizeof(::UnityEngine::EventModifiers) == 0x4);
    public:
    // Creating interface conversion operator: operator ::UnityEngine::UIElements::IPointerEvent
    operator ::UnityEngine::UIElements::IPointerEvent() noexcept {
      return *reinterpret_cast<::UnityEngine::UIElements::IPointerEvent*>(this);
    }
    // Get instance field reference: private System.Int32 <pointerId>k__BackingField
    [[deprecated("Use field access instead!")]] int& dyn_$pointerId$k__BackingField();
    // Get instance field reference: private System.String <pointerType>k__BackingField
    [[deprecated("Use field access instead!")]] ::StringW& dyn_$pointerType$k__BackingField();
    // Get instance field reference: private System.Boolean <isPrimary>k__BackingField
    [[deprecated("Use field access instead!")]] bool& dyn_$isPrimary$k__BackingField();
