// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.ScriptableObject
#include "UnityEngine/ScriptableObject.hpp"
// Including type: UnityEngine.UIElements.PanelScaleMode
#include "UnityEngine/UIElements/PanelScaleMode.hpp"
// Including type: UnityEngine.Vector2Int
#include "UnityEngine/Vector2Int.hpp"
// Including type: UnityEngine.UIElements.PanelScreenMatchMode
#include "UnityEngine/UIElements/PanelScreenMatchMode.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: UnityEngine.Rect
#include "UnityEngine/Rect.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: ThemeStyleSheet
  class ThemeStyleSheet;
  // Forward declaring type: UIDocumentList
  class UIDocumentList;
  // Forward declaring type: DynamicAtlasSettings
  class DynamicAtlasSettings;
  // Forward declaring type: PanelTextSettings
  class PanelTextSettings;
  // Forward declaring type: StyleSheet
  class StyleSheet;
  // Forward declaring type: BaseRuntimePanel
  class BaseRuntimePanel;
  // Forward declaring type: VisualElement
  class VisualElement;
  // Forward declaring type: UIDocument
  class UIDocument;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: RenderTexture
  class RenderTexture;
  // Forward declaring type: Shader
  class Shader;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Func`2<T, TResult>
  template<typename T, typename TResult>
  class Func_2;
  // Forward declaring type: String
  class String;
}
// Completed forward declares
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: PanelSettings
  class PanelSettings;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::UIElements::PanelSettings);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UIElements::PanelSettings*, "UnityEngine.UIElements", "PanelSettings");
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Size: 0xD0
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.UIElements.PanelSettings
  // [TokenAttribute] Offset: FFFFFFFF
  class PanelSettings : public ::UnityEngine::ScriptableObject {
    public:
    // Nested type: ::UnityEngine::UIElements::PanelSettings::RuntimePanelAccess
    class RuntimePanelAccess;
    public:
    // private UnityEngine.UIElements.ThemeStyleSheet themeUss
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::UIElements::ThemeStyleSheet* themeUss;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::ThemeStyleSheet*) == 0x8);
    // private UnityEngine.RenderTexture m_TargetTexture
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::RenderTexture* m_TargetTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::RenderTexture*) == 0x8);
    // private UnityEngine.UIElements.PanelScaleMode m_ScaleMode
    // Size: 0x4
    // Offset: 0x28
    ::UnityEngine::UIElements::PanelScaleMode m_ScaleMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::PanelScaleMode) == 0x4);
    // private System.Single m_ReferenceSpritePixelsPerUnit
    // Size: 0x4
    // Offset: 0x2C
    float m_ReferenceSpritePixelsPerUnit;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_Scale
    // Size: 0x4
    // Offset: 0x30
    float m_Scale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_ReferenceDpi
    // Size: 0x4
    // Offset: 0x34
    float m_ReferenceDpi;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_FallbackDpi
    // Size: 0x4
    // Offset: 0x38
    float m_FallbackDpi;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector2Int m_ReferenceResolution
    // Size: 0x8
    // Offset: 0x3C
    ::UnityEngine::Vector2Int m_ReferenceResolution;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2Int) == 0x8);
    // private UnityEngine.UIElements.PanelScreenMatchMode m_ScreenMatchMode
    // Size: 0x4
    // Offset: 0x44
    ::UnityEngine::UIElements::PanelScreenMatchMode m_ScreenMatchMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::PanelScreenMatchMode) == 0x4);
    // private System.Single m_Match
    // Size: 0x4
    // Offset: 0x48
    float m_Match;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_SortingOrder
    // Size: 0x4
    // Offset: 0x4C
    float m_SortingOrder;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 m_TargetDisplay
    // Size: 0x4
    // Offset: 0x50
    int m_TargetDisplay;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean m_ClearDepthStencil
    // Size: 0x1
    // Offset: 0x54
    bool m_ClearDepthStencil;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_ClearColor
    // Size: 0x1
    // Offset: 0x55
    bool m_ClearColor;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_ClearColor and: m_ColorClearValue
    char __padding13[0x2] = {};
    // private UnityEngine.Color m_ColorClearValue
    // Size: 0x10
    // Offset: 0x58
    ::UnityEngine::Color m_ColorClearValue;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.UIElements.PanelSettings/RuntimePanelAccess m_PanelAccess
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::UIElements::PanelSettings::RuntimePanelAccess* m_PanelAccess;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::PanelSettings::RuntimePanelAccess*) == 0x8);
    // UnityEngine.UIElements.UIDocumentList m_AttachedUIDocumentsList
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::UIElements::UIDocumentList* m_AttachedUIDocumentsList;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UIDocumentList*) == 0x8);
    // private UnityEngine.UIElements.DynamicAtlasSettings m_DynamicAtlasSettings
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::UIElements::DynamicAtlasSettings* m_DynamicAtlasSettings;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::DynamicAtlasSettings*) == 0x8);
    // private UnityEngine.Shader m_AtlasBlitShader
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::Shader* m_AtlasBlitShader;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // private UnityEngine.Shader m_RuntimeShader
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::Shader* m_RuntimeShader;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // private UnityEngine.Shader m_RuntimeWorldShader
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::Shader* m_RuntimeWorldShader;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // public UnityEngine.UIElements.PanelTextSettings textSettings
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::UIElements::PanelTextSettings* textSettings;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::PanelTextSettings*) == 0x8);
    // private UnityEngine.Rect m_TargetRect
    // Size: 0x10
    // Offset: 0xA0
    ::UnityEngine::Rect m_TargetRect;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rect) == 0x10);
    // private System.Single m_ResolvedScale
    // Size: 0x4
    // Offset: 0xB0
    float m_ResolvedScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: m_ResolvedScale and: m_OldThemeUss
    char __padding23[0x4] = {};
    // private UnityEngine.UIElements.StyleSheet m_OldThemeUss
    // Size: 0x8
    // Offset: 0xB8
    ::UnityEngine::UIElements::StyleSheet* m_OldThemeUss;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::StyleSheet*) == 0x8);
    // private System.Single <ScreenDPI>k__BackingField
    // Size: 0x4
    // Offset: 0xC0
    float ScreenDPI;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: ScreenDPI and: m_AssignedScreenToPanel
    char __padding25[0x4] = {};
    // private System.Func`2<UnityEngine.Vector2,UnityEngine.Vector2> m_AssignedScreenToPanel
    // Size: 0x8
    // Offset: 0xC8
    ::System::Func_2<::UnityEngine::Vector2, ::UnityEngine::Vector2>* m_AssignedScreenToPanel;
    // Field size check
    static_assert(sizeof(::System::Func_2<::UnityEngine::Vector2, ::UnityEngine::Vector2>*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // static field const value: static private System.Int32 k_DefaultSortingOrder
    static constexpr const int k_DefaultSortingOrder = 0;
    // Get static field: static private System.Int32 k_DefaultSortingOrder
    static int _get_k_DefaultSortingOrder();
    // Set static field: static private System.Int32 k_DefaultSortingOrder
    static void _set_k_DefaultSortingOrder(int value);
    // static field const value: static private System.Single k_DefaultScaleValue
    static constexpr const float k_DefaultScaleValue = 1;
    // Get static field: static private System.Single k_DefaultScaleValue
