// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.UIElements.BaseVisualElementPanel
#include "UnityEngine/UIElements/BaseVisualElementPanel.hpp"
// Including type: Unity.Profiling.ProfilerMarker
#include "Unity/Profiling/ProfilerMarker.hpp"
// Including type: UnityEngine.UIElements.ContextType
#include "UnityEngine/UIElements/ContextType.hpp"
// Including type: UnityEngine.EventInterests
#include "UnityEngine/EventInterests.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: VisualElement
  class VisualElement;
  // Forward declaring type: VisualTreeUpdater
  class VisualTreeUpdater;
  // Forward declaring type: IStylePropertyAnimationSystem
  class IStylePropertyAnimationSystem;
  // Forward declaring type: EventDispatcher
  class EventDispatcher;
  // Forward declaring type: TimerEventScheduler
  class TimerEventScheduler;
  // Forward declaring type: SavePersistentViewData
  class SavePersistentViewData;
  // Forward declaring type: GetViewDataDictionary
  class GetViewDataDictionary;
  // Forward declaring type: FocusController
  class FocusController;
  // Forward declaring type: IMGUIContainer
  class IMGUIContainer;
  // Forward declaring type: AtlasBase
  class AtlasBase;
  // Forward declaring type: LoadResourceFunction
  class LoadResourceFunction;
  // Forward declaring type: TimeMsFunction
  class TimeMsFunction;
  // Forward declaring type: IScheduler
  class IScheduler;
  // Forward declaring type: VersionChangeType
  struct VersionChangeType;
  // Forward declaring type: IVisualTreeUpdater
  class IVisualTreeUpdater;
  // Forward declaring type: VisualTreeUpdatePhase
  struct VisualTreeUpdatePhase;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: ScriptableObject
  class ScriptableObject;
  // Forward declaring type: Shader
  class Shader;
  // Forward declaring type: Object
  class Object;
  // Forward declaring type: Vector2
  struct Vector2;
  // Forward declaring type: Vector2Int
  struct Vector2Int;
  // Forward declaring type: Event
  class Event;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Type
  class Type;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: Panel
  class Panel;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::UIElements::Panel);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UIElements::Panel*, "UnityEngine.UIElements", "Panel");
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Size: 0x159
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.UIElements.Panel
  // [TokenAttribute] Offset: FFFFFFFF
  class Panel : public ::UnityEngine::UIElements::BaseVisualElementPanel {
    public:
    public:
    // private UnityEngine.UIElements.VisualElement m_RootContainer
    // Size: 0x8
    // Offset: 0xA8
    ::UnityEngine::UIElements::VisualElement* m_RootContainer;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::VisualElement*) == 0x8);
    // private UnityEngine.UIElements.VisualTreeUpdater m_VisualTreeUpdater
    // Size: 0x8
    // Offset: 0xB0
    ::UnityEngine::UIElements::VisualTreeUpdater* m_VisualTreeUpdater;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::VisualTreeUpdater*) == 0x8);
    // private UnityEngine.UIElements.IStylePropertyAnimationSystem m_StylePropertyAnimationSystem
    // Size: 0x8
    // Offset: 0xB8
    ::UnityEngine::UIElements::IStylePropertyAnimationSystem* m_StylePropertyAnimationSystem;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::IStylePropertyAnimationSystem*) == 0x8);
    // private System.String m_PanelName
    // Size: 0x8
    // Offset: 0xC0
    ::StringW m_PanelName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.UInt32 m_Version
    // Size: 0x4
    // Offset: 0xC8
    uint m_Version;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 m_RepaintVersion
    // Size: 0x4
    // Offset: 0xCC
    uint m_RepaintVersion;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 m_HierarchyVersion
    // Size: 0x4
    // Offset: 0xD0
    uint m_HierarchyVersion;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // Padding between fields: m_HierarchyVersion and: m_MarkerBeforeUpdate
    char __padding6[0x4] = {};
    // private Unity.Profiling.ProfilerMarker m_MarkerBeforeUpdate
    // Size: 0x8
    // Offset: 0xD8
    ::Unity::Profiling::ProfilerMarker m_MarkerBeforeUpdate;
    // Field size check
    static_assert(sizeof(::Unity::Profiling::ProfilerMarker) == 0x8);
    // private Unity.Profiling.ProfilerMarker m_MarkerUpdate
    // Size: 0x8
    // Offset: 0xE0
    ::Unity::Profiling::ProfilerMarker m_MarkerUpdate;
    // Field size check
    static_assert(sizeof(::Unity::Profiling::ProfilerMarker) == 0x8);
    // private Unity.Profiling.ProfilerMarker m_MarkerLayout
    // Size: 0x8
    // Offset: 0xE8
    ::Unity::Profiling::ProfilerMarker m_MarkerLayout;
    // Field size check
    static_assert(sizeof(::Unity::Profiling::ProfilerMarker) == 0x8);
    // private Unity.Profiling.ProfilerMarker m_MarkerBindings
    // Size: 0x8
    // Offset: 0xF0
    ::Unity::Profiling::ProfilerMarker m_MarkerBindings;
    // Field size check
    static_assert(sizeof(::Unity::Profiling::ProfilerMarker) == 0x8);
    // private Unity.Profiling.ProfilerMarker m_MarkerAnimations
    // Size: 0x8
    // Offset: 0xF8
    ::Unity::Profiling::ProfilerMarker m_MarkerAnimations;
    // Field size check
    static_assert(sizeof(::Unity::Profiling::ProfilerMarker) == 0x8);
    // private UnityEngine.UIElements.EventDispatcher <dispatcher>k__BackingField
    // Size: 0x8
    // Offset: 0x100
    ::UnityEngine::UIElements::EventDispatcher* dispatcher;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::EventDispatcher*) == 0x8);
    // private UnityEngine.UIElements.TimerEventScheduler m_Scheduler
    // Size: 0x8
    // Offset: 0x108
    ::UnityEngine::UIElements::TimerEventScheduler* m_Scheduler;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::TimerEventScheduler*) == 0x8);
    // private UnityEngine.ScriptableObject <ownerObject>k__BackingField
    // Size: 0x8
    // Offset: 0x110
    ::UnityEngine::ScriptableObject* ownerObject;
    // Field size check
    static_assert(sizeof(::UnityEngine::ScriptableObject*) == 0x8);
    // private UnityEngine.UIElements.ContextType <contextType>k__BackingField
    // Size: 0x4
    // Offset: 0x118
    ::UnityEngine::UIElements::ContextType contextType;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::ContextType) == 0x4);
    // Padding between fields: contextType and: saveViewData
    char __padding15[0x4] = {};
    // private UnityEngine.UIElements.SavePersistentViewData <saveViewData>k__BackingField
    // Size: 0x8
    // Offset: 0x120
    ::UnityEngine::UIElements::SavePersistentViewData* saveViewData;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::SavePersistentViewData*) == 0x8);
    // private UnityEngine.UIElements.GetViewDataDictionary <getViewDataDictionary>k__BackingField
    // Size: 0x8
    // Offset: 0x128
    ::UnityEngine::UIElements::GetViewDataDictionary* getViewDataDictionary;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::GetViewDataDictionary*) == 0x8);
    // private UnityEngine.UIElements.FocusController <focusController>k__BackingField
    // Size: 0x8
    // Offset: 0x130
    ::UnityEngine::UIElements::FocusController* focusController;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::FocusController*) == 0x8);
    // private UnityEngine.EventInterests <IMGUIEventInterests>k__BackingField
    // Size: 0x3
    // Offset: 0x138
    ::UnityEngine::EventInterests IMGUIEventInterests;
    // Field size check
    static_assert(sizeof(::UnityEngine::EventInterests) == 0x3);
    // private System.Boolean m_JustReceivedFocus
    // Size: 0x1
    // Offset: 0x13B
    bool m_JustReceivedFocus;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Int32 <IMGUIContainersCount>k__BackingField
    // Size: 0x4
    // Offset: 0x13C
    int IMGUIContainersCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.UIElements.IMGUIContainer <rootIMGUIContainer>k__BackingField
    // Size: 0x8
    // Offset: 0x140
    ::UnityEngine::UIElements::IMGUIContainer* rootIMGUIContainer;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::IMGUIContainer*) == 0x8);
    // private UnityEngine.Shader m_StandardShader
    // Size: 0x8
    // Offset: 0x148
    ::UnityEngine::Shader* m_StandardShader;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // private UnityEngine.UIElements.AtlasBase m_Atlas
    // Size: 0x8
    // Offset: 0x150
    ::UnityEngine::UIElements::AtlasBase* m_Atlas;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::AtlasBase*) == 0x8);
    // private System.Boolean m_ValidatingLayout
    // Size: 0x1
    // Offset: 0x158
    bool m_ValidatingLayout;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get static field: static private Unity.Profiling.ProfilerMarker s_MarkerPickAll
    static ::Unity::Profiling::ProfilerMarker _get_s_MarkerPickAll();
    // Set static field: static private Unity.Profiling.ProfilerMarker s_MarkerPickAll
    static void _set_s_MarkerPickAll(::Unity::Profiling::ProfilerMarker value);
    // Get static field: static private UnityEngine.UIElements.LoadResourceFunction <loadResourceFunc>k__BackingField
    static ::UnityEngine::UIElements::LoadResourceFunction* _get_$loadResourceFunc$k__BackingField();
    // Set static field: static private UnityEngine.UIElements.LoadResourceFunction <loadResourceFunc>k__BackingField
    static void _set_$loadResourceFunc$k__BackingField(::UnityEngine::UIElements::LoadResourceFunction* value);
