// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.UIElements.VisualElement
#include "UnityEngine/UIElements/VisualElement.hpp"
// Including type: UnityEngine.UIElements.ScrollerVisibility
#include "UnityEngine/UIElements/ScrollerVisibility.hpp"
// Including type: UnityEngine.UIElements.ScrollViewMode
#include "UnityEngine/UIElements/ScrollViewMode.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: IVisualElementScheduledItem
  class IVisualElementScheduledItem;
  // Forward declaring type: Scroller
  class Scroller;
  // Forward declaring type: EventCallback`1<TEventType>
  template<typename TEventType>
  class EventCallback_1;
  // Forward declaring type: PointerMoveEvent
  class PointerMoveEvent;
  // Forward declaring type: PointerUpEvent
  class PointerUpEvent;
  // Skipping declaration: TouchScrollBehavior because it is already included!
  // Skipping declaration: NestedInteractionKind because it is already included!
  // Forward declaring type: GeometryChangedEvent
  class GeometryChangedEvent;
  // Forward declaring type: AttachToPanelEvent
  class AttachToPanelEvent;
  // Forward declaring type: DetachFromPanelEvent
  class DetachFromPanelEvent;
  // Forward declaring type: PointerCaptureEvent
  class PointerCaptureEvent;
  // Forward declaring type: PointerCaptureOutEvent
  class PointerCaptureOutEvent;
  // Forward declaring type: PointerDownEvent
  class PointerDownEvent;
  // Forward declaring type: PointerCancelEvent
  class PointerCancelEvent;
  // Skipping declaration: IEventHandler because it is already included!
  // Forward declaring type: WheelEvent
  class WheelEvent;
  // Forward declaring type: CustomStyleResolvedEvent
  class CustomStyleResolvedEvent;
}
// Completed forward declares
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: ScrollView
  class ScrollView;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::UIElements::ScrollView);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UIElements::ScrollView*, "UnityEngine.UIElements", "ScrollView");
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // WARNING Size may be invalid!
  // Autogenerated type: UnityEngine.UIElements.ScrollView
  // [TokenAttribute] Offset: FFFFFFFF
  class ScrollView : public ::UnityEngine::UIElements::VisualElement {
    public:
    // Nested type: ::UnityEngine::UIElements::ScrollView::UxmlFactory
    class UxmlFactory;
    // Nested type: ::UnityEngine::UIElements::ScrollView::UxmlTraits
    class UxmlTraits;
    // Nested type: ::UnityEngine::UIElements::ScrollView::TouchScrollBehavior
    struct TouchScrollBehavior;
    // Nested type: ::UnityEngine::UIElements::ScrollView::NestedInteractionKind
    struct NestedInteractionKind;
    // Nested type: ::UnityEngine::UIElements::ScrollView::TouchScrollingResult
    struct TouchScrollingResult;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.UIElements.ScrollView/TouchScrollBehavior
    // [TokenAttribute] Offset: FFFFFFFF
    struct TouchScrollBehavior/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: TouchScrollBehavior
      constexpr TouchScrollBehavior(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.UIElements.ScrollView/TouchScrollBehavior Unrestricted
      static constexpr const int Unrestricted = 0;
      // Get static field: static public UnityEngine.UIElements.ScrollView/TouchScrollBehavior Unrestricted
      static ::UnityEngine::UIElements::ScrollView::TouchScrollBehavior _get_Unrestricted();
      // Set static field: static public UnityEngine.UIElements.ScrollView/TouchScrollBehavior Unrestricted
      static void _set_Unrestricted(::UnityEngine::UIElements::ScrollView::TouchScrollBehavior value);
      // static field const value: static public UnityEngine.UIElements.ScrollView/TouchScrollBehavior Elastic
      static constexpr const int Elastic = 1;
      // Get static field: static public UnityEngine.UIElements.ScrollView/TouchScrollBehavior Elastic
      static ::UnityEngine::UIElements::ScrollView::TouchScrollBehavior _get_Elastic();
      // Set static field: static public UnityEngine.UIElements.ScrollView/TouchScrollBehavior Elastic
      static void _set_Elastic(::UnityEngine::UIElements::ScrollView::TouchScrollBehavior value);
      // static field const value: static public UnityEngine.UIElements.ScrollView/TouchScrollBehavior Clamped
      static constexpr const int Clamped = 2;
      // Get static field: static public UnityEngine.UIElements.ScrollView/TouchScrollBehavior Clamped
      static ::UnityEngine::UIElements::ScrollView::TouchScrollBehavior _get_Clamped();
      // Set static field: static public UnityEngine.UIElements.ScrollView/TouchScrollBehavior Clamped
      static void _set_Clamped(::UnityEngine::UIElements::ScrollView::TouchScrollBehavior value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.UIElements.ScrollView/TouchScrollBehavior
    #pragma pack(pop)
    static check_size<sizeof(ScrollView::TouchScrollBehavior), 0 + sizeof(int)> __UnityEngine_UIElements_ScrollView_TouchScrollBehaviorSizeCheck;
    static_assert(sizeof(ScrollView::TouchScrollBehavior) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.UIElements.ScrollView/NestedInteractionKind
    // [TokenAttribute] Offset: FFFFFFFF
    struct NestedInteractionKind/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: NestedInteractionKind
      constexpr NestedInteractionKind(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.UIElements.ScrollView/NestedInteractionKind Default
      static constexpr const int Default = 0;
      // Get static field: static public UnityEngine.UIElements.ScrollView/NestedInteractionKind Default
      static ::UnityEngine::UIElements::ScrollView::NestedInteractionKind _get_Default();
      // Set static field: static public UnityEngine.UIElements.ScrollView/NestedInteractionKind Default
      static void _set_Default(::UnityEngine::UIElements::ScrollView::NestedInteractionKind value);
      // static field const value: static public UnityEngine.UIElements.ScrollView/NestedInteractionKind StopScrolling
      static constexpr const int StopScrolling = 1;
      // Get static field: static public UnityEngine.UIElements.ScrollView/NestedInteractionKind StopScrolling
      static ::UnityEngine::UIElements::ScrollView::NestedInteractionKind _get_StopScrolling();
      // Set static field: static public UnityEngine.UIElements.ScrollView/NestedInteractionKind StopScrolling
      static void _set_StopScrolling(::UnityEngine::UIElements::ScrollView::NestedInteractionKind value);
      // static field const value: static public UnityEngine.UIElements.ScrollView/NestedInteractionKind ForwardScrolling
      static constexpr const int ForwardScrolling = 2;
      // Get static field: static public UnityEngine.UIElements.ScrollView/NestedInteractionKind ForwardScrolling
      static ::UnityEngine::UIElements::ScrollView::NestedInteractionKind _get_ForwardScrolling();
      // Set static field: static public UnityEngine.UIElements.ScrollView/NestedInteractionKind ForwardScrolling
      static void _set_ForwardScrolling(::UnityEngine::UIElements::ScrollView::NestedInteractionKind value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.UIElements.ScrollView/NestedInteractionKind
    #pragma pack(pop)
    static check_size<sizeof(ScrollView::NestedInteractionKind), 0 + sizeof(int)> __UnityEngine_UIElements_ScrollView_NestedInteractionKindSizeCheck;
    static_assert(sizeof(ScrollView::NestedInteractionKind) == 0x4);
    public:
    // private System.Int32 m_FirstLayoutPass
    // Size: 0x4
    // Offset: 0x3C0
    int m_FirstLayoutPass;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.UIElements.ScrollerVisibility m_HorizontalScrollerVisibility
    // Size: 0x4
    // Offset: 0x3C4
    ::UnityEngine::UIElements::ScrollerVisibility m_HorizontalScrollerVisibility;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::ScrollerVisibility) == 0x4);
    // private UnityEngine.UIElements.ScrollerVisibility m_VerticalScrollerVisibility
    // Size: 0x4
    // Offset: 0x3C8
    ::UnityEngine::UIElements::ScrollerVisibility m_VerticalScrollerVisibility;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::ScrollerVisibility) == 0x4);
    // private UnityEngine.UIElements.VisualElement m_AttachedRootVisualContainer
    // Size: 0x8
    // Offset: 0x3D0
    ::UnityEngine::UIElements::VisualElement* m_AttachedRootVisualContainer;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::VisualElement*) == 0x8);
    // private System.Single m_SingleLineHeight
    // Size: 0x4
    // Offset: 0x3D8
    float m_SingleLineHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // System.Boolean m_MouseWheelScrollSizeIsInline
    // Size: 0x1
    // Offset: 0x3DC
    bool m_MouseWheelScrollSizeIsInline;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Single m_HorizontalPageSize
    // Size: 0x4
    // Offset: 0x3E0
    float m_HorizontalPageSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_VerticalPageSize
    // Size: 0x4
    // Offset: 0x3E4
    float m_VerticalPageSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_MouseWheelScrollSize
    // Size: 0x4
    // Offset: 0x3E8
    float m_MouseWheelScrollSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_ScrollDecelerationRate
    // Size: 0x4
    // Offset: 0x3EC
    float m_ScrollDecelerationRate;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_Elasticity
    // Size: 0x4
    // Offset: 0x3F0
    float m_Elasticity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.UIElements.ScrollView/TouchScrollBehavior m_TouchScrollBehavior
    // Size: 0x4
    // Offset: 0x3F4
    ::UnityEngine::UIElements::ScrollView::TouchScrollBehavior m_TouchScrollBehavior;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::ScrollView::TouchScrollBehavior) == 0x4);
    // private UnityEngine.UIElements.ScrollView/NestedInteractionKind m_NestedInteractionKind
    // Size: 0x4
    // Offset: 0x3F8
    ::UnityEngine::UIElements::ScrollView::NestedInteractionKind m_NestedInteractionKind;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::ScrollView::NestedInteractionKind) == 0x4);
    // private readonly UnityEngine.UIElements.VisualElement <contentViewport>k__BackingField
    // Size: 0x8
    // Offset: 0x400
    ::UnityEngine::UIElements::VisualElement* contentViewport;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::VisualElement*) == 0x8);
    // private readonly UnityEngine.UIElements.Scroller <horizontalScroller>k__BackingField
    // Size: 0x8
    // Offset: 0x408
    ::UnityEngine::UIElements::Scroller* horizontalScroller;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::Scroller*) == 0x8);
    // private readonly UnityEngine.UIElements.Scroller <verticalScroller>k__BackingField
    // Size: 0x8
    // Offset: 0x410
    ::UnityEngine::UIElements::Scroller* verticalScroller;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::Scroller*) == 0x8);
    // private UnityEngine.UIElements.VisualElement m_ContentContainer
    // Size: 0x8
    // Offset: 0x418
    ::UnityEngine::UIElements::VisualElement* m_ContentContainer;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::VisualElement*) == 0x8);
    // private UnityEngine.UIElements.VisualElement m_ContentAndVerticalScrollContainer
    // Size: 0x8
    // Offset: 0x420
    ::UnityEngine::UIElements::VisualElement* m_ContentAndVerticalScrollContainer;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::VisualElement*) == 0x8);
    // private UnityEngine.UIElements.ScrollViewMode m_Mode
    // Size: 0x4
    // Offset: 0x428
    ::UnityEngine::UIElements::ScrollViewMode m_Mode;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::ScrollViewMode) == 0x4);
    // private UnityEngine.UIElements.IVisualElementScheduledItem m_ScheduledLayoutPassResetItem
    // Size: 0x8
    // Offset: 0x430
    ::UnityEngine::UIElements::IVisualElementScheduledItem* m_ScheduledLayoutPassResetItem;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::IVisualElementScheduledItem*) == 0x8);
    // private System.Int32 m_ScrollingPointerId
    // Size: 0x4
    // Offset: 0x438
    int m_ScrollingPointerId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.Vector2 m_StartPosition
    // Size: 0x8
    // Offset: 0x43C
    ::UnityEngine::Vector2 m_StartPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private UnityEngine.Vector2 m_PointerStartPosition
    // Size: 0x8
    // Offset: 0x444
    ::UnityEngine::Vector2 m_PointerStartPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private UnityEngine.Vector2 m_Velocity
    // Size: 0x8
    // Offset: 0x44C
    ::UnityEngine::Vector2 m_Velocity;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private UnityEngine.Vector2 m_SpringBackVelocity
    // Size: 0x8
    // Offset: 0x454
    ::UnityEngine::Vector2 m_SpringBackVelocity;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private UnityEngine.Vector2 m_LowBounds
    // Size: 0x8
    // Offset: 0x45C
    ::UnityEngine::Vector2 m_LowBounds;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private UnityEngine.Vector2 m_HighBounds
    // Size: 0x8
    // Offset: 0x464
    ::UnityEngine::Vector2 m_HighBounds;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private System.Single m_LastVelocityLerpTime
    // Size: 0x4
    // Offset: 0x46C
    float m_LastVelocityLerpTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_StartedMoving
    // Size: 0x1
    // Offset: 0x470
    bool m_StartedMoving;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_TouchStoppedVelocity
    // Size: 0x1
    // Offset: 0x471
    bool m_TouchStoppedVelocity;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private UnityEngine.UIElements.VisualElement m_CapturedTarget
    // Size: 0x8
    // Offset: 0x478
    ::UnityEngine::UIElements::VisualElement* m_CapturedTarget;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::VisualElement*) == 0x8);
    // private UnityEngine.UIElements.EventCallback`1<UnityEngine.UIElements.PointerMoveEvent> m_CapturedTargetPointerMoveCallback
    // Size: 0x8
    // Offset: 0x480
    ::UnityEngine::UIElements::EventCallback_1<::UnityEngine::UIElements::PointerMoveEvent*>* m_CapturedTargetPointerMoveCallback;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::EventCallback_1<::UnityEngine::UIElements::PointerMoveEvent*>*) == 0x8);
    // private UnityEngine.UIElements.EventCallback`1<UnityEngine.UIElements.PointerUpEvent> m_CapturedTargetPointerUpCallback
    // Size: 0x8
    // Offset: 0x488
    ::UnityEngine::UIElements::EventCallback_1<::UnityEngine::UIElements::PointerUpEvent*>* m_CapturedTargetPointerUpCallback;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::EventCallback_1<::UnityEngine::UIElements::PointerUpEvent*>*) == 0x8);
    // private UnityEngine.UIElements.IVisualElementScheduledItem m_PostPointerUpAnimation
    // Size: 0x8
    // Offset: 0x490
    ::UnityEngine::UIElements::IVisualElementScheduledItem* m_PostPointerUpAnimation;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::IVisualElementScheduledItem*) == 0x8);
    public:
    // Get static field: static private readonly System.Single k_DefaultScrollDecelerationRate
    static float _get_k_DefaultScrollDecelerationRate();
    // Set static field: static private readonly System.Single k_DefaultScrollDecelerationRate
    static void _set_k_DefaultScrollDecelerationRate(float value);
    // Get static field: static private readonly System.Single k_DefaultElasticity
    static float _get_k_DefaultElasticity();
    // Set static field: static private readonly System.Single k_DefaultElasticity
    static void _set_k_DefaultElasticity(float value);
    // Get static field: static public readonly System.String ussClassName
    static ::StringW _get_ussClassName();
