// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.UIElements.ScrollView
#include "UnityEngine/UIElements/ScrollView.hpp"
// Including type: UnityEngine.UIElements.VisualElement/UxmlTraits
#include "UnityEngine/UIElements/VisualElement_UxmlTraits.hpp"
// Including type: UnityEngine.UIElements.ScrollViewMode
#include "UnityEngine/UIElements/ScrollViewMode.hpp"
// Including type: UnityEngine.UIElements.ScrollerVisibility
#include "UnityEngine/UIElements/ScrollerVisibility.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: UxmlEnumAttributeDescription`1<T>
  template<typename T>
  class UxmlEnumAttributeDescription_1;
  // Forward declaring type: UxmlBoolAttributeDescription
  class UxmlBoolAttributeDescription;
  // Forward declaring type: UxmlFloatAttributeDescription
  class UxmlFloatAttributeDescription;
  // Skipping declaration: VisualElement because it is already included!
  // Forward declaring type: IUxmlAttributes
  class IUxmlAttributes;
  // Forward declaring type: CreationContext
  struct CreationContext;
}
// Completed forward declares
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::UIElements::ScrollView::UxmlTraits);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UIElements::ScrollView::UxmlTraits*, "UnityEngine.UIElements", "ScrollView/UxmlTraits");
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Size: 0xD0
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.UIElements.ScrollView/UxmlTraits
  // [TokenAttribute] Offset: FFFFFFFF
  class ScrollView::UxmlTraits : public ::UnityEngine::UIElements::VisualElement::UxmlTraits {
    public:
    public:
    // private UnityEngine.UIElements.UxmlEnumAttributeDescription`1<UnityEngine.UIElements.ScrollViewMode> m_ScrollViewMode
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::UIElements::UxmlEnumAttributeDescription_1<::UnityEngine::UIElements::ScrollViewMode>* m_ScrollViewMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UxmlEnumAttributeDescription_1<::UnityEngine::UIElements::ScrollViewMode>*) == 0x8);
    // private UnityEngine.UIElements.UxmlEnumAttributeDescription`1<UnityEngine.UIElements.ScrollView/NestedInteractionKind> m_NestedInteractionKind
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::UIElements::UxmlEnumAttributeDescription_1<::UnityEngine::UIElements::ScrollView::NestedInteractionKind>* m_NestedInteractionKind;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UxmlEnumAttributeDescription_1<::UnityEngine::UIElements::ScrollView::NestedInteractionKind>*) == 0x8);
    // private UnityEngine.UIElements.UxmlBoolAttributeDescription m_ShowHorizontal
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::UIElements::UxmlBoolAttributeDescription* m_ShowHorizontal;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UxmlBoolAttributeDescription*) == 0x8);
    // private UnityEngine.UIElements.UxmlBoolAttributeDescription m_ShowVertical
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::UIElements::UxmlBoolAttributeDescription* m_ShowVertical;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UxmlBoolAttributeDescription*) == 0x8);
    // private UnityEngine.UIElements.UxmlEnumAttributeDescription`1<UnityEngine.UIElements.ScrollerVisibility> m_HorizontalScrollerVisibility
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::UIElements::UxmlEnumAttributeDescription_1<::UnityEngine::UIElements::ScrollerVisibility>* m_HorizontalScrollerVisibility;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UxmlEnumAttributeDescription_1<::UnityEngine::UIElements::ScrollerVisibility>*) == 0x8);
    // private UnityEngine.UIElements.UxmlEnumAttributeDescription`1<UnityEngine.UIElements.ScrollerVisibility> m_VerticalScrollerVisibility
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::UIElements::UxmlEnumAttributeDescription_1<::UnityEngine::UIElements::ScrollerVisibility>* m_VerticalScrollerVisibility;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UxmlEnumAttributeDescription_1<::UnityEngine::UIElements::ScrollerVisibility>*) == 0x8);
    // private UnityEngine.UIElements.UxmlFloatAttributeDescription m_HorizontalPageSize
    // Size: 0x8
    // Offset: 0xA0
    ::UnityEngine::UIElements::UxmlFloatAttributeDescription* m_HorizontalPageSize;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UxmlFloatAttributeDescription*) == 0x8);
    // private UnityEngine.UIElements.UxmlFloatAttributeDescription m_VerticalPageSize
    // Size: 0x8
    // Offset: 0xA8
    ::UnityEngine::UIElements::UxmlFloatAttributeDescription* m_VerticalPageSize;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UxmlFloatAttributeDescription*) == 0x8);
    // private UnityEngine.UIElements.UxmlFloatAttributeDescription m_MouseWheelScrollSize
    // Size: 0x8
    // Offset: 0xB0
    ::UnityEngine::UIElements::UxmlFloatAttributeDescription* m_MouseWheelScrollSize;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UxmlFloatAttributeDescription*) == 0x8);
    // private UnityEngine.UIElements.UxmlEnumAttributeDescription`1<UnityEngine.UIElements.ScrollView/TouchScrollBehavior> m_TouchScrollBehavior
    // Size: 0x8
    // Offset: 0xB8
    ::UnityEngine::UIElements::UxmlEnumAttributeDescription_1<::UnityEngine::UIElements::ScrollView::TouchScrollBehavior>* m_TouchScrollBehavior;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UxmlEnumAttributeDescription_1<::UnityEngine::UIElements::ScrollView::TouchScrollBehavior>*) == 0x8);
    // private UnityEngine.UIElements.UxmlFloatAttributeDescription m_ScrollDecelerationRate
    // Size: 0x8
    // Offset: 0xC0
    ::UnityEngine::UIElements::UxmlFloatAttributeDescription* m_ScrollDecelerationRate;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UxmlFloatAttributeDescription*) == 0x8);
    // private UnityEngine.UIElements.UxmlFloatAttributeDescription m_Elasticity
    // Size: 0x8
    // Offset: 0xC8
    ::UnityEngine::UIElements::UxmlFloatAttributeDescription* m_Elasticity;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UxmlFloatAttributeDescription*) == 0x8);
    public:
    // Get instance field reference: private UnityEngine.UIElements.UxmlEnumAttributeDescription`1<UnityEngine.UIElements.ScrollViewMode> m_ScrollViewMode
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::UxmlEnumAttributeDescription_1<::UnityEngine::UIElements::ScrollViewMode>*& dyn_m_ScrollViewMode();
    // Get instance field reference: private UnityEngine.UIElements.UxmlEnumAttributeDescription`1<UnityEngine.UIElements.ScrollView/NestedInteractionKind> m_NestedInteractionKind
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::UxmlEnumAttributeDescription_1<::UnityEngine::UIElements::ScrollView::NestedInteractionKind>*& dyn_m_NestedInteractionKind();
    // Get instance field reference: private UnityEngine.UIElements.UxmlBoolAttributeDescription m_ShowHorizontal
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::UxmlBoolAttributeDescription*& dyn_m_ShowHorizontal();
    // Get instance field reference: private UnityEngine.UIElements.UxmlBoolAttributeDescription m_ShowVertical
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::UxmlBoolAttributeDescription*& dyn_m_ShowVertical();
    // Get instance field reference: private UnityEngine.UIElements.UxmlEnumAttributeDescription`1<UnityEngine.UIElements.ScrollerVisibility> m_HorizontalScrollerVisibility
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::UxmlEnumAttributeDescription_1<::UnityEngine::UIElements::ScrollerVisibility>*& dyn_m_HorizontalScrollerVisibility();
    // Get instance field reference: private UnityEngine.UIElements.UxmlEnumAttributeDescription`1<UnityEngine.UIElements.ScrollerVisibility> m_VerticalScrollerVisibility
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::UxmlEnumAttributeDescription_1<::UnityEngine::UIElements::ScrollerVisibility>*& dyn_m_VerticalScrollerVisibility();
    // Get instance field reference: private UnityEngine.UIElements.UxmlFloatAttributeDescription m_HorizontalPageSize
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::UxmlFloatAttributeDescription*& dyn_m_HorizontalPageSize();
    // Get instance field reference: private UnityEngine.UIElements.UxmlFloatAttributeDescription m_VerticalPageSize
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::UxmlFloatAttributeDescription*& dyn_m_VerticalPageSize();
    // Get instance field reference: private UnityEngine.UIElements.UxmlFloatAttributeDescription m_MouseWheelScrollSize
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::UxmlFloatAttributeDescription*& dyn_m_MouseWheelScrollSize();
    // Get instance field reference: private UnityEngine.UIElements.UxmlEnumAttributeDescription`1<UnityEngine.UIElements.ScrollView/TouchScrollBehavior> m_TouchScrollBehavior
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::UxmlEnumAttributeDescription_1<::UnityEngine::UIElements::ScrollView::TouchScrollBehavior>*& dyn_m_TouchScrollBehavior();
    // Get instance field reference: private UnityEngine.UIElements.UxmlFloatAttributeDescription m_ScrollDecelerationRate
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::UxmlFloatAttributeDescription*& dyn_m_ScrollDecelerationRate();
    // Get instance field reference: private UnityEngine.UIElements.UxmlFloatAttributeDescription m_Elasticity
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::UxmlFloatAttributeDescription*& dyn_m_Elasticity();
    // public override System.Void Init(UnityEngine.UIElements.VisualElement ve, UnityEngine.UIElements.IUxmlAttributes bag, UnityEngine.UIElements.CreationContext cc)
    // Offset: 0x562C58C
    // Implemented from: UnityEngine.UIElements.VisualElement/UxmlTraits
    // Base method: System.Void UxmlTraits::Init(UnityEngine.UIElements.VisualElement ve, UnityEngine.UIElements.IUxmlAttributes bag, UnityEngine.UIElements.CreationContext cc)
    void Init(::UnityEngine::UIElements::VisualElement* ve, ::UnityEngine::UIElements::IUxmlAttributes* bag, ::UnityEngine::UIElements::CreationContext cc);
    // public System.Void .ctor()
    // Offset: 0x562C958
    // Implemented from: UnityEngine.UIElements.VisualElement/UxmlTraits
    // Base method: System.Void UxmlTraits::.ctor()
    // Base method: System.Void UxmlTraits::.ctor()
    // Base method: System.Void BaseUxmlTraits::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static ScrollView::UxmlTraits* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::UIElements::ScrollView::UxmlTraits::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<ScrollView::UxmlTraits*, creationType>()));
    }
  }; // UnityEngine.UIElements.ScrollView/UxmlTraits
  #pragma pack(pop)
  static check_size<sizeof(ScrollView::UxmlTraits), 200 + sizeof(::UnityEngine::UIElements::UxmlFloatAttributeDescription*)> __UnityEngine_UIElements_ScrollView_UxmlTraitsSizeCheck;
  static_assert(sizeof(ScrollView::UxmlTraits) == 0xD0);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: UnityEngine::UIElements::ScrollView::UxmlTraits::Init
// Il2CppName: Init
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (UnityEngine::UIElements::ScrollView::UxmlTraits::*)(::UnityEngine::UIElements::VisualElement*, ::UnityEngine::UIElements::IUxmlAttributes*, ::UnityEngine::UIElements::CreationContext)>(&UnityEngine::UIElements::ScrollView::UxmlTraits::Init)> {
  static const MethodInfo* get() {
    static auto* ve = &::il2cpp_utils::GetClassFromName("UnityEngine.UIElements", "VisualElement")->byval_arg;
    static auto* bag = &::il2cpp_utils::GetClassFromName("UnityEngine.UIElements", "IUxmlAttributes")->byval_arg;
    static auto* cc = &::il2cpp_utils::GetClassFromName("UnityEngine.UIElements", "CreationContext")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::UIElements::ScrollView::UxmlTraits*), "Init", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{ve, bag, cc});
  }
};
// Writing MetadataGetter for method: UnityEngine::UIElements::ScrollView::UxmlTraits::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
