// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.ScriptableObject
#include "UnityEngine/ScriptableObject.hpp"
// Including type: UnityEngine.UIElements.StyleSheets.Dimension
#include "UnityEngine/UIElements/StyleSheets/Dimension.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: UnityEngine.UIElements.StyleSheets.ScalableImage
#include "UnityEngine/UIElements/StyleSheets/ScalableImage.hpp"
// Including type: UnityEngine.UIElements.StyleValueType
#include "UnityEngine/UIElements/StyleValueType.hpp"
// Including type: UnityEngine.UIElements.StyleValueHandle
#include "UnityEngine/UIElements/StyleValueHandle.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: UnityEngine::UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: StyleRule
  class StyleRule;
  // Forward declaring type: StyleComplexSelector
  class StyleComplexSelector;
  // Forward declaring type: StyleValueKeyword
  struct StyleValueKeyword;
  // Forward declaring type: StyleValueFunction
  struct StyleValueFunction;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Skipping declaration: Object because it is already included!
}
// Completed forward declares
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: StyleSheet
  class StyleSheet;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::UIElements::StyleSheet);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UIElements::StyleSheet*, "UnityEngine.UIElements", "StyleSheet");
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Size: 0x91
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.UIElements.StyleSheet
  // [TokenAttribute] Offset: FFFFFFFF
  class StyleSheet : public ::UnityEngine::ScriptableObject {
    public:
    // Nested type: ::UnityEngine::UIElements::StyleSheet::ImportStruct
    struct ImportStruct;
    // Size: 0x10
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.UIElements.StyleSheet/ImportStruct
    // [TokenAttribute] Offset: FFFFFFFF
    struct ImportStruct/*, public ::System::ValueType*/ {
      public:
      public:
      // public UnityEngine.UIElements.StyleSheet styleSheet
      // Size: 0x8
      // Offset: 0x0
      ::UnityEngine::UIElements::StyleSheet* styleSheet;
      // Field size check
      static_assert(sizeof(::UnityEngine::UIElements::StyleSheet*) == 0x8);
      // public System.String[] mediaQueries
      // Size: 0x8
      // Offset: 0x8
      ::ArrayW<::StringW> mediaQueries;
      // Field size check
      static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
      public:
      // Creating value type constructor for type: ImportStruct
      constexpr ImportStruct(::UnityEngine::UIElements::StyleSheet* styleSheet_ = {}, ::ArrayW<::StringW> mediaQueries_ = ::ArrayW<::StringW>(static_cast<void*>(nullptr))) noexcept : styleSheet{styleSheet_}, mediaQueries{mediaQueries_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public UnityEngine.UIElements.StyleSheet styleSheet
      [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::StyleSheet*& dyn_styleSheet();
      // Get instance field reference: public System.String[] mediaQueries
      [[deprecated("Use field access instead!")]] ::ArrayW<::StringW>& dyn_mediaQueries();
    }; // UnityEngine.UIElements.StyleSheet/ImportStruct
    #pragma pack(pop)
    static check_size<sizeof(StyleSheet::ImportStruct), 8 + sizeof(::ArrayW<::StringW>)> __UnityEngine_UIElements_StyleSheet_ImportStructSizeCheck;
    static_assert(sizeof(StyleSheet::ImportStruct) == 0x10);
    public:
    // private System.Boolean m_ImportedWithErrors
    // Size: 0x1
    // Offset: 0x18
    bool m_ImportedWithErrors;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_ImportedWithWarnings
    // Size: 0x1
    // Offset: 0x19
    bool m_ImportedWithWarnings;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_ImportedWithWarnings and: m_Rules
    char __padding1[0x6] = {};
    // private UnityEngine.UIElements.StyleRule[] m_Rules
    // Size: 0x8
    // Offset: 0x20
    ::ArrayW<::UnityEngine::UIElements::StyleRule*> m_Rules;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::UIElements::StyleRule*>) == 0x8);
    // private UnityEngine.UIElements.StyleComplexSelector[] m_ComplexSelectors
    // Size: 0x8
    // Offset: 0x28
    ::ArrayW<::UnityEngine::UIElements::StyleComplexSelector*> m_ComplexSelectors;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::UIElements::StyleComplexSelector*>) == 0x8);
    // System.Single[] floats
    // Size: 0x8
    // Offset: 0x30
    ::ArrayW<float> floats;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    // UnityEngine.UIElements.StyleSheets.Dimension[] dimensions
    // Size: 0x8
    // Offset: 0x38
    ::ArrayW<::UnityEngine::UIElements::StyleSheets::Dimension> dimensions;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::UIElements::StyleSheets::Dimension>) == 0x8);
    // UnityEngine.Color[] colors
    // Size: 0x8
    // Offset: 0x40
    ::ArrayW<::UnityEngine::Color> colors;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Color>) == 0x8);
    // System.String[] strings
    // Size: 0x8
    // Offset: 0x48
    ::ArrayW<::StringW> strings;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // UnityEngine.Object[] assets
    // Size: 0x8
    // Offset: 0x50
    ::ArrayW<::UnityEngine::Object*> assets;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Object*>) == 0x8);
    // UnityEngine.UIElements.StyleSheet/ImportStruct[] imports
    // Size: 0x8
    // Offset: 0x58
    ::ArrayW<::UnityEngine::UIElements::StyleSheet::ImportStruct> imports;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::UIElements::StyleSheet::ImportStruct>) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.UIElements.StyleSheet> m_FlattenedImportedStyleSheets
    // Size: 0x8
    // Offset: 0x60
    ::System::Collections::Generic::List_1<::UnityEngine::UIElements::StyleSheet*>* m_FlattenedImportedStyleSheets;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::UIElements::StyleSheet*>*) == 0x8);
    // private System.Int32 m_ContentHash
    // Size: 0x4
    // Offset: 0x68
    int m_ContentHash;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: m_ContentHash and: scalableImages
    char __padding11[0x4] = {};
    // UnityEngine.UIElements.StyleSheets.ScalableImage[] scalableImages
    // Size: 0x8
    // Offset: 0x70
    ::ArrayW<::UnityEngine::UIElements::StyleSheets::ScalableImage> scalableImages;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::UIElements::StyleSheets::ScalableImage>) == 0x8);
    // System.Collections.Generic.Dictionary`2<System.String,UnityEngine.UIElements.StyleComplexSelector> orderedNameSelectors
    // Size: 0x8
    // Offset: 0x78
    ::System::Collections::Generic::Dictionary_2<::StringW, ::UnityEngine::UIElements::StyleComplexSelector*>* orderedNameSelectors;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, ::UnityEngine::UIElements::StyleComplexSelector*>*) == 0x8);
    // System.Collections.Generic.Dictionary`2<System.String,UnityEngine.UIElements.StyleComplexSelector> orderedTypeSelectors
    // Size: 0x8
    // Offset: 0x80
    ::System::Collections::Generic::Dictionary_2<::StringW, ::UnityEngine::UIElements::StyleComplexSelector*>* orderedTypeSelectors;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, ::UnityEngine::UIElements::StyleComplexSelector*>*) == 0x8);
    // System.Collections.Generic.Dictionary`2<System.String,UnityEngine.UIElements.StyleComplexSelector> orderedClassSelectors
    // Size: 0x8
    // Offset: 0x88
    ::System::Collections::Generic::Dictionary_2<::StringW, ::UnityEngine::UIElements::StyleComplexSelector*>* orderedClassSelectors;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, ::UnityEngine::UIElements::StyleComplexSelector*>*) == 0x8);
    // private System.Boolean m_IsDefaultStyleSheet
    // Size: 0x1
    // Offset: 0x90
    bool m_IsDefaultStyleSheet;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get static field: static private System.String kCustomPropertyMarker
    static ::StringW _get_kCustomPropertyMarker();
    // Set static field: static private System.String kCustomPropertyMarker
    static void _set_kCustomPropertyMarker(::StringW value);
    // Get instance field reference: private System.Boolean m_ImportedWithErrors
    [[deprecated("Use field access instead!")]] bool& dyn_m_ImportedWithErrors();
    // Get instance field reference: private System.Boolean m_ImportedWithWarnings
    [[deprecated("Use field access instead!")]] bool& dyn_m_ImportedWithWarnings();
    // Get instance field reference: private UnityEngine.UIElements.StyleRule[] m_Rules
