// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.UIElements.StyleSelectorPart
#include "UnityEngine/UIElements/StyleSelectorPart.hpp"
// Including type: UnityEngine.UIElements.StyleSelectorRelationship
#include "UnityEngine/UIElements/StyleSelectorRelationship.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UIElements
namespace UnityEngine::UIElements {
}
// Completed forward declares
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: StyleSelector
  class StyleSelector;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::UIElements::StyleSelector);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UIElements::StyleSelector*, "UnityEngine.UIElements", "StyleSelector");
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Size: 0x24
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.UIElements.StyleSelector
  // [TokenAttribute] Offset: FFFFFFFF
  class StyleSelector : public ::Il2CppObject {
    public:
    // Nested type: ::UnityEngine::UIElements::StyleSelector::$$c
    class $$c;
    public:
    // private UnityEngine.UIElements.StyleSelectorPart[] m_Parts
    // Size: 0x8
    // Offset: 0x10
    ::ArrayW<::UnityEngine::UIElements::StyleSelectorPart> m_Parts;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::UIElements::StyleSelectorPart>) == 0x8);
    // private UnityEngine.UIElements.StyleSelectorRelationship m_PreviousRelationship
    // Size: 0x4
    // Offset: 0x18
    ::UnityEngine::UIElements::StyleSelectorRelationship m_PreviousRelationship;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::StyleSelectorRelationship) == 0x4);
    // System.Int32 pseudoStateMask
    // Size: 0x4
    // Offset: 0x1C
    int pseudoStateMask;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 negatedPseudoStateMask
    // Size: 0x4
    // Offset: 0x20
    int negatedPseudoStateMask;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Get instance field reference: private UnityEngine.UIElements.StyleSelectorPart[] m_Parts
    [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::UIElements::StyleSelectorPart>& dyn_m_Parts();
    // Get instance field reference: private UnityEngine.UIElements.StyleSelectorRelationship m_PreviousRelationship
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::StyleSelectorRelationship& dyn_m_PreviousRelationship();
    // Get instance field reference: System.Int32 pseudoStateMask
    [[deprecated("Use field access instead!")]] int& dyn_pseudoStateMask();
    // Get instance field reference: System.Int32 negatedPseudoStateMask
    [[deprecated("Use field access instead!")]] int& dyn_negatedPseudoStateMask();
    // public UnityEngine.UIElements.StyleSelectorPart[] get_parts()
    // Offset: 0x56B03F8
    ::ArrayW<::UnityEngine::UIElements::StyleSelectorPart> get_parts();
    // System.Void set_parts(UnityEngine.UIElements.StyleSelectorPart[] value)
    // Offset: 0x56B0C10
    void set_parts(::ArrayW<::UnityEngine::UIElements::StyleSelectorPart> value);
    // public UnityEngine.UIElements.StyleSelectorRelationship get_previousRelationship()
    // Offset: 0x56B0C18
    ::UnityEngine::UIElements::StyleSelectorRelationship get_previousRelationship();
    // System.Void set_previousRelationship(UnityEngine.UIElements.StyleSelectorRelationship value)
    // Offset: 0x56B0C20
    void set_previousRelationship(::UnityEngine::UIElements::StyleSelectorRelationship value);
    // public System.Void .ctor()
    // Offset: 0x56B0D70
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static StyleSelector* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::UIElements::StyleSelector::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<StyleSelector*, creationType>()));
    }
    // public override System.String ToString()
    // Offset: 0x56B0C28
    // Implemented from: System.Object
    // Base method: System.String Object::ToString()
    ::StringW ToString();
  }; // UnityEngine.UIElements.StyleSelector
  #pragma pack(pop)
  static check_size<sizeof(StyleSelector), 32 + sizeof(int)> __UnityEngine_UIElements_StyleSelectorSizeCheck;
  static_assert(sizeof(StyleSelector) == 0x24);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: UnityEngine::UIElements::StyleSelector::get_parts
// Il2CppName: get_parts
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::ArrayW<::UnityEngine::UIElements::StyleSelectorPart> (UnityEngine::UIElements::StyleSelector::*)()>(&UnityEngine::UIElements::StyleSelector::get_parts)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::UIElements::StyleSelector*), "get_parts", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: UnityEngine::UIElements::StyleSelector::set_parts
// Il2CppName: set_parts
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (UnityEngine::UIElements::StyleSelector::*)(::ArrayW<::UnityEngine::UIElements::StyleSelectorPart>)>(&UnityEngine::UIElements::StyleSelector::set_parts)> {
  static const MethodInfo* get() {
    static auto* value = &il2cpp_functions::array_class_get(::il2cpp_utils::GetClassFromName("UnityEngine.UIElements", "StyleSelectorPart"), 1)->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::UIElements::StyleSelector*), "set_parts", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: UnityEngine::UIElements::StyleSelector::get_previousRelationship
// Il2CppName: get_previousRelationship
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::UIElements::StyleSelectorRelationship (UnityEngine::UIElements::StyleSelector::*)()>(&UnityEngine::UIElements::StyleSelector::get_previousRelationship)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::UIElements::StyleSelector*), "get_previousRelationship", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: UnityEngine::UIElements::StyleSelector::set_previousRelationship
// Il2CppName: set_previousRelationship
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (UnityEngine::UIElements::StyleSelector::*)(::UnityEngine::UIElements::StyleSelectorRelationship)>(&UnityEngine::UIElements::StyleSelector::set_previousRelationship)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("UnityEngine.UIElements", "StyleSelectorRelationship")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::UIElements::StyleSelector*), "set_previousRelationship", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: UnityEngine::UIElements::StyleSelector::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: UnityEngine::UIElements::StyleSelector::ToString
// Il2CppName: ToString
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::StringW (UnityEngine::UIElements::StyleSelector::*)()>(&UnityEngine::UIElements::StyleSelector::ToString)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::UIElements::StyleSelector*), "ToString", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
