// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.UIElements.IStylePropertyAnimationSystem
#include "UnityEngine/UIElements/IStylePropertyAnimationSystem.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: VisualElement
  class VisualElement;
  // Forward declaring type: Length
  struct Length;
  // Forward declaring type: Background
  struct Background;
  // Forward declaring type: FontDefinition
  struct FontDefinition;
  // Forward declaring type: TextShadow
  struct TextShadow;
  // Forward declaring type: Scale
  struct Scale;
  // Forward declaring type: Rotate
  struct Rotate;
  // Forward declaring type: Translate
  struct Translate;
  // Forward declaring type: TransformOrigin
  struct TransformOrigin;
  // Forward declaring type: BackgroundPosition
  struct BackgroundPosition;
  // Forward declaring type: BackgroundRepeat
  struct BackgroundRepeat;
  // Forward declaring type: BackgroundSize
  struct BackgroundSize;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Func`2<T, TResult>
  template<typename T, typename TResult>
  class Func_2;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Color
  struct Color;
  // Forward declaring type: Font
  class Font;
}
// Completed forward declares
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: StylePropertyAnimationSystem
  class StylePropertyAnimationSystem;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::UIElements::StylePropertyAnimationSystem);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UIElements::StylePropertyAnimationSystem*, "UnityEngine.UIElements", "StylePropertyAnimationSystem");
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Size: 0xA0
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.UIElements.StylePropertyAnimationSystem
  // [TokenAttribute] Offset: FFFFFFFF
  class StylePropertyAnimationSystem : public ::Il2CppObject/*, public ::UnityEngine::UIElements::IStylePropertyAnimationSystem*/ {
    public:
    // Nested type: ::UnityEngine::UIElements::StylePropertyAnimationSystem::TransitionState
    struct TransitionState;
    // Nested type: ::UnityEngine::UIElements::StylePropertyAnimationSystem::AnimationDataSet_2<TTimingData, TStyleData>
    template<typename TTimingData, typename TStyleData>
    struct AnimationDataSet_2;
    // Nested type: ::UnityEngine::UIElements::StylePropertyAnimationSystem::ElementPropertyPair
    struct ElementPropertyPair;
    // Nested type: ::UnityEngine::UIElements::StylePropertyAnimationSystem::Values
    class Values;
    // Nested type: ::UnityEngine::UIElements::StylePropertyAnimationSystem::Values_1<T>
    template<typename T>
    class Values_1;
    // Nested type: ::UnityEngine::UIElements::StylePropertyAnimationSystem::ValuesFloat
    class ValuesFloat;
    // Nested type: ::UnityEngine::UIElements::StylePropertyAnimationSystem::ValuesInt
    class ValuesInt;
    // Nested type: ::UnityEngine::UIElements::StylePropertyAnimationSystem::ValuesLength
    class ValuesLength;
    // Nested type: ::UnityEngine::UIElements::StylePropertyAnimationSystem::ValuesColor
    class ValuesColor;
    // Nested type: ::UnityEngine::UIElements::StylePropertyAnimationSystem::ValuesDiscrete_1<T>
    template<typename T>
    class ValuesDiscrete_1;
    // Nested type: ::UnityEngine::UIElements::StylePropertyAnimationSystem::ValuesBackground
    class ValuesBackground;
    // Nested type: ::UnityEngine::UIElements::StylePropertyAnimationSystem::ValuesFontDefinition
    class ValuesFontDefinition;
    // Nested type: ::UnityEngine::UIElements::StylePropertyAnimationSystem::ValuesFont
    class ValuesFont;
    // Nested type: ::UnityEngine::UIElements::StylePropertyAnimationSystem::ValuesTextShadow
    class ValuesTextShadow;
    // Nested type: ::UnityEngine::UIElements::StylePropertyAnimationSystem::ValuesScale
    class ValuesScale;
    // Nested type: ::UnityEngine::UIElements::StylePropertyAnimationSystem::ValuesRotate
    class ValuesRotate;
    // Nested type: ::UnityEngine::UIElements::StylePropertyAnimationSystem::ValuesTranslate
    class ValuesTranslate;
    // Nested type: ::UnityEngine::UIElements::StylePropertyAnimationSystem::ValuesTransformOrigin
    class ValuesTransformOrigin;
    // Nested type: ::UnityEngine::UIElements::StylePropertyAnimationSystem::ValuesBackgroundPosition
    class ValuesBackgroundPosition;
    // Nested type: ::UnityEngine::UIElements::StylePropertyAnimationSystem::ValuesBackgroundRepeat
    class ValuesBackgroundRepeat;
    // Nested type: ::UnityEngine::UIElements::StylePropertyAnimationSystem::ValuesBackgroundSize
    class ValuesBackgroundSize;
    public:
    // private System.Int64 m_CurrentTimeMs
    // Size: 0x8
    // Offset: 0x10
    int64_t m_CurrentTimeMs;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private UnityEngine.UIElements.StylePropertyAnimationSystem/ValuesFloat m_Floats
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::UIElements::StylePropertyAnimationSystem::ValuesFloat* m_Floats;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::StylePropertyAnimationSystem::ValuesFloat*) == 0x8);
    // private UnityEngine.UIElements.StylePropertyAnimationSystem/ValuesInt m_Ints
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::UIElements::StylePropertyAnimationSystem::ValuesInt* m_Ints;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::StylePropertyAnimationSystem::ValuesInt*) == 0x8);
    // private UnityEngine.UIElements.StylePropertyAnimationSystem/ValuesLength m_Lengths
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::UIElements::StylePropertyAnimationSystem::ValuesLength* m_Lengths;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::StylePropertyAnimationSystem::ValuesLength*) == 0x8);
    // private UnityEngine.UIElements.StylePropertyAnimationSystem/ValuesColor m_Colors
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::UIElements::StylePropertyAnimationSystem::ValuesColor* m_Colors;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::StylePropertyAnimationSystem::ValuesColor*) == 0x8);
    // private UnityEngine.UIElements.StylePropertyAnimationSystem/ValuesBackground m_Backgrounds
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::UIElements::StylePropertyAnimationSystem::ValuesBackground* m_Backgrounds;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::StylePropertyAnimationSystem::ValuesBackground*) == 0x8);
    // private UnityEngine.UIElements.StylePropertyAnimationSystem/ValuesFontDefinition m_FontDefinitions
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::UIElements::StylePropertyAnimationSystem::ValuesFontDefinition* m_FontDefinitions;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::StylePropertyAnimationSystem::ValuesFontDefinition*) == 0x8);
    // private UnityEngine.UIElements.StylePropertyAnimationSystem/ValuesFont m_Fonts
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::UIElements::StylePropertyAnimationSystem::ValuesFont* m_Fonts;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::StylePropertyAnimationSystem::ValuesFont*) == 0x8);
    // private UnityEngine.UIElements.StylePropertyAnimationSystem/ValuesTextShadow m_TextShadows
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::UIElements::StylePropertyAnimationSystem::ValuesTextShadow* m_TextShadows;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::StylePropertyAnimationSystem::ValuesTextShadow*) == 0x8);
    // private UnityEngine.UIElements.StylePropertyAnimationSystem/ValuesScale m_Scale
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::UIElements::StylePropertyAnimationSystem::ValuesScale* m_Scale;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::StylePropertyAnimationSystem::ValuesScale*) == 0x8);
    // private UnityEngine.UIElements.StylePropertyAnimationSystem/ValuesRotate m_Rotate
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::UIElements::StylePropertyAnimationSystem::ValuesRotate* m_Rotate;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::StylePropertyAnimationSystem::ValuesRotate*) == 0x8);
    // private UnityEngine.UIElements.StylePropertyAnimationSystem/ValuesTranslate m_Translate
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::UIElements::StylePropertyAnimationSystem::ValuesTranslate* m_Translate;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::StylePropertyAnimationSystem::ValuesTranslate*) == 0x8);
    // private UnityEngine.UIElements.StylePropertyAnimationSystem/ValuesTransformOrigin m_TransformOrigin
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::UIElements::StylePropertyAnimationSystem::ValuesTransformOrigin* m_TransformOrigin;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::StylePropertyAnimationSystem::ValuesTransformOrigin*) == 0x8);
    // private UnityEngine.UIElements.StylePropertyAnimationSystem/ValuesBackgroundPosition m_BackgroundPosition
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::UIElements::StylePropertyAnimationSystem::ValuesBackgroundPosition* m_BackgroundPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::StylePropertyAnimationSystem::ValuesBackgroundPosition*) == 0x8);
    // private UnityEngine.UIElements.StylePropertyAnimationSystem/ValuesBackgroundRepeat m_BackgroundRepeat
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::UIElements::StylePropertyAnimationSystem::ValuesBackgroundRepeat* m_BackgroundRepeat;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::StylePropertyAnimationSystem::ValuesBackgroundRepeat*) == 0x8);
    // private UnityEngine.UIElements.StylePropertyAnimationSystem/ValuesBackgroundSize m_BackgroundSize
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::UIElements::StylePropertyAnimationSystem::ValuesBackgroundSize* m_BackgroundSize;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::StylePropertyAnimationSystem::ValuesBackgroundSize*) == 0x8);
    // private readonly System.Collections.Generic.List`1<UnityEngine.UIElements.StylePropertyAnimationSystem/Values> m_AllValues
    // Size: 0x8
    // Offset: 0x90
    ::System::Collections::Generic::List_1<::UnityEngine::UIElements::StylePropertyAnimationSystem::Values*>* m_AllValues;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::UIElements::StylePropertyAnimationSystem::Values*>*) == 0x8);
    // private readonly System.Collections.Generic.Dictionary`2<UnityEngine.UIElements.StyleSheets.StylePropertyId,UnityEngine.UIElements.StylePropertyAnimationSystem/Values> m_PropertyToValues
    // Size: 0x8
    // Offset: 0x98
    ::System::Collections::Generic::Dictionary_2<::UnityEngine::UIElements::StyleSheets::StylePropertyId, ::UnityEngine::UIElements::StylePropertyAnimationSystem::Values*>* m_PropertyToValues;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::UnityEngine::UIElements::StyleSheets::StylePropertyId, ::UnityEngine::UIElements::StylePropertyAnimationSystem::Values*>*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::UnityEngine::UIElements::IStylePropertyAnimationSystem
    operator ::UnityEngine::UIElements::IStylePropertyAnimationSystem() noexcept {
      return *reinterpret_cast<::UnityEngine::UIElements::IStylePropertyAnimationSystem*>(this);
    }
    // Get instance field reference: private System.Int64 m_CurrentTimeMs
    [[deprecated("Use field access instead!")]] int64_t& dyn_m_CurrentTimeMs();
