// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.UIElements.StyleSheets.MatchResultInfo
#include "UnityEngine/UIElements/StyleSheets/MatchResultInfo.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine::UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: StyleSheet
  class StyleSheet;
  // Forward declaring type: StyleVariableContext
  class StyleVariableContext;
  // Forward declaring type: VisualElement
  class VisualElement;
  // Forward declaring type: AncestorFilter
  class AncestorFilter;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
}
// Completed forward declares
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: StyleMatchingContext
  class StyleMatchingContext;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::UIElements::StyleMatchingContext);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UIElements::StyleMatchingContext*, "UnityEngine.UIElements", "StyleMatchingContext");
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Size: 0x38
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.UIElements.StyleMatchingContext
  // [TokenAttribute] Offset: FFFFFFFF
  class StyleMatchingContext : public ::Il2CppObject {
    public:
    public:
    // private System.Collections.Generic.List`1<UnityEngine.UIElements.StyleSheet> m_StyleSheetStack
    // Size: 0x8
    // Offset: 0x10
    ::System::Collections::Generic::List_1<::UnityEngine::UIElements::StyleSheet*>* m_StyleSheetStack;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::UIElements::StyleSheet*>*) == 0x8);
    // public UnityEngine.UIElements.StyleVariableContext variableContext
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::UIElements::StyleVariableContext* variableContext;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::StyleVariableContext*) == 0x8);
    // public UnityEngine.UIElements.VisualElement currentElement
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::UIElements::VisualElement* currentElement;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::VisualElement*) == 0x8);
    // public System.Action`2<UnityEngine.UIElements.VisualElement,UnityEngine.UIElements.StyleSheets.MatchResultInfo> processResult
    // Size: 0x8
    // Offset: 0x28
    ::System::Action_2<::UnityEngine::UIElements::VisualElement*, ::UnityEngine::UIElements::StyleSheets::MatchResultInfo>* processResult;
    // Field size check
    static_assert(sizeof(::System::Action_2<::UnityEngine::UIElements::VisualElement*, ::UnityEngine::UIElements::StyleSheets::MatchResultInfo>*) == 0x8);
    // public UnityEngine.UIElements.AncestorFilter ancestorFilter
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::UIElements::AncestorFilter* ancestorFilter;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::AncestorFilter*) == 0x8);
    public:
    // Get instance field reference: private System.Collections.Generic.List`1<UnityEngine.UIElements.StyleSheet> m_StyleSheetStack
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::UnityEngine::UIElements::StyleSheet*>*& dyn_m_StyleSheetStack();
    // Get instance field reference: public UnityEngine.UIElements.StyleVariableContext variableContext
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::StyleVariableContext*& dyn_variableContext();
    // Get instance field reference: public UnityEngine.UIElements.VisualElement currentElement
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::VisualElement*& dyn_currentElement();
    // Get instance field reference: public System.Action`2<UnityEngine.UIElements.VisualElement,UnityEngine.UIElements.StyleSheets.MatchResultInfo> processResult
    [[deprecated("Use field access instead!")]] ::System::Action_2<::UnityEngine::UIElements::VisualElement*, ::UnityEngine::UIElements::StyleSheets::MatchResultInfo>*& dyn_processResult();
    // Get instance field reference: public UnityEngine.UIElements.AncestorFilter ancestorFilter
    [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::AncestorFilter*& dyn_ancestorFilter();
    // public System.Int32 get_styleSheetCount()
    // Offset: 0x55C6EA8
    int get_styleSheetCount();
    // public System.Void .ctor(System.Action`2<UnityEngine.UIElements.VisualElement,UnityEngine.UIElements.StyleSheets.MatchResultInfo> processResult)
    // Offset: 0x55C6EF0
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static StyleMatchingContext* New_ctor(::System::Action_2<::UnityEngine::UIElements::VisualElement*, ::UnityEngine::UIElements::StyleSheets::MatchResultInfo>* processResult) {
      static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::UIElements::StyleMatchingContext::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<StyleMatchingContext*, creationType>(processResult)));
    }
    // public System.Void AddStyleSheet(UnityEngine.UIElements.StyleSheet sheet)
    // Offset: 0x55C7018
    void AddStyleSheet(::UnityEngine::UIElements::StyleSheet* sheet);
    // public System.Void RemoveStyleSheetRange(System.Int32 index, System.Int32 count)
    // Offset: 0x55C7118
    void RemoveStyleSheetRange(int index, int count);
    // public UnityEngine.UIElements.StyleSheet GetStyleSheetAt(System.Int32 index)
    // Offset: 0x55C7180
    ::UnityEngine::UIElements::StyleSheet* GetStyleSheetAt(int index);
  }; // UnityEngine.UIElements.StyleMatchingContext
  #pragma pack(pop)
  static check_size<sizeof(StyleMatchingContext), 48 + sizeof(::UnityEngine::UIElements::AncestorFilter*)> __UnityEngine_UIElements_StyleMatchingContextSizeCheck;
  static_assert(sizeof(StyleMatchingContext) == 0x38);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: UnityEngine::UIElements::StyleMatchingContext::get_styleSheetCount
// Il2CppName: get_styleSheetCount
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<int (UnityEngine::UIElements::StyleMatchingContext::*)()>(&UnityEngine::UIElements::StyleMatchingContext::get_styleSheetCount)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::UIElements::StyleMatchingContext*), "get_styleSheetCount", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: UnityEngine::UIElements::StyleMatchingContext::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: UnityEngine::UIElements::StyleMatchingContext::AddStyleSheet
// Il2CppName: AddStyleSheet
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (UnityEngine::UIElements::StyleMatchingContext::*)(::UnityEngine::UIElements::StyleSheet*)>(&UnityEngine::UIElements::StyleMatchingContext::AddStyleSheet)> {
  static const MethodInfo* get() {
    static auto* sheet = &::il2cpp_utils::GetClassFromName("UnityEngine.UIElements", "StyleSheet")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::UIElements::StyleMatchingContext*), "AddStyleSheet", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{sheet});
  }
};
// Writing MetadataGetter for method: UnityEngine::UIElements::StyleMatchingContext::RemoveStyleSheetRange
// Il2CppName: RemoveStyleSheetRange
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (UnityEngine::UIElements::StyleMatchingContext::*)(int, int)>(&UnityEngine::UIElements::StyleMatchingContext::RemoveStyleSheetRange)> {
  static const MethodInfo* get() {
    static auto* index = &::il2cpp_utils::GetClassFromName("System", "Int32")->byval_arg;
    static auto* count = &::il2cpp_utils::GetClassFromName("System", "Int32")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::UIElements::StyleMatchingContext*), "RemoveStyleSheetRange", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{index, count});
  }
};
// Writing MetadataGetter for method: UnityEngine::UIElements::StyleMatchingContext::GetStyleSheetAt
// Il2CppName: GetStyleSheetAt
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::UIElements::StyleSheet* (UnityEngine::UIElements::StyleMatchingContext::*)(int)>(&UnityEngine::UIElements::StyleMatchingContext::GetStyleSheetAt)> {
  static const MethodInfo* get() {
    static auto* index = &::il2cpp_utils::GetClassFromName("System", "Int32")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::UIElements::StyleMatchingContext*), "GetStyleSheetAt", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{index});
  }
};
