// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.UIElements.TreeViewReorderableDragAndDropController
#include "UnityEngine/UIElements/TreeViewReorderableDragAndDropController.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::UIElements::TreeViewReorderableDragAndDropController::DropData);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UIElements::TreeViewReorderableDragAndDropController::DropData*, "UnityEngine.UIElements", "TreeViewReorderableDragAndDropController/DropData");
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Size: 0x30
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.UIElements.TreeViewReorderableDragAndDropController/DropData
  // [TokenAttribute] Offset: FFFFFFFF
  class TreeViewReorderableDragAndDropController::DropData : public ::Il2CppObject {
    public:
    public:
    // public System.Int32[] expandedIdsBeforeDrag
    // Size: 0x8
    // Offset: 0x10
    ::ArrayW<int> expandedIdsBeforeDrag;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // public System.Int32[] draggedIds
    // Size: 0x8
    // Offset: 0x18
    ::ArrayW<int> draggedIds;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // public System.Int32 lastItemId
    // Size: 0x4
    // Offset: 0x20
    int lastItemId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Single expandItemBeginTimerMs
    // Size: 0x4
    // Offset: 0x24
    float expandItemBeginTimerMs;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.Vector2 expandItemBeginPosition
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::Vector2 expandItemBeginPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    public:
    // Get instance field reference: public System.Int32[] expandedIdsBeforeDrag
    [[deprecated("Use field access instead!")]] ::ArrayW<int>& dyn_expandedIdsBeforeDrag();
    // Get instance field reference: public System.Int32[] draggedIds
    [[deprecated("Use field access instead!")]] ::ArrayW<int>& dyn_draggedIds();
    // Get instance field reference: public System.Int32 lastItemId
    [[deprecated("Use field access instead!")]] int& dyn_lastItemId();
    // Get instance field reference: public System.Single expandItemBeginTimerMs
    [[deprecated("Use field access instead!")]] float& dyn_expandItemBeginTimerMs();
    // Get instance field reference: public UnityEngine.Vector2 expandItemBeginPosition
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector2& dyn_expandItemBeginPosition();
    // public System.Void .ctor()
    // Offset: 0x5643E54
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static TreeViewReorderableDragAndDropController::DropData* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::UIElements::TreeViewReorderableDragAndDropController::DropData::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<TreeViewReorderableDragAndDropController::DropData*, creationType>()));
    }
  }; // UnityEngine.UIElements.TreeViewReorderableDragAndDropController/DropData
  #pragma pack(pop)
  static check_size<sizeof(TreeViewReorderableDragAndDropController::DropData), 40 + sizeof(::UnityEngine::Vector2)> __UnityEngine_UIElements_TreeViewReorderableDragAndDropController_DropDataSizeCheck;
  static_assert(sizeof(TreeViewReorderableDragAndDropController::DropData) == 0x30);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: UnityEngine::UIElements::TreeViewReorderableDragAndDropController::DropData::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
