// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.UIElements.Focusable
#include "UnityEngine/UIElements/Focusable.hpp"
// Including type: UnityEngine.UIElements.IResolvedStyle
#include "UnityEngine/UIElements/IResolvedStyle.hpp"
// Including type: UnityEngine.UIElements.IStylePropertyAnimations
#include "UnityEngine/UIElements/IStylePropertyAnimations.hpp"
// Including type: UnityEngine.UIElements.ITransform
#include "UnityEngine/UIElements/ITransform.hpp"
// Including type: UnityEngine.UIElements.Experimental.ITransitionAnimations
#include "UnityEngine/UIElements/Experimental/ITransitionAnimations.hpp"
// Including type: UnityEngine.UIElements.IExperimentalFeatures
#include "UnityEngine/UIElements/IExperimentalFeatures.hpp"
// Including type: UnityEngine.UIElements.IVisualElementScheduler
#include "UnityEngine/UIElements/IVisualElementScheduler.hpp"
// Including type: System.Collections.Generic.KeyValuePair`2
#include "System/Collections/Generic/KeyValuePair_2.hpp"
// Including type: UnityEngine.PropertyName
#include "UnityEngine/PropertyName.hpp"
// Including type: UnityEngine.UIElements.VisualElementFlags
#include "UnityEngine/UIElements/VisualElementFlags.hpp"

// Forward declaring namespace: System::Text::RegularExpressions
namespace System::Text::RegularExpressions {
  // Forward declaring type: Regex
  class Regex;
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: StringBuilder
  class StringBuilder;
}
// Completed forward declares
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: VisualElement
  class VisualElement;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::UIElements::VisualElement);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UIElements::VisualElement*, "UnityEngine.UIElements", "VisualElement");
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // WARNING Size may be invalid!
  // Autogenerated type: UnityEngine.UIElements.VisualElement
  // [TokenAttribute] Offset: FFFFFFFF
  // [DefaultMemberAttribute] Offset: FFFFFFFF
  class VisualElement : public ::UnityEngine::UIElements::Focusable/*, public ::UnityEngine::UIElements::IResolvedStyle, public ::UnityEngine::UIElements::IStylePropertyAnimations, public ::UnityEngine::UIElements::ITransform, public ::UnityEngine::UIElements::Experimental::ITransitionAnimations, public ::UnityEngine::UIElements::IExperimentalFeatures, public ::UnityEngine::UIElements::IVisualElementScheduler*/ {
    public:
    // Writing base type padding for base size: 0x2A to desired offset: 0x2C
    char ___base_padding[0x2] = {};
    // Nested type: ::UnityEngine::UIElements::VisualElement::UxmlFactory
    class UxmlFactory;
    // Nested type: ::UnityEngine::UIElements::VisualElement::UxmlTraits
    class UxmlTraits;
    // Nested type: ::UnityEngine::UIElements::VisualElement::MeasureMode
    struct MeasureMode;
    // Nested type: ::UnityEngine::UIElements::VisualElement::RenderTargetMode
    struct RenderTargetMode;
    // Nested type: ::UnityEngine::UIElements::VisualElement::Hierarchy
    struct Hierarchy;
    // Nested type: ::UnityEngine::UIElements::VisualElement::BaseVisualElementScheduledItem
    class BaseVisualElementScheduledItem;
    // Nested type: ::UnityEngine::UIElements::VisualElement::VisualElementScheduledItem_1<ActionType>
    template<typename ActionType>
    class VisualElementScheduledItem_1;
    // Nested type: ::UnityEngine::UIElements::VisualElement::TimerStateScheduledItem
    class TimerStateScheduledItem;
    // Nested type: ::UnityEngine::UIElements::VisualElement::SimpleScheduledItem
    class SimpleScheduledItem;
    // Nested type: ::UnityEngine::UIElements::VisualElement::CustomStyleAccess
    class CustomStyleAccess;
    // Nested type: ::UnityEngine::UIElements::VisualElement::TypeData
    class TypeData;
    // Nested type: ::UnityEngine::UIElements::VisualElement::$$c__DisplayClass484_0
    class $$c__DisplayClass484_0;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.UIElements.VisualElement/RenderTargetMode
    // [TokenAttribute] Offset: FFFFFFFF
    struct RenderTargetMode/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: RenderTargetMode
      constexpr RenderTargetMode(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.UIElements.VisualElement/RenderTargetMode None
      static constexpr const int None = 0;
      // Get static field: static public UnityEngine.UIElements.VisualElement/RenderTargetMode None
      static ::UnityEngine::UIElements::VisualElement::RenderTargetMode _get_None();
      // Set static field: static public UnityEngine.UIElements.VisualElement/RenderTargetMode None
      static void _set_None(::UnityEngine::UIElements::VisualElement::RenderTargetMode value);
      // static field const value: static public UnityEngine.UIElements.VisualElement/RenderTargetMode NoColorConversion
      static constexpr const int NoColorConversion = 1;
      // Get static field: static public UnityEngine.UIElements.VisualElement/RenderTargetMode NoColorConversion
      static ::UnityEngine::UIElements::VisualElement::RenderTargetMode _get_NoColorConversion();
      // Set static field: static public UnityEngine.UIElements.VisualElement/RenderTargetMode NoColorConversion
      static void _set_NoColorConversion(::UnityEngine::UIElements::VisualElement::RenderTargetMode value);
      // static field const value: static public UnityEngine.UIElements.VisualElement/RenderTargetMode LinearToGamma
      static constexpr const int LinearToGamma = 2;
      // Get static field: static public UnityEngine.UIElements.VisualElement/RenderTargetMode LinearToGamma
      static ::UnityEngine::UIElements::VisualElement::RenderTargetMode _get_LinearToGamma();
      // Set static field: static public UnityEngine.UIElements.VisualElement/RenderTargetMode LinearToGamma
      static void _set_LinearToGamma(::UnityEngine::UIElements::VisualElement::RenderTargetMode value);
      // static field const value: static public UnityEngine.UIElements.VisualElement/RenderTargetMode GammaToLinear
      static constexpr const int GammaToLinear = 3;
      // Get static field: static public UnityEngine.UIElements.VisualElement/RenderTargetMode GammaToLinear
      static ::UnityEngine::UIElements::VisualElement::RenderTargetMode _get_GammaToLinear();
      // Set static field: static public UnityEngine.UIElements.VisualElement/RenderTargetMode GammaToLinear
      static void _set_GammaToLinear(::UnityEngine::UIElements::VisualElement::RenderTargetMode value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.UIElements.VisualElement/RenderTargetMode
    #pragma pack(pop)
    static check_size<sizeof(VisualElement::RenderTargetMode), 0 + sizeof(int)> __UnityEngine_UIElements_VisualElement_RenderTargetModeSizeCheck;
    static_assert(sizeof(VisualElement::RenderTargetMode) == 0x4);
    // Size: 0x8
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.UIElements.VisualElement/Hierarchy
    // [TokenAttribute] Offset: FFFFFFFF
    // [DefaultMemberAttribute] Offset: FFFFFFFF
    struct Hierarchy/*, public ::System::ValueType*/ {
      public:
      public:
      // private readonly UnityEngine.UIElements.VisualElement m_Owner
      // Size: 0x8
      // Offset: 0x0
      ::UnityEngine::UIElements::VisualElement* m_Owner;
      // Field size check
      static_assert(sizeof(::UnityEngine::UIElements::VisualElement*) == 0x8);
      public:
      // Creating value type constructor for type: Hierarchy
      constexpr Hierarchy(::UnityEngine::UIElements::VisualElement* m_Owner_ = {}) noexcept : m_Owner{m_Owner_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Creating conversion operator: operator ::UnityEngine::UIElements::VisualElement*
      constexpr operator ::UnityEngine::UIElements::VisualElement*() const noexcept {
        return m_Owner;
      }
      // static field const value: static private System.String k_InvalidHierarchyChangeMsg
      static constexpr const char* k_InvalidHierarchyChangeMsg = "Cannot modify VisualElement hierarchy during layout calculation";
      // Get static field: static private System.String k_InvalidHierarchyChangeMsg
      static ::StringW _get_k_InvalidHierarchyChangeMsg();
      // Set static field: static private System.String k_InvalidHierarchyChangeMsg
      static void _set_k_InvalidHierarchyChangeMsg(::StringW value);
      // Get instance field reference: private readonly UnityEngine.UIElements.VisualElement m_Owner
      [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::VisualElement*& dyn_m_Owner();
      // public UnityEngine.UIElements.VisualElement get_parent()
      // Offset: 0x56A2D68
      ::UnityEngine::UIElements::VisualElement* get_parent();
      // System.Collections.Generic.List`1<UnityEngine.UIElements.VisualElement> get_children()
      // Offset: 0x56A2D84
      ::System::Collections::Generic::List_1<::UnityEngine::UIElements::VisualElement*>* get_children();
      // System.Void .ctor(UnityEngine.UIElements.VisualElement element)
      // Offset: 0x56A2DA0
      // ABORTED: conflicts with another method.  Hierarchy(::UnityEngine::UIElements::VisualElement* element);
      // public System.Void Add(UnityEngine.UIElements.VisualElement child)
      // Offset: 0x56A2DA8
      void Add(::UnityEngine::UIElements::VisualElement* child);
      // public System.Void Insert(System.Int32 index, UnityEngine.UIElements.VisualElement child)
      // Offset: 0x56A2E70
      void Insert(int index, ::UnityEngine::UIElements::VisualElement* child);
      // public System.Void Remove(UnityEngine.UIElements.VisualElement child)
      // Offset: 0x56A3310
      void Remove(::UnityEngine::UIElements::VisualElement* child);
      // public System.Void RemoveAt(System.Int32 index)
      // Offset: 0x56A33FC
      void RemoveAt(int index);
      // public System.Void Clear()
      // Offset: 0x56A377C
      void Clear();
      // System.Void BringToFront(UnityEngine.UIElements.VisualElement child)
      // Offset: 0x56A3AA8
      void BringToFront(::UnityEngine::UIElements::VisualElement* child);
      // System.Void SendToBack(UnityEngine.UIElements.VisualElement child)
      // Offset: 0x56A3C3C
      void SendToBack(::UnityEngine::UIElements::VisualElement* child);
      // System.Void PlaceBehind(UnityEngine.UIElements.VisualElement child, UnityEngine.UIElements.VisualElement over)
      // Offset: 0x56A3CD4
      void PlaceBehind(::UnityEngine::UIElements::VisualElement* child, ::UnityEngine::UIElements::VisualElement* over);
      // private System.Void MoveChildElement(UnityEngine.UIElements.VisualElement child, System.Int32 currentIndex, System.Int32 nextIndex)
      // Offset: 0x56A3B5C
      void MoveChildElement(::UnityEngine::UIElements::VisualElement* child, int currentIndex, int nextIndex);
      // public System.Int32 get_childCount()
      // Offset: 0x56A2E20
      int get_childCount();
      // public UnityEngine.UIElements.VisualElement get_Item(System.Int32 key)
      // Offset: 0x56A3DAC
      ::UnityEngine::UIElements::VisualElement* get_Item(int key);
      // public System.Int32 IndexOf(UnityEngine.UIElements.VisualElement element)
      // Offset: 0x56A3E0C
      int IndexOf(::UnityEngine::UIElements::VisualElement* element);
      // public UnityEngine.UIElements.VisualElement ElementAt(System.Int32 index)
      // Offset: 0x56A3E6C
      ::UnityEngine::UIElements::VisualElement* ElementAt(int index);
      // public System.Collections.Generic.IEnumerable`1<UnityEngine.UIElements.VisualElement> Children()
      // Offset: 0x56A3E70
      ::System::Collections::Generic::IEnumerable_1<::UnityEngine::UIElements::VisualElement*>* Children();
      // private System.Void SetParent(UnityEngine.UIElements.VisualElement value)
      // Offset: 0x56A3298
      void SetParent(::UnityEngine::UIElements::VisualElement* value);
      // private System.Void PutChildAtIndex(UnityEngine.UIElements.VisualElement child, System.Int32 index)
      // Offset: 0x56A3150
      void PutChildAtIndex(::UnityEngine::UIElements::VisualElement* child, int index);
      // private System.Void RemoveChildAtIndex(System.Int32 index)
      // Offset: 0x56A3614
      void RemoveChildAtIndex(int index);
      // private System.Void ReleaseChildList()
      // Offset: 0x56A3690
      void ReleaseChildList();
      // public System.Boolean Equals(UnityEngine.UIElements.VisualElement/Hierarchy other)
      // Offset: 0x56A3E8C
      bool Equals(::UnityEngine::UIElements::VisualElement::Hierarchy other);
      // public override System.Boolean Equals(System.Object obj)
      // Offset: 0x56A3EA8
      // Implemented from: System.ValueType
      // Base method: System.Boolean ValueType::Equals(System.Object obj)
      bool Equals(::Il2CppObject* obj);
      // public override System.Int32 GetHashCode()
      // Offset: 0x56A3F20
      // Implemented from: System.ValueType
      // Base method: System.Int32 ValueType::GetHashCode()
      int GetHashCode();
    }; // UnityEngine.UIElements.VisualElement/Hierarchy
    #pragma pack(pop)
    static check_size<sizeof(VisualElement::Hierarchy), 0 + sizeof(::UnityEngine::UIElements::VisualElement*)> __UnityEngine_UIElements_VisualElement_HierarchySizeCheck;
    static_assert(sizeof(VisualElement::Hierarchy) == 0x8);
    public:
    // private System.Int32 <UnityEngine.UIElements.IStylePropertyAnimations.runningAnimationCount>k__BackingField
    // Size: 0x4
    // Offset: 0x2C
    int runningAnimationCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 <UnityEngine.UIElements.IStylePropertyAnimations.completedAnimationCount>k__BackingField
    // Size: 0x4
    // Offset: 0x30
    int completedAnimationCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.String m_Name
    // Size: 0x8
    // Offset: 0x38
    ::StringW m_Name;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Collections.Generic.List`1<System.String> m_ClassList
    // Size: 0x8
    // Offset: 0x40
    ::System::Collections::Generic::List_1<::StringW>* m_ClassList;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::StringW>*) == 0x8);
    // private System.Collections.Generic.List`1<System.Collections.Generic.KeyValuePair`2<UnityEngine.PropertyName,System.Object>> m_PropertyBag
    // Size: 0x8
    // Offset: 0x48
    ::System::Collections::Generic::List_1<::System::Collections::Generic::KeyValuePair_2<::UnityEngine::PropertyName, ::Il2CppObject*>>* m_PropertyBag;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::System::Collections::Generic::KeyValuePair_2<::UnityEngine::PropertyName, ::Il2CppObject*>>*) == 0x8);
    // UnityEngine.UIElements.VisualElementFlags m_Flags
    // Size: 0x4
    // Offset: 0x50
    ::UnityEngine::UIElements::VisualElementFlags m_Flags;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::VisualElementFlags) == 0x4);
    // private System.String m_ViewDataKey
    // Size: 0x8
    // Offset: 0x58
    ::StringW m_ViewDataKey;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private UnityEngine.UIElements.RenderHints m_RenderHints
    // Size: 0x4
    // Offset: 0x60
    ::UnityEngine::UIElements::RenderHints m_RenderHints;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::RenderHints) == 0x4);
    // UnityEngine.Rect lastLayout
    // Size: 0x10
    // Offset: 0x64
    ::UnityEngine::Rect lastLayout;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rect) == 0x10);
    // UnityEngine.Rect lastPseudoPadding
    // Size: 0x10
    // Offset: 0x74
    ::UnityEngine::Rect lastPseudoPadding;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rect) == 0x10);
    // UnityEngine.UIElements.UIR.RenderChainVEData renderChainData
    // Size: 0x148
    // Offset: 0x88
    ::UnityEngine::UIElements::UIR::RenderChainVEData renderChainData;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UIR::RenderChainVEData) == 0x148);
    // private UnityEngine.Rect m_Layout
    // Size: 0x10
    // Offset: 0x1D0
    ::UnityEngine::Rect m_Layout;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rect) == 0x10);
    // private UnityEngine.Rect m_BoundingBox
    // Size: 0x10
    // Offset: 0x1E0
    ::UnityEngine::Rect m_BoundingBox;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rect) == 0x10);
    // private UnityEngine.Rect m_WorldBoundingBox
    // Size: 0x10
    // Offset: 0x1F0
    ::UnityEngine::Rect m_WorldBoundingBox;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rect) == 0x10);
    // private UnityEngine.Matrix4x4 m_WorldTransformCache
    // Size: 0x40
    // Offset: 0x200
    ::UnityEngine::Matrix4x4 m_WorldTransformCache;
    // Field size check
    static_assert(sizeof(::UnityEngine::Matrix4x4) == 0x40);
    // private UnityEngine.Matrix4x4 m_WorldTransformInverseCache
    // Size: 0x40
    // Offset: 0x240
    ::UnityEngine::Matrix4x4 m_WorldTransformInverseCache;
    // Field size check
    static_assert(sizeof(::UnityEngine::Matrix4x4) == 0x40);
    // private UnityEngine.Rect m_WorldClip
    // Size: 0x10
    // Offset: 0x280
    ::UnityEngine::Rect m_WorldClip;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rect) == 0x10);
    // private UnityEngine.Rect m_WorldClipMinusGroup
    // Size: 0x10
    // Offset: 0x290
    ::UnityEngine::Rect m_WorldClipMinusGroup;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rect) == 0x10);
    // private System.Boolean m_WorldClipIsInfinite
    // Size: 0x1
    // Offset: 0x2A0
    bool m_WorldClipIsInfinite;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // UnityEngine.UIElements.PseudoStates triggerPseudoMask
    // Size: 0x4
    // Offset: 0x2A4
    ::UnityEngine::UIElements::PseudoStates triggerPseudoMask;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::PseudoStates) == 0x4);
    // UnityEngine.UIElements.PseudoStates dependencyPseudoMask
    // Size: 0x4
    // Offset: 0x2A8
    ::UnityEngine::UIElements::PseudoStates dependencyPseudoMask;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::PseudoStates) == 0x4);
    // private UnityEngine.UIElements.PseudoStates m_PseudoStates
    // Size: 0x4
    // Offset: 0x2AC
    ::UnityEngine::UIElements::PseudoStates m_PseudoStates;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::PseudoStates) == 0x4);
    // private System.Int32 <containedPointerIds>k__BackingField
    // Size: 0x4
    // Offset: 0x2B0
    int containedPointerIds;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.UIElements.PickingMode <pickingMode>k__BackingField
    // Size: 0x4
    // Offset: 0x2B4
    ::UnityEngine::UIElements::PickingMode pickingMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::PickingMode) == 0x4);
    // private UnityEngine.Yoga.YogaNode <yogaNode>k__BackingField
    // Size: 0x8
    // Offset: 0x2B8
    ::UnityEngine::Yoga::YogaNode* yogaNode;
    // Field size check
    static_assert(sizeof(::UnityEngine::Yoga::YogaNode*) == 0x8);
    // UnityEngine.UIElements.ComputedStyle m_Style
    // Size: 0xFFFFFFFF
    // Offset: 0x2C0
    ::UnityEngine::UIElements::ComputedStyle m_Style;
    // UnityEngine.UIElements.StyleVariableContext variableContext
    // Size: 0x8
    // Offset: 0x318
    ::UnityEngine::UIElements::StyleVariableContext* variableContext;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::StyleVariableContext*) == 0x8);
    // System.Int32 inheritedStylesHash
    // Size: 0x4
    // Offset: 0x320
    int inheritedStylesHash;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // readonly System.UInt32 controlid
    // Size: 0x4
    // Offset: 0x324
    uint controlid;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // System.Int32 imguiContainerDescendantCount
    // Size: 0x4
    // Offset: 0x328
    int imguiContainerDescendantCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean <enabledSelf>k__BackingField
    // Size: 0x1
    // Offset: 0x32C
    bool enabledSelf;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Action`1<UnityEngine.UIElements.MeshGenerationContext> <generateVisualContent>k__BackingField
    // Size: 0x8
    // Offset: 0x330
    ::System::Action_1<::UnityEngine::UIElements::MeshGenerationContext*>* generateVisualContent;
    // Field size check
    static_assert(sizeof(::System::Action_1<::UnityEngine::UIElements::MeshGenerationContext*>*) == 0x8);
    // private UnityEngine.UIElements.VisualElement/RenderTargetMode m_SubRenderTargetMode
    // Size: 0x4
    // Offset: 0x338
    ::UnityEngine::UIElements::VisualElement::RenderTargetMode m_SubRenderTargetMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::VisualElement::RenderTargetMode) == 0x4);
    // private UnityEngine.Material m_defaultMaterial
    // Size: 0x8
    // Offset: 0x340
    ::UnityEngine::Material* m_defaultMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.UIElements.Experimental.IValueAnimationUpdate> m_RunningAnimations
    // Size: 0x8
    // Offset: 0x348
    ::System::Collections::Generic::List_1<::UnityEngine::UIElements::Experimental::IValueAnimationUpdate*>* m_RunningAnimations;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::UIElements::Experimental::IValueAnimationUpdate*>*) == 0x8);
    // private System.UInt32 m_NextParentCachedVersion
    // Size: 0x4
    // Offset: 0x350
    uint m_NextParentCachedVersion;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 m_NextParentRequiredVersion
    // Size: 0x4
    // Offset: 0x354
    uint m_NextParentRequiredVersion;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private UnityEngine.UIElements.VisualElement m_CachedNextParentWithEventCallback
    // Size: 0x8
    // Offset: 0x358
    ::UnityEngine::UIElements::VisualElement* m_CachedNextParentWithEventCallback;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::VisualElement*) == 0x8);
    // private System.Int32 m_EventCallbackCategories
    // Size: 0x4
    // Offset: 0x360
    int m_EventCallbackCategories;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_CachedEventCallbackParentCategories
    // Size: 0x4
    // Offset: 0x364
    int m_CachedEventCallbackParentCategories;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private readonly System.Int32 m_DefaultActionEventCategories
    // Size: 0x4
    // Offset: 0x368
    int m_DefaultActionEventCategories;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private readonly System.Int32 m_DefaultActionAtTargetEventCategories
    // Size: 0x4
    // Offset: 0x36C
    int m_DefaultActionAtTargetEventCategories;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.UIElements.VisualElement/Hierarchy <hierarchy>k__BackingField
    // Size: 0x8
    // Offset: 0x370
    ::UnityEngine::UIElements::VisualElement::Hierarchy hierarchy;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::VisualElement::Hierarchy) == 0x8);
    // private System.Boolean <isRootVisualContainer>k__BackingField
    // Size: 0x1
    // Offset: 0x378
    bool isRootVisualContainer;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <cacheAsBitmap>k__BackingField
    // Size: 0x1
    // Offset: 0x379
    bool cacheAsBitmap;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private UnityEngine.UIElements.VisualElement m_PhysicalParent
    // Size: 0x8
    // Offset: 0x380
    ::UnityEngine::UIElements::VisualElement* m_PhysicalParent;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::VisualElement*) == 0x8);
    // private UnityEngine.UIElements.VisualElement m_LogicalParent
    // Size: 0x8
    // Offset: 0x388
    ::UnityEngine::UIElements::VisualElement* m_LogicalParent;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::VisualElement*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.UIElements.VisualElement> m_Children
    // Size: 0x8
    // Offset: 0x390
    ::System::Collections::Generic::List_1<::UnityEngine::UIElements::VisualElement*>* m_Children;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::UIElements::VisualElement*>*) == 0x8);
    // private UnityEngine.UIElements.BaseVisualElementPanel <elementPanel>k__BackingField
    // Size: 0x8
    // Offset: 0x398
    ::UnityEngine::UIElements::BaseVisualElementPanel* elementPanel;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::BaseVisualElementPanel*) == 0x8);
    // private UnityEngine.UIElements.VisualTreeAsset m_VisualTreeAssetSource
    // Size: 0x8
    // Offset: 0x3A0
    ::UnityEngine::UIElements::VisualTreeAsset* m_VisualTreeAssetSource;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::VisualTreeAsset*) == 0x8);
    // UnityEngine.UIElements.InlineStyleAccess inlineStyleAccess
    // Size: 0x8
    // Offset: 0x3A8
    ::UnityEngine::UIElements::InlineStyleAccess* inlineStyleAccess;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::InlineStyleAccess*) == 0x8);
    // System.Collections.Generic.List`1<UnityEngine.UIElements.StyleSheet> styleSheetList
    // Size: 0x8
    // Offset: 0x3B0
    ::System::Collections::Generic::List_1<::UnityEngine::UIElements::StyleSheet*>* styleSheetList;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::UIElements::StyleSheet*>*) == 0x8);
    // private UnityEngine.UIElements.VisualElement/TypeData m_TypeData
    // Size: 0x8
    // Offset: 0x3B8
    ::UnityEngine::UIElements::VisualElement::TypeData* m_TypeData;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::VisualElement::TypeData*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::UnityEngine::UIElements::IResolvedStyle
    operator ::UnityEngine::UIElements::IResolvedStyle() noexcept {
      return *reinterpret_cast<::UnityEngine::UIElements::IResolvedStyle*>(this);
    }
    // Creating interface conversion operator: operator ::UnityEngine::UIElements::IStylePropertyAnimations
    operator ::UnityEngine::UIElements::IStylePropertyAnimations() noexcept {
      return *reinterpret_cast<::UnityEngine::UIElements::IStylePropertyAnimations*>(this);
    }
    // Creating interface conversion operator: operator ::UnityEngine::UIElements::ITransform
    operator ::UnityEngine::UIElements::ITransform() noexcept {
      return *reinterpret_cast<::UnityEngine::UIElements::ITransform*>(this);
    }
