// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.ScriptableObject
#include "UnityEngine/ScriptableObject.hpp"
// Including type: UnityEngine.UIElements.CreationContext
#include "UnityEngine/UIElements/CreationContext.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: StyleSheet
  class StyleSheet;
  // Forward declaring type: VisualElement
  class VisualElement;
  // Forward declaring type: VisualElementAsset
  class VisualElementAsset;
  // Skipping declaration: TemplateAsset because it is already included!
  // Forward declaring type: UxmlObjectAsset
  class UxmlObjectAsset;
  // Forward declaring type: IUxmlAttributes
  class IUxmlAttributes;
  // Skipping declaration: UxmlObjectEntry because it is already included!
  // Forward declaring type: IBaseUxmlObjectFactory
  class IBaseUxmlObjectFactory;
  // Forward declaring type: TemplateContainer
  class TemplateContainer;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: IEnumerable`1<T>
  template<typename T>
  class IEnumerable_1;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: IComparer`1<T>
  template<typename T>
  class IComparer_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Type
  class Type;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Skipping declaration: Object because it is already included!
}
// Completed forward declares
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: VisualTreeAsset
  class VisualTreeAsset;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::UIElements::VisualTreeAsset);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UIElements::VisualTreeAsset*, "UnityEngine.UIElements", "VisualTreeAsset");
// Type namespace: UnityEngine.UIElements
namespace UnityEngine::UIElements {
  // Size: 0x68
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.UIElements.VisualTreeAsset
  // [TokenAttribute] Offset: FFFFFFFF
  class VisualTreeAsset : public ::UnityEngine::ScriptableObject {
    public:
    // Nested type: ::UnityEngine::UIElements::VisualTreeAsset::UsingEntry
    struct UsingEntry;
    // Nested type: ::UnityEngine::UIElements::VisualTreeAsset::UsingEntryComparer
    class UsingEntryComparer;
    // Nested type: ::UnityEngine::UIElements::VisualTreeAsset::SlotDefinition
    struct SlotDefinition;
    // Nested type: ::UnityEngine::UIElements::VisualTreeAsset::SlotUsageEntry
    struct SlotUsageEntry;
    // Nested type: ::UnityEngine::UIElements::VisualTreeAsset::UxmlObjectEntry
    struct UxmlObjectEntry;
    // Nested type: ::UnityEngine::UIElements::VisualTreeAsset::AssetEntry
    struct AssetEntry;
    // Nested type: ::UnityEngine::UIElements::VisualTreeAsset::$$c__DisplayClass61_0
    class $$c__DisplayClass61_0;
    // Nested type: ::UnityEngine::UIElements::VisualTreeAsset::$$c__DisplayClass65_0
    struct $$c__DisplayClass65_0;
    // Nested type: ::UnityEngine::UIElements::VisualTreeAsset::$get_stylesheets$d__23
    class $get_stylesheets$d__23;
    // Nested type: ::UnityEngine::UIElements::VisualTreeAsset::$get_templateDependencies$d__19
    class $get_templateDependencies$d__19;
    // Size: 0x18
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.UIElements.VisualTreeAsset/UsingEntry
    // [TokenAttribute] Offset: FFFFFFFF
    struct UsingEntry/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.String alias
      // Size: 0x8
      // Offset: 0x0
      ::StringW alias;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      // public System.String path
      // Size: 0x8
      // Offset: 0x8
      ::StringW path;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      // public UnityEngine.UIElements.VisualTreeAsset asset
      // Size: 0x8
      // Offset: 0x10
      ::UnityEngine::UIElements::VisualTreeAsset* asset;
      // Field size check
      static_assert(sizeof(::UnityEngine::UIElements::VisualTreeAsset*) == 0x8);
      public:
      // Creating value type constructor for type: UsingEntry
      constexpr UsingEntry(::StringW alias_ = {}, ::StringW path_ = {}, ::UnityEngine::UIElements::VisualTreeAsset* asset_ = {}) noexcept : alias{alias_}, path{path_}, asset{asset_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get static field: static readonly System.Collections.Generic.IComparer`1<UnityEngine.UIElements.VisualTreeAsset/UsingEntry> comparer
      static ::System::Collections::Generic::IComparer_1<::UnityEngine::UIElements::VisualTreeAsset::UsingEntry>* _get_comparer();
      // Set static field: static readonly System.Collections.Generic.IComparer`1<UnityEngine.UIElements.VisualTreeAsset/UsingEntry> comparer
      static void _set_comparer(::System::Collections::Generic::IComparer_1<::UnityEngine::UIElements::VisualTreeAsset::UsingEntry>* value);
      // Get instance field reference: public System.String alias
      [[deprecated("Use field access instead!")]] ::StringW& dyn_alias();
      // Get instance field reference: public System.String path
      [[deprecated("Use field access instead!")]] ::StringW& dyn_path();
      // Get instance field reference: public UnityEngine.UIElements.VisualTreeAsset asset
      [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::VisualTreeAsset*& dyn_asset();
      // public System.Void .ctor(System.String alias, System.String path)
      // Offset: 0x55BF604
      UsingEntry(::StringW alias, ::StringW path);
      // static private System.Void .cctor()
      // Offset: 0x55BF644
      static void _cctor();
    }; // UnityEngine.UIElements.VisualTreeAsset/UsingEntry
    #pragma pack(pop)
    static check_size<sizeof(VisualTreeAsset::UsingEntry), 16 + sizeof(::UnityEngine::UIElements::VisualTreeAsset*)> __UnityEngine_UIElements_VisualTreeAsset_UsingEntrySizeCheck;
    static_assert(sizeof(VisualTreeAsset::UsingEntry) == 0x18);
    // Size: 0xC
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.UIElements.VisualTreeAsset/SlotDefinition
    // [TokenAttribute] Offset: FFFFFFFF
    struct SlotDefinition/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.String name
      // Size: 0x8
      // Offset: 0x0
      ::StringW name;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      // public System.Int32 insertionPointId
      // Size: 0x4
      // Offset: 0x8
      int insertionPointId;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: SlotDefinition
      constexpr SlotDefinition(::StringW name_ = {}, int insertionPointId_ = {}) noexcept : name{name_}, insertionPointId{insertionPointId_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public System.String name
      [[deprecated("Use field access instead!")]] ::StringW& dyn_name();
      // Get instance field reference: public System.Int32 insertionPointId
      [[deprecated("Use field access instead!")]] int& dyn_insertionPointId();
    }; // UnityEngine.UIElements.VisualTreeAsset/SlotDefinition
    #pragma pack(pop)
    static check_size<sizeof(VisualTreeAsset::SlotDefinition), 8 + sizeof(int)> __UnityEngine_UIElements_VisualTreeAsset_SlotDefinitionSizeCheck;
    static_assert(sizeof(VisualTreeAsset::SlotDefinition) == 0xC);
    // Size: 0x10
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.UIElements.VisualTreeAsset/UxmlObjectEntry
    // [TokenAttribute] Offset: FFFFFFFF
    struct UxmlObjectEntry/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.Int32 parentId
      // Size: 0x4
      // Offset: 0x0
      int parentId;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Padding between fields: parentId and: uxmlObjectAssets
      char __padding0[0x4] = {};
      // public System.Collections.Generic.List`1<UnityEngine.UIElements.UxmlObjectAsset> uxmlObjectAssets
      // Size: 0x8
      // Offset: 0x8
      ::System::Collections::Generic::List_1<::UnityEngine::UIElements::UxmlObjectAsset*>* uxmlObjectAssets;
      // Field size check
      static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::UIElements::UxmlObjectAsset*>*) == 0x8);
      public:
      // Creating value type constructor for type: UxmlObjectEntry
      constexpr UxmlObjectEntry(int parentId_ = {}, ::System::Collections::Generic::List_1<::UnityEngine::UIElements::UxmlObjectAsset*>* uxmlObjectAssets_ = {}) noexcept : parentId{parentId_}, uxmlObjectAssets{uxmlObjectAssets_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public System.Int32 parentId
      [[deprecated("Use field access instead!")]] int& dyn_parentId();
      // Get instance field reference: public System.Collections.Generic.List`1<UnityEngine.UIElements.UxmlObjectAsset> uxmlObjectAssets
      [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::UnityEngine::UIElements::UxmlObjectAsset*>*& dyn_uxmlObjectAssets();
      // public System.Void .ctor(System.Int32 parentId, System.Collections.Generic.List`1<UnityEngine.UIElements.UxmlObjectAsset> uxmlObjectAssets)
      // Offset: 0x55BF6D8
      // ABORTED: conflicts with another method.  UxmlObjectEntry(int parentId, ::System::Collections::Generic::List_1<::UnityEngine::UIElements::UxmlObjectAsset*>* uxmlObjectAssets);
    }; // UnityEngine.UIElements.VisualTreeAsset/UxmlObjectEntry
    #pragma pack(pop)
    static check_size<sizeof(VisualTreeAsset::UxmlObjectEntry), 8 + sizeof(::System::Collections::Generic::List_1<::UnityEngine::UIElements::UxmlObjectAsset*>*)> __UnityEngine_UIElements_VisualTreeAsset_UxmlObjectEntrySizeCheck;
    static_assert(sizeof(VisualTreeAsset::UxmlObjectEntry) == 0x10);
    // Size: 0x20
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.UIElements.VisualTreeAsset/AssetEntry
    // [TokenAttribute] Offset: FFFFFFFF
    struct AssetEntry/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.String path
      // Size: 0x8
      // Offset: 0x0
      ::StringW path;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      // public System.String typeFullName
      // Size: 0x8
      // Offset: 0x8
      ::StringW typeFullName;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      // public UnityEngine.Object asset
      // Size: 0x8
      // Offset: 0x10
      ::UnityEngine::Object* asset;
      // Field size check
      static_assert(sizeof(::UnityEngine::Object*) == 0x8);
      // private System.Type m_CachedType
      // Size: 0x8
      // Offset: 0x18
      ::System::Type* m_CachedType;
      // Field size check
      static_assert(sizeof(::System::Type*) == 0x8);
      public:
      // Creating value type constructor for type: AssetEntry
      constexpr AssetEntry(::StringW path_ = {}, ::StringW typeFullName_ = {}, ::UnityEngine::Object* asset_ = {}, ::System::Type* m_CachedType_ = {}) noexcept : path{path_}, typeFullName{typeFullName_}, asset{asset_}, m_CachedType{m_CachedType_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public System.String path
      [[deprecated("Use field access instead!")]] ::StringW& dyn_path();
      // Get instance field reference: public System.String typeFullName
      [[deprecated("Use field access instead!")]] ::StringW& dyn_typeFullName();
      // Get instance field reference: public UnityEngine.Object asset
      [[deprecated("Use field access instead!")]] ::UnityEngine::Object*& dyn_asset();
      // Get instance field reference: private System.Type m_CachedType
      [[deprecated("Use field access instead!")]] ::System::Type*& dyn_m_CachedType();
      // public System.Type get_type()
      // Offset: 0x55BF6E8
      ::System::Type* get_type();
      // public System.Void .ctor(System.String path, System.Type type, UnityEngine.Object asset)
      // Offset: 0x55BF798
      AssetEntry(::StringW path, ::System::Type* type, ::UnityEngine::Object* asset);
    }; // UnityEngine.UIElements.VisualTreeAsset/AssetEntry
    #pragma pack(pop)
    static check_size<sizeof(VisualTreeAsset::AssetEntry), 24 + sizeof(::System::Type*)> __UnityEngine_UIElements_VisualTreeAsset_AssetEntrySizeCheck;
    static_assert(sizeof(VisualTreeAsset::AssetEntry) == 0x20);
    public:
    // private System.Boolean m_ImportedWithErrors
    // Size: 0x1
    // Offset: 0x18
    bool m_ImportedWithErrors;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_ImportedWithWarnings
    // Size: 0x1
    // Offset: 0x19
    bool m_ImportedWithWarnings;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_ImportedWithWarnings and: m_Usings
    char __padding1[0x6] = {};
    // private System.Collections.Generic.List`1<UnityEngine.UIElements.VisualTreeAsset/UsingEntry> m_Usings
    // Size: 0x8
    // Offset: 0x20
    ::System::Collections::Generic::List_1<::UnityEngine::UIElements::VisualTreeAsset::UsingEntry>* m_Usings;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::UIElements::VisualTreeAsset::UsingEntry>*) == 0x8);
    // UnityEngine.UIElements.StyleSheet inlineSheet
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::UIElements::StyleSheet* inlineSheet;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::StyleSheet*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.UIElements.VisualElementAsset> m_VisualElementAssets
    // Size: 0x8
    // Offset: 0x30
    ::System::Collections::Generic::List_1<::UnityEngine::UIElements::VisualElementAsset*>* m_VisualElementAssets;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::UIElements::VisualElementAsset*>*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.UIElements.TemplateAsset> m_TemplateAssets
    // Size: 0x8
    // Offset: 0x38
    ::System::Collections::Generic::List_1<::UnityEngine::UIElements::TemplateAsset*>* m_TemplateAssets;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::UIElements::TemplateAsset*>*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.UIElements.VisualTreeAsset/UxmlObjectEntry> m_UxmlObjectEntries
    // Size: 0x8
    // Offset: 0x40
    ::System::Collections::Generic::List_1<::UnityEngine::UIElements::VisualTreeAsset::UxmlObjectEntry>* m_UxmlObjectEntries;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::UIElements::VisualTreeAsset::UxmlObjectEntry>*) == 0x8);
    // private System.Collections.Generic.List`1<System.Int32> m_UxmlObjectIds
    // Size: 0x8
    // Offset: 0x48
    ::System::Collections::Generic::List_1<int>* m_UxmlObjectIds;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<int>*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.UIElements.VisualTreeAsset/AssetEntry> m_AssetEntries
    // Size: 0x8
    // Offset: 0x50
    ::System::Collections::Generic::List_1<::UnityEngine::UIElements::VisualTreeAsset::AssetEntry>* m_AssetEntries;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::UIElements::VisualTreeAsset::AssetEntry>*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.UIElements.VisualTreeAsset/SlotDefinition> m_Slots
    // Size: 0x8
    // Offset: 0x58
    ::System::Collections::Generic::List_1<::UnityEngine::UIElements::VisualTreeAsset::SlotDefinition>* m_Slots;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::UIElements::VisualTreeAsset::SlotDefinition>*) == 0x8);
    // private System.Int32 m_ContentContainerId
    // Size: 0x4
    // Offset: 0x60
    int m_ContentContainerId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_ContentHash
    // Size: 0x4
    // Offset: 0x64
    int m_ContentHash;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get static field: static System.String LinkedVEAInTemplatePropertyName
    static ::StringW _get_LinkedVEAInTemplatePropertyName();
    // Set static field: static System.String LinkedVEAInTemplatePropertyName
    static void _set_LinkedVEAInTemplatePropertyName(::StringW value);
    // Get static field: static private readonly System.Collections.Generic.Dictionary`2<System.String,UnityEngine.UIElements.VisualElement> s_TemporarySlotInsertionPoints
    static ::System::Collections::Generic::Dictionary_2<::StringW, ::UnityEngine::UIElements::VisualElement*>* _get_s_TemporarySlotInsertionPoints();
