// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Backtrace.Unity.Interfaces.IBacktraceMetrics
#include "Backtrace/Unity/Interfaces/IBacktraceMetrics.hpp"
// Including type: System.Guid
#include "System/Guid.hpp"
// Including type: System.UInt32
#include "System/UInt32.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Backtrace::Unity::Services
namespace Backtrace::Unity::Services {
}
// Forward declaring namespace: Backtrace::Unity::Model::Metrics
namespace Backtrace::Unity::Model::Metrics {
  // Forward declaring type: UniqueEventsSubmissionQueue
  class UniqueEventsSubmissionQueue;
  // Forward declaring type: SummedEventsSubmissionQueue
  class SummedEventsSubmissionQueue;
  // Forward declaring type: UniqueEvent
  class UniqueEvent;
  // Forward declaring type: SummedEvent
  class SummedEvent;
}
// Forward declaring namespace: Backtrace::Unity::Model::JsonData
namespace Backtrace::Unity::Model::JsonData {
  // Forward declaring type: AttributeProvider
  class AttributeProvider;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: LinkedList`1<T>
  template<typename T>
  class LinkedList_1;
  // Forward declaring type: IDictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class IDictionary_2;
}
// Forward declaring namespace: Backtrace::Unity::Model
namespace Backtrace::Unity::Model {
  // Forward declaring type: IBacktraceHttpClient
  class IBacktraceHttpClient;
}
// Completed forward declares
// Type namespace: Backtrace.Unity.Services
namespace Backtrace::Unity::Services {
  // Forward declaring type: BacktraceMetrics
  class BacktraceMetrics;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Backtrace::Unity::Services::BacktraceMetrics);
DEFINE_IL2CPP_ARG_TYPE(::Backtrace::Unity::Services::BacktraceMetrics*, "Backtrace.Unity.Services", "BacktraceMetrics");
// Type namespace: Backtrace.Unity.Services
namespace Backtrace::Unity::Services {
  // Size: 0x60
  #pragma pack(push, 1)
  // Autogenerated type: Backtrace.Unity.Services.BacktraceMetrics
  // [TokenAttribute] Offset: FFFFFFFF
  class BacktraceMetrics : public ::Il2CppObject/*, public ::Backtrace::Unity::Interfaces::IBacktraceMetrics*/ {
    public:
    // Nested type: ::Backtrace::Unity::Services::BacktraceMetrics::$$c__DisplayClass44_0
    class $$c__DisplayClass44_0;
    public:
    // public readonly System.Guid SessionId
    // Size: 0x10
    // Offset: 0x10
    ::System::Guid SessionId;
    // Field size check
    static_assert(sizeof(::System::Guid) == 0x10);
    // private System.String <StartupUniqueAttributeName>k__BackingField
    // Size: 0x8
    // Offset: 0x20
    ::StringW StartupUniqueAttributeName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // readonly Backtrace.Unity.Model.Metrics.UniqueEventsSubmissionQueue _uniqueEventsSubmissionQueue
    // Size: 0x8
    // Offset: 0x28
    ::Backtrace::Unity::Model::Metrics::UniqueEventsSubmissionQueue* uniqueEventsSubmissionQueue;
    // Field size check
    static_assert(sizeof(::Backtrace::Unity::Model::Metrics::UniqueEventsSubmissionQueue*) == 0x8);
    // readonly Backtrace.Unity.Model.Metrics.SummedEventsSubmissionQueue _summedEventsSubmissionQueue
    // Size: 0x8
    // Offset: 0x30
    ::Backtrace::Unity::Model::Metrics::SummedEventsSubmissionQueue* summedEventsSubmissionQueue;
    // Field size check
    static_assert(sizeof(::Backtrace::Unity::Model::Metrics::SummedEventsSubmissionQueue*) == 0x8);
    // private readonly System.Int64 _timeIntervalInSec
    // Size: 0x8
    // Offset: 0x38
    int64_t timeIntervalInSec;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private System.Single _lastUpdateTime
    // Size: 0x4
    // Offset: 0x40
    float lastUpdateTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: lastUpdateTime and: attributeProvider
    char __padding5[0x4] = {};
    // private readonly Backtrace.Unity.Model.JsonData.AttributeProvider _attributeProvider
    // Size: 0x8
    // Offset: 0x48
    ::Backtrace::Unity::Model::JsonData::AttributeProvider* attributeProvider;
    // Field size check
    static_assert(sizeof(::Backtrace::Unity::Model::JsonData::AttributeProvider*) == 0x8);
    // private System.Object _object
    // Size: 0x8
    // Offset: 0x50
    ::Il2CppObject* object;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private readonly System.String _sessionId
    // Size: 0x8
    // Offset: 0x58
    ::StringW sessionId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Creating interface conversion operator: operator ::Backtrace::Unity::Interfaces::IBacktraceMetrics
    operator ::Backtrace::Unity::Interfaces::IBacktraceMetrics() noexcept {
      return *reinterpret_cast<::Backtrace::Unity::Interfaces::IBacktraceMetrics*>(this);
    }
    // static field const value: static public System.String DefaultSubmissionUrl
    static constexpr const char* DefaultSubmissionUrl = "https://events.backtrace.io/api/";
    // Get static field: static public System.String DefaultSubmissionUrl
    static ::StringW _get_DefaultSubmissionUrl();
    // Set static field: static public System.String DefaultSubmissionUrl
    static void _set_DefaultSubmissionUrl(::StringW value);
    // static field const value: static public System.UInt32 DefaultTimeIntervalInMin
    static constexpr const uint DefaultTimeIntervalInMin = 30u;
