// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: Oculus.Interaction.IActiveState
#include "Oculus/Interaction/IActiveState.hpp"
// Including type: UnityEngine.Pose
#include "UnityEngine/Pose.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Forward declaring namespace: Oculus::Interaction::HandGrab::Recorder
namespace Oculus::Interaction::HandGrab::Recorder {
  // Forward declaring type: TimerUIControl
  class TimerUIControl;
  // Forward declaring type: RigidbodyDetector
  class RigidbodyDetector;
  // Skipping declaration: RecorderStep because it is already included!
}
// Forward declaring namespace: Oculus::Interaction::HandGrab
namespace Oculus::Interaction::HandGrab {
  // Forward declaring type: HandGrabInteractor
  class HandGrabInteractor;
  // Forward declaring type: HandPose
  class HandPose;
  // Forward declaring type: HandGrabInteractable
  class HandGrabInteractable;
  // Forward declaring type: HandGrabPose
  class HandGrabPose;
}
// Forward declaring namespace: Oculus::Interaction::HandGrab::Visuals
namespace Oculus::Interaction::HandGrab::Visuals {
  // Forward declaring type: HandGhostProvider
  class HandGhostProvider;
}
// Forward declaring namespace: TMPro
namespace TMPro {
  // Forward declaring type: TextMeshPro
  class TextMeshPro;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: WaitForSeconds
  class WaitForSeconds;
  // Forward declaring type: Coroutine
  class Coroutine;
  // Forward declaring type: Rigidbody
  class Rigidbody;
}
// Forward declaring namespace: UnityEngine::Events
namespace UnityEngine::Events {
  // Forward declaring type: UnityEvent
  class UnityEvent;
  // Forward declaring type: UnityEvent`1<T0>
  template<typename T0>
  class UnityEvent_1;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: Oculus::Interaction::Input
namespace Oculus::Interaction::Input {
  // Forward declaring type: IHand
  class IHand;
}
// Completed forward declares
// Type namespace: Oculus.Interaction.HandGrab.Recorder
namespace Oculus::Interaction::HandGrab::Recorder {
  // Forward declaring type: HandGrabPoseLiveRecorder
  class HandGrabPoseLiveRecorder;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Oculus::Interaction::HandGrab::Recorder::HandGrabPoseLiveRecorder);
DEFINE_IL2CPP_ARG_TYPE(::Oculus::Interaction::HandGrab::Recorder::HandGrabPoseLiveRecorder*, "Oculus.Interaction.HandGrab.Recorder", "HandGrabPoseLiveRecorder");
// Type namespace: Oculus.Interaction.HandGrab.Recorder
namespace Oculus::Interaction::HandGrab::Recorder {
  // Size: 0xAD
  #pragma pack(push, 1)
  // Autogenerated type: Oculus.Interaction.HandGrab.Recorder.HandGrabPoseLiveRecorder
  // [TokenAttribute] Offset: FFFFFFFF
  class HandGrabPoseLiveRecorder : public ::UnityEngine::MonoBehaviour/*, public ::Oculus::Interaction::IActiveState*/ {
    public:
    // Nested type: ::Oculus::Interaction::HandGrab::Recorder::HandGrabPoseLiveRecorder::RecorderStep
    struct RecorderStep;
    // Nested type: ::Oculus::Interaction::HandGrab::Recorder::HandGrabPoseLiveRecorder::$DelayedSnapshot$d__29
    class $DelayedSnapshot$d__29;
    // Size: 0x40
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: Oculus.Interaction.HandGrab.Recorder.HandGrabPoseLiveRecorder/RecorderStep
    // [TokenAttribute] Offset: FFFFFFFF
    struct RecorderStep/*, public ::System::ValueType*/ {
      public:
      public:
      // private Oculus.Interaction.HandGrab.HandPose <RawHandPose>k__BackingField
      // Size: 0x8
      // Offset: 0x0
      ::Oculus::Interaction::HandGrab::HandPose* RawHandPose;
      // Field size check
      static_assert(sizeof(::Oculus::Interaction::HandGrab::HandPose*) == 0x8);
      // private UnityEngine.Pose <GrabPoint>k__BackingField
      // Size: 0x1C
      // Offset: 0x8
      ::UnityEngine::Pose GrabPoint;
      // Field size check
      static_assert(sizeof(::UnityEngine::Pose) == 0x1C);
      // Padding between fields: GrabPoint and: Item
      char __padding1[0x4] = {};
      // private UnityEngine.Rigidbody <Item>k__BackingField
      // Size: 0x8
      // Offset: 0x28
      ::UnityEngine::Rigidbody* Item;
      // Field size check
      static_assert(sizeof(::UnityEngine::Rigidbody*) == 0x8);
      // private System.Single <HandScale>k__BackingField
      // Size: 0x4
      // Offset: 0x30
      float HandScale;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // Padding between fields: HandScale and: interactable
      char __padding3[0x4] = {};
      // public Oculus.Interaction.HandGrab.HandGrabInteractable interactable
      // Size: 0x8
      // Offset: 0x38
      ::Oculus::Interaction::HandGrab::HandGrabInteractable* interactable;
      // Field size check
      static_assert(sizeof(::Oculus::Interaction::HandGrab::HandGrabInteractable*) == 0x8);
      public:
      // Creating value type constructor for type: RecorderStep
      constexpr RecorderStep(::Oculus::Interaction::HandGrab::HandPose* RawHandPose_ = {}, ::UnityEngine::Pose GrabPoint_ = {}, ::UnityEngine::Rigidbody* Item_ = {}, float HandScale_ = {}, ::Oculus::Interaction::HandGrab::HandGrabInteractable* interactable_ = {}) noexcept : RawHandPose{RawHandPose_}, GrabPoint{GrabPoint_}, Item{Item_}, HandScale{HandScale_}, interactable{interactable_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: private Oculus.Interaction.HandGrab.HandPose <RawHandPose>k__BackingField
      [[deprecated("Use field access instead!")]] ::Oculus::Interaction::HandGrab::HandPose*& dyn_$RawHandPose$k__BackingField();
      // Get instance field reference: private UnityEngine.Pose <GrabPoint>k__BackingField
      [[deprecated("Use field access instead!")]] ::UnityEngine::Pose& dyn_$GrabPoint$k__BackingField();
      // Get instance field reference: private UnityEngine.Rigidbody <Item>k__BackingField
      [[deprecated("Use field access instead!")]] ::UnityEngine::Rigidbody*& dyn_$Item$k__BackingField();
      // Get instance field reference: private System.Single <HandScale>k__BackingField
      [[deprecated("Use field access instead!")]] float& dyn_$HandScale$k__BackingField();
      // Get instance field reference: public Oculus.Interaction.HandGrab.HandGrabInteractable interactable
      [[deprecated("Use field access instead!")]] ::Oculus::Interaction::HandGrab::HandGrabInteractable*& dyn_interactable();
      // public Oculus.Interaction.HandGrab.HandPose get_RawHandPose()
      // Offset: 0x479D704
      ::Oculus::Interaction::HandGrab::HandPose* get_RawHandPose();
      // private System.Void set_RawHandPose(Oculus.Interaction.HandGrab.HandPose value)
      // Offset: 0x479D70C
      void set_RawHandPose(::Oculus::Interaction::HandGrab::HandPose* value);
      // public UnityEngine.Pose get_GrabPoint()
      // Offset: 0x479D714
      ::UnityEngine::Pose get_GrabPoint();
      // private System.Void set_GrabPoint(UnityEngine.Pose value)
      // Offset: 0x479D728
      void set_GrabPoint(::UnityEngine::Pose value);
      // public UnityEngine.Rigidbody get_Item()
      // Offset: 0x479D744
      ::UnityEngine::Rigidbody* get_Item();
      // private System.Void set_Item(UnityEngine.Rigidbody value)
      // Offset: 0x479D74C
      void set_Item(::UnityEngine::Rigidbody* value);
      // public System.Single get_HandScale()
      // Offset: 0x479D754
      float get_HandScale();
      // private System.Void set_HandScale(System.Single value)
      // Offset: 0x479D75C
      void set_HandScale(float value);
      // public System.Void .ctor(Oculus.Interaction.HandGrab.HandPose rawPose, UnityEngine.Pose grabPoint, System.Single scale, UnityEngine.Rigidbody item)
      // Offset: 0x479D570
      RecorderStep(::Oculus::Interaction::HandGrab::HandPose* rawPose, ::UnityEngine::Pose grabPoint, float scale, ::UnityEngine::Rigidbody* item);
      // public System.Void ClearInteractable()
      // Offset: 0x479CE6C
      void ClearInteractable();
    }; // Oculus.Interaction.HandGrab.Recorder.HandGrabPoseLiveRecorder/RecorderStep
    #pragma pack(pop)
    static check_size<sizeof(HandGrabPoseLiveRecorder::RecorderStep), 56 + sizeof(::Oculus::Interaction::HandGrab::HandGrabInteractable*)> __Oculus_Interaction_HandGrab_Recorder_HandGrabPoseLiveRecorder_RecorderStepSizeCheck;
    static_assert(sizeof(HandGrabPoseLiveRecorder::RecorderStep) == 0x40);
    public:
    // private Oculus.Interaction.HandGrab.HandGrabInteractor _leftHand
    // Size: 0x8
    // Offset: 0x20
    ::Oculus::Interaction::HandGrab::HandGrabInteractor* leftHand;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::HandGrab::HandGrabInteractor*) == 0x8);
    // private Oculus.Interaction.HandGrab.HandGrabInteractor _rightHand
    // Size: 0x8
    // Offset: 0x28
    ::Oculus::Interaction::HandGrab::HandGrabInteractor* rightHand;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::HandGrab::HandGrabInteractor*) == 0x8);
    // private Oculus.Interaction.HandGrab.Visuals.HandGhostProvider _ghostProvider
    // Size: 0x8
    // Offset: 0x30
    ::Oculus::Interaction::HandGrab::Visuals::HandGhostProvider* ghostProvider;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::HandGrab::Visuals::HandGhostProvider*) == 0x8);
    // private Oculus.Interaction.HandGrab.Recorder.TimerUIControl _timerControl
    // Size: 0x8
    // Offset: 0x38
    ::Oculus::Interaction::HandGrab::Recorder::TimerUIControl* timerControl;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::HandGrab::Recorder::TimerUIControl*) == 0x8);
    // private TMPro.TextMeshPro _delayLabel
    // Size: 0x8
    // Offset: 0x40
    ::TMPro::TextMeshPro* delayLabel;
    // Field size check
    static_assert(sizeof(::TMPro::TextMeshPro*) == 0x8);
    // private Oculus.Interaction.HandGrab.Recorder.RigidbodyDetector _leftDetector
    // Size: 0x8
    // Offset: 0x48
    ::Oculus::Interaction::HandGrab::Recorder::RigidbodyDetector* leftDetector;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::HandGrab::Recorder::RigidbodyDetector*) == 0x8);
    // private Oculus.Interaction.HandGrab.Recorder.RigidbodyDetector _rightDetector
    // Size: 0x8
    // Offset: 0x50
    ::Oculus::Interaction::HandGrab::Recorder::RigidbodyDetector* rightDetector;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::HandGrab::Recorder::RigidbodyDetector*) == 0x8);
    // private UnityEngine.WaitForSeconds _waitOneSeconds
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::WaitForSeconds* waitOneSeconds;
    // Field size check
    static_assert(sizeof(::UnityEngine::WaitForSeconds*) == 0x8);
    // private UnityEngine.Coroutine _delayedSnapRoutine
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::Coroutine* delayedSnapRoutine;
    // Field size check
    static_assert(sizeof(::UnityEngine::Coroutine*) == 0x8);
    // public UnityEngine.Events.UnityEvent WhenTimeStep
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::Events::UnityEvent* WhenTimeStep;
    // Field size check
    static_assert(sizeof(::UnityEngine::Events::UnityEvent*) == 0x8);
    // public UnityEngine.Events.UnityEvent WhenSnapshot
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::Events::UnityEvent* WhenSnapshot;
    // Field size check
    static_assert(sizeof(::UnityEngine::Events::UnityEvent*) == 0x8);
    // public UnityEngine.Events.UnityEvent WhenError
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::Events::UnityEvent* WhenError;
    // Field size check
    static_assert(sizeof(::UnityEngine::Events::UnityEvent*) == 0x8);
    // public UnityEngine.Events.UnityEvent`1<System.Boolean> WhenCanUndo
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::Events::UnityEvent_1<bool>* WhenCanUndo;
    // Field size check
    static_assert(sizeof(::UnityEngine::Events::UnityEvent_1<bool>*) == 0x8);
    // public UnityEngine.Events.UnityEvent`1<System.Boolean> WhenCanRedo
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::Events::UnityEvent_1<bool>* WhenCanRedo;
    // Field size check
    static_assert(sizeof(::UnityEngine::Events::UnityEvent_1<bool>*) == 0x8);
    // public UnityEngine.Events.UnityEvent WhenGrabAllowed
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::Events::UnityEvent* WhenGrabAllowed;
    // Field size check
    static_assert(sizeof(::UnityEngine::Events::UnityEvent*) == 0x8);
    // public UnityEngine.Events.UnityEvent WhenGrabDisallowed
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::Events::UnityEvent* WhenGrabDisallowed;
    // Field size check
    static_assert(sizeof(::UnityEngine::Events::UnityEvent*) == 0x8);
    // private System.Collections.Generic.List`1<Oculus.Interaction.HandGrab.Recorder.HandGrabPoseLiveRecorder/RecorderStep> _recorderSteps
    // Size: 0x8
    // Offset: 0xA0
    ::System::Collections::Generic::List_1<::Oculus::Interaction::HandGrab::Recorder::HandGrabPoseLiveRecorder::RecorderStep>* recorderSteps;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Oculus::Interaction::HandGrab::Recorder::HandGrabPoseLiveRecorder::RecorderStep>*) == 0x8);
    // private System.Int32 _currentStepIndex
    // Size: 0x4
    // Offset: 0xA8
    int currentStepIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean _grabbingEnabled
    // Size: 0x1
    // Offset: 0xAC
    bool grabbingEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating interface conversion operator: operator ::Oculus::Interaction::IActiveState
    operator ::Oculus::Interaction::IActiveState() noexcept {
      return *reinterpret_cast<::Oculus::Interaction::IActiveState*>(this);
    }
    // Get instance field reference: private Oculus.Interaction.HandGrab.HandGrabInteractor _leftHand
    [[deprecated("Use field access instead!")]] ::Oculus::Interaction::HandGrab::HandGrabInteractor*& dyn__leftHand();
    // Get instance field reference: private Oculus.Interaction.HandGrab.HandGrabInteractor _rightHand
    [[deprecated("Use field access instead!")]] ::Oculus::Interaction::HandGrab::HandGrabInteractor*& dyn__rightHand();
    // Get instance field reference: private Oculus.Interaction.HandGrab.Visuals.HandGhostProvider _ghostProvider
