// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Security.Cryptography.X509Certificates.X509Certificate
#include "System/Security/Cryptography/X509Certificates/X509Certificate.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Security::Cryptography
namespace System::Security::Cryptography {
  // Forward declaring type: Oid
  class Oid;
  // Forward declaring type: AsymmetricAlgorithm
  class AsymmetricAlgorithm;
}
// Forward declaring namespace: System::Security::Cryptography::X509Certificates
namespace System::Security::Cryptography::X509Certificates {
  // Forward declaring type: X500DistinguishedName
  class X500DistinguishedName;
  // Forward declaring type: PublicKey
  class PublicKey;
  // Forward declaring type: X509ExtensionCollection
  class X509ExtensionCollection;
  // Forward declaring type: X509Certificate2Impl
  class X509Certificate2Impl;
  // Forward declaring type: X509ContentType
  struct X509ContentType;
  // Forward declaring type: X509NameType
  struct X509NameType;
  // Forward declaring type: X509Extension
  class X509Extension;
}
// Forward declaring namespace: System::Runtime::Serialization
namespace System::Runtime::Serialization {
  // Forward declaring type: SerializationInfo
  class SerializationInfo;
}
// Forward declaring namespace: System
namespace System {
  // Skipping declaration: DateTime because it is already included!
}
// Completed forward declares
// Type namespace: System.Security.Cryptography.X509Certificates
namespace System::Security::Cryptography::X509Certificates {
  // Forward declaring type: X509Certificate2
  class X509Certificate2;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Security::Cryptography::X509Certificates::X509Certificate2);
DEFINE_IL2CPP_ARG_TYPE(::System::Security::Cryptography::X509Certificates::X509Certificate2*, "System.Security.Cryptography.X509Certificates", "X509Certificate2");
// Type namespace: System.Security.Cryptography.X509Certificates
namespace System::Security::Cryptography::X509Certificates {
  // Size: 0xA0
  #pragma pack(push, 1)
  // Autogenerated type: System.Security.Cryptography.X509Certificates.X509Certificate2
  // [TokenAttribute] Offset: FFFFFFFF
  class X509Certificate2 : public ::System::Security::Cryptography::X509Certificates::X509Certificate {
    public:
    public:
    // private System.Byte[] lazyRawData
    // Size: 0x8
    // Offset: 0x60
    ::ArrayW<uint8_t> lazyRawData;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // private System.Security.Cryptography.Oid lazySignatureAlgorithm
    // Size: 0x8
    // Offset: 0x68
    ::System::Security::Cryptography::Oid* lazySignatureAlgorithm;
    // Field size check
    static_assert(sizeof(::System::Security::Cryptography::Oid*) == 0x8);
    // private System.Int32 lazyVersion
    // Size: 0x4
    // Offset: 0x70
    int lazyVersion;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: lazyVersion and: lazySubjectName
    char __padding2[0x4] = {};
    // private System.Security.Cryptography.X509Certificates.X500DistinguishedName lazySubjectName
    // Size: 0x8
    // Offset: 0x78
    ::System::Security::Cryptography::X509Certificates::X500DistinguishedName* lazySubjectName;
    // Field size check
    static_assert(sizeof(::System::Security::Cryptography::X509Certificates::X500DistinguishedName*) == 0x8);
    // private System.Security.Cryptography.X509Certificates.X500DistinguishedName lazyIssuerName
    // Size: 0x8
    // Offset: 0x80
    ::System::Security::Cryptography::X509Certificates::X500DistinguishedName* lazyIssuerName;
    // Field size check
    static_assert(sizeof(::System::Security::Cryptography::X509Certificates::X500DistinguishedName*) == 0x8);
    // private System.Security.Cryptography.X509Certificates.PublicKey lazyPublicKey
    // Size: 0x8
    // Offset: 0x88
    ::System::Security::Cryptography::X509Certificates::PublicKey* lazyPublicKey;
    // Field size check
    static_assert(sizeof(::System::Security::Cryptography::X509Certificates::PublicKey*) == 0x8);
    // private System.Security.Cryptography.AsymmetricAlgorithm lazyPrivateKey
    // Size: 0x8
    // Offset: 0x90
    ::System::Security::Cryptography::AsymmetricAlgorithm* lazyPrivateKey;
    // Field size check
    static_assert(sizeof(::System::Security::Cryptography::AsymmetricAlgorithm*) == 0x8);
    // private System.Security.Cryptography.X509Certificates.X509ExtensionCollection lazyExtensions
    // Size: 0x8
    // Offset: 0x98
    ::System::Security::Cryptography::X509Certificates::X509ExtensionCollection* lazyExtensions;
    // Field size check
    static_assert(sizeof(::System::Security::Cryptography::X509Certificates::X509ExtensionCollection*) == 0x8);
    public:
    // Get instance field reference: private System.Byte[] lazyRawData
    [[deprecated("Use field access instead!")]] ::ArrayW<uint8_t>& dyn_lazyRawData();
    // Get instance field reference: private System.Security.Cryptography.Oid lazySignatureAlgorithm
    [[deprecated("Use field access instead!")]] ::System::Security::Cryptography::Oid*& dyn_lazySignatureAlgorithm();
    // Get instance field reference: private System.Int32 lazyVersion
    [[deprecated("Use field access instead!")]] int& dyn_lazyVersion();
    // Get instance field reference: private System.Security.Cryptography.X509Certificates.X500DistinguishedName lazySubjectName
