// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Pathfinding.Int2
#include "Pathfinding/Int2.hpp"
// Including type: Pathfinding.Voxels.Int3PolygonClipper
#include "Pathfinding/Voxels/Int3PolygonClipper.hpp"
// Including type: Pathfinding.ClipperLib.IntPoint
#include "Pathfinding/ClipperLib/IntPoint.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Pathfinding::Util
namespace Pathfinding::Util {
  // Forward declaring type: GridLookup`1<T>
  template<typename T>
  class GridLookup_1;
  // Forward declaring type: GraphTransform
  class GraphTransform;
}
// Forward declaring namespace: Pathfinding
namespace Pathfinding {
  // Forward declaring type: NavmeshBase
  class NavmeshBase;
  // Forward declaring type: NavmeshClipper
  class NavmeshClipper;
  // Forward declaring type: NavmeshTile
  class NavmeshTile;
  // Forward declaring type: IntRect
  struct IntRect;
  // Forward declaring type: NavmeshCut
  class NavmeshCut;
  // Forward declaring type: IWorkItemContext
  class IWorkItemContext;
}
// Forward declaring namespace: Pathfinding::ClipperLib
namespace Pathfinding::ClipperLib {
  // Forward declaring type: Clipper
  class Clipper;
  // Forward declaring type: PolyTree
  class PolyTree;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Stack`1<T>
  template<typename T>
  class Stack_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Mesh
  class Mesh;
  // Forward declaring type: Bounds
  struct Bounds;
}
// Forward declaring namespace: Pathfinding::Poly2Tri
namespace Pathfinding::Poly2Tri {
  // Forward declaring type: Polygon
  class Polygon;
}
// Completed forward declares
// Type namespace: Pathfinding.Util
namespace Pathfinding::Util {
  // Forward declaring type: TileHandler
  class TileHandler;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Pathfinding::Util::TileHandler);
DEFINE_IL2CPP_ARG_TYPE(::Pathfinding::Util::TileHandler*, "Pathfinding.Util", "TileHandler");
// Type namespace: Pathfinding.Util
namespace Pathfinding::Util {
  // Size: 0x70
  #pragma pack(push, 1)
  // Autogenerated type: Pathfinding.Util.TileHandler
  // [TokenAttribute] Offset: FFFFFFFF
  class TileHandler : public ::Il2CppObject {
    public:
    // Nested type: ::Pathfinding::Util::TileHandler::TileType
    class TileType;
    // Nested type: ::Pathfinding::Util::TileHandler::CutMode
    struct CutMode;
    // Nested type: ::Pathfinding::Util::TileHandler::Cut
    class Cut;
    // Nested type: ::Pathfinding::Util::TileHandler::CuttingResult
    struct CuttingResult;
    // Nested type: ::Pathfinding::Util::TileHandler::$$c__DisplayClass37_0
    class $$c__DisplayClass37_0;
    // Nested type: ::Pathfinding::Util::TileHandler::$$c__DisplayClass41_0
    class $$c__DisplayClass41_0;
    public:
    // public readonly Pathfinding.NavmeshBase graph
    // Size: 0x8
    // Offset: 0x10
    ::Pathfinding::NavmeshBase* graph;
    // Field size check
    static_assert(sizeof(::Pathfinding::NavmeshBase*) == 0x8);
    // private readonly System.Int32 tileXCount
    // Size: 0x4
    // Offset: 0x18
    int tileXCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private readonly System.Int32 tileZCount
    // Size: 0x4
    // Offset: 0x1C
    int tileZCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private readonly Pathfinding.ClipperLib.Clipper clipper
    // Size: 0x8
    // Offset: 0x20
    ::Pathfinding::ClipperLib::Clipper* clipper;
    // Field size check
    static_assert(sizeof(::Pathfinding::ClipperLib::Clipper*) == 0x8);
    // private readonly System.Collections.Generic.Dictionary`2<Pathfinding.Int2,System.Int32> cached_Int2_int_dict
    // Size: 0x8
    // Offset: 0x28
    ::System::Collections::Generic::Dictionary_2<::Pathfinding::Int2, int>* cached_Int2_int_dict;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::Pathfinding::Int2, int>*) == 0x8);
    // private readonly Pathfinding.Util.TileHandler/TileType[] activeTileTypes
    // Size: 0x8
    // Offset: 0x30
    ::ArrayW<::Pathfinding::Util::TileHandler::TileType*> activeTileTypes;
    // Field size check
    static_assert(sizeof(::ArrayW<::Pathfinding::Util::TileHandler::TileType*>) == 0x8);
    // private readonly System.Int32[] activeTileRotations
    // Size: 0x8
    // Offset: 0x38
    ::ArrayW<int> activeTileRotations;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // private readonly System.Int32[] activeTileOffsets
    // Size: 0x8
    // Offset: 0x40
    ::ArrayW<int> activeTileOffsets;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // private readonly System.Boolean[] reloadedInBatch
    // Size: 0x8
    // Offset: 0x48
    ::ArrayW<bool> reloadedInBatch;
    // Field size check
    static_assert(sizeof(::ArrayW<bool>) == 0x8);
    // public readonly Pathfinding.Util.GridLookup`1<Pathfinding.NavmeshClipper> cuts
    // Size: 0x8
    // Offset: 0x50
    ::Pathfinding::Util::GridLookup_1<::Pathfinding::NavmeshClipper*>* cuts;
    // Field size check
    static_assert(sizeof(::Pathfinding::Util::GridLookup_1<::Pathfinding::NavmeshClipper*>*) == 0x8);
    // private System.Int32 batchDepth
    // Size: 0x4
    // Offset: 0x58
    int batchDepth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: batchDepth and: simpleClipper
    char __padding10[0x4] = {};
    // private readonly Pathfinding.Voxels.Int3PolygonClipper simpleClipper
    // Size: 0x10
    // Offset: 0x60
    ::Pathfinding::Voxels::Int3PolygonClipper simpleClipper;
    // Field size check
    static_assert(sizeof(::Pathfinding::Voxels::Int3PolygonClipper) == 0x10);
    public:
    // Get instance field reference: public readonly Pathfinding.NavmeshBase graph
    [[deprecated("Use field access instead!")]] ::Pathfinding::NavmeshBase*& dyn_graph();
    // Get instance field reference: private readonly System.Int32 tileXCount
    [[deprecated("Use field access instead!")]] int& dyn_tileXCount();
    // Get instance field reference: private readonly System.Int32 tileZCount
    [[deprecated("Use field access instead!")]] int& dyn_tileZCount();
    // Get instance field reference: private readonly Pathfinding.ClipperLib.Clipper clipper
    [[deprecated("Use field access instead!")]] ::Pathfinding::ClipperLib::Clipper*& dyn_clipper();
