// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Meta.WitAi.CallbackHandlers.MatchMethod
#include "Meta/WitAi/CallbackHandlers/MatchMethod.hpp"
// Including type: Meta.WitAi.CallbackHandlers.ComparisonMethod
#include "Meta/WitAi/CallbackHandlers/ComparisonMethod.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Meta::WitAi::Data
namespace Meta::WitAi::Data {
  // Forward declaring type: WitValue
  class WitValue;
}
// Forward declaring namespace: Meta::WitAi::CallbackHandlers
namespace Meta::WitAi::CallbackHandlers {
  // Forward declaring type: ConfidenceRange
  class ConfidenceRange;
}
// Forward declaring namespace: Meta::WitAi
namespace Meta::WitAi {
  // Forward declaring type: WitResponseReference
  class WitResponseReference;
}
// Completed forward declares
// Type namespace: Meta.WitAi.CallbackHandlers
namespace Meta::WitAi::CallbackHandlers {
  // Forward declaring type: ValuePathMatcher
  class ValuePathMatcher;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Meta::WitAi::CallbackHandlers::ValuePathMatcher);
DEFINE_IL2CPP_ARG_TYPE(::Meta::WitAi::CallbackHandlers::ValuePathMatcher*, "Meta.WitAi.CallbackHandlers", "ValuePathMatcher");
// Type namespace: Meta.WitAi.CallbackHandlers
namespace Meta::WitAi::CallbackHandlers {
  // Size: 0x60
  #pragma pack(push, 1)
  // Autogenerated type: Meta.WitAi.CallbackHandlers.ValuePathMatcher
  // [TokenAttribute] Offset: FFFFFFFF
  class ValuePathMatcher : public ::Il2CppObject {
    public:
    public:
    // public System.String path
    // Size: 0x8
    // Offset: 0x10
    ::StringW path;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public Meta.WitAi.Data.WitValue witValueReference
    // Size: 0x8
    // Offset: 0x18
    ::Meta::WitAi::Data::WitValue* witValueReference;
    // Field size check
    static_assert(sizeof(::Meta::WitAi::Data::WitValue*) == 0x8);
    // public System.Boolean contentRequired
    // Size: 0x1
    // Offset: 0x20
    bool contentRequired;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: contentRequired and: matchMethod
    char __padding2[0x3] = {};
    // public Meta.WitAi.CallbackHandlers.MatchMethod matchMethod
    // Size: 0x4
    // Offset: 0x24
    ::Meta::WitAi::CallbackHandlers::MatchMethod matchMethod;
    // Field size check
    static_assert(sizeof(::Meta::WitAi::CallbackHandlers::MatchMethod) == 0x4);
    // public Meta.WitAi.CallbackHandlers.ComparisonMethod comparisonMethod
    // Size: 0x4
    // Offset: 0x28
    ::Meta::WitAi::CallbackHandlers::ComparisonMethod comparisonMethod;
    // Field size check
    static_assert(sizeof(::Meta::WitAi::CallbackHandlers::ComparisonMethod) == 0x4);
    // Padding between fields: comparisonMethod and: matchValue
    char __padding4[0x4] = {};
    // public System.String matchValue
    // Size: 0x8
    // Offset: 0x30
    ::StringW matchValue;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Double floatingPointComparisonTolerance
    // Size: 0x8
    // Offset: 0x38
    double floatingPointComparisonTolerance;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // public System.Boolean allowConfidenceOverlap
    // Size: 0x1
    // Offset: 0x40
    bool allowConfidenceOverlap;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: allowConfidenceOverlap and: confidenceRanges
    char __padding7[0x7] = {};
    // public Meta.WitAi.CallbackHandlers.ConfidenceRange[] confidenceRanges
    // Size: 0x8
    // Offset: 0x48
    ::ArrayW<::Meta::WitAi::CallbackHandlers::ConfidenceRange*> confidenceRanges;
    // Field size check
    static_assert(sizeof(::ArrayW<::Meta::WitAi::CallbackHandlers::ConfidenceRange*>) == 0x8);
    // private Meta.WitAi.WitResponseReference pathReference
    // Size: 0x8
    // Offset: 0x50
    ::Meta::WitAi::WitResponseReference* pathReference;
    // Field size check
    static_assert(sizeof(::Meta::WitAi::WitResponseReference*) == 0x8);
    // private Meta.WitAi.WitResponseReference confidencePathReference
    // Size: 0x8
    // Offset: 0x58
    ::Meta::WitAi::WitResponseReference* confidencePathReference;
    // Field size check
    static_assert(sizeof(::Meta::WitAi::WitResponseReference*) == 0x8);
    public:
    // Get instance field reference: public System.String path
    [[deprecated("Use field access instead!")]] ::StringW& dyn_path();
    // Get instance field reference: public Meta.WitAi.Data.WitValue witValueReference
    [[deprecated("Use field access instead!")]] ::Meta::WitAi::Data::WitValue*& dyn_witValueReference();
    // Get instance field reference: public System.Boolean contentRequired
    [[deprecated("Use field access instead!")]] bool& dyn_contentRequired();
    // Get instance field reference: public Meta.WitAi.CallbackHandlers.MatchMethod matchMethod
    [[deprecated("Use field access instead!")]] ::Meta::WitAi::CallbackHandlers::MatchMethod& dyn_matchMethod();
    // Get instance field reference: public Meta.WitAi.CallbackHandlers.ComparisonMethod comparisonMethod
    [[deprecated("Use field access instead!")]] ::Meta::WitAi::CallbackHandlers::ComparisonMethod& dyn_comparisonMethod();
    // Get instance field reference: public System.String matchValue
    [[deprecated("Use field access instead!")]] ::StringW& dyn_matchValue();
    // Get instance field reference: public System.Double floatingPointComparisonTolerance
    [[deprecated("Use field access instead!")]] double& dyn_floatingPointComparisonTolerance();
    // Get instance field reference: public System.Boolean allowConfidenceOverlap
    [[deprecated("Use field access instead!")]] bool& dyn_allowConfidenceOverlap();
    // Get instance field reference: public Meta.WitAi.CallbackHandlers.ConfidenceRange[] confidenceRanges
    [[deprecated("Use field access instead!")]] ::ArrayW<::Meta::WitAi::CallbackHandlers::ConfidenceRange*>& dyn_confidenceRanges();
    // Get instance field reference: private Meta.WitAi.WitResponseReference pathReference
    [[deprecated("Use field access instead!")]] ::Meta::WitAi::WitResponseReference*& dyn_pathReference();
    // Get instance field reference: private Meta.WitAi.WitResponseReference confidencePathReference
    [[deprecated("Use field access instead!")]] ::Meta::WitAi::WitResponseReference*& dyn_confidencePathReference();
    // public Meta.WitAi.WitResponseReference get_ConfidenceReference()
    // Offset: 0x4469DD4
    ::Meta::WitAi::WitResponseReference* get_ConfidenceReference();
    // public Meta.WitAi.WitResponseReference get_Reference()
    // Offset: 0x4469D18
    ::Meta::WitAi::WitResponseReference* get_Reference();
    // public System.Void .ctor()
    // Offset: 0x446A5D0
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static ValuePathMatcher* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::Meta::WitAi::CallbackHandlers::ValuePathMatcher::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<ValuePathMatcher*, creationType>()));
    }
  }; // Meta.WitAi.CallbackHandlers.ValuePathMatcher
  #pragma pack(pop)
  static check_size<sizeof(ValuePathMatcher), 88 + sizeof(::Meta::WitAi::WitResponseReference*)> __Meta_WitAi_CallbackHandlers_ValuePathMatcherSizeCheck;
  static_assert(sizeof(ValuePathMatcher) == 0x60);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Meta::WitAi::CallbackHandlers::ValuePathMatcher::get_ConfidenceReference
// Il2CppName: get_ConfidenceReference
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::Meta::WitAi::WitResponseReference* (Meta::WitAi::CallbackHandlers::ValuePathMatcher::*)()>(&Meta::WitAi::CallbackHandlers::ValuePathMatcher::get_ConfidenceReference)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Meta::WitAi::CallbackHandlers::ValuePathMatcher*), "get_ConfidenceReference", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Meta::WitAi::CallbackHandlers::ValuePathMatcher::get_Reference
// Il2CppName: get_Reference
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::Meta::WitAi::WitResponseReference* (Meta::WitAi::CallbackHandlers::ValuePathMatcher::*)()>(&Meta::WitAi::CallbackHandlers::ValuePathMatcher::get_Reference)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Meta::WitAi::CallbackHandlers::ValuePathMatcher*), "get_Reference", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Meta::WitAi::CallbackHandlers::ValuePathMatcher::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
