// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Meta.WitAi.CallbackHandlers.WitResponseHandler
#include "Meta/WitAi/CallbackHandlers/WitResponseHandler.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Meta::WitAi::Utilities
namespace Meta::WitAi::Utilities {
  // Forward declaring type: StringEvent
  class StringEvent;
}
// Forward declaring namespace: System::Text::RegularExpressions
namespace System::Text::RegularExpressions {
  // Forward declaring type: Regex
  class Regex;
}
// Forward declaring namespace: Meta::WitAi::Json
namespace Meta::WitAi::Json {
  // Forward declaring type: WitResponseNode
  class WitResponseNode;
}
// Completed forward declares
// Type namespace: Meta.WitAi.CallbackHandlers
namespace Meta::WitAi::CallbackHandlers {
  // Forward declaring type: WitUtteranceMatcher
  class WitUtteranceMatcher;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Meta::WitAi::CallbackHandlers::WitUtteranceMatcher);
DEFINE_IL2CPP_ARG_TYPE(::Meta::WitAi::CallbackHandlers::WitUtteranceMatcher*, "Meta.WitAi.CallbackHandlers", "WitUtteranceMatcher");
// Type namespace: Meta.WitAi.CallbackHandlers
namespace Meta::WitAi::CallbackHandlers {
  // Size: 0x50
  #pragma pack(push, 1)
  // Autogenerated type: Meta.WitAi.CallbackHandlers.WitUtteranceMatcher
  // [TokenAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: FFFFFFFF
  class WitUtteranceMatcher : public ::Meta::WitAi::CallbackHandlers::WitResponseHandler {
    public:
    // Writing base type padding for base size: 0x2A to desired offset: 0x30
    char ___base_padding[0x6] = {};
    public:
    // private System.String searchText
    // Size: 0x8
    // Offset: 0x30
    ::StringW searchText;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean exactMatch
    // Size: 0x1
    // Offset: 0x38
    bool exactMatch;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean useRegex
    // Size: 0x1
    // Offset: 0x39
    bool useRegex;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: useRegex and: onUtteranceMatched
    char __padding2[0x6] = {};
    // private Meta.WitAi.Utilities.StringEvent onUtteranceMatched
    // Size: 0x8
    // Offset: 0x40
    ::Meta::WitAi::Utilities::StringEvent* onUtteranceMatched;
    // Field size check
    static_assert(sizeof(::Meta::WitAi::Utilities::StringEvent*) == 0x8);
    // private System.Text.RegularExpressions.Regex regex
    // Size: 0x8
    // Offset: 0x48
    ::System::Text::RegularExpressions::Regex* regex;
    // Field size check
    static_assert(sizeof(::System::Text::RegularExpressions::Regex*) == 0x8);
    public:
    // Get instance field reference: private System.String searchText
    [[deprecated("Use field access instead!")]] ::StringW& dyn_searchText();
    // Get instance field reference: private System.Boolean exactMatch
    [[deprecated("Use field access instead!")]] bool& dyn_exactMatch();
    // Get instance field reference: private System.Boolean useRegex
    [[deprecated("Use field access instead!")]] bool& dyn_useRegex();
    // Get instance field reference: private Meta.WitAi.Utilities.StringEvent onUtteranceMatched
    [[deprecated("Use field access instead!")]] ::Meta::WitAi::Utilities::StringEvent*& dyn_onUtteranceMatched();
    // Get instance field reference: private System.Text.RegularExpressions.Regex regex
    [[deprecated("Use field access instead!")]] ::System::Text::RegularExpressions::Regex*& dyn_regex();
    // private System.Boolean IsMatch(System.String text)
    // Offset: 0x446A6A0
    bool IsMatch(::StringW text);
    // protected override System.String OnValidateResponse(Meta.WitAi.Json.WitResponseNode response, System.Boolean isEarlyResponse)
    // Offset: 0x446A5F0
    // Implemented from: Meta.WitAi.CallbackHandlers.WitResponseHandler
    // Base method: System.String WitResponseHandler::OnValidateResponse(Meta.WitAi.Json.WitResponseNode response, System.Boolean isEarlyResponse)
    ::StringW OnValidateResponse(::Meta::WitAi::Json::WitResponseNode* response, bool isEarlyResponse);
    // protected override System.Void OnResponseInvalid(Meta.WitAi.Json.WitResponseNode response, System.String error)
    // Offset: 0x446A814
    // Implemented from: Meta.WitAi.CallbackHandlers.WitResponseHandler
    // Base method: System.Void WitResponseHandler::OnResponseInvalid(Meta.WitAi.Json.WitResponseNode response, System.String error)
    void OnResponseInvalid(::Meta::WitAi::Json::WitResponseNode* response, ::StringW error);
    // protected override System.Void OnResponseSuccess(Meta.WitAi.Json.WitResponseNode response)
    // Offset: 0x446A818
    // Implemented from: Meta.WitAi.CallbackHandlers.WitResponseHandler
    // Base method: System.Void WitResponseHandler::OnResponseSuccess(Meta.WitAi.Json.WitResponseNode response)
    void OnResponseSuccess(::Meta::WitAi::Json::WitResponseNode* response);
    // public System.Void .ctor()
    // Offset: 0x446A8BC
    // Implemented from: Meta.WitAi.CallbackHandlers.WitResponseHandler
    // Base method: System.Void WitResponseHandler::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static WitUtteranceMatcher* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::Meta::WitAi::CallbackHandlers::WitUtteranceMatcher::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<WitUtteranceMatcher*, creationType>()));
    }
  }; // Meta.WitAi.CallbackHandlers.WitUtteranceMatcher
  #pragma pack(pop)
  static check_size<sizeof(WitUtteranceMatcher), 72 + sizeof(::System::Text::RegularExpressions::Regex*)> __Meta_WitAi_CallbackHandlers_WitUtteranceMatcherSizeCheck;
  static_assert(sizeof(WitUtteranceMatcher) == 0x50);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Meta::WitAi::CallbackHandlers::WitUtteranceMatcher::IsMatch
// Il2CppName: IsMatch
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (Meta::WitAi::CallbackHandlers::WitUtteranceMatcher::*)(::StringW)>(&Meta::WitAi::CallbackHandlers::WitUtteranceMatcher::IsMatch)> {
  static const MethodInfo* get() {
    static auto* text = &::il2cpp_utils::GetClassFromName("System", "String")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Meta::WitAi::CallbackHandlers::WitUtteranceMatcher*), "IsMatch", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{text});
  }
};
// Writing MetadataGetter for method: Meta::WitAi::CallbackHandlers::WitUtteranceMatcher::OnValidateResponse
// Il2CppName: OnValidateResponse
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::StringW (Meta::WitAi::CallbackHandlers::WitUtteranceMatcher::*)(::Meta::WitAi::Json::WitResponseNode*, bool)>(&Meta::WitAi::CallbackHandlers::WitUtteranceMatcher::OnValidateResponse)> {
  static const MethodInfo* get() {
    static auto* response = &::il2cpp_utils::GetClassFromName("Meta.WitAi.Json", "WitResponseNode")->byval_arg;
    static auto* isEarlyResponse = &::il2cpp_utils::GetClassFromName("System", "Boolean")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Meta::WitAi::CallbackHandlers::WitUtteranceMatcher*), "OnValidateResponse", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{response, isEarlyResponse});
  }
};
// Writing MetadataGetter for method: Meta::WitAi::CallbackHandlers::WitUtteranceMatcher::OnResponseInvalid
// Il2CppName: OnResponseInvalid
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Meta::WitAi::CallbackHandlers::WitUtteranceMatcher::*)(::Meta::WitAi::Json::WitResponseNode*, ::StringW)>(&Meta::WitAi::CallbackHandlers::WitUtteranceMatcher::OnResponseInvalid)> {
  static const MethodInfo* get() {
    static auto* response = &::il2cpp_utils::GetClassFromName("Meta.WitAi.Json", "WitResponseNode")->byval_arg;
    static auto* error = &::il2cpp_utils::GetClassFromName("System", "String")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Meta::WitAi::CallbackHandlers::WitUtteranceMatcher*), "OnResponseInvalid", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{response, error});
  }
};
// Writing MetadataGetter for method: Meta::WitAi::CallbackHandlers::WitUtteranceMatcher::OnResponseSuccess
// Il2CppName: OnResponseSuccess
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Meta::WitAi::CallbackHandlers::WitUtteranceMatcher::*)(::Meta::WitAi::Json::WitResponseNode*)>(&Meta::WitAi::CallbackHandlers::WitUtteranceMatcher::OnResponseSuccess)> {
  static const MethodInfo* get() {
    static auto* response = &::il2cpp_utils::GetClassFromName("Meta.WitAi.Json", "WitResponseNode")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Meta::WitAi::CallbackHandlers::WitUtteranceMatcher*), "OnResponseSuccess", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{response});
  }
};
// Writing MetadataGetter for method: Meta::WitAi::CallbackHandlers::WitUtteranceMatcher::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
