// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Reflection.Assembly
#include "System/Reflection/Assembly.hpp"
// Including type: System.IntPtr
#include "System/IntPtr.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Reflection
namespace System::Reflection {
  // Forward declaring type: AssemblyName
  class AssemblyName;
  // Forward declaring type: ManifestResourceInfo
  class ManifestResourceInfo;
  // Forward declaring type: Module
  class Module;
}
// Forward declaring namespace: System::Security::Policy
namespace System::Security::Policy {
  // Forward declaring type: Evidence
  class Evidence;
}
// Forward declaring namespace: System::Threading
namespace System::Threading {
  // Forward declaring type: StackCrawlMark
  struct StackCrawlMark;
}
// Forward declaring namespace: System::Runtime::Serialization
namespace System::Runtime::Serialization {
  // Forward declaring type: SerializationInfo
  class SerializationInfo;
  // Forward declaring type: StreamingContext
  struct StreamingContext;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Type
  class Type;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: Stream
  class Stream;
}
// Completed forward declares
// Type namespace: System.Reflection
namespace System::Reflection {
  // Forward declaring type: RuntimeAssembly
  class RuntimeAssembly;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Reflection::RuntimeAssembly);
DEFINE_IL2CPP_ARG_TYPE(::System::Reflection::RuntimeAssembly*, "System.Reflection", "RuntimeAssembly");
// Type namespace: System.Reflection
namespace System::Reflection {
  // Size: 0x60
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: System.Reflection.RuntimeAssembly
  // [TokenAttribute] Offset: FFFFFFFF
  // [ComVisibleAttribute] Offset: FFFFFFFF
  // [ComDefaultInterfaceAttribute] Offset: FFFFFFFF
  // [ClassInterfaceAttribute] Offset: FFFFFFFF
  class RuntimeAssembly : public ::System::Reflection::Assembly {
    public:
    // Nested type: ::System::Reflection::RuntimeAssembly::UnmanagedMemoryStreamForModule
    class UnmanagedMemoryStreamForModule;
    public:
    // System.IntPtr _mono_assembly
    // Size: 0x8
    // Offset: 0x10
    ::System::IntPtr mono_assembly;
    // Field size check
    static_assert(sizeof(::System::IntPtr) == 0x8);
    // private System.Object _evidence
    // Size: 0x8
    // Offset: 0x18
    ::Il2CppObject* evidence;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // System.Reflection.Assembly/ResolveEventHolder resolve_event_holder
    // Size: 0x8
    // Offset: 0x20
    ::System::Reflection::Assembly::ResolveEventHolder* resolve_event_holder;
    // Field size check
    static_assert(sizeof(::System::Reflection::Assembly::ResolveEventHolder*) == 0x8);
    // private System.Object _minimum
    // Size: 0x8
    // Offset: 0x28
    ::Il2CppObject* minimum;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Object _optional
    // Size: 0x8
    // Offset: 0x30
    ::Il2CppObject* optional;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Object _refuse
    // Size: 0x8
    // Offset: 0x38
    ::Il2CppObject* refuse;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Object _granted
    // Size: 0x8
    // Offset: 0x40
    ::Il2CppObject* granted;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Object _denied
    // Size: 0x8
    // Offset: 0x48
    ::Il2CppObject* denied;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // System.Boolean fromByteArray
    // Size: 0x1
    // Offset: 0x50
    bool fromByteArray;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: fromByteArray and: assemblyName
    char __padding8[0x7] = {};
    // System.String assemblyName
    // Size: 0x8
    // Offset: 0x58
    ::StringW assemblyName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Get instance field reference: System.IntPtr _mono_assembly
    [[deprecated("Use field access instead!")]] ::System::IntPtr& dyn__mono_assembly();
    // Get instance field reference: private System.Object _evidence
    [[deprecated("Use field access instead!")]] ::Il2CppObject*& dyn__evidence();
    // Get instance field reference: System.Reflection.Assembly/ResolveEventHolder resolve_event_holder
    [[deprecated("Use field access instead!")]] ::System::Reflection::Assembly::ResolveEventHolder*& dyn_resolve_event_holder();
    // Get instance field reference: private System.Object _minimum
    [[deprecated("Use field access instead!")]] ::Il2CppObject*& dyn__minimum();
    // Get instance field reference: private System.Object _optional
    [[deprecated("Use field access instead!")]] ::Il2CppObject*& dyn__optional();
