// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Collections.IList
#include "System/Collections/IList.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::ComponentModel
namespace System::ComponentModel {
  // Forward declaring type: EventDescriptor
  class EventDescriptor;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IComparer
  class IComparer;
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Array
  class Array;
}
// Completed forward declares
// Type namespace: System.ComponentModel
namespace System::ComponentModel {
  // Forward declaring type: EventDescriptorCollection
  class EventDescriptorCollection;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::ComponentModel::EventDescriptorCollection);
DEFINE_IL2CPP_ARG_TYPE(::System::ComponentModel::EventDescriptorCollection*, "System.ComponentModel", "EventDescriptorCollection");
// Type namespace: System.ComponentModel
namespace System::ComponentModel {
  // Size: 0x30
  #pragma pack(push, 1)
  // Autogenerated type: System.ComponentModel.EventDescriptorCollection
  // [TokenAttribute] Offset: FFFFFFFF
  // [DefaultMemberAttribute] Offset: FFFFFFFF
  class EventDescriptorCollection : public ::Il2CppObject/*, public ::System::Collections::IList*/ {
    public:
    // Nested type: ::System::ComponentModel::EventDescriptorCollection::ArraySubsetEnumerator
    class ArraySubsetEnumerator;
    public:
    // private System.ComponentModel.EventDescriptor[] _events
    // Size: 0x8
    // Offset: 0x10
    ::ArrayW<::System::ComponentModel::EventDescriptor*> events;
    // Field size check
    static_assert(sizeof(::ArrayW<::System::ComponentModel::EventDescriptor*>) == 0x8);
    // private System.String[] _namedSort
    // Size: 0x8
    // Offset: 0x18
    ::ArrayW<::StringW> namedSort;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // private readonly System.Collections.IComparer _comparer
    // Size: 0x8
    // Offset: 0x20
    ::System::Collections::IComparer* comparer;
    // Field size check
    static_assert(sizeof(::System::Collections::IComparer*) == 0x8);
    // private System.Boolean _eventsOwned
    // Size: 0x1
    // Offset: 0x28
    bool eventsOwned;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _needSort
    // Size: 0x1
    // Offset: 0x29
    bool needSort;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private readonly System.Boolean _readOnly
    // Size: 0x1
    // Offset: 0x2A
    bool readOnly;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: readOnly and: Count
    char __padding5[0x1] = {};
    // private System.Int32 <Count>k__BackingField
    // Size: 0x4
    // Offset: 0x2C
    int Count;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Creating interface conversion operator: operator ::System::Collections::IList
    operator ::System::Collections::IList() noexcept {
      return *reinterpret_cast<::System::Collections::IList*>(this);
    }
    // Get static field: static public readonly System.ComponentModel.EventDescriptorCollection Empty
    static ::System::ComponentModel::EventDescriptorCollection* _get_Empty();
    // Set static field: static public readonly System.ComponentModel.EventDescriptorCollection Empty
    static void _set_Empty(::System::ComponentModel::EventDescriptorCollection* value);
    // Get instance field reference: private System.ComponentModel.EventDescriptor[] _events
    [[deprecated("Use field access instead!")]] ::ArrayW<::System::ComponentModel::EventDescriptor*>& dyn__events();
    // Get instance field reference: private System.String[] _namedSort
    [[deprecated("Use field access instead!")]] ::ArrayW<::StringW>& dyn__namedSort();
    // Get instance field reference: private readonly System.Collections.IComparer _comparer
    [[deprecated("Use field access instead!")]] ::System::Collections::IComparer*& dyn__comparer();
    // Get instance field reference: private System.Boolean _eventsOwned
    [[deprecated("Use field access instead!")]] bool& dyn__eventsOwned();
    // Get instance field reference: private System.Boolean _needSort
    [[deprecated("Use field access instead!")]] bool& dyn__needSort();
    // Get instance field reference: private readonly System.Boolean _readOnly
    [[deprecated("Use field access instead!")]] bool& dyn__readOnly();
    // Get instance field reference: private System.Int32 <Count>k__BackingField
    [[deprecated("Use field access instead!")]] int& dyn_$Count$k__BackingField();
    // public System.Void .ctor(System.ComponentModel.EventDescriptor[] events)
    // Offset: 0x4F0232C
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static EventDescriptorCollection* New_ctor(::ArrayW<::System::ComponentModel::EventDescriptor*> events) {
      static auto ___internal__logger = ::Logger::get().WithContext("::System::ComponentModel::EventDescriptorCollection::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<EventDescriptorCollection*, creationType>(events)));
    }
    // public System.Void .ctor(System.ComponentModel.EventDescriptor[] events, System.Boolean readOnly)
    // Offset: 0x4F02404
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static EventDescriptorCollection* New_ctor(::ArrayW<::System::ComponentModel::EventDescriptor*> events, bool readOnly) {
      static auto ___internal__logger = ::Logger::get().WithContext("::System::ComponentModel::EventDescriptorCollection::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<EventDescriptorCollection*, creationType>(events, readOnly)));
    }
    // private System.Void .ctor(System.ComponentModel.EventDescriptor[] events, System.Int32 eventCount, System.String[] namedSort, System.Collections.IComparer comparer)
    // Offset: 0x4F02428
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static EventDescriptorCollection* New_ctor(::ArrayW<::System::ComponentModel::EventDescriptor*> events, int eventCount, ::ArrayW<::StringW> namedSort, ::System::Collections::IComparer* comparer) {
      static auto ___internal__logger = ::Logger::get().WithContext("::System::ComponentModel::EventDescriptorCollection::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<EventDescriptorCollection*, creationType>(events, eventCount, namedSort, comparer)));
    }
    // public System.Int32 get_Count()
    // Offset: 0x4F0253C
    int get_Count();
    // private System.Void set_Count(System.Int32 value)
    // Offset: 0x4F02544
    void set_Count(int value);
    // public System.ComponentModel.EventDescriptor get_Item(System.Int32 index)
    // Offset: 0x4F0254C
    ::System::ComponentModel::EventDescriptor* get_Item(int index);
    // public System.ComponentModel.EventDescriptor get_Item(System.String name)
    // Offset: 0x4F0268C
    ::System::ComponentModel::EventDescriptor* get_Item(::StringW name);
    // public System.Int32 Add(System.ComponentModel.EventDescriptor value)
    // Offset: 0x4F026A0
    int Add(::System::ComponentModel::EventDescriptor* value);
    // public System.Void Clear()
    // Offset: 0x4F02898
    void Clear();
    // public System.Boolean Contains(System.ComponentModel.EventDescriptor value)
    // Offset: 0x4F028E4
    bool Contains(::System::ComponentModel::EventDescriptor* value);
    // private System.Void System.Collections.ICollection.CopyTo(System.Array array, System.Int32 index)
    // Offset: 0x4F0295C
    void System_Collections_ICollection_CopyTo(::System::Array* array, int index);
    // private System.Void EnsureEventsOwned()
    // Offset: 0x4F025D0
    void EnsureEventsOwned();
    // private System.Void EnsureSize(System.Int32 sizeNeeded)
    // Offset: 0x4F02770
    void EnsureSize(int sizeNeeded);
    // public System.ComponentModel.EventDescriptor Find(System.String name, System.Boolean ignoreCase)
    // Offset: 0x4F02C18
    ::System::ComponentModel::EventDescriptor* Find(::StringW name, bool ignoreCase);
    // public System.Int32 IndexOf(System.ComponentModel.EventDescriptor value)
    // Offset: 0x4F028FC
    int IndexOf(::System::ComponentModel::EventDescriptor* value);
    // public System.Void Insert(System.Int32 index, System.ComponentModel.EventDescriptor value)
    // Offset: 0x4F02D2C
    void Insert(int index, ::System::ComponentModel::EventDescriptor* value);
    // public System.Void Remove(System.ComponentModel.EventDescriptor value)
    // Offset: 0x4F02E1C
    void Remove(::System::ComponentModel::EventDescriptor* value);
    // public System.Void RemoveAt(System.Int32 index)
    // Offset: 0x4F02E84
    void RemoveAt(int index);
    // public System.Collections.IEnumerator GetEnumerator()
    // Offset: 0x4F02F40
    ::System::Collections::IEnumerator* GetEnumerator();
    // public System.ComponentModel.EventDescriptorCollection Sort()
    // Offset: 0x4F03020
    ::System::ComponentModel::EventDescriptorCollection* Sort();
    // public System.ComponentModel.EventDescriptorCollection Sort(System.String[] names)
    // Offset: 0x4F03098
    ::System::ComponentModel::EventDescriptorCollection* Sort(::ArrayW<::StringW> names);
    // public System.ComponentModel.EventDescriptorCollection Sort(System.String[] names, System.Collections.IComparer comparer)
    // Offset: 0x4F03114
    ::System::ComponentModel::EventDescriptorCollection* Sort(::ArrayW<::StringW> names, ::System::Collections::IComparer* comparer);
    // public System.ComponentModel.EventDescriptorCollection Sort(System.Collections.IComparer comparer)
    // Offset: 0x4F03190
    ::System::ComponentModel::EventDescriptorCollection* Sort(::System::Collections::IComparer* comparer);
    // protected System.Void InternalSort(System.String[] names)
    // Offset: 0x4F02998
    void InternalSort(::ArrayW<::StringW> names);
    // protected System.Void InternalSort(System.Collections.IComparer sorter)
    // Offset: 0x4F03208
    void InternalSort(::System::Collections::IComparer* sorter);
    // private System.Boolean System.Collections.ICollection.get_IsSynchronized()
    // Offset: 0x4F03280
    bool System_Collections_ICollection_get_IsSynchronized();
    // private System.Object System.Collections.ICollection.get_SyncRoot()
    // Offset: 0x4F03288
    ::Il2CppObject* System_Collections_ICollection_get_SyncRoot();
    // private System.Int32 System.Collections.ICollection.get_Count()
    // Offset: 0x4F03290
    int System_Collections_ICollection_get_Count();
    // private System.Collections.IEnumerator System.Collections.IEnumerable.GetEnumerator()
    // Offset: 0x4F03298
    ::System::Collections::IEnumerator* System_Collections_IEnumerable_GetEnumerator();
    // private System.Object System.Collections.IList.get_Item(System.Int32 index)
    // Offset: 0x4F0329C
    ::Il2CppObject* System_Collections_IList_get_Item(int index);
    // private System.Void System.Collections.IList.set_Item(System.Int32 index, System.Object value)
    // Offset: 0x4F032AC
    void System_Collections_IList_set_Item(int index, ::Il2CppObject* value);
    // private System.Int32 System.Collections.IList.Add(System.Object value)
    // Offset: 0x4F03418
    int System_Collections_IList_Add(::Il2CppObject* value);
    // private System.Boolean System.Collections.IList.Contains(System.Object value)
    // Offset: 0x4F0349C
    bool System_Collections_IList_Contains(::Il2CppObject* value);
    // private System.Void System.Collections.IList.Clear()
    // Offset: 0x4F0352C
    void System_Collections_IList_Clear();
    // private System.Int32 System.Collections.IList.IndexOf(System.Object value)
    // Offset: 0x4F03530
    int System_Collections_IList_IndexOf(::Il2CppObject* value);
    // private System.Void System.Collections.IList.Insert(System.Int32 index, System.Object value)
    // Offset: 0x4F035B4
    void System_Collections_IList_Insert(int index, ::Il2CppObject* value);
    // private System.Void System.Collections.IList.Remove(System.Object value)
    // Offset: 0x4F03648
    void System_Collections_IList_Remove(::Il2CppObject* value);
    // private System.Void System.Collections.IList.RemoveAt(System.Int32 index)
    // Offset: 0x4F036CC
    void System_Collections_IList_RemoveAt(int index);
    // private System.Boolean System.Collections.IList.get_IsReadOnly()
    // Offset: 0x4F036D0
    bool System_Collections_IList_get_IsReadOnly();
    // private System.Boolean System.Collections.IList.get_IsFixedSize()
    // Offset: 0x4F036D8
    bool System_Collections_IList_get_IsFixedSize();
    // static private System.Void .cctor()
    // Offset: 0x4F036E0
    static void _cctor();
  }; // System.ComponentModel.EventDescriptorCollection
  #pragma pack(pop)
  static check_size<sizeof(EventDescriptorCollection), 44 + sizeof(int)> __System_ComponentModel_EventDescriptorCollectionSizeCheck;
  static_assert(sizeof(EventDescriptorCollection) == 0x30);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: System::ComponentModel::EventDescriptorCollection::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: System::ComponentModel::EventDescriptorCollection::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: System::ComponentModel::EventDescriptorCollection::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: System::ComponentModel::EventDescriptorCollection::get_Count
// Il2CppName: get_Count
template<>
