// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ICloneable
#include "System/ICloneable.hpp"
// Including type: System.Collections.Specialized.BitVector32
#include "System/Collections/Specialized/BitVector32.hpp"
// Including type: System.Char
#include "System/Char.hpp"
// Including type: System.Boolean
#include "System/Boolean.hpp"
// Including type: System.Byte
#include "System/Byte.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::ComponentModel
namespace System::ComponentModel {
  // Forward declaring type: MaskedTextResultHint
  struct MaskedTextResultHint;
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: StringBuilder
  class StringBuilder;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: System::Globalization
namespace System::Globalization {
  // Forward declaring type: CultureInfo
  class CultureInfo;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Type
  class Type;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: System.ComponentModel
namespace System::ComponentModel {
  // Forward declaring type: MaskedTextProvider
  class MaskedTextProvider;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::ComponentModel::MaskedTextProvider);
DEFINE_IL2CPP_ARG_TYPE(::System::ComponentModel::MaskedTextProvider*, "System.ComponentModel", "MaskedTextProvider");
// Type namespace: System.ComponentModel
namespace System::ComponentModel {
  // Size: 0x50
  #pragma pack(push, 1)
  // Autogenerated type: System.ComponentModel.MaskedTextProvider
  // [TokenAttribute] Offset: FFFFFFFF
  // [DefaultMemberAttribute] Offset: FFFFFFFF
  class MaskedTextProvider : public ::Il2CppObject/*, public ::System::ICloneable*/ {
    public:
    // Nested type: ::System::ComponentModel::MaskedTextProvider::CaseConversion
    struct CaseConversion;
    // Nested type: ::System::ComponentModel::MaskedTextProvider::CharType
    struct CharType;
    // Nested type: ::System::ComponentModel::MaskedTextProvider::CharDescriptor
    class CharDescriptor;
    public:
    // private System.Collections.Specialized.BitVector32 _flagState
    // Size: 0x4
    // Offset: 0x10
    ::System::Collections::Specialized::BitVector32 flagState;
    // Field size check
    static_assert(sizeof(::System::Collections::Specialized::BitVector32) == 0x4);
    // Padding between fields: flagState and: testString
    char __padding0[0x4] = {};
    // private System.Text.StringBuilder _testString
    // Size: 0x8
    // Offset: 0x18
    ::System::Text::StringBuilder* testString;
    // Field size check
    static_assert(sizeof(::System::Text::StringBuilder*) == 0x8);
    // private System.Int32 _requiredCharCount
    // Size: 0x4
    // Offset: 0x20
    int requiredCharCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _requiredEditChars
    // Size: 0x4
    // Offset: 0x24
    int requiredEditChars;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _optionalEditChars
    // Size: 0x4
    // Offset: 0x28
    int optionalEditChars;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Char _passwordChar
    // Size: 0x2
    // Offset: 0x2C
    ::Il2CppChar passwordChar;
    // Field size check
    static_assert(sizeof(::Il2CppChar) == 0x2);
    // private System.Char _promptChar
    // Size: 0x2
    // Offset: 0x2E
    ::Il2CppChar promptChar;
    // Field size check
    static_assert(sizeof(::Il2CppChar) == 0x2);
    // private System.Collections.Generic.List`1<System.ComponentModel.MaskedTextProvider/CharDescriptor> _stringDescriptor
    // Size: 0x8
    // Offset: 0x30
    ::System::Collections::Generic::List_1<::System::ComponentModel::MaskedTextProvider::CharDescriptor*>* stringDescriptor;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::System::ComponentModel::MaskedTextProvider::CharDescriptor*>*) == 0x8);
    // private System.Int32 <AssignedEditPositionCount>k__BackingField
    // Size: 0x4
    // Offset: 0x38
    int AssignedEditPositionCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: AssignedEditPositionCount and: Culture
    char __padding8[0x4] = {};
    // private readonly System.Globalization.CultureInfo <Culture>k__BackingField
    // Size: 0x8
    // Offset: 0x40
    ::System::Globalization::CultureInfo* Culture;
    // Field size check
    static_assert(sizeof(::System::Globalization::CultureInfo*) == 0x8);
    // private readonly System.String <Mask>k__BackingField
    // Size: 0x8
    // Offset: 0x48
    ::StringW Mask;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Creating interface conversion operator: operator ::System::ICloneable
    operator ::System::ICloneable() noexcept {
      return *reinterpret_cast<::System::ICloneable*>(this);
    }
    // static field const value: static private System.Char SPACE_CHAR
    static constexpr const ::Il2CppChar SPACE_CHAR = u' ';
    // Get static field: static private System.Char SPACE_CHAR
    static ::Il2CppChar _get_SPACE_CHAR();
    // Set static field: static private System.Char SPACE_CHAR
    static void _set_SPACE_CHAR(::Il2CppChar value);
    // static field const value: static private System.Char DEFAULT_PROMPT_CHAR
    static constexpr const ::Il2CppChar DEFAULT_PROMPT_CHAR = u'_';
    // Get static field: static private System.Char DEFAULT_PROMPT_CHAR
    static ::Il2CppChar _get_DEFAULT_PROMPT_CHAR();
