// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
// Including type: System.Double
#include "System/Double.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Technie::PhysicsCreator::QHull
namespace Technie::PhysicsCreator::QHull {
  // Forward declaring type: Vertex
  class Vertex;
  // Forward declaring type: Face
  class Face;
  // Forward declaring type: HalfEdge
  class HalfEdge;
  // Forward declaring type: FaceList
  class FaceList;
  // Forward declaring type: VertexList
  class VertexList;
  // Forward declaring type: Point3d
  class Point3d;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: Technie.PhysicsCreator.QHull
namespace Technie::PhysicsCreator::QHull {
  // Forward declaring type: QuickHull3D
  class QuickHull3D;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Technie::PhysicsCreator::QHull::QuickHull3D);
DEFINE_IL2CPP_ARG_TYPE(::Technie::PhysicsCreator::QHull::QuickHull3D*, "Technie.PhysicsCreator.QHull", "QuickHull3D");
// Type namespace: Technie.PhysicsCreator.QHull
namespace Technie::PhysicsCreator::QHull {
  // Size: 0x98
  #pragma pack(push, 1)
  // Autogenerated type: Technie.PhysicsCreator.QHull.QuickHull3D
  // [TokenAttribute] Offset: FFFFFFFF
  class QuickHull3D : public ::Il2CppObject {
    public:
    public:
    // protected System.Int32 findIndex
    // Size: 0x4
    // Offset: 0x10
    int findIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: findIndex and: charLength
    char __padding0[0x4] = {};
    // protected System.Double charLength
    // Size: 0x8
    // Offset: 0x18
    double charLength;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // protected System.Boolean debug
    // Size: 0x1
    // Offset: 0x20
    bool debug;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: debug and: pointBuffer
    char __padding2[0x7] = {};
    // protected Technie.PhysicsCreator.QHull.Vertex[] pointBuffer
    // Size: 0x8
    // Offset: 0x28
    ::ArrayW<::Technie::PhysicsCreator::QHull::Vertex*> pointBuffer;
    // Field size check
    static_assert(sizeof(::ArrayW<::Technie::PhysicsCreator::QHull::Vertex*>) == 0x8);
    // protected System.Int32[] vertexPointIndices
    // Size: 0x8
    // Offset: 0x30
    ::ArrayW<int> vertexPointIndices;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // private Technie.PhysicsCreator.QHull.Face[] discardedFaces
    // Size: 0x8
    // Offset: 0x38
    ::ArrayW<::Technie::PhysicsCreator::QHull::Face*> discardedFaces;
    // Field size check
    static_assert(sizeof(::ArrayW<::Technie::PhysicsCreator::QHull::Face*>) == 0x8);
    // private Technie.PhysicsCreator.QHull.Vertex[] maxVtxs
    // Size: 0x8
    // Offset: 0x40
    ::ArrayW<::Technie::PhysicsCreator::QHull::Vertex*> maxVtxs;
    // Field size check
    static_assert(sizeof(::ArrayW<::Technie::PhysicsCreator::QHull::Vertex*>) == 0x8);
    // private Technie.PhysicsCreator.QHull.Vertex[] minVtxs
    // Size: 0x8
    // Offset: 0x48
    ::ArrayW<::Technie::PhysicsCreator::QHull::Vertex*> minVtxs;
    // Field size check
    static_assert(sizeof(::ArrayW<::Technie::PhysicsCreator::QHull::Vertex*>) == 0x8);
    // protected System.Collections.Generic.List`1<Technie.PhysicsCreator.QHull.Face> faces
    // Size: 0x8
    // Offset: 0x50
    ::System::Collections::Generic::List_1<::Technie::PhysicsCreator::QHull::Face*>* faces;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Technie::PhysicsCreator::QHull::Face*>*) == 0x8);
    // protected System.Collections.Generic.List`1<Technie.PhysicsCreator.QHull.HalfEdge> horizon
    // Size: 0x8
    // Offset: 0x58
    ::System::Collections::Generic::List_1<::Technie::PhysicsCreator::QHull::HalfEdge*>* horizon;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Technie::PhysicsCreator::QHull::HalfEdge*>*) == 0x8);
    // private Technie.PhysicsCreator.QHull.FaceList newFaces
    // Size: 0x8
    // Offset: 0x60
    ::Technie::PhysicsCreator::QHull::FaceList* newFaces;
    // Field size check
    static_assert(sizeof(::Technie::PhysicsCreator::QHull::FaceList*) == 0x8);
    // private Technie.PhysicsCreator.QHull.VertexList unclaimed
    // Size: 0x8
    // Offset: 0x68
    ::Technie::PhysicsCreator::QHull::VertexList* unclaimed;
    // Field size check
    static_assert(sizeof(::Technie::PhysicsCreator::QHull::VertexList*) == 0x8);
    // private Technie.PhysicsCreator.QHull.VertexList claimed
    // Size: 0x8
    // Offset: 0x70
    ::Technie::PhysicsCreator::QHull::VertexList* claimed;
    // Field size check
    static_assert(sizeof(::Technie::PhysicsCreator::QHull::VertexList*) == 0x8);
    // protected System.Int32 numVertices
    // Size: 0x4
    // Offset: 0x78
    int numVertices;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Int32 numFaces
    // Size: 0x4
    // Offset: 0x7C
    int numFaces;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Int32 numPoints
    // Size: 0x4
    // Offset: 0x80
    int numPoints;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: numPoints and: explicitTolerance
    char __padding15[0x4] = {};
    // protected System.Double explicitTolerance
    // Size: 0x8
    // Offset: 0x88
    double explicitTolerance;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // protected System.Double tolerance
    // Size: 0x8
    // Offset: 0x90
    double tolerance;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    public:
    // static field const value: static public System.Int32 CLOCKWISE
    static constexpr const int CLOCKWISE = 1;
    // Get static field: static public System.Int32 CLOCKWISE
    static int _get_CLOCKWISE();
    // Set static field: static public System.Int32 CLOCKWISE
    static void _set_CLOCKWISE(int value);
    // static field const value: static public System.Int32 INDEXED_FROM_ONE
    static constexpr const int INDEXED_FROM_ONE = 2;
    // Get static field: static public System.Int32 INDEXED_FROM_ONE
    static int _get_INDEXED_FROM_ONE();
    // Set static field: static public System.Int32 INDEXED_FROM_ONE
    static void _set_INDEXED_FROM_ONE(int value);
    // static field const value: static public System.Int32 INDEXED_FROM_ZERO
    static constexpr const int INDEXED_FROM_ZERO = 4;
    // Get static field: static public System.Int32 INDEXED_FROM_ZERO
