// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: Fusion.INetworkStruct
#include "Fusion/INetworkStruct.hpp"
// Including type: Fusion.IFixedStorage
#include "Fusion/IFixedStorage.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
// Completed includes
// Type namespace: Fusion
namespace Fusion {
  // Forward declaring type: _512
  struct _512;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::Fusion::_512, "Fusion", "_512");
// Type namespace: Fusion
namespace Fusion {
  // Size: 0x800
  #pragma pack(push, 1)
  // WARNING Layout: Explicit may not be correctly taken into account!
  // Autogenerated type: Fusion._512
  // [TokenAttribute] Offset: FFFFFFFF
  // [NetworkStructWeavedAttribute] Offset: FFFFFFFF
  struct _512/*, public ::System::ValueType, public ::Fusion::INetworkStruct, public ::Fusion::IFixedStorage*/ {
    public:
    // Nested type: ::Fusion::_512::$Data$e__FixedBuffer
    struct $Data$e__FixedBuffer;
    // Size: 0x4
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: Fusion._512/<Data>e__FixedBuffer
    // [TokenAttribute] Offset: FFFFFFFF
    // [UnsafeValueTypeAttribute] Offset: FFFFFFFF
    // [CompilerGeneratedAttribute] Offset: FFFFFFFF
    struct $Data$e__FixedBuffer/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.UInt32 FixedElementField
      // Size: 0x4
      // Offset: 0x0
      uint FixedElementField;
      // Field size check
      static_assert(sizeof(uint) == 0x4);
      public:
      // Creating value type constructor for type: $Data$e__FixedBuffer
      constexpr $Data$e__FixedBuffer(uint FixedElementField_ = {}) noexcept : FixedElementField{FixedElementField_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Creating conversion operator: operator uint
      constexpr operator uint() const noexcept {
        return FixedElementField;
      }
      // Get instance field reference: public System.UInt32 FixedElementField
      [[deprecated("Use field access instead!")]] uint& dyn_FixedElementField();
    }; // Fusion._512/<Data>e__FixedBuffer
    #pragma pack(pop)
    static check_size<sizeof(_512::$Data$e__FixedBuffer), 0 + sizeof(uint)> __Fusion__512_$Data$e__FixedBufferSizeCheck;
    static_assert(sizeof(_512::$Data$e__FixedBuffer) == 0x4);
    public:
    // Creating union for fields at offset: 0x0
    union {
      // public Fusion._512/<Data>e__FixedBuffer Data
      // Size: 0x4
      // Offset: 0x0
      ::Fusion::_512::$Data$e__FixedBuffer Data;
      // Field size check
      static_assert(sizeof(::Fusion::_512::$Data$e__FixedBuffer) == 0x4);
      // private System.UInt32 _data0
      // Size: 0x4
      // Offset: 0x0
      uint data0;
      // Field size check
      static_assert(sizeof(uint) == 0x4);
    };
    // private System.UInt32 _data1
    // Size: 0x4
    // Offset: 0x4
    uint data1;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data2
    // Size: 0x4
    // Offset: 0x8
    uint data2;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data3
    // Size: 0x4
    // Offset: 0xC
    uint data3;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data4
    // Size: 0x4
    // Offset: 0x10
    uint data4;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data5
    // Size: 0x4
    // Offset: 0x14
    uint data5;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data6
    // Size: 0x4
    // Offset: 0x18
    uint data6;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data7
    // Size: 0x4
    // Offset: 0x1C
    uint data7;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data8
    // Size: 0x4
    // Offset: 0x20
    uint data8;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data9
    // Size: 0x4
    // Offset: 0x24
    uint data9;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data10
    // Size: 0x4
    // Offset: 0x28
    uint data10;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data11
    // Size: 0x4
    // Offset: 0x2C
    uint data11;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data12
    // Size: 0x4
    // Offset: 0x30
    uint data12;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data13
    // Size: 0x4
    // Offset: 0x34
    uint data13;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data14
    // Size: 0x4
    // Offset: 0x38
    uint data14;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data15
    // Size: 0x4
    // Offset: 0x3C
    uint data15;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data16
    // Size: 0x4
    // Offset: 0x40
    uint data16;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data17
    // Size: 0x4
    // Offset: 0x44
    uint data17;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data18
    // Size: 0x4
    // Offset: 0x48
    uint data18;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data19
    // Size: 0x4
    // Offset: 0x4C
    uint data19;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data20
    // Size: 0x4
    // Offset: 0x50
    uint data20;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data21
    // Size: 0x4
    // Offset: 0x54
    uint data21;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data22
    // Size: 0x4
    // Offset: 0x58
    uint data22;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data23
    // Size: 0x4
    // Offset: 0x5C
    uint data23;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data24
    // Size: 0x4
    // Offset: 0x60
    uint data24;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data25
    // Size: 0x4
    // Offset: 0x64
    uint data25;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data26
    // Size: 0x4
    // Offset: 0x68
    uint data26;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data27
    // Size: 0x4
    // Offset: 0x6C
    uint data27;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data28
    // Size: 0x4
    // Offset: 0x70
    uint data28;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data29
    // Size: 0x4
    // Offset: 0x74
    uint data29;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data30
    // Size: 0x4
    // Offset: 0x78
    uint data30;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data31
    // Size: 0x4
    // Offset: 0x7C
    uint data31;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data32
    // Size: 0x4
    // Offset: 0x80
    uint data32;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data33
    // Size: 0x4
    // Offset: 0x84
    uint data33;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data34
    // Size: 0x4
    // Offset: 0x88
    uint data34;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data35
    // Size: 0x4
    // Offset: 0x8C
    uint data35;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data36
    // Size: 0x4
    // Offset: 0x90
    uint data36;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data37
    // Size: 0x4
    // Offset: 0x94
    uint data37;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data38
    // Size: 0x4
    // Offset: 0x98
    uint data38;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data39
    // Size: 0x4
    // Offset: 0x9C
    uint data39;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data40
    // Size: 0x4
    // Offset: 0xA0
    uint data40;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data41
    // Size: 0x4
    // Offset: 0xA4
    uint data41;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data42
    // Size: 0x4
    // Offset: 0xA8
    uint data42;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data43
    // Size: 0x4
    // Offset: 0xAC
    uint data43;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data44
    // Size: 0x4
    // Offset: 0xB0
    uint data44;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data45
    // Size: 0x4
    // Offset: 0xB4
    uint data45;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data46
    // Size: 0x4
    // Offset: 0xB8
    uint data46;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data47
    // Size: 0x4
    // Offset: 0xBC
    uint data47;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data48
    // Size: 0x4
    // Offset: 0xC0
    uint data48;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data49
    // Size: 0x4
    // Offset: 0xC4
    uint data49;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data50
    // Size: 0x4
    // Offset: 0xC8
    uint data50;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data51
    // Size: 0x4
    // Offset: 0xCC
    uint data51;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data52
    // Size: 0x4
    // Offset: 0xD0
    uint data52;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data53
    // Size: 0x4
    // Offset: 0xD4
    uint data53;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data54
    // Size: 0x4
    // Offset: 0xD8
    uint data54;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data55
    // Size: 0x4
    // Offset: 0xDC
    uint data55;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data56
    // Size: 0x4
    // Offset: 0xE0
    uint data56;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data57
    // Size: 0x4
    // Offset: 0xE4
    uint data57;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data58
    // Size: 0x4
    // Offset: 0xE8
    uint data58;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data59
    // Size: 0x4
    // Offset: 0xEC
    uint data59;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data60
    // Size: 0x4
    // Offset: 0xF0
    uint data60;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data61
    // Size: 0x4
    // Offset: 0xF4
    uint data61;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data62
    // Size: 0x4
    // Offset: 0xF8
    uint data62;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data63
    // Size: 0x4
    // Offset: 0xFC
    uint data63;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data64
    // Size: 0x4
    // Offset: 0x100
    uint data64;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data65
    // Size: 0x4
    // Offset: 0x104
    uint data65;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data66
    // Size: 0x4
    // Offset: 0x108
    uint data66;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data67
    // Size: 0x4
    // Offset: 0x10C
    uint data67;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data68
    // Size: 0x4
    // Offset: 0x110
    uint data68;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data69
    // Size: 0x4
    // Offset: 0x114
    uint data69;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data70
    // Size: 0x4
    // Offset: 0x118
    uint data70;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data71
    // Size: 0x4
    // Offset: 0x11C
    uint data71;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data72
    // Size: 0x4
    // Offset: 0x120
    uint data72;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data73
    // Size: 0x4
    // Offset: 0x124
    uint data73;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data74
    // Size: 0x4
    // Offset: 0x128
    uint data74;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data75
    // Size: 0x4
    // Offset: 0x12C
    uint data75;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data76
    // Size: 0x4
    // Offset: 0x130
    uint data76;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data77
    // Size: 0x4
    // Offset: 0x134
    uint data77;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data78
    // Size: 0x4
    // Offset: 0x138
    uint data78;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data79
    // Size: 0x4
    // Offset: 0x13C
    uint data79;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data80
    // Size: 0x4
    // Offset: 0x140
    uint data80;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data81
    // Size: 0x4
    // Offset: 0x144
    uint data81;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data82
    // Size: 0x4
    // Offset: 0x148
    uint data82;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data83
    // Size: 0x4
    // Offset: 0x14C
    uint data83;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data84
    // Size: 0x4
    // Offset: 0x150
    uint data84;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data85
    // Size: 0x4
    // Offset: 0x154
    uint data85;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data86
    // Size: 0x4
    // Offset: 0x158
    uint data86;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data87
    // Size: 0x4
    // Offset: 0x15C
    uint data87;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data88
    // Size: 0x4
    // Offset: 0x160
    uint data88;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data89
    // Size: 0x4
    // Offset: 0x164
    uint data89;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data90
    // Size: 0x4
    // Offset: 0x168
    uint data90;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data91
    // Size: 0x4
    // Offset: 0x16C
    uint data91;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data92
    // Size: 0x4
    // Offset: 0x170
    uint data92;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data93
    // Size: 0x4
    // Offset: 0x174
    uint data93;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data94
    // Size: 0x4
    // Offset: 0x178
    uint data94;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data95
    // Size: 0x4
    // Offset: 0x17C
    uint data95;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data96
    // Size: 0x4
    // Offset: 0x180
    uint data96;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data97
    // Size: 0x4
    // Offset: 0x184
    uint data97;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data98
    // Size: 0x4
    // Offset: 0x188
    uint data98;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data99
    // Size: 0x4
    // Offset: 0x18C
    uint data99;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data100
    // Size: 0x4
    // Offset: 0x190
    uint data100;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data101
    // Size: 0x4
    // Offset: 0x194
    uint data101;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data102
    // Size: 0x4
    // Offset: 0x198
    uint data102;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data103
    // Size: 0x4
    // Offset: 0x19C
    uint data103;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data104
    // Size: 0x4
    // Offset: 0x1A0
    uint data104;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data105
    // Size: 0x4
    // Offset: 0x1A4
    uint data105;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data106
    // Size: 0x4
    // Offset: 0x1A8
    uint data106;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data107
    // Size: 0x4
    // Offset: 0x1AC
    uint data107;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data108
    // Size: 0x4
    // Offset: 0x1B0
    uint data108;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data109
    // Size: 0x4
    // Offset: 0x1B4
    uint data109;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data110
    // Size: 0x4
    // Offset: 0x1B8
    uint data110;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data111
    // Size: 0x4
    // Offset: 0x1BC
    uint data111;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data112
    // Size: 0x4
    // Offset: 0x1C0
    uint data112;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data113
    // Size: 0x4
    // Offset: 0x1C4
    uint data113;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data114
    // Size: 0x4
    // Offset: 0x1C8
    uint data114;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data115
    // Size: 0x4
    // Offset: 0x1CC
    uint data115;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data116
    // Size: 0x4
    // Offset: 0x1D0
    uint data116;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data117
    // Size: 0x4
    // Offset: 0x1D4
    uint data117;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data118
    // Size: 0x4
    // Offset: 0x1D8
    uint data118;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data119
    // Size: 0x4
    // Offset: 0x1DC
    uint data119;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data120
    // Size: 0x4
    // Offset: 0x1E0
    uint data120;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data121
    // Size: 0x4
    // Offset: 0x1E4
    uint data121;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data122
    // Size: 0x4
    // Offset: 0x1E8
    uint data122;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data123
    // Size: 0x4
    // Offset: 0x1EC
    uint data123;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data124
    // Size: 0x4
    // Offset: 0x1F0
    uint data124;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data125
    // Size: 0x4
    // Offset: 0x1F4
    uint data125;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data126
    // Size: 0x4
    // Offset: 0x1F8
    uint data126;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data127
    // Size: 0x4
    // Offset: 0x1FC
    uint data127;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data128
    // Size: 0x4
    // Offset: 0x200
    uint data128;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data129
    // Size: 0x4
    // Offset: 0x204
    uint data129;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data130
    // Size: 0x4
    // Offset: 0x208
    uint data130;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data131
    // Size: 0x4
    // Offset: 0x20C
    uint data131;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data132
    // Size: 0x4
    // Offset: 0x210
    uint data132;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data133
    // Size: 0x4
    // Offset: 0x214
    uint data133;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data134
    // Size: 0x4
    // Offset: 0x218
    uint data134;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data135
    // Size: 0x4
    // Offset: 0x21C
    uint data135;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data136
    // Size: 0x4
    // Offset: 0x220
    uint data136;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data137
    // Size: 0x4
    // Offset: 0x224
    uint data137;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data138
    // Size: 0x4
    // Offset: 0x228
    uint data138;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data139
    // Size: 0x4
    // Offset: 0x22C
    uint data139;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data140
    // Size: 0x4
    // Offset: 0x230
    uint data140;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data141
    // Size: 0x4
    // Offset: 0x234
    uint data141;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data142
    // Size: 0x4
    // Offset: 0x238
    uint data142;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data143
    // Size: 0x4
    // Offset: 0x23C
    uint data143;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data144
    // Size: 0x4
    // Offset: 0x240
    uint data144;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data145
    // Size: 0x4
    // Offset: 0x244
    uint data145;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data146
    // Size: 0x4
    // Offset: 0x248
    uint data146;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data147
    // Size: 0x4
    // Offset: 0x24C
    uint data147;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data148
    // Size: 0x4
    // Offset: 0x250
    uint data148;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data149
    // Size: 0x4
    // Offset: 0x254
    uint data149;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data150
    // Size: 0x4
    // Offset: 0x258
    uint data150;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data151
    // Size: 0x4
    // Offset: 0x25C
    uint data151;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data152
    // Size: 0x4
    // Offset: 0x260
    uint data152;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data153
    // Size: 0x4
    // Offset: 0x264
    uint data153;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data154
    // Size: 0x4
    // Offset: 0x268
    uint data154;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data155
    // Size: 0x4
    // Offset: 0x26C
    uint data155;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data156
    // Size: 0x4
    // Offset: 0x270
    uint data156;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data157
    // Size: 0x4
    // Offset: 0x274
    uint data157;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data158
    // Size: 0x4
    // Offset: 0x278
    uint data158;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data159
    // Size: 0x4
    // Offset: 0x27C
    uint data159;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data160
    // Size: 0x4
    // Offset: 0x280
    uint data160;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data161
    // Size: 0x4
    // Offset: 0x284
    uint data161;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data162
    // Size: 0x4
    // Offset: 0x288
    uint data162;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data163
    // Size: 0x4
    // Offset: 0x28C
    uint data163;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data164
    // Size: 0x4
    // Offset: 0x290
    uint data164;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data165
    // Size: 0x4
    // Offset: 0x294
    uint data165;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data166
    // Size: 0x4
    // Offset: 0x298
    uint data166;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data167
    // Size: 0x4
    // Offset: 0x29C
    uint data167;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data168
    // Size: 0x4
    // Offset: 0x2A0
    uint data168;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data169
    // Size: 0x4
    // Offset: 0x2A4
    uint data169;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data170
    // Size: 0x4
    // Offset: 0x2A8
    uint data170;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data171
    // Size: 0x4
    // Offset: 0x2AC
    uint data171;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data172
    // Size: 0x4
    // Offset: 0x2B0
    uint data172;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data173
    // Size: 0x4
    // Offset: 0x2B4
    uint data173;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data174
    // Size: 0x4
    // Offset: 0x2B8
    uint data174;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data175
    // Size: 0x4
    // Offset: 0x2BC
    uint data175;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data176
    // Size: 0x4
    // Offset: 0x2C0
    uint data176;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data177
    // Size: 0x4
    // Offset: 0x2C4
    uint data177;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data178
    // Size: 0x4
    // Offset: 0x2C8
    uint data178;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data179
    // Size: 0x4
    // Offset: 0x2CC
    uint data179;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data180
    // Size: 0x4
    // Offset: 0x2D0
    uint data180;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data181
    // Size: 0x4
    // Offset: 0x2D4
    uint data181;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data182
    // Size: 0x4
    // Offset: 0x2D8
    uint data182;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data183
    // Size: 0x4
    // Offset: 0x2DC
    uint data183;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data184
    // Size: 0x4
    // Offset: 0x2E0
    uint data184;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data185
    // Size: 0x4
    // Offset: 0x2E4
    uint data185;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data186
    // Size: 0x4
    // Offset: 0x2E8
    uint data186;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data187
    // Size: 0x4
    // Offset: 0x2EC
    uint data187;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data188
    // Size: 0x4
    // Offset: 0x2F0
    uint data188;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data189
    // Size: 0x4
    // Offset: 0x2F4
    uint data189;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data190
    // Size: 0x4
    // Offset: 0x2F8
    uint data190;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data191
    // Size: 0x4
    // Offset: 0x2FC
    uint data191;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data192
    // Size: 0x4
    // Offset: 0x300
    uint data192;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data193
    // Size: 0x4
    // Offset: 0x304
    uint data193;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data194
    // Size: 0x4
    // Offset: 0x308
    uint data194;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data195
    // Size: 0x4
    // Offset: 0x30C
    uint data195;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data196
    // Size: 0x4
    // Offset: 0x310
    uint data196;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data197
    // Size: 0x4
    // Offset: 0x314
    uint data197;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data198
    // Size: 0x4
    // Offset: 0x318
    uint data198;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data199
    // Size: 0x4
    // Offset: 0x31C
    uint data199;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data200
    // Size: 0x4
    // Offset: 0x320
    uint data200;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data201
    // Size: 0x4
    // Offset: 0x324
    uint data201;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data202
    // Size: 0x4
    // Offset: 0x328
    uint data202;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data203
    // Size: 0x4
    // Offset: 0x32C
    uint data203;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data204
    // Size: 0x4
    // Offset: 0x330
    uint data204;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data205
    // Size: 0x4
    // Offset: 0x334
    uint data205;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data206
    // Size: 0x4
    // Offset: 0x338
    uint data206;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data207
    // Size: 0x4
    // Offset: 0x33C
    uint data207;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data208
    // Size: 0x4
    // Offset: 0x340
    uint data208;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data209
    // Size: 0x4
    // Offset: 0x344
    uint data209;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data210
    // Size: 0x4
    // Offset: 0x348
    uint data210;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data211
    // Size: 0x4
    // Offset: 0x34C
    uint data211;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data212
    // Size: 0x4
    // Offset: 0x350
    uint data212;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data213
    // Size: 0x4
    // Offset: 0x354
    uint data213;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data214
    // Size: 0x4
    // Offset: 0x358
    uint data214;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data215
    // Size: 0x4
    // Offset: 0x35C
    uint data215;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data216
    // Size: 0x4
    // Offset: 0x360
    uint data216;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data217
    // Size: 0x4
    // Offset: 0x364
    uint data217;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data218
    // Size: 0x4
    // Offset: 0x368
    uint data218;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data219
    // Size: 0x4
    // Offset: 0x36C
    uint data219;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data220
    // Size: 0x4
    // Offset: 0x370
    uint data220;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data221
    // Size: 0x4
    // Offset: 0x374
    uint data221;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data222
    // Size: 0x4
    // Offset: 0x378
    uint data222;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data223
    // Size: 0x4
    // Offset: 0x37C
    uint data223;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data224
    // Size: 0x4
    // Offset: 0x380
    uint data224;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data225
    // Size: 0x4
    // Offset: 0x384
    uint data225;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data226
    // Size: 0x4
    // Offset: 0x388
    uint data226;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data227
    // Size: 0x4
    // Offset: 0x38C
    uint data227;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data228
    // Size: 0x4
    // Offset: 0x390
    uint data228;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data229
    // Size: 0x4
    // Offset: 0x394
    uint data229;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data230
    // Size: 0x4
    // Offset: 0x398
    uint data230;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data231
    // Size: 0x4
    // Offset: 0x39C
    uint data231;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data232
    // Size: 0x4
    // Offset: 0x3A0
    uint data232;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data233
    // Size: 0x4
    // Offset: 0x3A4
    uint data233;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data234
    // Size: 0x4
    // Offset: 0x3A8
    uint data234;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data235
    // Size: 0x4
    // Offset: 0x3AC
    uint data235;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data236
    // Size: 0x4
    // Offset: 0x3B0
    uint data236;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data237
    // Size: 0x4
    // Offset: 0x3B4
    uint data237;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data238
    // Size: 0x4
    // Offset: 0x3B8
    uint data238;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data239
    // Size: 0x4
    // Offset: 0x3BC
    uint data239;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data240
    // Size: 0x4
    // Offset: 0x3C0
    uint data240;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data241
    // Size: 0x4
    // Offset: 0x3C4
    uint data241;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data242
    // Size: 0x4
    // Offset: 0x3C8
    uint data242;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data243
    // Size: 0x4
    // Offset: 0x3CC
    uint data243;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data244
    // Size: 0x4
    // Offset: 0x3D0
    uint data244;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data245
    // Size: 0x4
    // Offset: 0x3D4
    uint data245;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data246
    // Size: 0x4
    // Offset: 0x3D8
    uint data246;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data247
    // Size: 0x4
    // Offset: 0x3DC
    uint data247;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data248
    // Size: 0x4
    // Offset: 0x3E0
    uint data248;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data249
    // Size: 0x4
    // Offset: 0x3E4
    uint data249;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data250
    // Size: 0x4
    // Offset: 0x3E8
    uint data250;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data251
    // Size: 0x4
    // Offset: 0x3EC
    uint data251;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data252
    // Size: 0x4
    // Offset: 0x3F0
    uint data252;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data253
    // Size: 0x4
    // Offset: 0x3F4
    uint data253;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data254
    // Size: 0x4
    // Offset: 0x3F8
    uint data254;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data255
    // Size: 0x4
    // Offset: 0x3FC
    uint data255;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data256
    // Size: 0x4
    // Offset: 0x400
    uint data256;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data257
    // Size: 0x4
    // Offset: 0x404
    uint data257;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data258
    // Size: 0x4
    // Offset: 0x408
    uint data258;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data259
    // Size: 0x4
    // Offset: 0x40C
    uint data259;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data260
    // Size: 0x4
    // Offset: 0x410
    uint data260;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data261
    // Size: 0x4
    // Offset: 0x414
    uint data261;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data262
    // Size: 0x4
    // Offset: 0x418
    uint data262;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data263
    // Size: 0x4
    // Offset: 0x41C
    uint data263;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data264
    // Size: 0x4
    // Offset: 0x420
    uint data264;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data265
    // Size: 0x4
    // Offset: 0x424
    uint data265;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data266
    // Size: 0x4
    // Offset: 0x428
    uint data266;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data267
    // Size: 0x4
    // Offset: 0x42C
    uint data267;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data268
    // Size: 0x4
    // Offset: 0x430
    uint data268;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data269
    // Size: 0x4
    // Offset: 0x434
    uint data269;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data270
    // Size: 0x4
    // Offset: 0x438
    uint data270;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data271
    // Size: 0x4
    // Offset: 0x43C
    uint data271;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data272
    // Size: 0x4
    // Offset: 0x440
    uint data272;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data273
    // Size: 0x4
    // Offset: 0x444
    uint data273;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data274
    // Size: 0x4
    // Offset: 0x448
    uint data274;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data275
    // Size: 0x4
    // Offset: 0x44C
    uint data275;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data276
    // Size: 0x4
    // Offset: 0x450
    uint data276;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data277
    // Size: 0x4
    // Offset: 0x454
    uint data277;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data278
    // Size: 0x4
    // Offset: 0x458
    uint data278;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data279
    // Size: 0x4
    // Offset: 0x45C
    uint data279;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data280
    // Size: 0x4
    // Offset: 0x460
    uint data280;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data281
    // Size: 0x4
    // Offset: 0x464
    uint data281;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data282
    // Size: 0x4
    // Offset: 0x468
    uint data282;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data283
    // Size: 0x4
    // Offset: 0x46C
    uint data283;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data284
    // Size: 0x4
    // Offset: 0x470
    uint data284;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data285
    // Size: 0x4
    // Offset: 0x474
    uint data285;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data286
    // Size: 0x4
    // Offset: 0x478
    uint data286;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data287
    // Size: 0x4
    // Offset: 0x47C
    uint data287;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data288
    // Size: 0x4
    // Offset: 0x480
    uint data288;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data289
    // Size: 0x4
    // Offset: 0x484
    uint data289;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data290
    // Size: 0x4
    // Offset: 0x488
    uint data290;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data291
    // Size: 0x4
    // Offset: 0x48C
    uint data291;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data292
    // Size: 0x4
    // Offset: 0x490
    uint data292;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data293
    // Size: 0x4
    // Offset: 0x494
    uint data293;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data294
    // Size: 0x4
    // Offset: 0x498
    uint data294;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data295
    // Size: 0x4
    // Offset: 0x49C
    uint data295;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data296
    // Size: 0x4
    // Offset: 0x4A0
    uint data296;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data297
    // Size: 0x4
    // Offset: 0x4A4
    uint data297;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data298
    // Size: 0x4
    // Offset: 0x4A8
    uint data298;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data299
    // Size: 0x4
    // Offset: 0x4AC
    uint data299;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data300
    // Size: 0x4
    // Offset: 0x4B0
    uint data300;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data301
    // Size: 0x4
    // Offset: 0x4B4
    uint data301;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data302
    // Size: 0x4
    // Offset: 0x4B8
    uint data302;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data303
    // Size: 0x4
    // Offset: 0x4BC
    uint data303;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data304
    // Size: 0x4
    // Offset: 0x4C0
    uint data304;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data305
    // Size: 0x4
    // Offset: 0x4C4
    uint data305;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data306
    // Size: 0x4
    // Offset: 0x4C8
    uint data306;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data307
    // Size: 0x4
    // Offset: 0x4CC
    uint data307;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data308
    // Size: 0x4
    // Offset: 0x4D0
    uint data308;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data309
    // Size: 0x4
    // Offset: 0x4D4
    uint data309;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data310
    // Size: 0x4
    // Offset: 0x4D8
    uint data310;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data311
    // Size: 0x4
    // Offset: 0x4DC
    uint data311;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data312
    // Size: 0x4
    // Offset: 0x4E0
    uint data312;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data313
    // Size: 0x4
    // Offset: 0x4E4
    uint data313;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data314
    // Size: 0x4
    // Offset: 0x4E8
    uint data314;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data315
    // Size: 0x4
    // Offset: 0x4EC
    uint data315;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data316
    // Size: 0x4
    // Offset: 0x4F0
    uint data316;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data317
    // Size: 0x4
    // Offset: 0x4F4
    uint data317;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data318
    // Size: 0x4
    // Offset: 0x4F8
    uint data318;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data319
    // Size: 0x4
    // Offset: 0x4FC
    uint data319;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data320
    // Size: 0x4
    // Offset: 0x500
    uint data320;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data321
    // Size: 0x4
    // Offset: 0x504
    uint data321;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data322
    // Size: 0x4
    // Offset: 0x508
    uint data322;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data323
    // Size: 0x4
    // Offset: 0x50C
    uint data323;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data324
    // Size: 0x4
    // Offset: 0x510
    uint data324;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data325
    // Size: 0x4
    // Offset: 0x514
    uint data325;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data326
    // Size: 0x4
    // Offset: 0x518
    uint data326;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data327
    // Size: 0x4
    // Offset: 0x51C
    uint data327;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data328
    // Size: 0x4
    // Offset: 0x520
    uint data328;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data329
    // Size: 0x4
    // Offset: 0x524
    uint data329;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data330
    // Size: 0x4
    // Offset: 0x528
    uint data330;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data331
    // Size: 0x4
    // Offset: 0x52C
    uint data331;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data332
    // Size: 0x4
    // Offset: 0x530
    uint data332;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data333
    // Size: 0x4
    // Offset: 0x534
    uint data333;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data334
    // Size: 0x4
    // Offset: 0x538
    uint data334;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data335
    // Size: 0x4
    // Offset: 0x53C
    uint data335;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data336
    // Size: 0x4
    // Offset: 0x540
    uint data336;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data337
    // Size: 0x4
    // Offset: 0x544
    uint data337;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data338
    // Size: 0x4
    // Offset: 0x548
    uint data338;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data339
    // Size: 0x4
    // Offset: 0x54C
    uint data339;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data340
    // Size: 0x4
    // Offset: 0x550
    uint data340;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data341
    // Size: 0x4
    // Offset: 0x554
    uint data341;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data342
    // Size: 0x4
    // Offset: 0x558
    uint data342;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data343
    // Size: 0x4
    // Offset: 0x55C
    uint data343;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data344
    // Size: 0x4
    // Offset: 0x560
    uint data344;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data345
    // Size: 0x4
    // Offset: 0x564
    uint data345;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data346
    // Size: 0x4
    // Offset: 0x568
    uint data346;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data347
    // Size: 0x4
    // Offset: 0x56C
    uint data347;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data348
    // Size: 0x4
    // Offset: 0x570
    uint data348;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data349
    // Size: 0x4
    // Offset: 0x574
    uint data349;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data350
    // Size: 0x4
    // Offset: 0x578
    uint data350;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data351
    // Size: 0x4
    // Offset: 0x57C
    uint data351;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data352
    // Size: 0x4
    // Offset: 0x580
    uint data352;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data353
    // Size: 0x4
    // Offset: 0x584
    uint data353;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data354
    // Size: 0x4
    // Offset: 0x588
    uint data354;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data355
    // Size: 0x4
    // Offset: 0x58C
    uint data355;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data356
    // Size: 0x4
    // Offset: 0x590
    uint data356;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data357
    // Size: 0x4
    // Offset: 0x594
    uint data357;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data358
    // Size: 0x4
    // Offset: 0x598
    uint data358;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data359
    // Size: 0x4
    // Offset: 0x59C
    uint data359;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data360
    // Size: 0x4
    // Offset: 0x5A0
    uint data360;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _data361
