// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
// Including type: System.Byte
#include "System/Byte.hpp"
// Including type: Fusion.Ptr
#include "Fusion/Ptr.hpp"
// Including type: Fusion.Simulation
#include "Fusion/Simulation.hpp"
// Including type: Fusion.PageSizes
#include "Fusion/PageSizes.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Fusion
namespace Fusion {
  // Skipping declaration: Config because it is already included!
}
// Forward declaring namespace: Fusion::Sockets
namespace Fusion::Sockets {
  // Forward declaring type: NetBitBuffer
  struct NetBitBuffer;
}
// Completed forward declares
// Type namespace: Fusion
namespace Fusion {
  // Forward declaring type: Allocator
  struct Allocator;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::Fusion::Allocator, "Fusion", "Allocator");
// Type namespace: Fusion
namespace Fusion {
  // Size: 0x70
  #pragma pack(push, 1)
  // WARNING Layout: Explicit may not be correctly taken into account!
  // Autogenerated type: Fusion.Allocator
  // [TokenAttribute] Offset: FFFFFFFF
  struct Allocator/*, public ::System::ValueType*/ {
    public:
    // Nested type: ::Fusion::Allocator::Block
    struct Block;
    // Nested type: ::Fusion::Allocator::BlockList
    struct BlockList;
    // Nested type: ::Fusion::Allocator::Bucket
    struct Bucket;
    // Nested type: ::Fusion::Allocator::AllocatorBucketSize
    class AllocatorBucketSize;
    // Nested type: ::Fusion::Allocator::Config
    struct Config;
    // Nested type: ::Fusion::Allocator::Segment
    struct Segment;
    // Size: 0xC
    #pragma pack(push, 1)
    // WARNING Layout: Explicit may not be correctly taken into account!
    // Autogenerated type: Fusion.Allocator/Config
    // [TokenAttribute] Offset: FFFFFFFF
    struct Config/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.Int32 BlockShift
      // Size: 0x4
      // Offset: 0x0
      int BlockShift;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Int32 BlockCount
      // Size: 0x4
      // Offset: 0x4
      int BlockCount;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Int32 GlobalsSize
      // Size: 0x4
      // Offset: 0x8
      int GlobalsSize;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: Config
      constexpr Config(int BlockShift_ = {}, int BlockCount_ = {}, int GlobalsSize_ = {}) noexcept : BlockShift{BlockShift_}, BlockCount{BlockCount_}, GlobalsSize{GlobalsSize_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // static field const value: static public System.Int32 SIZE
      static constexpr const int SIZE = 12;
      // Get static field: static public System.Int32 SIZE
      static int _get_SIZE();
      // Set static field: static public System.Int32 SIZE
      static void _set_SIZE(int value);
      // static field const value: static public Fusion.PageSizes DEFAULT_BLOCK_SHIFT
      static constexpr const int DEFAULT_BLOCK_SHIFT = 14;
      // Get static field: static public Fusion.PageSizes DEFAULT_BLOCK_SHIFT
      static ::Fusion::PageSizes _get_DEFAULT_BLOCK_SHIFT();
      // Set static field: static public Fusion.PageSizes DEFAULT_BLOCK_SHIFT
      static void _set_DEFAULT_BLOCK_SHIFT(::Fusion::PageSizes value);
      // static field const value: static public System.Int32 DEFAULT_BLOCK_COUNT
      static constexpr const int DEFAULT_BLOCK_COUNT = 128;
      // Get static field: static public System.Int32 DEFAULT_BLOCK_COUNT
      static int _get_DEFAULT_BLOCK_COUNT();
      // Set static field: static public System.Int32 DEFAULT_BLOCK_COUNT
      static void _set_DEFAULT_BLOCK_COUNT(int value);
      // Get instance field reference: public System.Int32 BlockShift
      [[deprecated("Use field access instead!")]] int& dyn_BlockShift();
      // Get instance field reference: public System.Int32 BlockCount
      [[deprecated("Use field access instead!")]] int& dyn_BlockCount();
      // Get instance field reference: public System.Int32 GlobalsSize
      [[deprecated("Use field access instead!")]] int& dyn_GlobalsSize();
      // public System.Int32 get_BlockByteSize()
      // Offset: 0x2AFCE54
      int get_BlockByteSize();
      // public System.Int32 get_BlockWordCount()
      // Offset: 0x2AFE130
      int get_BlockWordCount();
      // public System.Int32 get_HeapSizeUsable()
      // Offset: 0x2AFCD50
      int get_HeapSizeUsable();
      // public System.Int32 get_HeapSizeAllocated()
      // Offset: 0x2AFE148
      int get_HeapSizeAllocated();
      // public System.Void .ctor(Fusion.PageSizes shift, System.Int32 count, System.Int32 globalsSize)
      // Offset: 0x2AFE3A8
      Config(::Fusion::PageSizes shift, int count, int globalsSize);
      // public System.Boolean Equals(Fusion.Allocator/Config other)
      // Offset: 0x2AFE42C
      bool Equals(::Fusion::Allocator::Config other);
      // public override System.Boolean Equals(System.Object obj)
      // Offset: 0x2AFE454
      // Implemented from: System.ValueType
      // Base method: System.Boolean ValueType::Equals(System.Object obj)
      bool Equals(::Il2CppObject* obj);
      // public override System.Int32 GetHashCode()
      // Offset: 0x2AFE4DC
      // Implemented from: System.ValueType
      // Base method: System.Int32 ValueType::GetHashCode()
      int GetHashCode();
      // public override System.String ToString()
      // Offset: 0x2AFE4F0
      // Implemented from: System.ValueType
      // Base method: System.String ValueType::ToString()
      ::StringW ToString();
    }; // Fusion.Allocator/Config
    #pragma pack(pop)
    static check_size<sizeof(Allocator::Config), 8 + sizeof(int)> __Fusion_Allocator_ConfigSizeCheck;
    static_assert(sizeof(Allocator::Config) == 0xC);
    public:
    // private System.Byte* _root
    // Size: 0x8
    // Offset: 0x0
    uint8_t* root;
    // Field size check
    static_assert(sizeof(uint8_t*) == 0x8);
    // private System.Byte* _heap
    // Size: 0x8
    // Offset: 0x8
    uint8_t* heap;
    // Field size check
    static_assert(sizeof(uint8_t*) == 0x8);
    // private System.Byte* _meta
    // Size: 0x8
    // Offset: 0x10
    uint8_t* meta;
    // Field size check
    static_assert(sizeof(uint8_t*) == 0x8);
    // private System.Void* _globals
    // Size: 0x8
    // Offset: 0x18
    void* globals;
    // Field size check
    static_assert(sizeof(void*) == 0x8);
    // private System.Void* _checksum
    // Size: 0x8
    // Offset: 0x20
    void* checksum;
    // Field size check
    static_assert(sizeof(void*) == 0x8);
    // private System.Void* _replicate
    // Size: 0x8
    // Offset: 0x28
    void* replicate;
    // Field size check
    static_assert(sizeof(void*) == 0x8);
    // private Fusion.Allocator/Block* _blocks
    // Size: 0x8
    // Offset: 0x30
    ::Fusion::Allocator::Block* blocks;
    // Field size check
    static_assert(sizeof(::Fusion::Allocator::Block*) == 0x8);
    // private Fusion.Allocator/BlockList* _blocksFreeList
    // Size: 0x8
    // Offset: 0x38
    ::Fusion::Allocator::BlockList* blocksFreeList;
    // Field size check
    static_assert(sizeof(::Fusion::Allocator::BlockList*) == 0x8);
    // private Fusion.Allocator/Bucket* _buckets
    // Size: 0x8
    // Offset: 0x40
    ::Fusion::Allocator::Bucket* buckets;
    // Field size check
    static_assert(sizeof(::Fusion::Allocator::Bucket*) == 0x8);
    // private System.Byte* _bucketsMap
    // Size: 0x8
    // Offset: 0x48
    uint8_t* bucketsMap;
    // Field size check
    static_assert(sizeof(uint8_t*) == 0x8);
    // private Fusion.Allocator/BlockList* _bucketsLists
    // Size: 0x8
    // Offset: 0x50
    ::Fusion::Allocator::BlockList* bucketsLists;
    // Field size check
    static_assert(sizeof(::Fusion::Allocator::BlockList*) == 0x8);
    // private Fusion.Allocator/Config _config
    // Size: 0xC
    // Offset: 0x58
    ::Fusion::Allocator::Config config;
    // Field size check
    static_assert(sizeof(::Fusion::Allocator::Config) == 0xC);
    // private System.Int32 _maxBlockIndexUsed
    // Size: 0x4
    // Offset: 0x64
    int maxBlockIndexUsed;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _checksumByteLength
    // Size: 0x4
    // Offset: 0x68
    int checksumByteLength;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _replicateByteLength
    // Size: 0x4
    // Offset: 0x6C
    int replicateByteLength;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Creating value type constructor for type: Allocator
