// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: UnityEngine.Bounds
#include "UnityEngine/Bounds.hpp"
// Including type: Fusion.NetworkBehaviourId
#include "Fusion/NetworkBehaviourId.hpp"
// Including type: Fusion.HitboxRoot
#include "Fusion/HitboxRoot.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Fusion
namespace Fusion {
  // Forward declaring type: BVH
  class BVH;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: StringBuilder
  class StringBuilder;
}
// Completed forward declares
// Type namespace: Fusion
namespace Fusion {
  // Forward declaring type: BVHNode
  struct BVHNode;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::Fusion::BVHNode, "Fusion", "BVHNode");
// Type namespace: Fusion
namespace Fusion {
  // Size: 0x79
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: Fusion.BVHNode
  // [TokenAttribute] Offset: FFFFFFFF
  struct BVHNode/*, public ::System::ValueType*/ {
    public:
    // Nested type: ::Fusion::BVHNode::CachedBounds
    struct CachedBounds;
    // Nested type: ::Fusion::BVHNode::Rot
    struct Rot;
    // Size: 0x30
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: Fusion.BVHNode/CachedBounds
    // [TokenAttribute] Offset: FFFFFFFF
    struct CachedBounds/*, public ::System::ValueType*/ {
      public:
      public:
      // public UnityEngine.Vector3 Center
      // Size: 0xC
      // Offset: 0x0
      ::UnityEngine::Vector3 Center;
      // Field size check
      static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
      // public UnityEngine.Vector3 Extents
      // Size: 0xC
      // Offset: 0xC
      ::UnityEngine::Vector3 Extents;
      // Field size check
      static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
      // public UnityEngine.Vector3 Min
      // Size: 0xC
      // Offset: 0x18
      ::UnityEngine::Vector3 Min;
      // Field size check
      static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
      // public UnityEngine.Vector3 Max
      // Size: 0xC
      // Offset: 0x24
      ::UnityEngine::Vector3 Max;
      // Field size check
      static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
      public:
      // Creating value type constructor for type: CachedBounds
      constexpr CachedBounds(::UnityEngine::Vector3 Center_ = {}, ::UnityEngine::Vector3 Extents_ = {}, ::UnityEngine::Vector3 Min_ = {}, ::UnityEngine::Vector3 Max_ = {}) noexcept : Center{Center_}, Extents{Extents_}, Min{Min_}, Max{Max_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public UnityEngine.Vector3 Center
      [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_Center();
      // Get instance field reference: public UnityEngine.Vector3 Extents
      [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_Extents();
      // Get instance field reference: public UnityEngine.Vector3 Min
      [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_Min();
      // Get instance field reference: public UnityEngine.Vector3 Max
      [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_Max();
      // public System.Void .ctor(UnityEngine.Bounds bounds)
      // Offset: 0x2B370D0
      CachedBounds(::UnityEngine::Bounds bounds);
      // public System.Void .ctor(UnityEngine.Vector3 center, UnityEngine.Vector3 extents)
      // Offset: 0x2B372A0
      CachedBounds(::UnityEngine::Vector3 center, ::UnityEngine::Vector3 extents);
    }; // Fusion.BVHNode/CachedBounds
    #pragma pack(pop)
    static check_size<sizeof(BVHNode::CachedBounds), 36 + sizeof(::UnityEngine::Vector3)> __Fusion_BVHNode_CachedBoundsSizeCheck;
    static_assert(sizeof(BVHNode::CachedBounds) == 0x30);
    public:
    // public UnityEngine.Bounds Box
    // Size: 0x18
    // Offset: 0x0
    ::UnityEngine::Bounds Box;
    // Field size check
    static_assert(sizeof(::UnityEngine::Bounds) == 0x18);
    // Fusion.BVHNode/CachedBounds _cachedBounds
    // Size: 0x30
    // Offset: 0x18
    ::Fusion::BVHNode::CachedBounds cachedBounds;
    // Field size check
    static_assert(sizeof(::Fusion::BVHNode::CachedBounds) == 0x30);
    // private System.Int32 _nodeIndex
    // Size: 0x4
    // Offset: 0x48
    int nodeIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _parentIndex
    // Size: 0x4
    // Offset: 0x4C
    int parentIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _leftIndex
    // Size: 0x4
    // Offset: 0x50
    int leftIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _rightIndex
    // Size: 0x4
    // Offset: 0x54
    int rightIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Boolean Active
    // Size: 0x1
    // Offset: 0x58
    bool Active;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: Active and: Depth
    char __padding6[0x3] = {};
    // System.Int32 Depth
    // Size: 0x4
    // Offset: 0x5C
    int Depth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Boolean Used
    // Size: 0x1
    // Offset: 0x60
    bool Used;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: Used and: Next
    char __padding8[0x3] = {};
    // System.Int32 Next
    // Size: 0x4
    // Offset: 0x64
    int Next;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Fusion.HitboxRoot _root
    // Size: 0x8
    // Offset: 0x68
    ::Fusion::HitboxRoot* root;
    // Field size check
    static_assert(sizeof(::Fusion::HitboxRoot*) == 0x8);
    // Fusion.NetworkBehaviourId _rootId
    // Size: 0x8
    // Offset: 0x70
    ::Fusion::NetworkBehaviourId rootId;
    // Field size check
    static_assert(sizeof(::Fusion::NetworkBehaviourId) == 0x8);
    // System.Boolean _isLeaf
    // Size: 0x1
    // Offset: 0x78
    bool isLeaf;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating value type constructor for type: BVHNode
    constexpr BVHNode(::UnityEngine::Bounds Box_ = {}, ::Fusion::BVHNode::CachedBounds cachedBounds_ = {}, int nodeIndex_ = {}, int parentIndex_ = {}, int leftIndex_ = {}, int rightIndex_ = {}, bool Active_ = {}, int Depth_ = {}, bool Used_ = {}, int Next_ = {}, ::Fusion::HitboxRoot* root_ = {}, ::Fusion::NetworkBehaviourId rootId_ = {}, bool isLeaf_ = {}) noexcept : Box{Box_}, cachedBounds{cachedBounds_}, nodeIndex{nodeIndex_}, parentIndex{parentIndex_}, leftIndex{leftIndex_}, rightIndex{rightIndex_}, Active{Active_}, Depth{Depth_}, Used{Used_}, Next{Next_}, root{root_}, rootId{rootId_}, isLeaf{isLeaf_} {}
    // Creating interface conversion operator: operator ::System::ValueType
    operator ::System::ValueType() noexcept {
      return *reinterpret_cast<::System::ValueType*>(this);
    }
