// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Fusion.SimulationBehaviour
#include "Fusion/SimulationBehaviour.hpp"
// Including type: Fusion.HitboxHit
#include "Fusion/HitboxHit.hpp"
// Including type: UnityEngine.RaycastHit
#include "UnityEngine/RaycastHit.hpp"
// Including type: Fusion.LagCompensatedHit
#include "Fusion/LagCompensatedHit.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Fusion
namespace Fusion {
  // Forward declaring type: LagCompensationSettings
  class LagCompensationSettings;
  // Forward declaring type: HitboxBuffer
  class HitboxBuffer;
  // Forward declaring type: PlayerRef
  struct PlayerRef;
  // Forward declaring type: HitOptions
  struct HitOptions;
  // Forward declaring type: Hitbox
  class Hitbox;
  // Forward declaring type: HitboxRoot
  class HitboxRoot;
  // Forward declaring type: NetworkRunner
  class NetworkRunner;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Collider
  class Collider;
  // Skipping declaration: Vector3 because it is already included!
  // Forward declaring type: QueryTriggerInteraction
  struct QueryTriggerInteraction;
  // Skipping declaration: Quaternion because it is already included!
}
// Forward declaring namespace: Fusion::LagCompensation
namespace Fusion::LagCompensation {
  // Forward declaring type: Query
  struct Query;
  // Forward declaring type: PreProcessingDelegate
  class PreProcessingDelegate;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Nullable`1<T>
  template<typename T>
  struct Nullable_1;
}
// Completed forward declares
// Type namespace: Fusion
namespace Fusion {
  // Forward declaring type: HitboxManager
  class HitboxManager;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Fusion::HitboxManager);
DEFINE_IL2CPP_ARG_TYPE(::Fusion::HitboxManager*, "Fusion", "HitboxManager");
// Type namespace: Fusion
namespace Fusion {
  // Size: 0x80
  #pragma pack(push, 1)
  // Autogenerated type: Fusion.HitboxManager
  // [TokenAttribute] Offset: FFFFFFFF
  // [DisallowMultipleComponent] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: FFFFFFFF
  // [OrderAfterAttribute] Offset: FFFFFFFF
  class HitboxManager : public ::Fusion::SimulationBehaviour {
    public:
    public:
    // public System.Int32 BVHDepth
    // Size: 0x4
    // Offset: 0x48
    int BVHDepth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 BVHNodes
    // Size: 0x4
    // Offset: 0x4C
    int BVHNodes;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 TotalHitboxes
    // Size: 0x4
    // Offset: 0x50
    int TotalHitboxes;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: TotalHitboxes and: settings
    char __padding2[0x4] = {};
    // private Fusion.LagCompensationSettings _settings
    // Size: 0x8
    // Offset: 0x58
    ::Fusion::LagCompensationSettings* settings;
    // Field size check
    static_assert(sizeof(::Fusion::LagCompensationSettings*) == 0x8);
    // private Fusion.HitboxBuffer _hitboxBuffer
    // Size: 0x8
    // Offset: 0x60
    ::Fusion::HitboxBuffer* hitboxBuffer;
    // Field size check
    static_assert(sizeof(::Fusion::HitboxBuffer*) == 0x8);
    // private System.Collections.Generic.List`1<Fusion.HitboxHit> _lagCompensatedHits
    // Size: 0x8
    // Offset: 0x68
    ::System::Collections::Generic::List_1<::Fusion::HitboxHit>* lagCompensatedHits;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Fusion::HitboxHit>*) == 0x8);
    // private UnityEngine.Collider[] _physXOverlapHits
    // Size: 0x8
    // Offset: 0x70
    ::ArrayW<::UnityEngine::Collider*> physXOverlapHits;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Collider*>) == 0x8);
    // private UnityEngine.RaycastHit[] _physXRaycastHits
    // Size: 0x8
    // Offset: 0x78
    ::ArrayW<::UnityEngine::RaycastHit> physXRaycastHits;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::RaycastHit>) == 0x8);
    public:
    // Get instance field reference: public System.Int32 BVHDepth
    [[deprecated("Use field access instead!")]] int& dyn_BVHDepth();
    // Get instance field reference: public System.Int32 BVHNodes
    [[deprecated("Use field access instead!")]] int& dyn_BVHNodes();
    // Get instance field reference: public System.Int32 TotalHitboxes
    [[deprecated("Use field access instead!")]] int& dyn_TotalHitboxes();
    // Get instance field reference: private Fusion.LagCompensationSettings _settings
    [[deprecated("Use field access instead!")]] ::Fusion::LagCompensationSettings*& dyn__settings();
    // Get instance field reference: private Fusion.HitboxBuffer _hitboxBuffer
    [[deprecated("Use field access instead!")]] ::Fusion::HitboxBuffer*& dyn__hitboxBuffer();
