// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Fusion.HitboxBuffer
#include "Fusion/HitboxBuffer.hpp"
// Including type: Fusion.IHitboxColliderContainer
#include "Fusion/IHitboxColliderContainer.hpp"
// Including type: Fusion.HitboxCollider
#include "Fusion/HitboxCollider.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Fusion
namespace Fusion {
  // Forward declaring type: ILagCompensationBroadphase
  class ILagCompensationBroadphase;
  // Forward declaring type: RayNodeTraversalTest
  class RayNodeTraversalTest;
  // Forward declaring type: RadialNodeTraversalTest
  class RadialNodeTraversalTest;
  // Forward declaring type: AabbNodeTraversalTest
  class AabbNodeTraversalTest;
  // Forward declaring type: Mapper
  class Mapper;
  // Forward declaring type: HitboxRoot
  class HitboxRoot;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: HashSet`1<T>
  template<typename T>
  class HashSet_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Skipping declaration: Vector3 because it is already included!
  // Forward declaring type: Color
  struct Color;
}
// Forward declaring namespace: Fusion::LagCompensation
namespace Fusion::LagCompensation {
  // Forward declaring type: Query
  struct Query;
}
// Completed forward declares
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Fusion::HitboxBuffer::HitboxSnapshot);
DEFINE_IL2CPP_ARG_TYPE(::Fusion::HitboxBuffer::HitboxSnapshot*, "Fusion", "HitboxBuffer/HitboxSnapshot");
// Type namespace: Fusion
namespace Fusion {
  // Size: 0x58
  #pragma pack(push, 1)
  // Autogenerated type: Fusion.HitboxBuffer/HitboxSnapshot
  // [TokenAttribute] Offset: FFFFFFFF
  class HitboxBuffer::HitboxSnapshot : public ::Il2CppObject/*, public ::Fusion::IHitboxColliderContainer*/ {
    public:
    public:
    // readonly System.Int32 CollidersCapacity
    // Size: 0x4
    // Offset: 0x10
    int CollidersCapacity;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: CollidersCapacity and: colliders
    char __padding0[0x4] = {};
    // private Fusion.HitboxCollider[] _colliders
    // Size: 0x8
    // Offset: 0x18
    ::ArrayW<::Fusion::HitboxCollider> colliders;
    // Field size check
    static_assert(sizeof(::ArrayW<::Fusion::HitboxCollider>) == 0x8);
    // private System.Int32 _collidersCount
    // Size: 0x4
    // Offset: 0x20
    int collidersCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _collidersTempCount
    // Size: 0x4
    // Offset: 0x24
    int collidersTempCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _collidersFreeHead
    // Size: 0x4
    // Offset: 0x28
    int collidersFreeHead;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: collidersFreeHead and: broadphase
    char __padding4[0x4] = {};
    // Fusion.ILagCompensationBroadphase _broadphase
    // Size: 0x8
    // Offset: 0x30
    ::Fusion::ILagCompensationBroadphase* broadphase;
    // Field size check
    static_assert(sizeof(::Fusion::ILagCompensationBroadphase*) == 0x8);
    // System.Int32 Tick
    // Size: 0x4
    // Offset: 0x38
    int Tick;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 DataTick
    // Size: 0x4
    // Offset: 0x3C
    int DataTick;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private readonly Fusion.RayNodeTraversalTest _rayTraversalTest
    // Size: 0x8
    // Offset: 0x40
    ::Fusion::RayNodeTraversalTest* rayTraversalTest;
    // Field size check
    static_assert(sizeof(::Fusion::RayNodeTraversalTest*) == 0x8);
    // private readonly Fusion.RadialNodeTraversalTest _radialTraversalTest
    // Size: 0x8
    // Offset: 0x48
    ::Fusion::RadialNodeTraversalTest* radialTraversalTest;
    // Field size check
    static_assert(sizeof(::Fusion::RadialNodeTraversalTest*) == 0x8);
    // private readonly Fusion.AabbNodeTraversalTest _aabbTraversalTest
    // Size: 0x8
    // Offset: 0x50
    ::Fusion::AabbNodeTraversalTest* aabbTraversalTest;
    // Field size check
    static_assert(sizeof(::Fusion::AabbNodeTraversalTest*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::Fusion::IHitboxColliderContainer
    operator ::Fusion::IHitboxColliderContainer() noexcept {
      return *reinterpret_cast<::Fusion::IHitboxColliderContainer*>(this);
    }
    // Get instance field reference: readonly System.Int32 CollidersCapacity
    [[deprecated("Use field access instead!")]] int& dyn_CollidersCapacity();
    // Get instance field reference: private Fusion.HitboxCollider[] _colliders
    [[deprecated("Use field access instead!")]] ::ArrayW<::Fusion::HitboxCollider>& dyn__colliders();
    // Get instance field reference: private System.Int32 _collidersCount
    [[deprecated("Use field access instead!")]] int& dyn__collidersCount();
    // Get instance field reference: private System.Int32 _collidersTempCount
