// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Fusion.Behaviour
#include "Fusion/Behaviour.hpp"
// Including type: Fusion.ILogBuilder
#include "Fusion/ILogBuilder.hpp"
// Including type: Fusion.NetworkId
#include "Fusion/NetworkId.hpp"
// Including type: Fusion.Tick
#include "Fusion/Tick.hpp"
// Including type: Fusion.NetworkObjectFlags
#include "Fusion/NetworkObjectFlags.hpp"
// Including type: Fusion.NetworkObjectGuid
#include "Fusion/NetworkObjectGuid.hpp"
// Including type: Fusion.NetworkPrefabId
#include "Fusion/NetworkPrefabId.hpp"
// Including type: Fusion.NetworkObjectPredictionKey
#include "Fusion/NetworkObjectPredictionKey.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Fusion
namespace Fusion {
  // Forward declaring type: NetworkAreaOfInterestBehaviour
  class NetworkAreaOfInterestBehaviour;
  // Forward declaring type: FastReferenceList`1<T>
  template<typename T>
  class FastReferenceList_1;
  // Forward declaring type: NetworkBehaviour
  class NetworkBehaviour;
  // Forward declaring type: NetworkRunner
  class NetworkRunner;
  // Forward declaring type: SimulationBehaviour
  class SimulationBehaviour;
  // Forward declaring type: PlayerRef
  struct PlayerRef;
  // Forward declaring type: NetworkObjectHeader
  struct NetworkObjectHeader;
  // Forward declaring type: NetworkObjectHeaderPtr
  struct NetworkObjectHeaderPtr;
  // Forward declaring type: LogOptions
  struct LogOptions;
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: StringBuilder
  class StringBuilder;
}
// Completed forward declares
// Type namespace: Fusion
namespace Fusion {
  // Forward declaring type: NetworkObject
  class NetworkObject;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Fusion::NetworkObject);
DEFINE_IL2CPP_ARG_TYPE(::Fusion::NetworkObject*, "Fusion", "NetworkObject");
// Type namespace: Fusion
namespace Fusion {
  // WARNING Size may be invalid!
  // Autogenerated type: Fusion.NetworkObject
  // [TokenAttribute] Offset: FFFFFFFF
  // [HelpURLAttribute] Offset: FFFFFFFF
  // [DisallowMultipleComponent] Offset: FFFFFFFF
  // [ScriptHelpAttribute] Offset: FFFFFFFF
  // [DefaultExecutionOrder] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: FFFFFFFF
  class NetworkObject : public ::Fusion::Behaviour/*, public ::Fusion::ILogBuilder*/ {
    public:
    // Nested type: ::Fusion::NetworkObject::PredictionData
    struct PredictionData;
    // Nested type: ::Fusion::NetworkObject::ObjectInterestModes
    struct ObjectInterestModes;
    // WARNING Size may be invalid!
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: Fusion.NetworkObject/PredictionData
    // [TokenAttribute] Offset: FFFFFFFF
    struct PredictionData/*, public ::System::ValueType*/ {
      public:
      public:
      // public Fusion.Tick Tick
      // Size: 0x4
      // Offset: 0x0
      ::Fusion::Tick Tick;
      // Field size check
      static_assert(sizeof(::Fusion::Tick) == 0x4);
      // public Fusion.NetworkPrefabId Prefab
      // Size: 0x4
      // Offset: 0x4
      ::Fusion::NetworkPrefabId Prefab;
      // Field size check
      static_assert(sizeof(::Fusion::NetworkPrefabId) == 0x4);
      // public Fusion.NetworkObjectPredictionKey Key
      // Size: 0xFFFFFFFF
      // Offset: 0x8
      ::Fusion::NetworkObjectPredictionKey Key;
      public:
      // Creating value type constructor for type: PredictionData
      constexpr PredictionData(::Fusion::Tick Tick_ = {}, ::Fusion::NetworkPrefabId Prefab_ = {}, ::Fusion::NetworkObjectPredictionKey Key_ = {}) noexcept : Tick{Tick_}, Prefab{Prefab_}, Key{Key_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public Fusion.Tick Tick
      [[deprecated("Use field access instead!")]] ::Fusion::Tick& dyn_Tick();
      // Get instance field reference: public Fusion.NetworkPrefabId Prefab
      [[deprecated("Use field access instead!")]] ::Fusion::NetworkPrefabId& dyn_Prefab();
      // Get instance field reference: public Fusion.NetworkObjectPredictionKey Key
      [[deprecated("Use field access instead!")]] ::Fusion::NetworkObjectPredictionKey& dyn_Key();
    }; // Fusion.NetworkObject/PredictionData
    // WARNING Not writing size check since size may be invalid!
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: Fusion.NetworkObject/ObjectInterestModes
    // [TokenAttribute] Offset: FFFFFFFF
    struct ObjectInterestModes/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: ObjectInterestModes
      constexpr ObjectInterestModes(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public Fusion.NetworkObject/ObjectInterestModes AreaOfInterest
      static constexpr const int AreaOfInterest = 0;
      // Get static field: static public Fusion.NetworkObject/ObjectInterestModes AreaOfInterest
      static ::Fusion::NetworkObject::ObjectInterestModes _get_AreaOfInterest();
      // Set static field: static public Fusion.NetworkObject/ObjectInterestModes AreaOfInterest
      static void _set_AreaOfInterest(::Fusion::NetworkObject::ObjectInterestModes value);
      // static field const value: static public Fusion.NetworkObject/ObjectInterestModes AllPlayers
      static constexpr const int AllPlayers = 1;
      // Get static field: static public Fusion.NetworkObject/ObjectInterestModes AllPlayers
      static ::Fusion::NetworkObject::ObjectInterestModes _get_AllPlayers();
      // Set static field: static public Fusion.NetworkObject/ObjectInterestModes AllPlayers
      static void _set_AllPlayers(::Fusion::NetworkObject::ObjectInterestModes value);
      // static field const value: static public Fusion.NetworkObject/ObjectInterestModes ExplicitPlayers
      static constexpr const int ExplicitPlayers = 2;
      // Get static field: static public Fusion.NetworkObject/ObjectInterestModes ExplicitPlayers
      static ::Fusion::NetworkObject::ObjectInterestModes _get_ExplicitPlayers();
      // Set static field: static public Fusion.NetworkObject/ObjectInterestModes ExplicitPlayers
      static void _set_ExplicitPlayers(::Fusion::NetworkObject::ObjectInterestModes value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // Fusion.NetworkObject/ObjectInterestModes
    #pragma pack(pop)
    static check_size<sizeof(NetworkObject::ObjectInterestModes), 0 + sizeof(int)> __Fusion_NetworkObject_ObjectInterestModesSizeCheck;
    static_assert(sizeof(NetworkObject::ObjectInterestModes) == 0x4);
    public:
    // System.Int32* Ptr
    // Size: 0x8
    // Offset: 0x20
    int* Ptr;
    // Field size check
    static_assert(sizeof(int*) == 0x8);
    // System.Int32* Changed
    // Size: 0x8
    // Offset: 0x28
    int* Changed;
    // Field size check
    static_assert(sizeof(int*) == 0x8);
    // Fusion.FastReferenceList`1<Fusion.NetworkBehaviour> CallbackBehaviours
    // Size: 0x8
    // Offset: 0x30
    ::Fusion::FastReferenceList_1<::Fusion::NetworkBehaviour*>* CallbackBehaviours;
    // Field size check
    static_assert(sizeof(::Fusion::FastReferenceList_1<::Fusion::NetworkBehaviour*>*) == 0x8);
    // public Fusion.NetworkId Id
    // Size: 0x4
    // Offset: 0x38
    ::Fusion::NetworkId Id;
    // Field size check
    static_assert(sizeof(::Fusion::NetworkId) == 0x4);
    // public System.Boolean IsResume
    // Size: 0x1
    // Offset: 0x3C
    bool IsResume;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public Fusion.NetworkRunner Runner
    // Size: 0x8
    // Offset: 0x40
    ::Fusion::NetworkRunner* Runner;
    // Field size check
    static_assert(sizeof(::Fusion::NetworkRunner*) == 0x8);
    // Fusion.NetworkObject/ObjectInterestModes ObjectInterest
    // Size: 0x4
    // Offset: 0x48
    ::Fusion::NetworkObject::ObjectInterestModes ObjectInterest;
    // Field size check
    static_assert(sizeof(::Fusion::NetworkObject::ObjectInterestModes) == 0x4);
    // System.String[] DefaultInterestGroups
    // Size: 0x8
    // Offset: 0x50
    ::ArrayW<::StringW> DefaultInterestGroups;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // System.Boolean DestroyWhenStateAuthorityLeaves
    // Size: 0x1
    // Offset: 0x58
    bool DestroyWhenStateAuthorityLeaves;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // System.Boolean AllowStateAuthorityOverride
    // Size: 0x1
    // Offset: 0x59
    bool AllowStateAuthorityOverride;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Fusion.NetworkAreaOfInterestBehaviour AoiPositionSource
    // Size: 0x8
    // Offset: 0x60
    ::Fusion::NetworkAreaOfInterestBehaviour* AoiPositionSource;
    // Field size check
    static_assert(sizeof(::Fusion::NetworkAreaOfInterestBehaviour*) == 0x8);
    // private Fusion.Tick <LastReceiveTick>k__BackingField
    // Size: 0x4
    // Offset: 0x68
    ::Fusion::Tick LastReceiveTick;
    // Field size check
    static_assert(sizeof(::Fusion::Tick) == 0x4);
    // public Fusion.NetworkObjectFlags Flags
    // Size: 0x4
    // Offset: 0x6C
    ::Fusion::NetworkObjectFlags Flags;
    // Field size check
    static_assert(sizeof(::Fusion::NetworkObjectFlags) == 0x4);
    // public Fusion.NetworkObjectGuid NetworkGuid
    // Size: 0x10
    // Offset: 0x70
    ::Fusion::NetworkObjectGuid NetworkGuid;
    // Field size check
    static_assert(sizeof(::Fusion::NetworkObjectGuid) == 0x10);
    // public Fusion.NetworkObject/PredictionData PredictedSpawn
    // Size: 0xFFFFFFFF
    // Offset: 0x80
    ::Fusion::NetworkObject::PredictionData PredictedSpawn;
    // public Fusion.NetworkObject[] NestedObjects
    // Size: 0x8
    // Offset: 0x90
    ::ArrayW<::Fusion::NetworkObject*> NestedObjects;
    // Field size check
    static_assert(sizeof(::ArrayW<::Fusion::NetworkObject*>) == 0x8);
    // public Fusion.NetworkBehaviour[] NetworkedBehaviours
    // Size: 0x8
    // Offset: 0x98
    ::ArrayW<::Fusion::NetworkBehaviour*> NetworkedBehaviours;
    // Field size check
    static_assert(sizeof(::ArrayW<::Fusion::NetworkBehaviour*>) == 0x8);
    // public Fusion.SimulationBehaviour[] SimulationBehaviours
    // Size: 0x8
    // Offset: 0xA0
    ::ArrayW<::Fusion::SimulationBehaviour*> SimulationBehaviours;
    // Field size check
    static_assert(sizeof(::ArrayW<::Fusion::SimulationBehaviour*>) == 0x8);
    // System.Boolean InSimulation
    // Size: 0x1
    // Offset: 0xA8
    bool InSimulation;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating interface conversion operator: operator ::Fusion::ILogBuilder
    operator ::Fusion::ILogBuilder() noexcept {
      return *reinterpret_cast<::Fusion::ILogBuilder*>(this);
    }
    // static field const value: static public System.Int32 DefaultExecutionOrder
    static constexpr const int DefaultExecutionOrder = 500;
    // Get static field: static public System.Int32 DefaultExecutionOrder
    static int _get_DefaultExecutionOrder();
    // Set static field: static public System.Int32 DefaultExecutionOrder
    static void _set_DefaultExecutionOrder(int value);
    // Get instance field reference: System.Int32* Ptr
    [[deprecated("Use field access instead!")]] int*& dyn_Ptr();
    // Get instance field reference: System.Int32* Changed
    [[deprecated("Use field access instead!")]] int*& dyn_Changed();
