// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Fusion.INetworkRunnerCallbacks
#include "Fusion/INetworkRunnerCallbacks.hpp"
// Including type: Fusion.PlayerRef
#include "Fusion/PlayerRef.hpp"
// Including type: Fusion.NetworkInput
#include "Fusion/NetworkInput.hpp"
// Including type: Fusion.ShutdownReason
#include "Fusion/ShutdownReason.hpp"
// Including type: Fusion.Sockets.NetAddress
#include "Fusion/Sockets/NetAddress.hpp"
// Including type: Fusion.Sockets.NetConnectFailedReason
#include "Fusion/Sockets/NetConnectFailedReason.hpp"
// Including type: Fusion.SimulationMessagePtr
#include "Fusion/SimulationMessagePtr.hpp"
// Including type: System.ArraySegment`1
#include "System/ArraySegment_1.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
  // Forward declaring type: Action`3<T1, T2, T3>
  template<typename T1, typename T2, typename T3>
  class Action_3;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: Fusion
namespace Fusion {
  // Forward declaring type: NetworkRunner
  class NetworkRunner;
  // Forward declaring type: SessionInfo
  class SessionInfo;
  // Forward declaring type: HostMigrationToken
  class HostMigrationToken;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Completed forward declares
// Type namespace: Fusion
namespace Fusion {
  // Forward declaring type: NetworkDelegates
  class NetworkDelegates;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Fusion::NetworkDelegates);
DEFINE_IL2CPP_ARG_TYPE(::Fusion::NetworkDelegates*, "Fusion", "NetworkDelegates");
// Type namespace: Fusion
namespace Fusion {
  // Size: 0x90
  #pragma pack(push, 1)
  // Autogenerated type: Fusion.NetworkDelegates
  // [TokenAttribute] Offset: FFFFFFFF
  class NetworkDelegates : public ::Il2CppObject/*, public ::Fusion::INetworkRunnerCallbacks*/ {
    public:
    public:
    // public System.Action`2<Fusion.NetworkRunner,Fusion.PlayerRef> OnPlayerJoined
    // Size: 0x8
    // Offset: 0x10
    ::System::Action_2<::Fusion::NetworkRunner*, ::Fusion::PlayerRef>* OnPlayerJoined;
    // Field size check
    static_assert(sizeof(::System::Action_2<::Fusion::NetworkRunner*, ::Fusion::PlayerRef>*) == 0x8);
    // public System.Action`2<Fusion.NetworkRunner,Fusion.PlayerRef> OnPlayerLeft
    // Size: 0x8
    // Offset: 0x18
    ::System::Action_2<::Fusion::NetworkRunner*, ::Fusion::PlayerRef>* OnPlayerLeft;
    // Field size check
    static_assert(sizeof(::System::Action_2<::Fusion::NetworkRunner*, ::Fusion::PlayerRef>*) == 0x8);
    // public System.Action`2<Fusion.NetworkRunner,Fusion.NetworkInput> OnInput
    // Size: 0x8
    // Offset: 0x20
    ::System::Action_2<::Fusion::NetworkRunner*, ::Fusion::NetworkInput>* OnInput;
    // Field size check
    static_assert(sizeof(::System::Action_2<::Fusion::NetworkRunner*, ::Fusion::NetworkInput>*) == 0x8);
    // public System.Action`3<Fusion.NetworkRunner,Fusion.PlayerRef,Fusion.NetworkInput> OnInputMissing
    // Size: 0x8
    // Offset: 0x28
    ::System::Action_3<::Fusion::NetworkRunner*, ::Fusion::PlayerRef, ::Fusion::NetworkInput>* OnInputMissing;
    // Field size check
    static_assert(sizeof(::System::Action_3<::Fusion::NetworkRunner*, ::Fusion::PlayerRef, ::Fusion::NetworkInput>*) == 0x8);
    // public System.Action`2<Fusion.NetworkRunner,Fusion.ShutdownReason> OnShutdown
    // Size: 0x8
    // Offset: 0x30
    ::System::Action_2<::Fusion::NetworkRunner*, ::Fusion::ShutdownReason>* OnShutdown;
    // Field size check
    static_assert(sizeof(::System::Action_2<::Fusion::NetworkRunner*, ::Fusion::ShutdownReason>*) == 0x8);
    // public System.Action`1<Fusion.NetworkRunner> OnConnectedToServer
    // Size: 0x8
    // Offset: 0x38
    ::System::Action_1<::Fusion::NetworkRunner*>* OnConnectedToServer;
    // Field size check
    static_assert(sizeof(::System::Action_1<::Fusion::NetworkRunner*>*) == 0x8);
    // public System.Action`1<Fusion.NetworkRunner> OnDisconnectedFromServer
    // Size: 0x8
    // Offset: 0x40
    ::System::Action_1<::Fusion::NetworkRunner*>* OnDisconnectedFromServer;
    // Field size check
    static_assert(sizeof(::System::Action_1<::Fusion::NetworkRunner*>*) == 0x8);
    // public System.Action`1<Fusion.NetworkRunner> OnSceneLoadDone
    // Size: 0x8
    // Offset: 0x48
    ::System::Action_1<::Fusion::NetworkRunner*>* OnSceneLoadDone;
    // Field size check
    static_assert(sizeof(::System::Action_1<::Fusion::NetworkRunner*>*) == 0x8);
    // public System.Action`1<Fusion.NetworkRunner> OnSceneLoadStart
    // Size: 0x8
    // Offset: 0x50
    ::System::Action_1<::Fusion::NetworkRunner*>* OnSceneLoadStart;
    // Field size check
    static_assert(sizeof(::System::Action_1<::Fusion::NetworkRunner*>*) == 0x8);
    // public System.Action`3<Fusion.NetworkRunner,Fusion.NetworkRunnerCallbackArgs/ConnectRequest,System.Byte[]> OnConnectRequest
    // Size: 0x8
    // Offset: 0x58
    ::System::Action_3<::Fusion::NetworkRunner*, ::Fusion::NetworkRunnerCallbackArgs::ConnectRequest*, ::ArrayW<uint8_t>>* OnConnectRequest;
    // Field size check
    static_assert(sizeof(::System::Action_3<::Fusion::NetworkRunner*, ::Fusion::NetworkRunnerCallbackArgs::ConnectRequest*, ::ArrayW<uint8_t>>*) == 0x8);
    // public System.Action`3<Fusion.NetworkRunner,Fusion.Sockets.NetAddress,Fusion.Sockets.NetConnectFailedReason> OnConnectFailed
    // Size: 0x8
    // Offset: 0x60
    ::System::Action_3<::Fusion::NetworkRunner*, ::Fusion::Sockets::NetAddress, ::Fusion::Sockets::NetConnectFailedReason>* OnConnectFailed;
    // Field size check
    static_assert(sizeof(::System::Action_3<::Fusion::NetworkRunner*, ::Fusion::Sockets::NetAddress, ::Fusion::Sockets::NetConnectFailedReason>*) == 0x8);
    // public System.Action`2<Fusion.NetworkRunner,Fusion.SimulationMessagePtr> OnUserSimulationMessage
    // Size: 0x8
    // Offset: 0x68
    ::System::Action_2<::Fusion::NetworkRunner*, ::Fusion::SimulationMessagePtr>* OnUserSimulationMessage;
    // Field size check
    static_assert(sizeof(::System::Action_2<::Fusion::NetworkRunner*, ::Fusion::SimulationMessagePtr>*) == 0x8);
    // public System.Action`2<Fusion.NetworkRunner,System.Collections.Generic.List`1<Fusion.SessionInfo>> OnSessionListUpdated
    // Size: 0x8
    // Offset: 0x70
    ::System::Action_2<::Fusion::NetworkRunner*, ::System::Collections::Generic::List_1<::Fusion::SessionInfo*>*>* OnSessionListUpdated;
    // Field size check
    static_assert(sizeof(::System::Action_2<::Fusion::NetworkRunner*, ::System::Collections::Generic::List_1<::Fusion::SessionInfo*>*>*) == 0x8);
    // public System.Action`2<Fusion.NetworkRunner,System.Collections.Generic.Dictionary`2<System.String,System.Object>> OnCustomAuthenticationResponse
    // Size: 0x8
    // Offset: 0x78
    ::System::Action_2<::Fusion::NetworkRunner*, ::System::Collections::Generic::Dictionary_2<::StringW, ::Il2CppObject*>*>* OnCustomAuthenticationResponse;
    // Field size check
    static_assert(sizeof(::System::Action_2<::Fusion::NetworkRunner*, ::System::Collections::Generic::Dictionary_2<::StringW, ::Il2CppObject*>*>*) == 0x8);
    // public System.Action`2<Fusion.NetworkRunner,Fusion.HostMigrationToken> OnHostMigration
    // Size: 0x8
    // Offset: 0x80
    ::System::Action_2<::Fusion::NetworkRunner*, ::Fusion::HostMigrationToken*>* OnHostMigration;
    // Field size check
    static_assert(sizeof(::System::Action_2<::Fusion::NetworkRunner*, ::Fusion::HostMigrationToken*>*) == 0x8);
    // public System.Action`3<Fusion.NetworkRunner,Fusion.PlayerRef,System.ArraySegment`1<System.Byte>> OnReliableDataReceived
    // Size: 0x8
    // Offset: 0x88
    ::System::Action_3<::Fusion::NetworkRunner*, ::Fusion::PlayerRef, ::System::ArraySegment_1<uint8_t>>* OnReliableDataReceived;
    // Field size check
    static_assert(sizeof(::System::Action_3<::Fusion::NetworkRunner*, ::Fusion::PlayerRef, ::System::ArraySegment_1<uint8_t>>*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::Fusion::INetworkRunnerCallbacks
    operator ::Fusion::INetworkRunnerCallbacks() noexcept {
      return *reinterpret_cast<::Fusion::INetworkRunnerCallbacks*>(this);
    }
    // Get instance field reference: public System.Action`2<Fusion.NetworkRunner,Fusion.PlayerRef> OnPlayerJoined
    [[deprecated("Use field access instead!")]] ::System::Action_2<::Fusion::NetworkRunner*, ::Fusion::PlayerRef>*& dyn_OnPlayerJoined();
    // Get instance field reference: public System.Action`2<Fusion.NetworkRunner,Fusion.PlayerRef> OnPlayerLeft
