// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Fusion.Behaviour
#include "Fusion/Behaviour.hpp"
// Including type: Fusion.INetworkRunnerCallbacks
#include "Fusion/INetworkRunnerCallbacks.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Fusion
namespace Fusion {
  // Forward declaring type: NetworkRunner
  class NetworkRunner;
  // Forward declaring type: PlayerRef
  struct PlayerRef;
  // Forward declaring type: NetworkInput
  struct NetworkInput;
  // Forward declaring type: ShutdownReason
  struct ShutdownReason;
  // Forward declaring type: SimulationMessagePtr
  struct SimulationMessagePtr;
  // Forward declaring type: SessionInfo
  class SessionInfo;
  // Forward declaring type: HostMigrationToken
  class HostMigrationToken;
}
// Forward declaring namespace: Fusion::Sockets
namespace Fusion::Sockets {
  // Forward declaring type: NetAddress
  struct NetAddress;
  // Forward declaring type: NetConnectFailedReason
  struct NetConnectFailedReason;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: ArraySegment`1<T>
  template<typename T>
  struct ArraySegment_1;
}
// Completed forward declares
// Type namespace: Fusion
namespace Fusion {
  // Forward declaring type: NetworkEvents
  class NetworkEvents;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Fusion::NetworkEvents);
DEFINE_IL2CPP_ARG_TYPE(::Fusion::NetworkEvents*, "Fusion", "NetworkEvents");
// Type namespace: Fusion
namespace Fusion {
  // Size: 0xA0
  #pragma pack(push, 1)
  // Autogenerated type: Fusion.NetworkEvents
  // [TokenAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: FFFFFFFF
  class NetworkEvents : public ::Fusion::Behaviour/*, public ::Fusion::INetworkRunnerCallbacks*/ {
    public:
    // Nested type: ::Fusion::NetworkEvents::InputEvent
    class InputEvent;
    // Nested type: ::Fusion::NetworkEvents::InputPlayerEvent
    class InputPlayerEvent;
    // Nested type: ::Fusion::NetworkEvents::ConnectRequestEvent
    class ConnectRequestEvent;
    // Nested type: ::Fusion::NetworkEvents::ConnectFailedEvent
    class ConnectFailedEvent;
    // Nested type: ::Fusion::NetworkEvents::ShutdownEvent
    class ShutdownEvent;
    // Nested type: ::Fusion::NetworkEvents::PlayerEvent
    class PlayerEvent;
    // Nested type: ::Fusion::NetworkEvents::RunnerEvent
    class RunnerEvent;
    // Nested type: ::Fusion::NetworkEvents::SimulationMessageEvent
    class SimulationMessageEvent;
    // Nested type: ::Fusion::NetworkEvents::SessionListUpdateEvent
    class SessionListUpdateEvent;
    // Nested type: ::Fusion::NetworkEvents::CustomAuthenticationResponse
    class CustomAuthenticationResponse;
    // Nested type: ::Fusion::NetworkEvents::HostMigrationEvent
    class HostMigrationEvent;
    // Nested type: ::Fusion::NetworkEvents::ReliableDataEvent
    class ReliableDataEvent;
    public:
    // public Fusion.NetworkEvents/InputEvent OnInput
    // Size: 0x8
    // Offset: 0x20
    ::Fusion::NetworkEvents::InputEvent* OnInput;
    // Field size check
    static_assert(sizeof(::Fusion::NetworkEvents::InputEvent*) == 0x8);
    // public Fusion.NetworkEvents/InputPlayerEvent OnInputMissing
    // Size: 0x8
    // Offset: 0x28
    ::Fusion::NetworkEvents::InputPlayerEvent* OnInputMissing;
    // Field size check
    static_assert(sizeof(::Fusion::NetworkEvents::InputPlayerEvent*) == 0x8);
    // public Fusion.NetworkEvents/RunnerEvent OnConnectedToServer
    // Size: 0x8
    // Offset: 0x30
    ::Fusion::NetworkEvents::RunnerEvent* OnConnectedToServer;
    // Field size check
    static_assert(sizeof(::Fusion::NetworkEvents::RunnerEvent*) == 0x8);
    // public Fusion.NetworkEvents/RunnerEvent OnDisconnectedFromServer
    // Size: 0x8
    // Offset: 0x38
    ::Fusion::NetworkEvents::RunnerEvent* OnDisconnectedFromServer;
    // Field size check
    static_assert(sizeof(::Fusion::NetworkEvents::RunnerEvent*) == 0x8);
    // public Fusion.NetworkEvents/ConnectRequestEvent OnConnectRequest
    // Size: 0x8
    // Offset: 0x40
    ::Fusion::NetworkEvents::ConnectRequestEvent* OnConnectRequest;
    // Field size check
    static_assert(sizeof(::Fusion::NetworkEvents::ConnectRequestEvent*) == 0x8);
    // public Fusion.NetworkEvents/ConnectFailedEvent OnConnectFailed
    // Size: 0x8
    // Offset: 0x48
    ::Fusion::NetworkEvents::ConnectFailedEvent* OnConnectFailed;
    // Field size check
    static_assert(sizeof(::Fusion::NetworkEvents::ConnectFailedEvent*) == 0x8);
    // public Fusion.NetworkEvents/PlayerEvent PlayerJoined
    // Size: 0x8
    // Offset: 0x50
    ::Fusion::NetworkEvents::PlayerEvent* PlayerJoined;
    // Field size check
    static_assert(sizeof(::Fusion::NetworkEvents::PlayerEvent*) == 0x8);
    // public Fusion.NetworkEvents/PlayerEvent PlayerLeft
    // Size: 0x8
    // Offset: 0x58
    ::Fusion::NetworkEvents::PlayerEvent* PlayerLeft;
    // Field size check
    static_assert(sizeof(::Fusion::NetworkEvents::PlayerEvent*) == 0x8);
    // public Fusion.NetworkEvents/SimulationMessageEvent OnSimulationMessage
    // Size: 0x8
    // Offset: 0x60
    ::Fusion::NetworkEvents::SimulationMessageEvent* OnSimulationMessage;
    // Field size check
    static_assert(sizeof(::Fusion::NetworkEvents::SimulationMessageEvent*) == 0x8);
    // public Fusion.NetworkEvents/ShutdownEvent OnShutdown
    // Size: 0x8
    // Offset: 0x68
    ::Fusion::NetworkEvents::ShutdownEvent* OnShutdown;
    // Field size check
    static_assert(sizeof(::Fusion::NetworkEvents::ShutdownEvent*) == 0x8);
    // public Fusion.NetworkEvents/SessionListUpdateEvent OnSessionListUpdate
    // Size: 0x8
    // Offset: 0x70
    ::Fusion::NetworkEvents::SessionListUpdateEvent* OnSessionListUpdate;
    // Field size check
    static_assert(sizeof(::Fusion::NetworkEvents::SessionListUpdateEvent*) == 0x8);
    // public Fusion.NetworkEvents/CustomAuthenticationResponse OnCustomAuthenticationResponse
    // Size: 0x8
    // Offset: 0x78
    ::Fusion::NetworkEvents::CustomAuthenticationResponse* OnCustomAuthenticationResponse;
    // Field size check
    static_assert(sizeof(::Fusion::NetworkEvents::CustomAuthenticationResponse*) == 0x8);
    // public Fusion.NetworkEvents/HostMigrationEvent OnHostMigration
    // Size: 0x8
    // Offset: 0x80
    ::Fusion::NetworkEvents::HostMigrationEvent* OnHostMigration;
    // Field size check
    static_assert(sizeof(::Fusion::NetworkEvents::HostMigrationEvent*) == 0x8);
    // public Fusion.NetworkEvents/RunnerEvent OnSceneLoadDone
    // Size: 0x8
    // Offset: 0x88
    ::Fusion::NetworkEvents::RunnerEvent* OnSceneLoadDone;
    // Field size check
    static_assert(sizeof(::Fusion::NetworkEvents::RunnerEvent*) == 0x8);
    // public Fusion.NetworkEvents/RunnerEvent OnSceneLoadStart
    // Size: 0x8
    // Offset: 0x90
    ::Fusion::NetworkEvents::RunnerEvent* OnSceneLoadStart;
    // Field size check
    static_assert(sizeof(::Fusion::NetworkEvents::RunnerEvent*) == 0x8);
    // public Fusion.NetworkEvents/ReliableDataEvent OnReliableData
    // Size: 0x8
    // Offset: 0x98
    ::Fusion::NetworkEvents::ReliableDataEvent* OnReliableData;
    // Field size check
    static_assert(sizeof(::Fusion::NetworkEvents::ReliableDataEvent*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::Fusion::INetworkRunnerCallbacks
    operator ::Fusion::INetworkRunnerCallbacks() noexcept {
      return *reinterpret_cast<::Fusion::INetworkRunnerCallbacks*>(this);
    }
    // Get instance field reference: public Fusion.NetworkEvents/InputEvent OnInput
    [[deprecated("Use field access instead!")]] ::Fusion::NetworkEvents::InputEvent*& dyn_OnInput();
    // Get instance field reference: public Fusion.NetworkEvents/InputPlayerEvent OnInputMissing
    [[deprecated("Use field access instead!")]] ::Fusion::NetworkEvents::InputPlayerEvent*& dyn_OnInputMissing();
    // Get instance field reference: public Fusion.NetworkEvents/RunnerEvent OnConnectedToServer
