// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include <initializer_list>
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Fusion.Behaviour
#include "Fusion/Behaviour.hpp"
// Including type: Fusion.ILogBuilder
#include "Fusion/ILogBuilder.hpp"
// Including type: Fusion.Simulation/ICallbacks
#include "Fusion/Simulation_ICallbacks.hpp"
// Including type: Fusion.NetworkId
#include "Fusion/NetworkId.hpp"
// Including type: Fusion.ReadAccuracy
#include "Fusion/ReadAccuracy.hpp"
// Including type: Fusion.WriteAccuracy
#include "Fusion/WriteAccuracy.hpp"
// Including type: System.Nullable`1
#include "System/Nullable_1.hpp"
// Including type: System.ValueTuple`5
#include "System/ValueTuple_5.hpp"
// Including type: Unity.Jobs.JobHandle
#include "Unity/Jobs/JobHandle.hpp"
// Including type: Fusion.GameMode
#include "Fusion/GameMode.hpp"
// Including type: System.ValueTuple`2
#include "System/ValueTuple_2.hpp"
// Including type: Fusion.ShutdownReason
#include "Fusion/ShutdownReason.hpp"
// Including type: Fusion.NetworkObjectGuid
#include "Fusion/NetworkObjectGuid.hpp"
// Including type: Fusion.SceneRef
#include "Fusion/SceneRef.hpp"
// Including type: UnityEngine.SceneManagement.Scene
#include "UnityEngine/SceneManagement/Scene.hpp"

namespace System::Collections::Generic {
  // Skipping declaration: IReadOnlyList`1 because it is already included!
  // Forward declaring type: LinkedList`1<T>
  template<typename T>
  class LinkedList_1;
  // Forward declaring type: Queue`1<T>
  template<typename T>
  class Queue_1;
  // Forward declaring type: Stack`1<T>
  template<typename T>
  class Stack_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Skipping declaration: IEnumerable`1 because it is already included!
}
// Forward declaring namespace: System::Threading
namespace System::Threading {
  // Forward declaring type: CancellationTokenSource
  class CancellationTokenSource;
  // Forward declaring type: CancellationToken
  struct CancellationToken;
}
// Forward declaring namespace: Fusion::Sockets
namespace Fusion::Sockets {
  // Forward declaring type: NetAddress
  struct NetAddress;
  // Forward declaring type: INetSocket
  class INetSocket;
  // Forward declaring type: NetConnectFailedReason
  struct NetConnectFailedReason;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Skipping declaration: IEnumerator because it is already included!
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Type
  class Type;
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
  // Forward declaring type: Exception
  class Exception;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: PhysicsScene
  struct PhysicsScene;
  // Forward declaring type: PhysicsScene2D
  struct PhysicsScene2D;
  // Skipping declaration: Component because it is already included!
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: StringBuilder
  class StringBuilder;
}
// Forward declaring namespace: Fusion::Photon::Realtime
namespace Fusion::Photon::Realtime {
  // Forward declaring type: AuthenticationValues
  class AuthenticationValues;
  // Forward declaring type: AppSettings
  class AppSettings;
}
// Forward declaring namespace: Fusion::Sockets::Stun
namespace Fusion::Sockets::Stun {
  // Forward declaring type: NATType
  struct NATType;
}
// Completed forward declares
// Type namespace: Fusion
namespace Fusion {
  // Forward declaring type: NetworkRunner
  class NetworkRunner;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Fusion::NetworkRunner);
DEFINE_IL2CPP_ARG_TYPE(::Fusion::NetworkRunner*, "Fusion", "NetworkRunner");
// Type namespace: Fusion
namespace Fusion {
  // WARNING Size may be invalid!
  // Autogenerated type: Fusion.NetworkRunner
  // [TokenAttribute] Offset: FFFFFFFF
  // [ScriptHelpAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: FFFFFFFF
  // [DisallowMultipleComponent] Offset: FFFFFFFF
  // [HelpURLAttribute] Offset: FFFFFFFF
  class NetworkRunner : public ::Fusion::Behaviour/*, public ::Fusion::ILogBuilder, public ::Fusion::Simulation::ICallbacks*/ {
    public:
    // Nested type: ::Fusion::NetworkRunner::BuildTypes
    struct BuildTypes;
    // Nested type: ::Fusion::NetworkRunner::States
    struct States;
    // Nested type: ::Fusion::NetworkRunner::ShutdownFlags
    struct ShutdownFlags;
    // Nested type: ::Fusion::NetworkRunner::OnBeforeSpawned
    class OnBeforeSpawned;
    // Nested type: ::Fusion::NetworkRunner::SpawnQueueEntry
    struct SpawnQueueEntry;
    // Nested type: ::Fusion::NetworkRunner::DeferredShutdownParams
    struct DeferredShutdownParams;
    // Nested type: ::Fusion::NetworkRunner::SimulationPhase
    struct SimulationPhase;
    // Nested type: ::Fusion::NetworkRunner::AttachOptions
    struct AttachOptions;
    // Nested type: ::Fusion::NetworkRunner::HostSnapshotCompressionJob
    struct HostSnapshotCompressionJob;
    // Nested type: ::Fusion::NetworkRunner::NetworkObjectInactivityGuard
    class NetworkObjectInactivityGuard;
    // Nested type: ::Fusion::NetworkRunner::$$c
    class $$c;
    // Nested type: ::Fusion::NetworkRunner::$$c__DisplayClass119_0
    class $$c__DisplayClass119_0;
    // Nested type: ::Fusion::NetworkRunner::$$c__DisplayClass119_1
    class $$c__DisplayClass119_1;
    // Nested type: ::Fusion::NetworkRunner::$ConnectToCloud$d__314
    struct $ConnectToCloud$d__314;
    // Nested type: ::Fusion::NetworkRunner::$DisconnectFromCloud$d__315
    struct $DisconnectFromCloud$d__315;
    // Nested type: ::Fusion::NetworkRunner::$GetResumeSnapshotNetworkObjects$d__257
    class $GetResumeSnapshotNetworkObjects$d__257;
    // Nested type: ::Fusion::NetworkRunner::$GetResumeSnapshotNetworkSceneObjects$d__258
    class $GetResumeSnapshotNetworkSceneObjects$d__258;
    // Nested type: ::Fusion::NetworkRunner::$JoinSessionLobby$d__312
    struct $JoinSessionLobby$d__312;
    // Nested type: ::Fusion::NetworkRunner::$RunHostMigrationResume$d__259
    class $RunHostMigrationResume$d__259;
    // Nested type: ::Fusion::NetworkRunner::$ShutdownAndBuildResult$d__318
    struct $ShutdownAndBuildResult$d__318;
    // Nested type: ::Fusion::NetworkRunner::$ShutdownWithCleanupCoroutine$d__118
    class $ShutdownWithCleanupCoroutine$d__118;
    // Nested type: ::Fusion::NetworkRunner::$StartGameModeCloud$d__317
    struct $StartGameModeCloud$d__317;
    // Nested type: ::Fusion::NetworkRunner::$StartGameModeSinglePlayer$d__316
    struct $StartGameModeSinglePlayer$d__316;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: Fusion.NetworkRunner/ShutdownFlags
    // [TokenAttribute] Offset: FFFFFFFF
    // [FlagsAttribute] Offset: FFFFFFFF
    struct ShutdownFlags/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: ShutdownFlags
      constexpr ShutdownFlags(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public Fusion.NetworkRunner/ShutdownFlags Regular
      static constexpr const int Regular = 1;
      // Get static field: static public Fusion.NetworkRunner/ShutdownFlags Regular
      static ::Fusion::NetworkRunner::ShutdownFlags _get_Regular();
      // Set static field: static public Fusion.NetworkRunner/ShutdownFlags Regular
      static void _set_Regular(::Fusion::NetworkRunner::ShutdownFlags value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // Fusion.NetworkRunner/ShutdownFlags
    #pragma pack(pop)
    static check_size<sizeof(NetworkRunner::ShutdownFlags), 0 + sizeof(int)> __Fusion_NetworkRunner_ShutdownFlagsSizeCheck;
    static_assert(sizeof(NetworkRunner::ShutdownFlags) == 0x4);
    // WARNING Size may be invalid!
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: Fusion.NetworkRunner/SpawnQueueEntry
    // [TokenAttribute] Offset: FFFFFFFF
    struct SpawnQueueEntry/*, public ::System::ValueType*/ {
      public:
      public:
      // public Fusion.NetworkPrefabId PrefabId
      // Size: 0x4
      // Offset: 0x0
      ::Fusion::NetworkPrefabId PrefabId;
      // Field size check
      static_assert(sizeof(::Fusion::NetworkPrefabId) == 0x4);
      // public System.Nullable`1<UnityEngine.Vector3> Position
      // Size: 0xFFFFFFFF
      // Offset: 0x4
      ::System::Nullable_1<::UnityEngine::Vector3> Position;
      // public System.Nullable`1<UnityEngine.Quaternion> Rotation
      // Size: 0xFFFFFFFF
      // Offset: 0x14
      ::System::Nullable_1<::UnityEngine::Quaternion> Rotation;
      // public System.Nullable`1<Fusion.PlayerRef> InputAuthority
      // Size: 0xFFFFFFFF
      // Offset: 0x28
      ::System::Nullable_1<::Fusion::PlayerRef> InputAuthority;
      // public System.Object OnBeforeSpawned
      // Size: 0x8
      // Offset: 0x30
      ::Il2CppObject* OnBeforeSpawned;
      // Field size check
      static_assert(sizeof(::Il2CppObject*) == 0x8);
      // public System.Nullable`1<Fusion.NetworkObjectPredictionKey> PredictionKey
      // Size: 0xFFFFFFFF
      // Offset: 0x38
      ::System::Nullable_1<::Fusion::NetworkObjectPredictionKey> PredictionKey;
      // public System.Boolean SyncPhysics
      // Size: 0x1
      // Offset: 0x40
      bool SyncPhysics;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      public:
      // Creating value type constructor for type: SpawnQueueEntry
      constexpr SpawnQueueEntry(::Fusion::NetworkPrefabId PrefabId_ = {}, ::System::Nullable_1<::UnityEngine::Vector3> Position_ = {}, ::System::Nullable_1<::UnityEngine::Quaternion> Rotation_ = {}, ::System::Nullable_1<::Fusion::PlayerRef> InputAuthority_ = {}, ::Il2CppObject* OnBeforeSpawned_ = {}, ::System::Nullable_1<::Fusion::NetworkObjectPredictionKey> PredictionKey_ = {}, bool SyncPhysics_ = {}) noexcept : PrefabId{PrefabId_}, Position{Position_}, Rotation{Rotation_}, InputAuthority{InputAuthority_}, OnBeforeSpawned{OnBeforeSpawned_}, PredictionKey{PredictionKey_}, SyncPhysics{SyncPhysics_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public Fusion.NetworkPrefabId PrefabId
      [[deprecated("Use field access instead!")]] ::Fusion::NetworkPrefabId& dyn_PrefabId();
      // Get instance field reference: public System.Nullable`1<UnityEngine.Vector3> Position
      [[deprecated("Use field access instead!")]] ::System::Nullable_1<::UnityEngine::Vector3>& dyn_Position();
      // Get instance field reference: public System.Nullable`1<UnityEngine.Quaternion> Rotation
      [[deprecated("Use field access instead!")]] ::System::Nullable_1<::UnityEngine::Quaternion>& dyn_Rotation();
      // Get instance field reference: public System.Nullable`1<Fusion.PlayerRef> InputAuthority
      [[deprecated("Use field access instead!")]] ::System::Nullable_1<::Fusion::PlayerRef>& dyn_InputAuthority();
      // Get instance field reference: public System.Object OnBeforeSpawned
      [[deprecated("Use field access instead!")]] ::Il2CppObject*& dyn_OnBeforeSpawned();
      // Get instance field reference: public System.Nullable`1<Fusion.NetworkObjectPredictionKey> PredictionKey
      [[deprecated("Use field access instead!")]] ::System::Nullable_1<::Fusion::NetworkObjectPredictionKey>& dyn_PredictionKey();
      // Get instance field reference: public System.Boolean SyncPhysics
      [[deprecated("Use field access instead!")]] bool& dyn_SyncPhysics();
    }; // Fusion.NetworkRunner/SpawnQueueEntry
    // WARNING Not writing size check since size may be invalid!
    // Size: 0x9
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: Fusion.NetworkRunner/DeferredShutdownParams
    // [TokenAttribute] Offset: FFFFFFFF
    struct DeferredShutdownParams/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.Boolean ShutdownRequested
      // Size: 0x1
      // Offset: 0x0
      bool ShutdownRequested;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // Padding between fields: ShutdownRequested and: ShutdownReason
      char __padding0[0x3] = {};
      // public Fusion.ShutdownReason ShutdownReason
      // Size: 0x4
      // Offset: 0x4
      ::Fusion::ShutdownReason ShutdownReason;
      // Field size check
      static_assert(sizeof(::Fusion::ShutdownReason) == 0x4);
      // public System.Boolean DestroyGO
      // Size: 0x1
      // Offset: 0x8
      bool DestroyGO;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      public:
      // Creating value type constructor for type: DeferredShutdownParams
      constexpr DeferredShutdownParams(bool ShutdownRequested_ = {}, ::Fusion::ShutdownReason ShutdownReason_ = {}, bool DestroyGO_ = {}) noexcept : ShutdownRequested{ShutdownRequested_}, ShutdownReason{ShutdownReason_}, DestroyGO{DestroyGO_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public System.Boolean ShutdownRequested
      [[deprecated("Use field access instead!")]] bool& dyn_ShutdownRequested();
      // Get instance field reference: public Fusion.ShutdownReason ShutdownReason
      [[deprecated("Use field access instead!")]] ::Fusion::ShutdownReason& dyn_ShutdownReason();
      // Get instance field reference: public System.Boolean DestroyGO
      [[deprecated("Use field access instead!")]] bool& dyn_DestroyGO();
    }; // Fusion.NetworkRunner/DeferredShutdownParams
    #pragma pack(pop)
    static check_size<sizeof(NetworkRunner::DeferredShutdownParams), 8 + sizeof(bool)> __Fusion_NetworkRunner_DeferredShutdownParamsSizeCheck;
    static_assert(sizeof(NetworkRunner::DeferredShutdownParams) == 0x9);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: Fusion.NetworkRunner/SimulationPhase
    // [TokenAttribute] Offset: FFFFFFFF
    struct SimulationPhase/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: SimulationPhase
      constexpr SimulationPhase(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public Fusion.NetworkRunner/SimulationPhase None
      static constexpr const int None = 0;
      // Get static field: static public Fusion.NetworkRunner/SimulationPhase None
      static ::Fusion::NetworkRunner::SimulationPhase _get_None();
      // Set static field: static public Fusion.NetworkRunner/SimulationPhase None
      static void _set_None(::Fusion::NetworkRunner::SimulationPhase value);
      // static field const value: static public Fusion.NetworkRunner/SimulationPhase Update
      static constexpr const int Update = 1;
      // Get static field: static public Fusion.NetworkRunner/SimulationPhase Update
      static ::Fusion::NetworkRunner::SimulationPhase _get_Update();
      // Set static field: static public Fusion.NetworkRunner/SimulationPhase Update
      static void _set_Update(::Fusion::NetworkRunner::SimulationPhase value);
      // static field const value: static public Fusion.NetworkRunner/SimulationPhase Render
      static constexpr const int Render = 2;
      // Get static field: static public Fusion.NetworkRunner/SimulationPhase Render
      static ::Fusion::NetworkRunner::SimulationPhase _get_Render();
      // Set static field: static public Fusion.NetworkRunner/SimulationPhase Render
      static void _set_Render(::Fusion::NetworkRunner::SimulationPhase value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // Fusion.NetworkRunner/SimulationPhase
    #pragma pack(pop)
    static check_size<sizeof(NetworkRunner::SimulationPhase), 0 + sizeof(int)> __Fusion_NetworkRunner_SimulationPhaseSizeCheck;
    static_assert(sizeof(NetworkRunner::SimulationPhase) == 0x4);
    // Size: 0x28
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: Fusion.NetworkRunner/HostSnapshotCompressionJob
    // [TokenAttribute] Offset: FFFFFFFF
    struct HostSnapshotCompressionJob/*, public ::System::ValueType, public ::Unity::Jobs::IJob*/ {
      public:
      public:
      // System.Int32 CurrentTick
      // Size: 0x4
      // Offset: 0x0
      int CurrentTick;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // System.Int32 Length
      // Size: 0x4
      // Offset: 0x4
      int Length;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // System.UInt32 LastID
      // Size: 0x4
      // Offset: 0x8
      uint LastID;
      // Field size check
      static_assert(sizeof(uint) == 0x4);
      // Padding between fields: LastID and: Previous
      char __padding2[0x4] = {};
      // System.Int32* Previous
      // Size: 0x8
      // Offset: 0x10
      int* Previous;
      // Field size check
      static_assert(sizeof(int*) == 0x8);
      // System.Int32* Current
      // Size: 0x8
      // Offset: 0x18
      int* Current;
      // Field size check
      static_assert(sizeof(int*) == 0x8);
      // System.Int32* Result
      // Size: 0x8
      // Offset: 0x20
      int* Result;
      // Field size check
      static_assert(sizeof(int*) == 0x8);
      public:
      // Creating value type constructor for type: HostSnapshotCompressionJob
      constexpr HostSnapshotCompressionJob(int CurrentTick_ = {}, int Length_ = {}, uint LastID_ = {}, int* Previous_ = {}, int* Current_ = {}, int* Result_ = {}) noexcept : CurrentTick{CurrentTick_}, Length{Length_}, LastID{LastID_}, Previous{Previous_}, Current{Current_}, Result{Result_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Creating interface conversion operator: operator ::Unity::Jobs::IJob
      operator ::Unity::Jobs::IJob() noexcept {
        return *reinterpret_cast<::Unity::Jobs::IJob*>(this);
      }
      // Get instance field reference: System.Int32 CurrentTick
      [[deprecated("Use field access instead!")]] int& dyn_CurrentTick();
      // Get instance field reference: System.Int32 Length
      [[deprecated("Use field access instead!")]] int& dyn_Length();
      // Get instance field reference: System.UInt32 LastID
      [[deprecated("Use field access instead!")]] uint& dyn_LastID();
      // Get instance field reference: System.Int32* Previous
      [[deprecated("Use field access instead!")]] int*& dyn_Previous();
      // Get instance field reference: System.Int32* Current
      [[deprecated("Use field access instead!")]] int*& dyn_Current();
      // Get instance field reference: System.Int32* Result
      [[deprecated("Use field access instead!")]] int*& dyn_Result();
      // public System.Int32 get_ResultLength()
      // Offset: 0x2B66584
      int get_ResultLength();
      // System.Void set_ResultLength(System.Int32 value)
      // Offset: 0x2B66590
      void set_ResultLength(int value);
      // public System.Int32 get_ResultTick()
      // Offset: 0x2B6659C
      int get_ResultTick();
      // System.Void set_ResultTick(System.Int32 value)
      // Offset: 0x2B665A8
      void set_ResultTick(int value);
      // public System.Int32* get_ResultData()
      // Offset: 0x2B665B4
      int* get_ResultData();
      // public System.Void Execute()
      // Offset: 0x2B665C0
      void Execute();
    }; // Fusion.NetworkRunner/HostSnapshotCompressionJob
    #pragma pack(pop)
    static check_size<sizeof(NetworkRunner::HostSnapshotCompressionJob), 32 + sizeof(int*)> __Fusion_NetworkRunner_HostSnapshotCompressionJobSizeCheck;
    static_assert(sizeof(NetworkRunner::HostSnapshotCompressionJob) == 0x28);
    public:
    // private Fusion.NetworkRunner/DeferredShutdownParams _deferredShutdownParams
    // Size: 0x9
    // Offset: 0x20
    ::Fusion::NetworkRunner::DeferredShutdownParams deferredShutdownParams;
    // Field size check
    static_assert(sizeof(::Fusion::NetworkRunner::DeferredShutdownParams) == 0x9);
    // Fusion.Simulation _simulation
    // Size: 0x8
    // Offset: 0x30
    ::Fusion::Simulation* simulation;
    // Field size check
    static_assert(sizeof(::Fusion::Simulation*) == 0x8);
    // private Fusion.NetworkRunner/SimulationPhase _simulationPhase
    // Size: 0x4
    // Offset: 0x38
    ::Fusion::NetworkRunner::SimulationPhase simulationPhase;
    // Field size check
    static_assert(sizeof(::Fusion::NetworkRunner::SimulationPhase) == 0x4);
    // private Fusion.NetworkRunner/ShutdownFlags _simulationShutdown
    // Size: 0x4
    // Offset: 0x3C
    ::Fusion::NetworkRunner::ShutdownFlags simulationShutdown;
    // Field size check
    static_assert(sizeof(::Fusion::NetworkRunner::ShutdownFlags) == 0x4);
    // private Fusion.NetworkObjectRefMap`1<Fusion.NetworkObject> _objects
    // Size: 0x8
    // Offset: 0x40
    ::Fusion::NetworkObjectRefMap_1<::Fusion::NetworkObject*>* objects;
    // Field size check
    static_assert(sizeof(::Fusion::NetworkObjectRefMap_1<::Fusion::NetworkObject*>*) == 0x8);
    // private Fusion.SimulationBehaviourUpdater _behaviourUpdater
    // Size: 0x8
    // Offset: 0x48
    ::Fusion::SimulationBehaviourUpdater* behaviourUpdater;
    // Field size check
    static_assert(sizeof(::Fusion::SimulationBehaviourUpdater*) == 0x8);
    // private System.Collections.Generic.List`1<Fusion.INetworkRunnerCallbacks> _callbacks
    // Size: 0x8
    // Offset: 0x50
    ::System::Collections::Generic::List_1<::Fusion::INetworkRunnerCallbacks*>* callbacks;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Fusion::INetworkRunnerCallbacks*>*) == 0x8);
    // private Fusion.Allocator* _changedAllocator
    // Size: 0x8
    // Offset: 0x58
    ::Fusion::Allocator* changedAllocator;
    // Field size check
    static_assert(sizeof(::Fusion::Allocator*) == 0x8);
    // private System.Collections.Generic.List`1<Fusion.NetworkId> _destroyIdsBuffer
    // Size: 0x8
    // Offset: 0x60
    ::System::Collections::Generic::List_1<::Fusion::NetworkId>* destroyIdsBuffer;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Fusion::NetworkId>*) == 0x8);
    // System.Collections.Generic.LinkedList`1<Fusion.RunnerVisibilityNode> _visibilityNodes
    // Size: 0x8
    // Offset: 0x68
    ::System::Collections::Generic::LinkedList_1<::Fusion::RunnerVisibilityNode*>* visibilityNodes;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::LinkedList_1<::Fusion::RunnerVisibilityNode*>*) == 0x8);
    // private System.Boolean _isVisible
    // Size: 0x1
    // Offset: 0x70
    bool isVisible;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Collections.Generic.Queue`1<Fusion.NetworkRunner/SpawnQueueEntry> _spawnQueue
    // Size: 0x8
    // Offset: 0x78
    ::System::Collections::Generic::Queue_1<::Fusion::NetworkRunner::SpawnQueueEntry>* spawnQueue;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Queue_1<::Fusion::NetworkRunner::SpawnQueueEntry>*) == 0x8);
    // private System.Boolean _printedInterestGroupsWarning
    // Size: 0x1
    // Offset: 0x80
    bool printedInterestGroupsWarning;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // System.Threading.Tasks.TaskCompletionSource`1<System.Boolean> _initializeOperation
    // Size: 0x8
    // Offset: 0x88
    ::System::Threading::Tasks::TaskCompletionSource_1<bool>* initializeOperation;
    // Field size check
    static_assert(sizeof(::System::Threading::Tasks::TaskCompletionSource_1<bool>*) == 0x8);
    // private Fusion.NetworkProjectConfig _config
    // Size: 0x8
    // Offset: 0x90
    ::Fusion::NetworkProjectConfig* config;
    // Field size check
    static_assert(sizeof(::Fusion::NetworkProjectConfig*) == 0x8);
    // private System.Int32 _ticksExecuted
    // Size: 0x4
    // Offset: 0x98
    int ticksExecuted;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private Fusion.INetworkObjectPool _networkObjectPool
    // Size: 0x8
    // Offset: 0xA0
    ::Fusion::INetworkObjectPool* networkObjectPool;
    // Field size check
    static_assert(sizeof(::Fusion::INetworkObjectPool*) == 0x8);
    // private System.UInt32 _idCounter
    // Size: 0x4
    // Offset: 0xA8
    uint idCounter;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.Collections.Generic.List`1<Fusion.NetworkObject> _predictionSpawns
    // Size: 0x8
    // Offset: 0xB0
    ::System::Collections::Generic::List_1<::Fusion::NetworkObject*>* predictionSpawns;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Fusion::NetworkObject*>*) == 0x8);
    // private System.Collections.Generic.List`1<Fusion.NetworkObject> _predictionDespawns
    // Size: 0x8
    // Offset: 0xB8
    ::System::Collections::Generic::List_1<::Fusion::NetworkObject*>* predictionDespawns;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Fusion::NetworkObject*>*) == 0x8);
    // private System.Collections.Generic.List`1<Fusion.NetworkObject> _activeSceneObjectsBuffer
    // Size: 0x8
    // Offset: 0xC0
    ::System::Collections::Generic::List_1<::Fusion::NetworkObject*>* activeSceneObjectsBuffer;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Fusion::NetworkObject*>*) == 0x8);
    // Fusion.ReadAccuracy _positionReadAccuracy
    // Size: 0x4
    // Offset: 0xC8
    ::Fusion::ReadAccuracy positionReadAccuracy;
    // Field size check
    static_assert(sizeof(::Fusion::ReadAccuracy) == 0x4);
    // Fusion.WriteAccuracy _positionWriteAccuracy
    // Size: 0x4
    // Offset: 0xCC
    ::Fusion::WriteAccuracy positionWriteAccuracy;
    // Field size check
    static_assert(sizeof(::Fusion::WriteAccuracy) == 0x4);
    // Fusion.ReadAccuracy _rotationReadAccuracy
    // Size: 0x4
    // Offset: 0xD0
    ::Fusion::ReadAccuracy rotationReadAccuracy;
    // Field size check
    static_assert(sizeof(::Fusion::ReadAccuracy) == 0x4);
    // Fusion.WriteAccuracy _rotationWriteAccuracy
    // Size: 0x4
    // Offset: 0xD4
    ::Fusion::WriteAccuracy rotationWriteAccuracy;
    // Field size check
    static_assert(sizeof(::Fusion::WriteAccuracy) == 0x4);
    // System.Byte[] _connectionToken
    // Size: 0x8
    // Offset: 0xD8
    ::ArrayW<uint8_t> connectionToken;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // private System.Nullable`1<System.Boolean> _provideInput
    // Size: 0xFFFFFFFF
    // Offset: 0xE0
    ::System::Nullable_1<bool> provideInput;
    // private System.Threading.CancellationTokenSource OperationsCancellationTokenSource
    // Size: 0x8
    // Offset: 0xE8
    ::System::Threading::CancellationTokenSource* OperationsCancellationTokenSource;
    // Field size check
    static_assert(sizeof(::System::Threading::CancellationTokenSource*) == 0x8);
    // private System.Collections.Generic.List`1<Fusion.NetworkObject> _remotePrefabsWaitingForSpawnedCallback
    // Size: 0x8
    // Offset: 0xF0
    ::System::Collections::Generic::List_1<::Fusion::NetworkObject*>* remotePrefabsWaitingForSpawnedCallback;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Fusion::NetworkObject*>*) == 0x8);
    // private System.Collections.Generic.List`1<Fusion.INetworkRunnerCallbacks> _callbacksBuffer
    // Size: 0x8
    // Offset: 0xF8
    ::System::Collections::Generic::List_1<::Fusion::INetworkRunnerCallbacks*>* callbacksBuffer;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Fusion::INetworkRunnerCallbacks*>*) == 0x8);
    // private System.Boolean <IsHostMigrationEnabled>k__BackingField
    // Size: 0x1
    // Offset: 0x100
    bool IsHostMigrationEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.UInt32 <HostMigrationSnapshotDelay>k__BackingField
    // Size: 0x4
    // Offset: 0x104
    uint HostMigrationSnapshotDelay;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.Byte* _hostSnapshotData0
    // Size: 0x8
    // Offset: 0x108
    uint8_t* hostSnapshotData0;
    // Field size check
    static_assert(sizeof(uint8_t*) == 0x8);
    // private System.Byte* _hostSnapshotData1
    // Size: 0x8
    // Offset: 0x110
    uint8_t* hostSnapshotData1;
    // Field size check
    static_assert(sizeof(uint8_t*) == 0x8);
    // private System.Byte* _hostSnapshotDelta
    // Size: 0x8
    // Offset: 0x118
    uint8_t* hostSnapshotDelta;
    // Field size check
    static_assert(sizeof(uint8_t*) == 0x8);
    // private System.Threading.Tasks.TaskCompletionSource`1<System.ValueTuple`5<System.Boolean,System.Int32,System.Int32,System.UInt32,System.Byte[]>> _buildHostSnapshotTask
    // Size: 0x8
    // Offset: 0x120
    ::System::Threading::Tasks::TaskCompletionSource_1<::System::ValueTuple_5<bool, int, int, uint, ::ArrayW<uint8_t>>>* buildHostSnapshotTask;
    // Field size check
    static_assert(sizeof(::System::Threading::Tasks::TaskCompletionSource_1<::System::ValueTuple_5<bool, int, int, uint, ::ArrayW<uint8_t>>>*) == 0x8);
    // private System.Nullable`1<Fusion.NetworkRunner/HostSnapshotCompressionJob> _buildHostSnapshotJob
    // Size: 0xFFFFFFFF
    // Offset: 0x128
    ::System::Nullable_1<::Fusion::NetworkRunner::HostSnapshotCompressionJob> buildHostSnapshotJob;
    // private System.Nullable`1<Unity.Jobs.JobHandle> _buildHostSnapshotHandler
    // Size: 0xFFFFFFFF
    // Offset: 0x158
    ::System::Nullable_1<::Unity::Jobs::JobHandle> buildHostSnapshotHandler;
    // private Fusion.Protocol.HostMigration _lastHostMigrationInfo
    // Size: 0x8
    // Offset: 0x170
    ::Fusion::Protocol::HostMigration* lastHostMigrationInfo;
    // Field size check
    static_assert(sizeof(::Fusion::Protocol::HostMigration*) == 0x8);
    // private System.Collections.Generic.Stack`1<Fusion.NetworkRunner/NetworkObjectInactivityGuard> _inactivityGuardPool
    // Size: 0x8
    // Offset: 0x178
    ::System::Collections::Generic::Stack_1<::Fusion::NetworkRunner::NetworkObjectInactivityGuard*>* inactivityGuardPool;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Stack_1<::Fusion::NetworkRunner::NetworkObjectInactivityGuard*>*) == 0x8);
    // private Fusion.GameMode <GameMode>k__BackingField
    // Size: 0x4
    // Offset: 0x180
    ::Fusion::GameMode GameMode;
    // Field size check
    static_assert(sizeof(::Fusion::GameMode) == 0x4);
    // private Fusion.SessionInfo <SessionInfo>k__BackingField
    // Size: 0x8
    // Offset: 0x188
    ::Fusion::SessionInfo* SessionInfo;
    // Field size check
    static_assert(sizeof(::Fusion::SessionInfo*) == 0x8);
    // private Fusion.LobbyInfo <LobbyInfo>k__BackingField
    // Size: 0x8
    // Offset: 0x190
    ::Fusion::LobbyInfo* LobbyInfo;
    // Field size check
    static_assert(sizeof(::Fusion::LobbyInfo*) == 0x8);
    // System.Threading.Tasks.TaskCompletionSource`1<System.ValueTuple`2<Fusion.ShutdownReason,System.String>> _cloudOperation
    // Size: 0x8
    // Offset: 0x198
    ::System::Threading::Tasks::TaskCompletionSource_1<::System::ValueTuple_2<::Fusion::ShutdownReason, ::StringW>>* cloudOperation;
    // Field size check
    static_assert(sizeof(::System::Threading::Tasks::TaskCompletionSource_1<::System::ValueTuple_2<::Fusion::ShutdownReason, ::StringW>>*) == 0x8);
    // Fusion.CloudServices _cloudServices
    // Size: 0x8
    // Offset: 0x1A0
    ::Fusion::CloudServices* cloudServices;
    // Field size check
    static_assert(sizeof(::Fusion::CloudServices*) == 0x8);
    // private Fusion.INetworkSceneManager _sceneManager
    // Size: 0x8
    // Offset: 0x1A8
    ::Fusion::INetworkSceneManager* sceneManager;
    // Field size check
    static_assert(sizeof(::Fusion::INetworkSceneManager*) == 0x8);
    // private Fusion.INetworkSceneManagerObjectResolver _sceneObjectResolver
    // Size: 0x8
    // Offset: 0x1B0
    ::Fusion::INetworkSceneManagerObjectResolver* sceneObjectResolver;
    // Field size check
    static_assert(sizeof(::Fusion::INetworkSceneManagerObjectResolver*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<Fusion.NetworkObjectGuid,Fusion.NetworkObject> _sceneObjectLoopkup
    // Size: 0x8
    // Offset: 0x1B8
    ::System::Collections::Generic::Dictionary_2<::Fusion::NetworkObjectGuid, ::Fusion::NetworkObject*>* sceneObjectLoopkup;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::Fusion::NetworkObjectGuid, ::Fusion::NetworkObject*>*) == 0x8);
    // private System.Nullable`1<Fusion.SceneRef> _sharedModeStartSceneRef
    // Size: 0xFFFFFFFF
    // Offset: 0x1C0
    ::System::Nullable_1<::Fusion::SceneRef> sharedModeStartSceneRef;
    // private UnityEngine.SceneManagement.Scene _multiplePeerUnityScene
    // Size: 0x4
    // Offset: 0x1C8
    ::UnityEngine::SceneManagement::Scene multiplePeerUnityScene;
    // Field size check
    static_assert(sizeof(::UnityEngine::SceneManagement::Scene) == 0x4);
    // private System.Boolean _isMultiplePeerUnitySceneTemp
    // Size: 0x1
    // Offset: 0x1CC
    bool isMultiplePeerUnitySceneTemp;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Int32* _tempWords
    // Size: 0x8
    // Offset: 0x1D0
    int* tempWords;
    // Field size check
    static_assert(sizeof(int*) == 0x8);
    // private System.Int32 _tempWordsCapacity
    // Size: 0x4
    // Offset: 0x1D8
    int tempWordsCapacity;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Creating interface conversion operator: operator ::Fusion::ILogBuilder
    operator ::Fusion::ILogBuilder() noexcept {
      return *reinterpret_cast<::Fusion::ILogBuilder*>(this);
    }
    // Creating interface conversion operator: operator ::Fusion::Simulation::ICallbacks
    operator ::Fusion::Simulation::ICallbacks() noexcept {
      return *reinterpret_cast<::Fusion::Simulation::ICallbacks*>(this);
    }
    // Get static field: static private System.Collections.Generic.Dictionary`2<System.Int32,Fusion.NetworkRunner> _instancesByMultiPeerScene
    static ::System::Collections::Generic::Dictionary_2<int, ::Fusion::NetworkRunner*>* _get__instancesByMultiPeerScene();
    // Set static field: static private System.Collections.Generic.Dictionary`2<System.Int32,Fusion.NetworkRunner> _instancesByMultiPeerScene
