// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Fusion.Simulation
#include "Fusion/Simulation.hpp"
// Including type: Fusion.PlayerRef
#include "Fusion/PlayerRef.hpp"
// Including type: Fusion.SimulationInput
#include "Fusion/SimulationInput.hpp"
// Including type: Fusion.Timer
#include "Fusion/Timer.hpp"
// Including type: Fusion.SimulationPlayer/AOIQuery
#include "Fusion/SimulationPlayer.hpp"
// Including type: Fusion.SimulationSnapshot
#include "Fusion/SimulationSnapshot.hpp"
// Including type: System.ValueTuple`2
#include "System/ValueTuple_2.hpp"
// Including type: System.Nullable`1
#include "System/Nullable_1.hpp"
// Including type: Fusion.SimulationArgs
#include "Fusion/SimulationArgs.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Fusion
namespace Fusion {
  // Forward declaring type: SimulationStages
  struct SimulationStages;
  // Forward declaring type: SimulationPacketEnvelope
  struct SimulationPacketEnvelope;
  // Skipping declaration: Tick because it is already included!
}
// Forward declaring namespace: Fusion::Sockets
namespace Fusion::Sockets {
  // Forward declaring type: NetConnection
  struct NetConnection;
  // Skipping declaration: NetAddress because it is already included!
  // Forward declaring type: NetBitBuffer
  struct NetBitBuffer;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Queue`1<T>
  template<typename T>
  class Queue_1;
  // Forward declaring type: IEnumerable`1<T>
  template<typename T>
  class IEnumerable_1;
}
// Forward declaring namespace: System
namespace System {
  // Skipping declaration: ValueType because it is already included!
}
// Completed forward declares
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Fusion::Simulation::Client);
DEFINE_IL2CPP_ARG_TYPE(::Fusion::Simulation::Client*, "Fusion", "Simulation/Client");
// Type namespace: Fusion
namespace Fusion {
  // WARNING Size may be invalid!
  // Autogenerated type: Fusion.Simulation/Client
  // [TokenAttribute] Offset: FFFFFFFF
  class Simulation::Client : public ::Fusion::Simulation {
    public:
    // Nested type: ::Fusion::Simulation::Client::$get_ActivePlayers$d__27
    class $get_ActivePlayers$d__27;
    public:
    // private Fusion.PlayerRef _player
    // Size: 0x4
    // Offset: 0x360
    ::Fusion::PlayerRef player;
    // Field size check
    static_assert(sizeof(::Fusion::PlayerRef) == 0x4);
    // private Fusion.Sockets.NetConnection* _server
    // Size: 0x8
    // Offset: 0x368
    ::Fusion::Sockets::NetConnection* server;
    // Field size check
    static_assert(sizeof(::Fusion::Sockets::NetConnection*) == 0x8);
    // private System.Boolean _stateReceived
    // Size: 0x1
    // Offset: 0x370
    bool stateReceived;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _forceClientPredictionReset
    // Size: 0x1
    // Offset: 0x371
    bool forceClientPredictionReset;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private Fusion.SimulationInput/Buffer _inputBuffer
    // Size: 0x8
    // Offset: 0x378
    ::Fusion::SimulationInput::Buffer* inputBuffer;
    // Field size check
    static_assert(sizeof(::Fusion::SimulationInput::Buffer*) == 0x8);
    // private Fusion.SimulationInput[] _inputArray
    // Size: 0x8
    // Offset: 0x380
    ::ArrayW<::Fusion::SimulationInput*> inputArray;
    // Field size check
    static_assert(sizeof(::ArrayW<::Fusion::SimulationInput*>) == 0x8);
    // private System.Double _inputOffsetTarget
    // Size: 0x8
    // Offset: 0x388
    double inputOffsetTarget;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private System.Double _inputLastAdjustment
    // Size: 0x8
    // Offset: 0x390
    double inputLastAdjustment;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private Fusion.Timer _inputAdjustClock
    // Size: 0x11
    // Offset: 0x398
    ::Fusion::Timer inputAdjustClock;
    // Field size check
    static_assert(sizeof(::Fusion::Timer) == 0x11);
    // private System.Collections.Generic.List`1<Fusion.SimulationPlayer/AOIQuery> _aoiQueries
    // Size: 0x8
    // Offset: 0x3B0
    ::System::Collections::Generic::List_1<::Fusion::SimulationPlayer::AOIQuery>* aoiQueries;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Fusion::SimulationPlayer::AOIQuery>*) == 0x8);
    // private Fusion.SimulationSnapshot/Interpolator _interpolator
    // Size: 0x8
    // Offset: 0x3B8
    ::Fusion::SimulationSnapshot::Interpolator* interpolator;
    // Field size check
    static_assert(sizeof(::Fusion::SimulationSnapshot::Interpolator*) == 0x8);
    // private System.Collections.Generic.Queue`1<System.ValueTuple`2<Fusion.PlayerRef,System.Boolean>> _playerJoinedLeftMessages
    // Size: 0x8
    // Offset: 0x3C0
    ::System::Collections::Generic::Queue_1<::System::ValueTuple_2<::Fusion::PlayerRef, bool>>* playerJoinedLeftMessages;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Queue_1<::System::ValueTuple_2<::Fusion::PlayerRef, bool>>*) == 0x8);
    public:
    // Get instance field reference: private Fusion.PlayerRef _player
    [[deprecated("Use field access instead!")]] ::Fusion::PlayerRef& dyn__player();
    // Get instance field reference: private Fusion.Sockets.NetConnection* _server
    [[deprecated("Use field access instead!")]] ::Fusion::Sockets::NetConnection*& dyn__server();
    // Get instance field reference: private System.Boolean _stateReceived
    [[deprecated("Use field access instead!")]] bool& dyn__stateReceived();
    // Get instance field reference: private System.Boolean _forceClientPredictionReset
    [[deprecated("Use field access instead!")]] bool& dyn__forceClientPredictionReset();
