// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Fusion.ILogBuilder
#include "Fusion/ILogBuilder.hpp"
// Including type: Fusion.Sockets.INetPeerGroupCallbacks
#include "Fusion/Sockets/INetPeerGroupCallbacks.hpp"
// Including type: Fusion.SimulationModes
#include "Fusion/SimulationModes.hpp"
// Including type: Fusion.SimulationStages
#include "Fusion/SimulationStages.hpp"
// Including type: Fusion.SimulationSnapshot
#include "Fusion/SimulationSnapshot.hpp"
// Including type: Fusion.SimulationInput
#include "Fusion/SimulationInput.hpp"
// Including type: Fusion.TickAccumulator
#include "Fusion/TickAccumulator.hpp"
// Including type: Fusion.Ema
#include "Fusion/Ema.hpp"
// Including type: System.Nullable`1
#include "System/Nullable_1.hpp"
// Including type: Fusion.SimulationConfig
#include "Fusion/SimulationConfig.hpp"
// Including type: Fusion.SimulationPlayer
#include "Fusion/SimulationPlayer.hpp"
// Including type: Fusion.SimulationMessageInternalTypes
#include "Fusion/SimulationMessageInternalTypes.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"

  class SimulationInputCollection;
  // Forward declaring type: SimulationConnection
  class SimulationConnection;
  // Forward declaring type: NetworkObjectHeader
  struct NetworkObjectHeader;
  // Forward declaring type: SimulationPacketEnvelope
  struct SimulationPacketEnvelope;
  // Forward declaring type: NetworkPrefabId
  struct NetworkPrefabId;
  // Forward declaring type: NetworkObjectDestroyFlags
  struct NetworkObjectDestroyFlags;
  // Forward declaring type: SimulationMessage
  struct SimulationMessage;
  // Forward declaring type: SimulationMessageList
  struct SimulationMessageList;
  // Forward declaring type: SceneRef
  struct SceneRef;
  // Forward declaring type: LogOptions
  struct LogOptions;
  // Forward declaring type: RpcTargetStatus
  struct RpcTargetStatus;
  // Forward declaring type: RpcSendMessageResult
  struct RpcSendMessageResult;
  // Forward declaring type: PlayerRefSet
  struct PlayerRefSet;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: IEnumerable`1<T>
  template<typename T>
  class IEnumerable_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: Fusion::Sockets
namespace Fusion::Sockets {
  // Forward declaring type: INetSocket
  class INetSocket;
  // Forward declaring type: NetPeer
  struct NetPeer;
  // Forward declaring type: NetPeerGroup
  struct NetPeerGroup;
  // Forward declaring type: NetAddress
  struct NetAddress;
  // Forward declaring type: NetConfig
  struct NetConfig;
  // Forward declaring type: NetConnection
  struct NetConnection;
  // Forward declaring type: NetBitBuffer
  struct NetBitBuffer;
  // Forward declaring type: NetDisconnectReason
  struct NetDisconnectReason;
  // Forward declaring type: NetConnectFailedReason
  struct NetConnectFailedReason;
  // Forward declaring type: NetSendEnvelope
  struct NetSendEnvelope;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Random
  class Random;
  // Skipping declaration: ValueType because it is already included!
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Skipping declaration: Vector3 because it is already included!
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: StringBuilder
  class StringBuilder;
}
// Completed forward declares
// Type namespace: Fusion
namespace Fusion {
  // Forward declaring type: Simulation
  class Simulation;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Fusion::Simulation);
DEFINE_IL2CPP_ARG_TYPE(::Fusion::Simulation*, "Fusion", "Simulation");
// Type namespace: Fusion
namespace Fusion {
  // WARNING Size may be invalid!
  // Autogenerated type: Fusion.Simulation
  // [TokenAttribute] Offset: FFFFFFFF
  class Simulation : public ::Il2CppObject/*, public ::Fusion::ILogBuilder, public ::Fusion::Sockets::INetPeerGroupCallbacks*/ {
    public:
    // Nested type: ::Fusion::Simulation::AreaOfInterest
    struct AreaOfInterest;
    // Nested type: ::Fusion::Simulation::Client
    class Client;
    // Nested type: ::Fusion::Simulation::ICallbacks
    class ICallbacks;
    // Nested type: ::Fusion::Simulation::IDeltaCompressor
    class IDeltaCompressor;
    // Nested type: ::Fusion::Simulation::DeltaCompressorDebug
    class DeltaCompressorDebug;
    // Nested type: ::Fusion::Simulation::DeltaCompressorDefault
    class DeltaCompressorDefault;
    // Nested type: ::Fusion::Simulation::TargetObjectVerificationResult
    struct TargetObjectVerificationResult;
    // Nested type: ::Fusion::Simulation::Server
    class Server;
    // Nested type: ::Fusion::Simulation::StateReplicator
    class StateReplicator;
    // Nested type: ::Fusion::Simulation::StateReplicatorDeltaSnapshot
    class StateReplicatorDeltaSnapshot;
    // Nested type: ::Fusion::Simulation::StateReplicatorEventualConsistencyBase
    class StateReplicatorEventualConsistencyBase;
    // Nested type: ::Fusion::Simulation::StateReplicatorEventualConsistencyClientServer
    class StateReplicatorEventualConsistencyClientServer;
    // Nested type: ::Fusion::Simulation::StateReplicatorEventualConsistencyShared
    class StateReplicatorEventualConsistencyShared;
    // Nested type: ::Fusion::Simulation::Statistics
    class Statistics;
    // Nested type: ::Fusion::Simulation::$get_ActivePlayers$d__100
    class $get_ActivePlayers$d__100;
    public:
    // private System.Boolean _isShutdown
    // Size: 0x1
    // Offset: 0x10
    bool isShutdown;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _isWaitingForShutdown
    // Size: 0x1
    // Offset: 0x11
    bool isWaitingForShutdown;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private Fusion.Allocator* _tempAllocator
    // Size: 0x8
    // Offset: 0x18
    ::Fusion::Allocator* tempAllocator;
    // Field size check
    static_assert(sizeof(::Fusion::Allocator*) == 0x8);
    // private Fusion.Simulation/ICallbacks _callbacks
    // Size: 0x8
    // Offset: 0x20
    ::Fusion::Simulation::ICallbacks* callbacks;
    // Field size check
    static_assert(sizeof(::Fusion::Simulation::ICallbacks*) == 0x8);
    // private Fusion.Simulation/IDeltaCompressor _deltaCompressor
    // Size: 0x8
    // Offset: 0x28
    ::Fusion::Simulation::IDeltaCompressor* deltaCompressor;
    // Field size check
    static_assert(sizeof(::Fusion::Simulation::IDeltaCompressor*) == 0x8);
    // private Fusion.SimulationModes _mode
    // Size: 0x4
    // Offset: 0x30
    ::Fusion::SimulationModes mode;
    // Field size check
    static_assert(sizeof(::Fusion::SimulationModes) == 0x4);
    // private Fusion.SimulationStages _stage
    // Size: 0x4
    // Offset: 0x34
    ::Fusion::SimulationStages stage;
    // Field size check
    static_assert(sizeof(::Fusion::SimulationStages) == 0x4);
    // private Fusion.SimulationConfig _config
    // Size: 0x8
    // Offset: 0x38
    ::Fusion::SimulationConfig* config;
    // Field size check
    static_assert(sizeof(::Fusion::SimulationConfig*) == 0x8);
    // private Fusion.NetworkProjectConfig _projectConfig
    // Size: 0x8
    // Offset: 0x40
    ::Fusion::NetworkProjectConfig* projectConfig;
    // Field size check
    static_assert(sizeof(::Fusion::NetworkProjectConfig*) == 0x8);
    // private Fusion.SimulationSnapshot/IHistory _history
    // Size: 0x8
    // Offset: 0x48
    ::Fusion::SimulationSnapshot::IHistory* history;
    // Field size check
    static_assert(sizeof(::Fusion::SimulationSnapshot::IHistory*) == 0x8);
    // private Fusion.SimulationSnapshot/Pool _historyPool
    // Size: 0x8
    // Offset: 0x50
    ::Fusion::SimulationSnapshot::Pool* historyPool;
    // Field size check
    static_assert(sizeof(::Fusion::SimulationSnapshot::Pool*) == 0x8);
    // private Fusion.SimulationSnapshot _state
    // Size: 0x8
    // Offset: 0x58
    ::Fusion::SimulationSnapshot* state;
    // Field size check
    static_assert(sizeof(::Fusion::SimulationSnapshot*) == 0x8);
    // private Fusion.SimulationSnapshot _statePrevious
    // Size: 0x8
    // Offset: 0x60
    ::Fusion::SimulationSnapshot* statePrevious;
    // Field size check
    static_assert(sizeof(::Fusion::SimulationSnapshot*) == 0x8);
    // private Fusion.SimulationSnapshot _stateInterestGroups
    // Size: 0x8
    // Offset: 0x68
    ::Fusion::SimulationSnapshot* stateInterestGroups;
    // Field size check
    static_assert(sizeof(::Fusion::SimulationSnapshot*) == 0x8);
    // private Fusion.SimulationSnapshot _stateResume
    // Size: 0x8
    // Offset: 0x70
    ::Fusion::SimulationSnapshot* stateResume;
    // Field size check
    static_assert(sizeof(::Fusion::SimulationSnapshot*) == 0x8);
    // private Fusion.SimulationSnapshot _interpTo
    // Size: 0x8
    // Offset: 0x78
    ::Fusion::SimulationSnapshot* interpTo;
    // Field size check
    static_assert(sizeof(::Fusion::SimulationSnapshot*) == 0x8);
    // private Fusion.SimulationSnapshot _interpFrom
    // Size: 0x8
    // Offset: 0x80
    ::Fusion::SimulationSnapshot* interpFrom;
    // Field size check
    static_assert(sizeof(::Fusion::SimulationSnapshot*) == 0x8);
    // private System.Single _interpAlpha
    // Size: 0x4
    // Offset: 0x88
    float interpAlpha;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private Fusion.SimulationInput _inputRoot
    // Size: 0x8
    // Offset: 0x90
    ::Fusion::SimulationInput* inputRoot;
    // Field size check
    static_assert(sizeof(::Fusion::SimulationInput*) == 0x8);
    // private Fusion.SimulationInput/Pool _inputPool
    // Size: 0x8
    // Offset: 0x98
    ::Fusion::SimulationInput::Pool* inputPool;
    // Field size check
    static_assert(sizeof(::Fusion::SimulationInput::Pool*) == 0x8);
    // private Fusion.SimulationInputCollection _inputCollection
    // Size: 0x8
    // Offset: 0xA0
    ::Fusion::SimulationInputCollection* inputCollection;
    // Field size check
    static_assert(sizeof(::Fusion::SimulationInputCollection*) == 0x8);
    // private Fusion.Simulation/StateReplicator _stateReplicator
    // Size: 0x8
    // Offset: 0xA8
    ::Fusion::Simulation::StateReplicator* stateReplicator;
    // Field size check
    static_assert(sizeof(::Fusion::Simulation::StateReplicator*) == 0x8);
    // private Fusion.SimulationConnection[] _connections
    // Size: 0x8
    // Offset: 0xB0
    ::ArrayW<::Fusion::SimulationConnection*> connections;
    // Field size check
    static_assert(sizeof(::ArrayW<::Fusion::SimulationConnection*>) == 0x8);
    // private Fusion.SimulationPlayer[] _players
    // Size: 0x8
    // Offset: 0xB8
    ::ArrayW<::Fusion::SimulationPlayer*> players;
    // Field size check
    static_assert(sizeof(::ArrayW<::Fusion::SimulationPlayer*>) == 0x8);
    // private Fusion.TickAccumulator _accumulator
    // Size: 0x15
    // Offset: 0xC0
    ::Fusion::TickAccumulator accumulator;
    // Field size check
    static_assert(sizeof(::Fusion::TickAccumulator) == 0x15);
    // private System.Int32 _stepSize
    // Size: 0x4
    // Offset: 0xD8
    int stepSize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single _stepDeltaFloat
    // Size: 0x4
    // Offset: 0xDC
    float stepDeltaFloat;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Double _stepDeltaDouble
    // Size: 0x8
    // Offset: 0xE0
    double stepDeltaDouble;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private System.Double _updateTime
    // Size: 0x8
    // Offset: 0xE8
    double updateTime;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private System.Double _updateDelta
    // Size: 0x8
    // Offset: 0xF0
    double updateDelta;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private Fusion.Ema _updateDeltaAvg
    // Size: 0x28
    // Offset: 0xF8
    ::Fusion::Ema updateDeltaAvg;
    // Field size check
    static_assert(sizeof(::Fusion::Ema) == 0x28);
    // private System.Boolean _isLastTick
    // Size: 0x1
    // Offset: 0x318
    bool isLastTick;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _isFirstTick
    // Size: 0x1
    // Offset: 0x319
    bool isFirstTick;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _isResimulation
    // Size: 0x1
    // Offset: 0x31A
    bool isResimulation;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _isResume
    // Size: 0x1
    // Offset: 0x31B
    bool isResume;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _isInTick
    // Size: 0x1
    // Offset: 0x31C
    bool isInTick;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Nullable`1<System.Boolean> _isPaused
    // Size: 0xFFFFFFFF
    // Offset: 0x31D
    ::System::Nullable_1<bool> isPaused;
    // private Fusion.Simulation/AreaOfInterest* _aoi
    // Size: 0x8
    // Offset: 0x320
    ::Fusion::Simulation::AreaOfInterest* aoi;
    // Field size check
    static_assert(sizeof(::Fusion::Simulation::AreaOfInterest*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<Fusion.Tick,System.Double> _tickUpdateTimes
    // Size: 0x8
    // Offset: 0x328
    ::System::Collections::Generic::Dictionary_2<::Fusion::Tick, double>* tickUpdateTimes;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::Fusion::Tick, double>*) == 0x8);
    // private System.Collections.Generic.List`1<Fusion.NetworkId> _globalInterestObjects
    // Size: 0x8
    // Offset: 0x330
    ::System::Collections::Generic::List_1<::Fusion::NetworkId>* globalInterestObjects;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Fusion::NetworkId>*) == 0x8);
    // Fusion.Sockets.INetSocket _netSocket
    // Size: 0x8
    // Offset: 0x338
    ::Fusion::Sockets::INetSocket* netSocket;
    // Field size check
    static_assert(sizeof(::Fusion::Sockets::INetSocket*) == 0x8);
    // Fusion.Sockets.NetPeer* _netPeer
    // Size: 0x8
    // Offset: 0x340
    ::Fusion::Sockets::NetPeer* netPeer;
    // Field size check
    static_assert(sizeof(::Fusion::Sockets::NetPeer*) == 0x8);
    // private Fusion.Sockets.NetPeerGroup* _netPeerGroup
    // Size: 0x8
    // Offset: 0x348
    ::Fusion::Sockets::NetPeerGroup* netPeerGroup;
    // Field size check
    static_assert(sizeof(::Fusion::Sockets::NetPeerGroup*) == 0x8);
    // private System.Random _netPeerRng
    // Size: 0x8
    // Offset: 0x350
    ::System::Random* netPeerRng;
    // Field size check
    static_assert(sizeof(::System::Random*) == 0x8);
    // public Fusion.Simulation/Statistics Stats
    // Size: 0x8
    // Offset: 0x358
    ::Fusion::Simulation::Statistics* Stats;
    // Field size check
    static_assert(sizeof(::Fusion::Simulation::Statistics*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::Fusion::ILogBuilder
    operator ::Fusion::ILogBuilder() noexcept {
      return *reinterpret_cast<::Fusion::ILogBuilder*>(this);
    }
    // Creating interface conversion operator: operator ::Fusion::Sockets::INetPeerGroupCallbacks
    operator ::Fusion::Sockets::INetPeerGroupCallbacks() noexcept {
      return *reinterpret_cast<::Fusion::Sockets::INetPeerGroupCallbacks*>(this);
    }
    // static field const value: static public System.Int32 DEFAULT_COMPRESSOR_OFFSET_BLOCK_SIZE
    static constexpr const int DEFAULT_COMPRESSOR_OFFSET_BLOCK_SIZE = 3;
    // Get static field: static public System.Int32 DEFAULT_COMPRESSOR_OFFSET_BLOCK_SIZE
    static int _get_DEFAULT_COMPRESSOR_OFFSET_BLOCK_SIZE();
