// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Fusion.Simulation
#include "Fusion/Simulation.hpp"
// Including type: Fusion.Simulation/StateReplicator
#include "Fusion/Simulation_StateReplicator.hpp"
// Including type: Fusion.NetworkId
#include "Fusion/NetworkId.hpp"
// Including type: Fusion.NetworkObjectPriorityHeap/Item
#include "Fusion/NetworkObjectPriorityHeap.hpp"
// Including type: Fusion.NetworkObjectRefMapPtr
#include "Fusion/NetworkObjectRefMapPtr.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: Queue`1<T>
  template<typename T>
  class Queue_1;
}
// Forward declaring namespace: Fusion
namespace Fusion {
  // Forward declaring type: SimulationSnapshot
  class SimulationSnapshot;
  // Forward declaring type: Allocator
  struct Allocator;
  // Forward declaring type: SimulationConnection
  class SimulationConnection;
  // Forward declaring type: SimulationPacketEnvelope
  struct SimulationPacketEnvelope;
  // Forward declaring type: SimulationGlobalState
  struct SimulationGlobalState;
  // Forward declaring type: PlayerRef
  struct PlayerRef;
  // Forward declaring type: NetworkObjectHeader
  struct NetworkObjectHeader;
  // Forward declaring type: NetworkPrefabId
  struct NetworkPrefabId;
  // Forward declaring type: NetworkObjectHeaderFlags
  struct NetworkObjectHeaderFlags;
  // Forward declaring type: NetworkObjectNestingKey
  struct NetworkObjectNestingKey;
  // Forward declaring type: NetworkObjectDestroyFlags
  struct NetworkObjectDestroyFlags;
}
// Forward declaring namespace: Fusion::Sockets
namespace Fusion::Sockets {
  // Forward declaring type: NetBitBuffer
  struct NetBitBuffer;
  // Forward declaring type: NetConnection
  struct NetConnection;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Guid
  struct Guid;
}
// Completed forward declares
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Fusion::Simulation::StateReplicatorEventualConsistencyBase);
DEFINE_IL2CPP_ARG_TYPE(::Fusion::Simulation::StateReplicatorEventualConsistencyBase*, "Fusion", "Simulation/StateReplicatorEventualConsistencyBase");
// Type namespace: Fusion
namespace Fusion {
  // Size: 0x60
  #pragma pack(push, 1)
  // Autogenerated type: Fusion.Simulation/StateReplicatorEventualConsistencyBase
  // [TokenAttribute] Offset: FFFFFFFF
  class Simulation::StateReplicatorEventualConsistencyBase : public ::Fusion::Simulation::StateReplicator {
    public:
    // Writing base type padding for base size: 0x1C to desired offset: 0x20
    char ___base_padding[0x4] = {};
    // Nested type: ::Fusion::Simulation::StateReplicatorEventualConsistencyBase::ConnectionBitSet
    struct ConnectionBitSet;
    // Size: 0x8
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: Fusion.Simulation/StateReplicatorEventualConsistencyBase/ConnectionBitSet
    // [TokenAttribute] Offset: FFFFFFFF
    struct ConnectionBitSet/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.UInt32* Words
      // Size: 0x8
      // Offset: 0x0
      uint* Words;
      // Field size check
      static_assert(sizeof(uint*) == 0x8);
      public:
      // Creating value type constructor for type: ConnectionBitSet
      constexpr ConnectionBitSet(uint* Words_ = {}) noexcept : Words{Words_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Creating conversion operator: operator uint*
      constexpr operator uint*() const noexcept {
        return Words;
      }
      // Get instance field reference: public System.UInt32* Words
      [[deprecated("Use field access instead!")]] uint*& dyn_Words();
      // public System.Void Set(System.Int32 bit)
      // Offset: 0x2B7EA00
      void Set(int bit);
      // public System.Boolean IsSet(System.Int32 bit)
      // Offset: 0x2B7EA2C
      bool IsSet(int bit);
    }; // Fusion.Simulation/StateReplicatorEventualConsistencyBase/ConnectionBitSet
    #pragma pack(pop)
    static check_size<sizeof(Simulation::StateReplicatorEventualConsistencyBase::ConnectionBitSet), 0 + sizeof(uint*)> __Fusion_Simulation_StateReplicatorEventualConsistencyBase_ConnectionBitSetSizeCheck;
    static_assert(sizeof(Simulation::StateReplicatorEventualConsistencyBase::ConnectionBitSet) == 0x8);
    public:
    // protected System.Int32* _changed
    // Size: 0x8
    // Offset: 0x20
    int* changed;
    // Field size check
    static_assert(sizeof(int*) == 0x8);
    // protected Fusion.SimulationSnapshot _delta
    // Size: 0x8
    // Offset: 0x28
    ::Fusion::SimulationSnapshot* delta;
    // Field size check
    static_assert(sizeof(::Fusion::SimulationSnapshot*) == 0x8);
    // private Fusion.Allocator* _setsAllocator
    // Size: 0x8
    // Offset: 0x30
    ::Fusion::Allocator* setsAllocator;
    // Field size check
    static_assert(sizeof(::Fusion::Allocator*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<Fusion.NetworkId,Fusion.Simulation/StateReplicatorEventualConsistencyBase/ConnectionBitSet> _sets
    // Size: 0x8
    // Offset: 0x38
    ::System::Collections::Generic::Dictionary_2<::Fusion::NetworkId, ::Fusion::Simulation::StateReplicatorEventualConsistencyBase::ConnectionBitSet>* sets;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::Fusion::NetworkId, ::Fusion::Simulation::StateReplicatorEventualConsistencyBase::ConnectionBitSet>*) == 0x8);
    // private System.Collections.Generic.List`1<Fusion.NetworkObjectPriorityHeap/Item> _priorityPopped
    // Size: 0x8
    // Offset: 0x40
    ::System::Collections::Generic::List_1<::Fusion::NetworkObjectPriorityHeap::Item>* priorityPopped;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Fusion::NetworkObjectPriorityHeap::Item>*) == 0x8);
    // protected System.Collections.Generic.Queue`1<Fusion.NetworkId> _create
    // Size: 0x8
    // Offset: 0x48
    ::System::Collections::Generic::Queue_1<::Fusion::NetworkId>* create;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Queue_1<::Fusion::NetworkId>*) == 0x8);
    // protected System.Collections.Generic.Queue`1<Fusion.NetworkId> _createNested
    // Size: 0x8
    // Offset: 0x50
    ::System::Collections::Generic::Queue_1<::Fusion::NetworkId>* createNested;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Queue_1<::Fusion::NetworkId>*) == 0x8);
    // protected System.Collections.Generic.Queue`1<Fusion.NetworkId> _destroy
    // Size: 0x8
    // Offset: 0x58
    ::System::Collections::Generic::Queue_1<::Fusion::NetworkId>* destroy;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Queue_1<::Fusion::NetworkId>*) == 0x8);
    public:
    // static field const value: static protected System.Int32 SET_WORD_BITS
    static constexpr const int SET_WORD_BITS = 32;
    // Get static field: static protected System.Int32 SET_WORD_BITS
    static int _get_SET_WORD_BITS();
    // Set static field: static protected System.Int32 SET_WORD_BITS
    static void _set_SET_WORD_BITS(int value);
    // static field const value: static protected System.Int32 DATA_BLOCK_SIZE
    static constexpr const int DATA_BLOCK_SIZE = 6;
    // Get static field: static protected System.Int32 DATA_BLOCK_SIZE
    static int _get_DATA_BLOCK_SIZE();
    // Set static field: static protected System.Int32 DATA_BLOCK_SIZE
    static void _set_DATA_BLOCK_SIZE(int value);
