// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.InputSystem.LowLevel.IInputRuntime
#include "UnityEngine/InputSystem/LowLevel/IInputRuntime.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::InputSystem::LowLevel
namespace UnityEngine::InputSystem::LowLevel {
  // Forward declaring type: InputUpdateDelegate
  class InputUpdateDelegate;
  // Forward declaring type: InputEvent
  struct InputEvent;
  // Forward declaring type: InputDeviceCommand
  struct InputDeviceCommand;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Func`2<T, TResult>
  template<typename T, typename TResult>
  class Func_2;
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Vector2
  struct Vector2;
  // Forward declaring type: ScreenOrientation
  struct ScreenOrientation;
}
// Completed forward declares
// Type namespace: UnityEngine.InputSystem.LowLevel
namespace UnityEngine::InputSystem::LowLevel {
  // Forward declaring type: NativeInputRuntime
  class NativeInputRuntime;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::InputSystem::LowLevel::NativeInputRuntime);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::InputSystem::LowLevel::NativeInputRuntime*, "UnityEngine.InputSystem.LowLevel", "NativeInputRuntime");
// Type namespace: UnityEngine.InputSystem.LowLevel
namespace UnityEngine::InputSystem::LowLevel {
  // Size: 0x48
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.InputSystem.LowLevel.NativeInputRuntime
  // [TokenAttribute] Offset: FFFFFFFF
  class NativeInputRuntime : public ::Il2CppObject/*, public ::UnityEngine::InputSystem::LowLevel::IInputRuntime*/ {
    public:
    // Nested type: ::UnityEngine::InputSystem::LowLevel::NativeInputRuntime::$$c__DisplayClass10_0
    class $$c__DisplayClass10_0;
    // Nested type: ::UnityEngine::InputSystem::LowLevel::NativeInputRuntime::$$c__DisplayClass13_0
    class $$c__DisplayClass13_0;
    // Nested type: ::UnityEngine::InputSystem::LowLevel::NativeInputRuntime::$$c__DisplayClass7_0
    class $$c__DisplayClass7_0;
    public:
    // private System.Boolean m_RunInBackground
    // Size: 0x1
    // Offset: 0x10
    bool m_RunInBackground;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_RunInBackground and: m_ShutdownMethod
    char __padding0[0x7] = {};
    // private System.Action m_ShutdownMethod
    // Size: 0x8
    // Offset: 0x18
    ::System::Action* m_ShutdownMethod;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private UnityEngine.InputSystem.LowLevel.InputUpdateDelegate m_OnUpdate
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::InputSystem::LowLevel::InputUpdateDelegate* m_OnUpdate;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::LowLevel::InputUpdateDelegate*) == 0x8);
    // private System.Action`1<UnityEngine.InputSystem.LowLevel.InputUpdateType> m_OnBeforeUpdate
    // Size: 0x8
    // Offset: 0x28
    ::System::Action_1<::UnityEngine::InputSystem::LowLevel::InputUpdateType>* m_OnBeforeUpdate;
    // Field size check
    static_assert(sizeof(::System::Action_1<::UnityEngine::InputSystem::LowLevel::InputUpdateType>*) == 0x8);
    // private System.Func`2<UnityEngine.InputSystem.LowLevel.InputUpdateType,System.Boolean> m_OnShouldRunUpdate
    // Size: 0x8
    // Offset: 0x30
    ::System::Func_2<::UnityEngine::InputSystem::LowLevel::InputUpdateType, bool>* m_OnShouldRunUpdate;
    // Field size check
    static_assert(sizeof(::System::Func_2<::UnityEngine::InputSystem::LowLevel::InputUpdateType, bool>*) == 0x8);
    // private System.Single m_PollingFrequency
    // Size: 0x4
    // Offset: 0x38
    float m_PollingFrequency;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_DidCallOnShutdown
    // Size: 0x1
    // Offset: 0x3C
    bool m_DidCallOnShutdown;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_DidCallOnShutdown and: m_FocusChangedMethod
    char __padding6[0x3] = {};
    // private System.Action`1<System.Boolean> m_FocusChangedMethod
    // Size: 0x8
    // Offset: 0x40
    ::System::Action_1<bool>* m_FocusChangedMethod;
    // Field size check
    static_assert(sizeof(::System::Action_1<bool>*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::UnityEngine::InputSystem::LowLevel::IInputRuntime
    operator ::UnityEngine::InputSystem::LowLevel::IInputRuntime() noexcept {
      return *reinterpret_cast<::UnityEngine::InputSystem::LowLevel::IInputRuntime*>(this);
    }
    // Get static field: static public readonly UnityEngine.InputSystem.LowLevel.NativeInputRuntime instance
    static ::UnityEngine::InputSystem::LowLevel::NativeInputRuntime* _get_instance();
    // Set static field: static public readonly UnityEngine.InputSystem.LowLevel.NativeInputRuntime instance
    static void _set_instance(::UnityEngine::InputSystem::LowLevel::NativeInputRuntime* value);
    // Get instance field reference: private System.Boolean m_RunInBackground
