// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: IBuilderPieceComponent
#include "GlobalNamespace/IBuilderPieceComponent.hpp"
// Including type: UnityEngine.XR.XRNode
#include "UnityEngine/XR/XRNode.hpp"
// Including type: UnityEngine.LayerMask
#include "UnityEngine/LayerMask.hpp"
// Including type: UnityEngine.RaycastHit
#include "UnityEngine/RaycastHit.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: AudioSource
  class AudioSource;
  // Skipping declaration: Vector3 because it is already included!
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: GorillaLocomotion::Climbing
namespace GorillaLocomotion::Climbing {
  // Forward declaring type: GorillaVelocityTracker
  class GorillaVelocityTracker;
}
// Forward declaring namespace: GorillaLocomotion::Gameplay
namespace GorillaLocomotion::Gameplay {
  // Forward declaring type: GorillaRopeSwingSettings
  class GorillaRopeSwingSettings;
}
// Forward declaring namespace: Photon::Pun
namespace Photon::Pun {
  // Forward declaring type: PhotonMessageInfo
  struct PhotonMessageInfo;
}
// Completed forward declares
// Type namespace: GorillaLocomotion.Gameplay
namespace GorillaLocomotion::Gameplay {
  // Forward declaring type: GorillaRopeSwing
  class GorillaRopeSwing;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GorillaLocomotion::Gameplay::GorillaRopeSwing);
DEFINE_IL2CPP_ARG_TYPE(::GorillaLocomotion::Gameplay::GorillaRopeSwing*, "GorillaLocomotion.Gameplay", "GorillaRopeSwing");
// Type namespace: GorillaLocomotion.Gameplay
namespace GorillaLocomotion::Gameplay {
  // Size: 0xB0
  #pragma pack(push, 1)
  // Autogenerated type: GorillaLocomotion.Gameplay.GorillaRopeSwing
  // [TokenAttribute] Offset: FFFFFFFF
  class GorillaRopeSwing : public ::UnityEngine::MonoBehaviour/*, public ::GlobalNamespace::IBuilderPieceComponent*/ {
    public:
    public:
    // public System.Int32 ropeId
    // Size: 0x4
    // Offset: 0x20
    int ropeId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: ropeId and: staticId
    char __padding0[0x4] = {};
    // public System.String staticId
    // Size: 0x8
    // Offset: 0x28
    ::StringW staticId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Boolean useStaticId
    // Size: 0x1
    // Offset: 0x30
    bool useStaticId;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: useStaticId and: prefabRopeBit
    char __padding2[0x7] = {};
    // private UnityEngine.GameObject prefabRopeBit
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::GameObject* prefabRopeBit;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Boolean supportMovingAtRuntime
    // Size: 0x1
    // Offset: 0x40
    bool supportMovingAtRuntime;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: supportMovingAtRuntime and: nodes
    char __padding4[0x7] = {};
    // public UnityEngine.Transform[] nodes
    // Size: 0x8
    // Offset: 0x48
    ::ArrayW<::UnityEngine::Transform*> nodes;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Transform*>) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.Int32,System.Int32> remotePlayers
    // Size: 0x8
    // Offset: 0x50
    ::System::Collections::Generic::Dictionary_2<int, int>* remotePlayers;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<int, int>*) == 0x8);
    // public System.Single lastGrabTime
    // Size: 0x4
    // Offset: 0x58
    float lastGrabTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: lastGrabTime and: ropeCreakSFX
    char __padding7[0x4] = {};
    // private UnityEngine.AudioSource ropeCreakSFX
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::AudioSource* ropeCreakSFX;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // public GorillaLocomotion.Climbing.GorillaVelocityTracker velocityTracker
    // Size: 0x8
    // Offset: 0x68
    ::GorillaLocomotion::Climbing::GorillaVelocityTracker* velocityTracker;
    // Field size check
    static_assert(sizeof(::GorillaLocomotion::Climbing::GorillaVelocityTracker*) == 0x8);
    // private System.Boolean localPlayerOn
    // Size: 0x1
    // Offset: 0x70
    bool localPlayerOn;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: localPlayerOn and: localPlayerBoneIndex
    char __padding10[0x3] = {};
    // private System.Int32 localPlayerBoneIndex
    // Size: 0x4
    // Offset: 0x74
    int localPlayerBoneIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.XR.XRNode localPlayerXRNode
    // Size: 0x4
    // Offset: 0x78
    ::UnityEngine::XR::XRNode localPlayerXRNode;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::XRNode) == 0x4);
    // private System.Boolean <isIdle>k__BackingField
    // Size: 0x1
    // Offset: 0x7C
    bool isIdle;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <isFullyIdle>k__BackingField
    // Size: 0x1
    // Offset: 0x7D
    bool isFullyIdle;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isFullyIdle and: potentialIdleTimer
    char __padding14[0x2] = {};
    // private System.Single potentialIdleTimer
    // Size: 0x4
    // Offset: 0x80
    float potentialIdleTimer;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 ropeLength
    // Size: 0x4
    // Offset: 0x84
    int ropeLength;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private GorillaLocomotion.Gameplay.GorillaRopeSwingSettings settings
    // Size: 0x8
    // Offset: 0x88
    ::GorillaLocomotion::Gameplay::GorillaRopeSwingSettings* settings;
    // Field size check
    static_assert(sizeof(::GorillaLocomotion::Gameplay::GorillaRopeSwingSettings*) == 0x8);
    // public System.Int32 ropeDataStartIndex
    // Size: 0x4
    // Offset: 0x90
    int ropeDataStartIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 ropeDataIndexOffset
    // Size: 0x4
    // Offset: 0x94
    int ropeDataIndexOffset;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.LayerMask wallLayerMask
    // Size: 0x4
    // Offset: 0x98
    ::UnityEngine::LayerMask wallLayerMask;
    // Field size check
    static_assert(sizeof(::UnityEngine::LayerMask) == 0x4);
    // Padding between fields: wallLayerMask and: nodeHits
    char __padding20[0x4] = {};
    // private UnityEngine.RaycastHit[] nodeHits
    // Size: 0x8
    // Offset: 0xA0
    ::ArrayW<::UnityEngine::RaycastHit> nodeHits;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::RaycastHit>) == 0x8);
    // private System.Single scaleFactor
    // Size: 0x4
    // Offset: 0xA8
    float scaleFactor;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 lastNodeCheckIndex
    // Size: 0x4
    // Offset: 0xAC
    int lastNodeCheckIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Creating interface conversion operator: operator ::GlobalNamespace::IBuilderPieceComponent
    operator ::GlobalNamespace::IBuilderPieceComponent() noexcept {
      return *reinterpret_cast<::GlobalNamespace::IBuilderPieceComponent*>(this);
    }
    // static field const value: static public System.Single ropeBitGenOffset
    static constexpr const float ropeBitGenOffset = 1;
    // Get static field: static public System.Single ropeBitGenOffset
    static float _get_ropeBitGenOffset();
    // Set static field: static public System.Single ropeBitGenOffset
    static void _set_ropeBitGenOffset(float value);
    // static field const value: static private System.Single MAX_VELOCITY_FOR_IDLE
    static constexpr const float MAX_VELOCITY_FOR_IDLE = 0.5;
    // Get static field: static private System.Single MAX_VELOCITY_FOR_IDLE
