// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.XR.Interaction.Toolkit.XRBaseController
#include "UnityEngine/XR/Interaction/Toolkit/XRBaseController.hpp"
// Including type: UnityEngine.InputSystem.InputActionProperty
#include "UnityEngine/InputSystem/InputActionProperty.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::InputSystem
namespace UnityEngine::InputSystem {
  // Forward declaring type: InputAction
  class InputAction;
}
// Forward declaring namespace: UnityEngine::XR::Interaction::Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Forward declaring type: XRControllerState
  class XRControllerState;
}
// Completed forward declares
// Type namespace: UnityEngine.XR.Interaction.Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Forward declaring type: ActionBasedController
  class ActionBasedController;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::XR::Interaction::Toolkit::ActionBasedController);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::XR::Interaction::Toolkit::ActionBasedController*, "UnityEngine.XR.Interaction.Toolkit", "ActionBasedController");
// Type namespace: UnityEngine.XR.Interaction.Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Size: 0x1E0
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.ActionBasedController
  // [TokenAttribute] Offset: FFFFFFFF
  // [HelpURLAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: FFFFFFFF
  class ActionBasedController : public ::UnityEngine::XR::Interaction::Toolkit::XRBaseController {
    public:
    // Writing base type padding for base size: 0x9C to desired offset: 0xA0
    char ___base_padding[0x4] = {};
    public:
    // private UnityEngine.InputSystem.InputActionProperty m_PositionAction
    // Size: 0x18
    // Offset: 0xA0
    ::UnityEngine::InputSystem::InputActionProperty m_PositionAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionProperty) == 0x18);
    // private UnityEngine.InputSystem.InputActionProperty m_RotationAction
    // Size: 0x18
    // Offset: 0xB8
    ::UnityEngine::InputSystem::InputActionProperty m_RotationAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionProperty) == 0x18);
    // private UnityEngine.InputSystem.InputActionProperty m_TrackingStateAction
    // Size: 0x18
    // Offset: 0xD0
    ::UnityEngine::InputSystem::InputActionProperty m_TrackingStateAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionProperty) == 0x18);
    // private UnityEngine.InputSystem.InputActionProperty m_SelectAction
    // Size: 0x18
    // Offset: 0xE8
    ::UnityEngine::InputSystem::InputActionProperty m_SelectAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionProperty) == 0x18);
    // private UnityEngine.InputSystem.InputActionProperty m_SelectActionValue
    // Size: 0x18
    // Offset: 0x100
    ::UnityEngine::InputSystem::InputActionProperty m_SelectActionValue;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionProperty) == 0x18);
    // private UnityEngine.InputSystem.InputActionProperty m_ActivateAction
    // Size: 0x18
    // Offset: 0x118
    ::UnityEngine::InputSystem::InputActionProperty m_ActivateAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionProperty) == 0x18);
    // private UnityEngine.InputSystem.InputActionProperty m_ActivateActionValue
    // Size: 0x18
    // Offset: 0x130
    ::UnityEngine::InputSystem::InputActionProperty m_ActivateActionValue;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionProperty) == 0x18);
    // private UnityEngine.InputSystem.InputActionProperty m_UIPressAction
    // Size: 0x18
    // Offset: 0x148
    ::UnityEngine::InputSystem::InputActionProperty m_UIPressAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionProperty) == 0x18);
    // private UnityEngine.InputSystem.InputActionProperty m_UIPressActionValue
    // Size: 0x18
    // Offset: 0x160
    ::UnityEngine::InputSystem::InputActionProperty m_UIPressActionValue;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionProperty) == 0x18);
    // private UnityEngine.InputSystem.InputActionProperty m_HapticDeviceAction
    // Size: 0x18
    // Offset: 0x178
    ::UnityEngine::InputSystem::InputActionProperty m_HapticDeviceAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionProperty) == 0x18);
    // private UnityEngine.InputSystem.InputActionProperty m_RotateAnchorAction
    // Size: 0x18
    // Offset: 0x190
    ::UnityEngine::InputSystem::InputActionProperty m_RotateAnchorAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionProperty) == 0x18);
    // private UnityEngine.InputSystem.InputActionProperty m_DirectionalAnchorRotationAction
    // Size: 0x18
    // Offset: 0x1A8
    ::UnityEngine::InputSystem::InputActionProperty m_DirectionalAnchorRotationAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionProperty) == 0x18);
    // private UnityEngine.InputSystem.InputActionProperty m_TranslateAnchorAction
    // Size: 0x18
    // Offset: 0x1C0
    ::UnityEngine::InputSystem::InputActionProperty m_TranslateAnchorAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionProperty) == 0x18);
    // private System.Boolean m_HasCheckedDisabledTrackingInputReferenceActions
    // Size: 0x1
    // Offset: 0x1D8
    bool m_HasCheckedDisabledTrackingInputReferenceActions;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_HasCheckedDisabledInputReferenceActions
    // Size: 0x1
    // Offset: 0x1D9
    bool m_HasCheckedDisabledInputReferenceActions;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_HasCheckedDisabledInputReferenceActions and: m_ButtonPressPoint
    char __padding14[0x2] = {};
    // private System.Single m_ButtonPressPoint
    // Size: 0x4
    // Offset: 0x1DC
    float m_ButtonPressPoint;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Get instance field reference: private UnityEngine.InputSystem.InputActionProperty m_PositionAction
    [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::InputActionProperty& dyn_m_PositionAction();
    // Get instance field reference: private UnityEngine.InputSystem.InputActionProperty m_RotationAction
    [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::InputActionProperty& dyn_m_RotationAction();
    // Get instance field reference: private UnityEngine.InputSystem.InputActionProperty m_TrackingStateAction
    [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::InputActionProperty& dyn_m_TrackingStateAction();
    // Get instance field reference: private UnityEngine.InputSystem.InputActionProperty m_SelectAction
