// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.XR.Interaction.Toolkit.InteractionState
#include "UnityEngine/XR/Interaction/Toolkit/InteractionState.hpp"
// Including type: UnityEngine.XR.Interaction.Toolkit.XRInteractionUpdateOrder
#include "UnityEngine/XR/Interaction/Toolkit/XRInteractionUpdateOrder.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: Animator
  class Animator;
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: UnityEngine::XR::Interaction::Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Forward declaring type: XRControllerState
  class XRControllerState;
  // Skipping declaration: UpdateType because it is already included!
}
// Completed forward declares
// Type namespace: UnityEngine.XR.Interaction.Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Forward declaring type: XRBaseController
  class XRBaseController;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::XR::Interaction::Toolkit::XRBaseController);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::XR::Interaction::Toolkit::XRBaseController*, "UnityEngine.XR.Interaction.Toolkit", "XRBaseController");
// Type namespace: UnityEngine.XR.Interaction.Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Size: 0x9C
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.XRBaseController
  // [TokenAttribute] Offset: FFFFFFFF
  // [DisallowMultipleComponent] Offset: FFFFFFFF
  // [DefaultExecutionOrder] Offset: FFFFFFFF
  class XRBaseController : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::UnityEngine::XR::Interaction::Toolkit::XRBaseController::UpdateType
    struct UpdateType;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.XRBaseController/UpdateType
    // [TokenAttribute] Offset: FFFFFFFF
    struct UpdateType/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: UpdateType
      constexpr UpdateType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.XRBaseController/UpdateType UpdateAndBeforeRender
      static constexpr const int UpdateAndBeforeRender = 0;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.XRBaseController/UpdateType UpdateAndBeforeRender
      static ::UnityEngine::XR::Interaction::Toolkit::XRBaseController::UpdateType _get_UpdateAndBeforeRender();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.XRBaseController/UpdateType UpdateAndBeforeRender
      static void _set_UpdateAndBeforeRender(::UnityEngine::XR::Interaction::Toolkit::XRBaseController::UpdateType value);
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.XRBaseController/UpdateType Update
      static constexpr const int Update = 1;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.XRBaseController/UpdateType Update
      static ::UnityEngine::XR::Interaction::Toolkit::XRBaseController::UpdateType _get_Update();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.XRBaseController/UpdateType Update
      static void _set_Update(::UnityEngine::XR::Interaction::Toolkit::XRBaseController::UpdateType value);
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.XRBaseController/UpdateType BeforeRender
      static constexpr const int BeforeRender = 2;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.XRBaseController/UpdateType BeforeRender
      static ::UnityEngine::XR::Interaction::Toolkit::XRBaseController::UpdateType _get_BeforeRender();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.XRBaseController/UpdateType BeforeRender
      static void _set_BeforeRender(::UnityEngine::XR::Interaction::Toolkit::XRBaseController::UpdateType value);
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.XRBaseController/UpdateType Fixed
      static constexpr const int Fixed = 3;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.XRBaseController/UpdateType Fixed
      static ::UnityEngine::XR::Interaction::Toolkit::XRBaseController::UpdateType _get_Fixed();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.XRBaseController/UpdateType Fixed
      static void _set_Fixed(::UnityEngine::XR::Interaction::Toolkit::XRBaseController::UpdateType value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.XR.Interaction.Toolkit.XRBaseController/UpdateType
    #pragma pack(pop)
    static check_size<sizeof(XRBaseController::UpdateType), 0 + sizeof(int)> __UnityEngine_XR_Interaction_Toolkit_XRBaseController_UpdateTypeSizeCheck;
    static_assert(sizeof(XRBaseController::UpdateType) == 0x4);
    public:
    // private UnityEngine.XR.Interaction.Toolkit.XRBaseController/UpdateType m_UpdateTrackingType
    // Size: 0x4
    // Offset: 0x20
    ::UnityEngine::XR::Interaction::Toolkit::XRBaseController::UpdateType m_UpdateTrackingType;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRBaseController::UpdateType) == 0x4);
    // private System.Boolean m_EnableInputTracking
    // Size: 0x1
    // Offset: 0x24
    bool m_EnableInputTracking;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_EnableInputActions
    // Size: 0x1
    // Offset: 0x25
    bool m_EnableInputActions;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_EnableInputActions and: m_ModelPrefab
    char __padding2[0x2] = {};
    // private UnityEngine.Transform m_ModelPrefab
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::Transform* m_ModelPrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform m_ModelParent
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Transform* m_ModelParent;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform m_Model
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::Transform* m_Model;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private System.Boolean m_AnimateModel
    // Size: 0x1
    // Offset: 0x40
    bool m_AnimateModel;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_AnimateModel and: m_ModelSelectTransition
    char __padding6[0x7] = {};
    // private System.String m_ModelSelectTransition
    // Size: 0x8
    // Offset: 0x48
    ::StringW m_ModelSelectTransition;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String m_ModelDeSelectTransition
    // Size: 0x8
    // Offset: 0x50
    ::StringW m_ModelDeSelectTransition;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean m_HideControllerModel
    // Size: 0x1
    // Offset: 0x58
    bool m_HideControllerModel;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_HideControllerModel and: m_SelectInteractionState
    char __padding9[0x3] = {};
    // private UnityEngine.XR.Interaction.Toolkit.InteractionState m_SelectInteractionState
    // Size: 0x7
    // Offset: 0x5C
    ::UnityEngine::XR::Interaction::Toolkit::InteractionState m_SelectInteractionState;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::InteractionState) == 0x7);
    // Padding between fields: m_SelectInteractionState and: m_ActivateInteractionState
    char __padding10[0x1] = {};
    // private UnityEngine.XR.Interaction.Toolkit.InteractionState m_ActivateInteractionState
    // Size: 0x7
    // Offset: 0x64
    ::UnityEngine::XR::Interaction::Toolkit::InteractionState m_ActivateInteractionState;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::InteractionState) == 0x7);
    // Padding between fields: m_ActivateInteractionState and: m_UIPressInteractionState
    char __padding11[0x1] = {};
    // private UnityEngine.XR.Interaction.Toolkit.InteractionState m_UIPressInteractionState
    // Size: 0x7
    // Offset: 0x6C
    ::UnityEngine::XR::Interaction::Toolkit::InteractionState m_UIPressInteractionState;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::InteractionState) == 0x7);
    // Padding between fields: m_UIPressInteractionState and: m_ControllerState
    char __padding12[0x5] = {};
    // private UnityEngine.XR.Interaction.Toolkit.XRControllerState m_ControllerState
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::XR::Interaction::Toolkit::XRControllerState* m_ControllerState;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRControllerState*) == 0x8);
    // private System.Boolean m_CreateControllerState
    // Size: 0x1
    // Offset: 0x80
    bool m_CreateControllerState;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_CreateControllerState and: m_ModelAnimator
    char __padding14[0x7] = {};
    // private UnityEngine.Animator m_ModelAnimator
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::Animator* m_ModelAnimator;
    // Field size check
    static_assert(sizeof(::UnityEngine::Animator*) == 0x8);
    // private System.Boolean m_HasWarnedAnimatorMissing
    // Size: 0x1
    // Offset: 0x90
    bool m_HasWarnedAnimatorMissing;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_PerformSetup
    // Size: 0x1
    // Offset: 0x91
    bool m_PerformSetup;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_PerformSetup and: anchorControlDeadzone
    char __padding17[0x2] = {};
    // private System.Single <anchorControlDeadzone>k__BackingField
    // Size: 0x4
    // Offset: 0x94
    float anchorControlDeadzone;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <anchorControlOffAxisDeadzone>k__BackingField
    // Size: 0x4
    // Offset: 0x98
    float anchorControlOffAxisDeadzone;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Get instance field reference: private UnityEngine.XR.Interaction.Toolkit.XRBaseController/UpdateType m_UpdateTrackingType
    [[deprecated("Use field access instead!")]] ::UnityEngine::XR::Interaction::Toolkit::XRBaseController::UpdateType& dyn_m_UpdateTrackingType();
    // Get instance field reference: private System.Boolean m_EnableInputTracking
    [[deprecated("Use field access instead!")]] bool& dyn_m_EnableInputTracking();
    // Get instance field reference: private System.Boolean m_EnableInputActions
    [[deprecated("Use field access instead!")]] bool& dyn_m_EnableInputActions();
    // Get instance field reference: private UnityEngine.Transform m_ModelPrefab
    [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_m_ModelPrefab();
    // Get instance field reference: private UnityEngine.Transform m_ModelParent
