// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.XR.Interaction.Toolkit.XRBaseInteractor
#include "UnityEngine/XR/Interaction/Toolkit/XRBaseInteractor.hpp"
// Including type: UnityEngine.XR.Interaction.Toolkit.IXRActivateInteractor
#include "UnityEngine/XR/Interaction/Toolkit/IXRActivateInteractor.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: AudioClip
  class AudioClip;
  // Forward declaring type: AudioSource
  class AudioSource;
  // Forward declaring type: Transform
  class Transform;
}
// Forward declaring namespace: UnityEngine::XR::Interaction::Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Forward declaring type: XRBaseController
  class XRBaseController;
  // Forward declaring type: ActivateEventArgs
  class ActivateEventArgs;
  // Forward declaring type: DeactivateEventArgs
  class DeactivateEventArgs;
  // Skipping declaration: XRBaseInteractable because it is already included!
  // Forward declaring type: IXRActivateInteractable
  class IXRActivateInteractable;
  // Skipping declaration: InputTriggerType because it is already included!
  // Forward declaring type: IXRHoverInteractable
  class IXRHoverInteractable;
  // Forward declaring type: SelectEnterEventArgs
  class SelectEnterEventArgs;
  // Forward declaring type: SelectExitEventArgs
  class SelectExitEventArgs;
  // Forward declaring type: HoverEnterEventArgs
  class HoverEnterEventArgs;
  // Forward declaring type: HoverExitEventArgs
  class HoverExitEventArgs;
}
// Forward declaring namespace: UnityEngine::XR::Interaction::Toolkit::Utilities::Pooling
namespace UnityEngine::XR::Interaction::Toolkit::Utilities::Pooling {
  // Forward declaring type: LinkedPool`1<T>
  template<typename T>
  class LinkedPool_1;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: UnityEngine.XR.Interaction.Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Forward declaring type: XRBaseControllerInteractor
  class XRBaseControllerInteractor;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::XR::Interaction::Toolkit::XRBaseControllerInteractor);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::XR::Interaction::Toolkit::XRBaseControllerInteractor*, "UnityEngine.XR.Interaction.Toolkit", "XRBaseControllerInteractor");
// Type namespace: UnityEngine.XR.Interaction.Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Size: 0x280
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.XRBaseControllerInteractor
  // [TokenAttribute] Offset: FFFFFFFF
  class XRBaseControllerInteractor : public ::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractor/*, public ::UnityEngine::XR::Interaction::Toolkit::IXRActivateInteractor*/ {
    public:
    // Nested type: ::UnityEngine::XR::Interaction::Toolkit::XRBaseControllerInteractor::InputTriggerType
    struct InputTriggerType;
    // Nested type: ::UnityEngine::XR::Interaction::Toolkit::XRBaseControllerInteractor::$$c
    class $$c;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.XRBaseControllerInteractor/InputTriggerType
    // [TokenAttribute] Offset: FFFFFFFF
    struct InputTriggerType/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: InputTriggerType
      constexpr InputTriggerType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.XRBaseControllerInteractor/InputTriggerType State
      static constexpr const int State = 0;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.XRBaseControllerInteractor/InputTriggerType State
      static ::UnityEngine::XR::Interaction::Toolkit::XRBaseControllerInteractor::InputTriggerType _get_State();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.XRBaseControllerInteractor/InputTriggerType State
      static void _set_State(::UnityEngine::XR::Interaction::Toolkit::XRBaseControllerInteractor::InputTriggerType value);
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.XRBaseControllerInteractor/InputTriggerType StateChange
      static constexpr const int StateChange = 1;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.XRBaseControllerInteractor/InputTriggerType StateChange
      static ::UnityEngine::XR::Interaction::Toolkit::XRBaseControllerInteractor::InputTriggerType _get_StateChange();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.XRBaseControllerInteractor/InputTriggerType StateChange
      static void _set_StateChange(::UnityEngine::XR::Interaction::Toolkit::XRBaseControllerInteractor::InputTriggerType value);
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.XRBaseControllerInteractor/InputTriggerType Toggle
      static constexpr const int Toggle = 2;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.XRBaseControllerInteractor/InputTriggerType Toggle
      static ::UnityEngine::XR::Interaction::Toolkit::XRBaseControllerInteractor::InputTriggerType _get_Toggle();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.XRBaseControllerInteractor/InputTriggerType Toggle
      static void _set_Toggle(::UnityEngine::XR::Interaction::Toolkit::XRBaseControllerInteractor::InputTriggerType value);
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.XRBaseControllerInteractor/InputTriggerType Sticky
      static constexpr const int Sticky = 3;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.XRBaseControllerInteractor/InputTriggerType Sticky
      static ::UnityEngine::XR::Interaction::Toolkit::XRBaseControllerInteractor::InputTriggerType _get_Sticky();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.XRBaseControllerInteractor/InputTriggerType Sticky
      static void _set_Sticky(::UnityEngine::XR::Interaction::Toolkit::XRBaseControllerInteractor::InputTriggerType value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.XR.Interaction.Toolkit.XRBaseControllerInteractor/InputTriggerType
    #pragma pack(pop)
    static check_size<sizeof(XRBaseControllerInteractor::InputTriggerType), 0 + sizeof(int)> __UnityEngine_XR_Interaction_Toolkit_XRBaseControllerInteractor_InputTriggerTypeSizeCheck;
    static_assert(sizeof(XRBaseControllerInteractor::InputTriggerType) == 0x4);
    public:
    // private UnityEngine.XR.Interaction.Toolkit.XRBaseControllerInteractor/InputTriggerType m_SelectActionTrigger
    // Size: 0x4
    // Offset: 0x198
    ::UnityEngine::XR::Interaction::Toolkit::XRBaseControllerInteractor::InputTriggerType m_SelectActionTrigger;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRBaseControllerInteractor::InputTriggerType) == 0x4);
    // private System.Boolean m_HideControllerOnSelect
    // Size: 0x1
    // Offset: 0x19C
    bool m_HideControllerOnSelect;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_AllowHoveredActivate
    // Size: 0x1
    // Offset: 0x19D
    bool m_AllowHoveredActivate;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_AllowHoveredActivate and: m_TargetPriorityMode
    char __padding2[0x2] = {};
    // private UnityEngine.XR.Interaction.Toolkit.TargetPriorityMode m_TargetPriorityMode
    // Size: 0x4
    // Offset: 0x1A0
    ::UnityEngine::XR::Interaction::Toolkit::TargetPriorityMode m_TargetPriorityMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::TargetPriorityMode) == 0x4);
    // private System.Boolean m_PlayAudioClipOnSelectEntered
    // Size: 0x1
    // Offset: 0x1A4
    bool m_PlayAudioClipOnSelectEntered;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_PlayAudioClipOnSelectEntered and: m_AudioClipForOnSelectEntered
    char __padding4[0x3] = {};
    // private UnityEngine.AudioClip m_AudioClipForOnSelectEntered
    // Size: 0x8
    // Offset: 0x1A8
    ::UnityEngine::AudioClip* m_AudioClipForOnSelectEntered;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // private System.Boolean m_PlayAudioClipOnSelectExited
    // Size: 0x1
    // Offset: 0x1B0
    bool m_PlayAudioClipOnSelectExited;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_PlayAudioClipOnSelectExited and: m_AudioClipForOnSelectExited
    char __padding6[0x7] = {};
    // private UnityEngine.AudioClip m_AudioClipForOnSelectExited
    // Size: 0x8
    // Offset: 0x1B8
    ::UnityEngine::AudioClip* m_AudioClipForOnSelectExited;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // private System.Boolean m_PlayAudioClipOnSelectCanceled
    // Size: 0x1
    // Offset: 0x1C0
    bool m_PlayAudioClipOnSelectCanceled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_PlayAudioClipOnSelectCanceled and: m_AudioClipForOnSelectCanceled
    char __padding8[0x7] = {};
    // private UnityEngine.AudioClip m_AudioClipForOnSelectCanceled
    // Size: 0x8
    // Offset: 0x1C8
    ::UnityEngine::AudioClip* m_AudioClipForOnSelectCanceled;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // private System.Boolean m_PlayAudioClipOnHoverEntered
    // Size: 0x1
    // Offset: 0x1D0
    bool m_PlayAudioClipOnHoverEntered;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_PlayAudioClipOnHoverEntered and: m_AudioClipForOnHoverEntered
    char __padding10[0x7] = {};
    // private UnityEngine.AudioClip m_AudioClipForOnHoverEntered
    // Size: 0x8
    // Offset: 0x1D8
    ::UnityEngine::AudioClip* m_AudioClipForOnHoverEntered;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // private System.Boolean m_PlayAudioClipOnHoverExited
    // Size: 0x1
    // Offset: 0x1E0
    bool m_PlayAudioClipOnHoverExited;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_PlayAudioClipOnHoverExited and: m_AudioClipForOnHoverExited
    char __padding12[0x7] = {};
    // private UnityEngine.AudioClip m_AudioClipForOnHoverExited
    // Size: 0x8
    // Offset: 0x1E8
    ::UnityEngine::AudioClip* m_AudioClipForOnHoverExited;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // private System.Boolean m_PlayAudioClipOnHoverCanceled
    // Size: 0x1
    // Offset: 0x1F0
    bool m_PlayAudioClipOnHoverCanceled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_PlayAudioClipOnHoverCanceled and: m_AudioClipForOnHoverCanceled
    char __padding14[0x7] = {};
    // private UnityEngine.AudioClip m_AudioClipForOnHoverCanceled
    // Size: 0x8
    // Offset: 0x1F8
    ::UnityEngine::AudioClip* m_AudioClipForOnHoverCanceled;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // private System.Boolean m_AllowHoverAudioWhileSelecting
    // Size: 0x1
    // Offset: 0x200
    bool m_AllowHoverAudioWhileSelecting;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_PlayHapticsOnSelectEntered
    // Size: 0x1
    // Offset: 0x201
    bool m_PlayHapticsOnSelectEntered;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_PlayHapticsOnSelectEntered and: m_HapticSelectEnterIntensity
    char __padding17[0x2] = {};
    // private System.Single m_HapticSelectEnterIntensity
    // Size: 0x4
    // Offset: 0x204
    float m_HapticSelectEnterIntensity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_HapticSelectEnterDuration
    // Size: 0x4
    // Offset: 0x208
    float m_HapticSelectEnterDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_PlayHapticsOnSelectExited
    // Size: 0x1
    // Offset: 0x20C
    bool m_PlayHapticsOnSelectExited;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_PlayHapticsOnSelectExited and: m_HapticSelectExitIntensity
    char __padding20[0x3] = {};
    // private System.Single m_HapticSelectExitIntensity
    // Size: 0x4
    // Offset: 0x210
    float m_HapticSelectExitIntensity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_HapticSelectExitDuration
    // Size: 0x4
    // Offset: 0x214
    float m_HapticSelectExitDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_PlayHapticsOnSelectCanceled
    // Size: 0x1
    // Offset: 0x218
    bool m_PlayHapticsOnSelectCanceled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_PlayHapticsOnSelectCanceled and: m_HapticSelectCancelIntensity
    char __padding23[0x3] = {};
    // private System.Single m_HapticSelectCancelIntensity
    // Size: 0x4
    // Offset: 0x21C
    float m_HapticSelectCancelIntensity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_HapticSelectCancelDuration
    // Size: 0x4
    // Offset: 0x220
    float m_HapticSelectCancelDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_PlayHapticsOnHoverEntered
    // Size: 0x1
    // Offset: 0x224
    bool m_PlayHapticsOnHoverEntered;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_PlayHapticsOnHoverEntered and: m_HapticHoverEnterIntensity
    char __padding26[0x3] = {};
    // private System.Single m_HapticHoverEnterIntensity
    // Size: 0x4
    // Offset: 0x228
    float m_HapticHoverEnterIntensity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_HapticHoverEnterDuration
    // Size: 0x4
    // Offset: 0x22C
    float m_HapticHoverEnterDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_PlayHapticsOnHoverExited
    // Size: 0x1
    // Offset: 0x230
    bool m_PlayHapticsOnHoverExited;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_PlayHapticsOnHoverExited and: m_HapticHoverExitIntensity
    char __padding29[0x3] = {};
    // private System.Single m_HapticHoverExitIntensity
    // Size: 0x4
    // Offset: 0x234
    float m_HapticHoverExitIntensity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_HapticHoverExitDuration
    // Size: 0x4
    // Offset: 0x238
    float m_HapticHoverExitDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_PlayHapticsOnHoverCanceled
    // Size: 0x1
    // Offset: 0x23C
    bool m_PlayHapticsOnHoverCanceled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_PlayHapticsOnHoverCanceled and: m_HapticHoverCancelIntensity
    char __padding32[0x3] = {};
    // private System.Single m_HapticHoverCancelIntensity
    // Size: 0x4
    // Offset: 0x240
    float m_HapticHoverCancelIntensity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_HapticHoverCancelDuration
    // Size: 0x4
    // Offset: 0x244
    float m_HapticHoverCancelDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_AllowHoverHapticsWhileSelecting
    // Size: 0x1
    // Offset: 0x248
    bool m_AllowHoverHapticsWhileSelecting;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_AllowActivate
    // Size: 0x1
    // Offset: 0x249
    bool m_AllowActivate;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_AllowActivate and: m_Controller
    char __padding36[0x6] = {};
    // private UnityEngine.XR.Interaction.Toolkit.XRBaseController m_Controller
    // Size: 0x8
    // Offset: 0x250
    ::UnityEngine::XR::Interaction::Toolkit::XRBaseController* m_Controller;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRBaseController*) == 0x8);
    // private readonly UnityEngine.XR.Interaction.Toolkit.Utilities.Pooling.LinkedPool`1<UnityEngine.XR.Interaction.Toolkit.ActivateEventArgs> m_ActivateEventArgs
    // Size: 0x8
    // Offset: 0x258
    ::UnityEngine::XR::Interaction::Toolkit::Utilities::Pooling::LinkedPool_1<::UnityEngine::XR::Interaction::Toolkit::ActivateEventArgs*>* m_ActivateEventArgs;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::Utilities::Pooling::LinkedPool_1<::UnityEngine::XR::Interaction::Toolkit::ActivateEventArgs*>*) == 0x8);
    // private readonly UnityEngine.XR.Interaction.Toolkit.Utilities.Pooling.LinkedPool`1<UnityEngine.XR.Interaction.Toolkit.DeactivateEventArgs> m_DeactivateEventArgs
    // Size: 0x8
    // Offset: 0x260
    ::UnityEngine::XR::Interaction::Toolkit::Utilities::Pooling::LinkedPool_1<::UnityEngine::XR::Interaction::Toolkit::DeactivateEventArgs*>* m_DeactivateEventArgs;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::Utilities::Pooling::LinkedPool_1<::UnityEngine::XR::Interaction::Toolkit::DeactivateEventArgs*>*) == 0x8);
    // private System.Boolean m_ToggleSelectActive
    // Size: 0x1
    // Offset: 0x268
    bool m_ToggleSelectActive;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_ToggleSelectDeactivatedThisFrame
    // Size: 0x1
    // Offset: 0x269
    bool m_ToggleSelectDeactivatedThisFrame;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_WaitingForSelectDeactivate
    // Size: 0x1
    // Offset: 0x26A
    bool m_WaitingForSelectDeactivate;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_WaitingForSelectDeactivate and: m_EffectsAudioSource
    char __padding42[0x5] = {};
    // private UnityEngine.AudioSource m_EffectsAudioSource
    // Size: 0x8
    // Offset: 0x270
    ::UnityEngine::AudioSource* m_EffectsAudioSource;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // private readonly System.Collections.Generic.List`1<UnityEngine.XR.Interaction.Toolkit.XRBaseInteractable> <validTargets>k__BackingField
    // Size: 0x8
    // Offset: 0x278
    ::System::Collections::Generic::List_1<::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractable*>* validTargets;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractable*>*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::UnityEngine::XR::Interaction::Toolkit::IXRActivateInteractor
    operator ::UnityEngine::XR::Interaction::Toolkit::IXRActivateInteractor() noexcept {
      return *reinterpret_cast<::UnityEngine::XR::Interaction::Toolkit::IXRActivateInteractor*>(this);
    }
    // Get static field: static private readonly System.Collections.Generic.List`1<UnityEngine.XR.Interaction.Toolkit.IXRActivateInteractable> s_ActivateTargets
    static ::System::Collections::Generic::List_1<::UnityEngine::XR::Interaction::Toolkit::IXRActivateInteractable*>* _get_s_ActivateTargets();
