// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.XR.Interaction.Toolkit.IXRActivateInteractable
#include "UnityEngine/XR/Interaction/Toolkit/IXRActivateInteractable.hpp"
// Including type: UnityEngine.XR.Interaction.Toolkit.IXRHoverInteractable
#include "UnityEngine/XR/Interaction/Toolkit/IXRHoverInteractable.hpp"
// Including type: UnityEngine.XR.Interaction.Toolkit.IXRSelectInteractable
#include "UnityEngine/XR/Interaction/Toolkit/IXRSelectInteractable.hpp"
// Including type: UnityEngine.XR.Interaction.Toolkit.IXRInteractionStrengthInteractable
#include "UnityEngine/XR/Interaction/Toolkit/IXRInteractionStrengthInteractable.hpp"
// Including type: UnityEngine.XR.Interaction.Toolkit.IXROverridesGazeAutoSelect
#include "UnityEngine/XR/Interaction/Toolkit/IXROverridesGazeAutoSelect.hpp"
// Including type: UnityEngine.XR.Interaction.Toolkit.DistanceInfo
#include "UnityEngine/XR/Interaction/Toolkit/DistanceInfo.hpp"
// Including type: UnityEngine.LayerMask
#include "UnityEngine/LayerMask.hpp"
// Including type: UnityEngine.XR.Interaction.Toolkit.InteractionLayerMask

// Forward declaring namespace: Unity::XR::CoreUtils::Collections
namespace Unity::XR::CoreUtils::Collections {
  // Forward declaring type: HashSetList`1<T>
  template<typename T>
  class HashSetList_1;
}
// Forward declaring namespace: UnityEngine::XR::Interaction::Toolkit::Utilities
namespace UnityEngine::XR::Interaction::Toolkit::Utilities {
  // Forward declaring type: ExposedRegistrationList`1<T>
  template<typename T>
  class ExposedRegistrationList_1;
}
// Forward declaring namespace: UnityEngine::XR::Interaction::Toolkit::Filtering
namespace UnityEngine::XR::Interaction::Toolkit::Filtering {
  // Forward declaring type: IXRHoverFilter
  class IXRHoverFilter;
  // Forward declaring type: IXRSelectFilter
  class IXRSelectFilter;
  // Forward declaring type: IXRInteractionStrengthFilter
  class IXRInteractionStrengthFilter;
}
// Forward declaring namespace: Unity::XR::CoreUtils::Bindings::Variables
namespace Unity::XR::CoreUtils::Bindings::Variables {
  // Forward declaring type: BindableVariable`1<T>
  template<typename T>
  class BindableVariable_1;
  // Forward declaring type: IReadOnlyBindableVariable`1<T>
  template<typename T>
  class IReadOnlyBindableVariable_1;
}
// Completed forward declares
// Type namespace: UnityEngine.XR.Interaction.Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Forward declaring type: XRBaseInteractable
  class XRBaseInteractable;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractable);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractable*, "UnityEngine.XR.Interaction.Toolkit", "XRBaseInteractable");
// Type namespace: UnityEngine.XR.Interaction.Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Size: 0x1A0
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.XRBaseInteractable
  // [TokenAttribute] Offset: FFFFFFFF
  // [SelectionBaseAttribute] Offset: FFFFFFFF
  // [DefaultExecutionOrder] Offset: FFFFFFFF
  class XRBaseInteractable : public ::UnityEngine::MonoBehaviour/*, public ::UnityEngine::XR::Interaction::Toolkit::IXRActivateInteractable, public ::UnityEngine::XR::Interaction::Toolkit::IXRHoverInteractable, public ::UnityEngine::XR::Interaction::Toolkit::IXRSelectInteractable, public ::UnityEngine::XR::Interaction::Toolkit::IXRInteractionStrengthInteractable, public ::UnityEngine::XR::Interaction::Toolkit::IXROverridesGazeAutoSelect*/ {
    public:
    // Nested type: ::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractable::MovementType
    struct MovementType;
    // Nested type: ::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractable::DistanceCalculationMode
    struct DistanceCalculationMode;
    // Nested type: ::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractable::$$c
    class $$c;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.XRBaseInteractable/DistanceCalculationMode
    // [TokenAttribute] Offset: FFFFFFFF
    struct DistanceCalculationMode/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: DistanceCalculationMode
      constexpr DistanceCalculationMode(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.XRBaseInteractable/DistanceCalculationMode TransformPosition
      static constexpr const int TransformPosition = 0;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.XRBaseInteractable/DistanceCalculationMode TransformPosition
      static ::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractable::DistanceCalculationMode _get_TransformPosition();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.XRBaseInteractable/DistanceCalculationMode TransformPosition
      static void _set_TransformPosition(::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractable::DistanceCalculationMode value);
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.XRBaseInteractable/DistanceCalculationMode ColliderPosition
      static constexpr const int ColliderPosition = 1;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.XRBaseInteractable/DistanceCalculationMode ColliderPosition
      static ::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractable::DistanceCalculationMode _get_ColliderPosition();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.XRBaseInteractable/DistanceCalculationMode ColliderPosition
      static void _set_ColliderPosition(::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractable::DistanceCalculationMode value);
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.XRBaseInteractable/DistanceCalculationMode ColliderVolume
      static constexpr const int ColliderVolume = 2;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.XRBaseInteractable/DistanceCalculationMode ColliderVolume
      static ::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractable::DistanceCalculationMode _get_ColliderVolume();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.XRBaseInteractable/DistanceCalculationMode ColliderVolume
      static void _set_ColliderVolume(::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractable::DistanceCalculationMode value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.XR.Interaction.Toolkit.XRBaseInteractable/DistanceCalculationMode
    #pragma pack(pop)
    static check_size<sizeof(XRBaseInteractable::DistanceCalculationMode), 0 + sizeof(int)> __UnityEngine_XR_Interaction_Toolkit_XRBaseInteractable_DistanceCalculationModeSizeCheck;
    static_assert(sizeof(XRBaseInteractable::DistanceCalculationMode) == 0x4);
    public:
    // private System.Action`1<UnityEngine.XR.Interaction.Toolkit.InteractableRegisteredEventArgs> registered
    // Size: 0x8
    // Offset: 0x20
    ::System::Action_1<::UnityEngine::XR::Interaction::Toolkit::InteractableRegisteredEventArgs*>* registered;
    // Field size check
    static_assert(sizeof(::System::Action_1<::UnityEngine::XR::Interaction::Toolkit::InteractableRegisteredEventArgs*>*) == 0x8);
    // private System.Action`1<UnityEngine.XR.Interaction.Toolkit.InteractableUnregisteredEventArgs> unregistered
    // Size: 0x8
    // Offset: 0x28
    ::System::Action_1<::UnityEngine::XR::Interaction::Toolkit::InteractableUnregisteredEventArgs*>* unregistered;
    // Field size check
    static_assert(sizeof(::System::Action_1<::UnityEngine::XR::Interaction::Toolkit::InteractableUnregisteredEventArgs*>*) == 0x8);
    // private System.Func`3<UnityEngine.XR.Interaction.Toolkit.IXRInteractable,UnityEngine.Vector3,UnityEngine.XR.Interaction.Toolkit.DistanceInfo> <getDistanceOverride>k__BackingField
    // Size: 0x8
    // Offset: 0x30
    ::System::Func_3<::UnityEngine::XR::Interaction::Toolkit::IXRInteractable*, ::UnityEngine::Vector3, ::UnityEngine::XR::Interaction::Toolkit::DistanceInfo>* getDistanceOverride;
    // Field size check
    static_assert(sizeof(::System::Func_3<::UnityEngine::XR::Interaction::Toolkit::IXRInteractable*, ::UnityEngine::Vector3, ::UnityEngine::XR::Interaction::Toolkit::DistanceInfo>*) == 0x8);
    // private UnityEngine.XR.Interaction.Toolkit.XRInteractionManager m_InteractionManager
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::XR::Interaction::Toolkit::XRInteractionManager* m_InteractionManager;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRInteractionManager*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.Collider> m_Colliders
    // Size: 0x8
    // Offset: 0x40
    ::System::Collections::Generic::List_1<::UnityEngine::Collider*>* m_Colliders;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Collider*>*) == 0x8);
    // private UnityEngine.LayerMask m_InteractionLayerMask
    // Size: 0x4
    // Offset: 0x48
    ::UnityEngine::LayerMask m_InteractionLayerMask;
    // Field size check
    static_assert(sizeof(::UnityEngine::LayerMask) == 0x4);
    // private UnityEngine.XR.Interaction.Toolkit.InteractionLayerMask m_InteractionLayers
    // Size: 0x8
    // Offset: 0x4C
    ::UnityEngine::XR::Interaction::Toolkit::InteractionLayerMask m_InteractionLayers;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::InteractionLayerMask) == 0x8);
    // private UnityEngine.XR.Interaction.Toolkit.XRBaseInteractable/DistanceCalculationMode m_DistanceCalculationMode
    // Size: 0x4
    // Offset: 0x54
    ::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractable::DistanceCalculationMode m_DistanceCalculationMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractable::DistanceCalculationMode) == 0x4);
    // private UnityEngine.XR.Interaction.Toolkit.InteractableSelectMode m_SelectMode
    // Size: 0x4
    // Offset: 0x58
    ::UnityEngine::XR::Interaction::Toolkit::InteractableSelectMode m_SelectMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::InteractableSelectMode) == 0x4);
    // Padding between fields: m_SelectMode and: m_CustomReticle
    char __padding8[0x4] = {};
    // private UnityEngine.GameObject m_CustomReticle
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::GameObject* m_CustomReticle;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Boolean m_AllowGazeInteraction
    // Size: 0x1
    // Offset: 0x68
    bool m_AllowGazeInteraction;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_AllowGazeSelect
    // Size: 0x1
    // Offset: 0x69
    bool m_AllowGazeSelect;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_OverrideGazeTimeToSelect
    // Size: 0x1
    // Offset: 0x6A
    bool m_OverrideGazeTimeToSelect;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_OverrideGazeTimeToSelect and: m_GazeTimeToSelect
    char __padding12[0x1] = {};
    // private System.Single m_GazeTimeToSelect
    // Size: 0x4
    // Offset: 0x6C
    float m_GazeTimeToSelect;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_OverrideTimeToAutoDeselectGaze
    // Size: 0x1
    // Offset: 0x70
    bool m_OverrideTimeToAutoDeselectGaze;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_OverrideTimeToAutoDeselectGaze and: m_TimeToAutoDeselectGaze
    char __padding14[0x3] = {};
    // private System.Single m_TimeToAutoDeselectGaze
    // Size: 0x4
    // Offset: 0x74
    float m_TimeToAutoDeselectGaze;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_AllowGazeAssistance
    // Size: 0x1
    // Offset: 0x78
    bool m_AllowGazeAssistance;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_AllowGazeAssistance and: m_FirstHoverEntered
    char __padding16[0x7] = {};
    // private UnityEngine.XR.Interaction.Toolkit.HoverEnterEvent m_FirstHoverEntered
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::XR::Interaction::Toolkit::HoverEnterEvent* m_FirstHoverEntered;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::HoverEnterEvent*) == 0x8);
    // private UnityEngine.XR.Interaction.Toolkit.HoverExitEvent m_LastHoverExited
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::XR::Interaction::Toolkit::HoverExitEvent* m_LastHoverExited;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::HoverExitEvent*) == 0x8);
    // private UnityEngine.XR.Interaction.Toolkit.HoverEnterEvent m_HoverEntered
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::XR::Interaction::Toolkit::HoverEnterEvent* m_HoverEntered;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::HoverEnterEvent*) == 0x8);
    // private UnityEngine.XR.Interaction.Toolkit.HoverExitEvent m_HoverExited
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::XR::Interaction::Toolkit::HoverExitEvent* m_HoverExited;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::HoverExitEvent*) == 0x8);
    // private UnityEngine.XR.Interaction.Toolkit.SelectEnterEvent m_FirstSelectEntered
    // Size: 0x8
    // Offset: 0xA0
    ::UnityEngine::XR::Interaction::Toolkit::SelectEnterEvent* m_FirstSelectEntered;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::SelectEnterEvent*) == 0x8);
    // private UnityEngine.XR.Interaction.Toolkit.SelectExitEvent m_LastSelectExited
    // Size: 0x8
    // Offset: 0xA8
    ::UnityEngine::XR::Interaction::Toolkit::SelectExitEvent* m_LastSelectExited;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::SelectExitEvent*) == 0x8);
    // private UnityEngine.XR.Interaction.Toolkit.SelectEnterEvent m_SelectEntered
    // Size: 0x8
    // Offset: 0xB0
    ::UnityEngine::XR::Interaction::Toolkit::SelectEnterEvent* m_SelectEntered;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::SelectEnterEvent*) == 0x8);
    // private UnityEngine.XR.Interaction.Toolkit.SelectExitEvent m_SelectExited
    // Size: 0x8
    // Offset: 0xB8
    ::UnityEngine::XR::Interaction::Toolkit::SelectExitEvent* m_SelectExited;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::SelectExitEvent*) == 0x8);
    // private UnityEngine.XR.Interaction.Toolkit.ActivateEvent m_Activated
    // Size: 0x8
    // Offset: 0xC0
    ::UnityEngine::XR::Interaction::Toolkit::ActivateEvent* m_Activated;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::ActivateEvent*) == 0x8);
    // private UnityEngine.XR.Interaction.Toolkit.DeactivateEvent m_Deactivated
    // Size: 0x8
    // Offset: 0xC8
    ::UnityEngine::XR::Interaction::Toolkit::DeactivateEvent* m_Deactivated;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::DeactivateEvent*) == 0x8);
    // private readonly Unity.XR.CoreUtils.Collections.HashSetList`1<UnityEngine.XR.Interaction.Toolkit.IXRHoverInteractor> m_InteractorsHovering
    // Size: 0x8
    // Offset: 0xD0
    ::Unity::XR::CoreUtils::Collections::HashSetList_1<::UnityEngine::XR::Interaction::Toolkit::IXRHoverInteractor*>* m_InteractorsHovering;
    // Field size check
    static_assert(sizeof(::Unity::XR::CoreUtils::Collections::HashSetList_1<::UnityEngine::XR::Interaction::Toolkit::IXRHoverInteractor*>*) == 0x8);
    // private readonly Unity.XR.CoreUtils.Collections.HashSetList`1<UnityEngine.XR.Interaction.Toolkit.IXRSelectInteractor> m_InteractorsSelecting
    // Size: 0x8
    // Offset: 0xD8
    ::Unity::XR::CoreUtils::Collections::HashSetList_1<::UnityEngine::XR::Interaction::Toolkit::IXRSelectInteractor*>* m_InteractorsSelecting;
    // Field size check
    static_assert(sizeof(::Unity::XR::CoreUtils::Collections::HashSetList_1<::UnityEngine::XR::Interaction::Toolkit::IXRSelectInteractor*>*) == 0x8);
    // private UnityEngine.XR.Interaction.Toolkit.IXRSelectInteractor <firstInteractorSelecting>k__BackingField
    // Size: 0x8
    // Offset: 0xE0
    ::UnityEngine::XR::Interaction::Toolkit::IXRSelectInteractor* firstInteractorSelecting;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::IXRSelectInteractor*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.Object> m_StartingHoverFilters
    // Size: 0x8
    // Offset: 0xE8
    ::System::Collections::Generic::List_1<::UnityEngine::Object*>* m_StartingHoverFilters;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Object*>*) == 0x8);
    // private readonly UnityEngine.XR.Interaction.Toolkit.Utilities.ExposedRegistrationList`1<UnityEngine.XR.Interaction.Toolkit.Filtering.IXRHoverFilter> m_HoverFilters
    // Size: 0x8
    // Offset: 0xF0
    ::UnityEngine::XR::Interaction::Toolkit::Utilities::ExposedRegistrationList_1<::UnityEngine::XR::Interaction::Toolkit::Filtering::IXRHoverFilter*>* m_HoverFilters;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::Utilities::ExposedRegistrationList_1<::UnityEngine::XR::Interaction::Toolkit::Filtering::IXRHoverFilter*>*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.Object> m_StartingSelectFilters
    // Size: 0x8
    // Offset: 0xF8
    ::System::Collections::Generic::List_1<::UnityEngine::Object*>* m_StartingSelectFilters;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Object*>*) == 0x8);
    // private readonly UnityEngine.XR.Interaction.Toolkit.Utilities.ExposedRegistrationList`1<UnityEngine.XR.Interaction.Toolkit.Filtering.IXRSelectFilter> m_SelectFilters
    // Size: 0x8
    // Offset: 0x100
    ::UnityEngine::XR::Interaction::Toolkit::Utilities::ExposedRegistrationList_1<::UnityEngine::XR::Interaction::Toolkit::Filtering::IXRSelectFilter*>* m_SelectFilters;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::Utilities::ExposedRegistrationList_1<::UnityEngine::XR::Interaction::Toolkit::Filtering::IXRSelectFilter*>*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.Object> m_StartingInteractionStrengthFilters
    // Size: 0x8
    // Offset: 0x108
    ::System::Collections::Generic::List_1<::UnityEngine::Object*>* m_StartingInteractionStrengthFilters;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Object*>*) == 0x8);
    // private readonly UnityEngine.XR.Interaction.Toolkit.Utilities.ExposedRegistrationList`1<UnityEngine.XR.Interaction.Toolkit.Filtering.IXRInteractionStrengthFilter> m_InteractionStrengthFilters
    // Size: 0x8
    // Offset: 0x110
    ::UnityEngine::XR::Interaction::Toolkit::Utilities::ExposedRegistrationList_1<::UnityEngine::XR::Interaction::Toolkit::Filtering::IXRInteractionStrengthFilter*>* m_InteractionStrengthFilters;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::Utilities::ExposedRegistrationList_1<::UnityEngine::XR::Interaction::Toolkit::Filtering::IXRInteractionStrengthFilter*>*) == 0x8);
    // private readonly Unity.XR.CoreUtils.Bindings.Variables.BindableVariable`1<System.Single> m_LargestInteractionStrength
    // Size: 0x8
    // Offset: 0x118
    ::Unity::XR::CoreUtils::Bindings::Variables::BindableVariable_1<float>* m_LargestInteractionStrength;
    // Field size check
    static_assert(sizeof(::Unity::XR::CoreUtils::Bindings::Variables::BindableVariable_1<float>*) == 0x8);
    // private readonly System.Collections.Generic.Dictionary`2<UnityEngine.XR.Interaction.Toolkit.IXRSelectInteractor,UnityEngine.Pose> m_AttachPoseOnSelect
    // Size: 0x8
    // Offset: 0x120
    ::System::Collections::Generic::Dictionary_2<::UnityEngine::XR::Interaction::Toolkit::IXRSelectInteractor*, ::UnityEngine::Pose>* m_AttachPoseOnSelect;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::UnityEngine::XR::Interaction::Toolkit::IXRSelectInteractor*, ::UnityEngine::Pose>*) == 0x8);
    // private readonly System.Collections.Generic.Dictionary`2<UnityEngine.XR.Interaction.Toolkit.IXRSelectInteractor,UnityEngine.Pose> m_LocalAttachPoseOnSelect
    // Size: 0x8
    // Offset: 0x128
    ::System::Collections::Generic::Dictionary_2<::UnityEngine::XR::Interaction::Toolkit::IXRSelectInteractor*, ::UnityEngine::Pose>* m_LocalAttachPoseOnSelect;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::UnityEngine::XR::Interaction::Toolkit::IXRSelectInteractor*, ::UnityEngine::Pose>*) == 0x8);
    // private readonly System.Collections.Generic.Dictionary`2<UnityEngine.XR.Interaction.Toolkit.IXRInteractor,UnityEngine.GameObject> m_ReticleCache
    // Size: 0x8
    // Offset: 0x130
    ::System::Collections::Generic::Dictionary_2<::UnityEngine::XR::Interaction::Toolkit::IXRInteractor*, ::UnityEngine::GameObject*>* m_ReticleCache;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::UnityEngine::XR::Interaction::Toolkit::IXRInteractor*, ::UnityEngine::GameObject*>*) == 0x8);
    // private readonly Unity.XR.CoreUtils.Collections.HashSetList`1<UnityEngine.XR.Interaction.Toolkit.XRBaseControllerInteractor> m_VariableSelectInteractors
    // Size: 0x8
    // Offset: 0x138
    ::Unity::XR::CoreUtils::Collections::HashSetList_1<::UnityEngine::XR::Interaction::Toolkit::XRBaseControllerInteractor*>* m_VariableSelectInteractors;
    // Field size check
    static_assert(sizeof(::Unity::XR::CoreUtils::Collections::HashSetList_1<::UnityEngine::XR::Interaction::Toolkit::XRBaseControllerInteractor*>*) == 0x8);
    // private readonly System.Collections.Generic.Dictionary`2<UnityEngine.XR.Interaction.Toolkit.IXRInteractor,System.Single> m_InteractionStrengths
    // Size: 0x8
    // Offset: 0x140
    ::System::Collections::Generic::Dictionary_2<::UnityEngine::XR::Interaction::Toolkit::IXRInteractor*, float>* m_InteractionStrengths;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::UnityEngine::XR::Interaction::Toolkit::IXRInteractor*, float>*) == 0x8);
    // private UnityEngine.XR.Interaction.Toolkit.XRInteractionManager m_RegisteredInteractionManager
    // Size: 0x8
    // Offset: 0x148
    ::UnityEngine::XR::Interaction::Toolkit::XRInteractionManager* m_RegisteredInteractionManager;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRInteractionManager*) == 0x8);
    // private UnityEngine.XR.Interaction.Toolkit.XRInteractableEvent m_OnFirstHoverEntered
    // Size: 0x8
    // Offset: 0x150
    ::UnityEngine::XR::Interaction::Toolkit::XRInteractableEvent* m_OnFirstHoverEntered;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRInteractableEvent*) == 0x8);
    // private UnityEngine.XR.Interaction.Toolkit.XRInteractableEvent m_OnLastHoverExited
    // Size: 0x8
    // Offset: 0x158
    ::UnityEngine::XR::Interaction::Toolkit::XRInteractableEvent* m_OnLastHoverExited;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRInteractableEvent*) == 0x8);
    // private UnityEngine.XR.Interaction.Toolkit.XRInteractableEvent m_OnHoverEntered
    // Size: 0x8
    // Offset: 0x160
    ::UnityEngine::XR::Interaction::Toolkit::XRInteractableEvent* m_OnHoverEntered;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRInteractableEvent*) == 0x8);
    // private UnityEngine.XR.Interaction.Toolkit.XRInteractableEvent m_OnHoverExited
    // Size: 0x8
    // Offset: 0x168
    ::UnityEngine::XR::Interaction::Toolkit::XRInteractableEvent* m_OnHoverExited;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRInteractableEvent*) == 0x8);
    // private UnityEngine.XR.Interaction.Toolkit.XRInteractableEvent m_OnSelectEntered
    // Size: 0x8
    // Offset: 0x170
    ::UnityEngine::XR::Interaction::Toolkit::XRInteractableEvent* m_OnSelectEntered;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRInteractableEvent*) == 0x8);
    // private UnityEngine.XR.Interaction.Toolkit.XRInteractableEvent m_OnSelectExited
    // Size: 0x8
    // Offset: 0x178
    ::UnityEngine::XR::Interaction::Toolkit::XRInteractableEvent* m_OnSelectExited;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRInteractableEvent*) == 0x8);
    // private UnityEngine.XR.Interaction.Toolkit.XRInteractableEvent m_OnSelectCanceled
    // Size: 0x8
    // Offset: 0x180
    ::UnityEngine::XR::Interaction::Toolkit::XRInteractableEvent* m_OnSelectCanceled;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRInteractableEvent*) == 0x8);
    // private UnityEngine.XR.Interaction.Toolkit.XRInteractableEvent m_OnActivate
    // Size: 0x8
    // Offset: 0x188
    ::UnityEngine::XR::Interaction::Toolkit::XRInteractableEvent* m_OnActivate;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRInteractableEvent*) == 0x8);
    // private UnityEngine.XR.Interaction.Toolkit.XRInteractableEvent m_OnDeactivate
    // Size: 0x8
    // Offset: 0x190
    ::UnityEngine::XR::Interaction::Toolkit::XRInteractableEvent* m_OnDeactivate;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRInteractableEvent*) == 0x8);
    // private readonly System.Collections.Generic.List`1<UnityEngine.XR.Interaction.Toolkit.XRBaseInteractor> <hoveringInteractors>k__BackingField
    // Size: 0x8
    // Offset: 0x198
    ::System::Collections::Generic::List_1<::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractor*>* hoveringInteractors;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractor*>*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::UnityEngine::XR::Interaction::Toolkit::IXRActivateInteractable
    operator ::UnityEngine::XR::Interaction::Toolkit::IXRActivateInteractable() noexcept {
      return *reinterpret_cast<::UnityEngine::XR::Interaction::Toolkit::IXRActivateInteractable*>(this);
    }
    // Creating interface conversion operator: operator ::UnityEngine::XR::Interaction::Toolkit::IXRHoverInteractable
    operator ::UnityEngine::XR::Interaction::Toolkit::IXRHoverInteractable() noexcept {
      return *reinterpret_cast<::UnityEngine::XR::Interaction::Toolkit::IXRHoverInteractable*>(this);
    }
