// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.XR.Interaction.Toolkit.XRBaseController
#include "UnityEngine/XR/Interaction/Toolkit/XRBaseController.hpp"
// Including type: UnityEngine.XR.XRNode
#include "UnityEngine/XR/XRNode.hpp"
// Including type: UnityEngine.XR.Interaction.Toolkit.InputHelpers/Button
#include "UnityEngine/XR/Interaction/Toolkit/InputHelpers_Button.hpp"
// Including type: UnityEngine.XR.Interaction.Toolkit.InputHelpers/Axis2D
#include "UnityEngine/XR/Interaction/Toolkit/InputHelpers_Axis2D.hpp"
// Including type: UnityEngine.XR.InputDevice
#include "UnityEngine/XR/InputDevice.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::Experimental::XR::Interaction
namespace UnityEngine::Experimental::XR::Interaction {
  // Forward declaring type: BasePoseProvider
  class BasePoseProvider;
}
// Forward declaring namespace: UnityEngine::XR::Interaction::Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Forward declaring type: XRControllerState
  class XRControllerState;
}
// Completed forward declares
// Type namespace: UnityEngine.XR.Interaction.Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Forward declaring type: XRController
  class XRController;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::XR::Interaction::Toolkit::XRController);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::XR::Interaction::Toolkit::XRController*, "UnityEngine.XR.Interaction.Toolkit", "XRController");
// Type namespace: UnityEngine.XR.Interaction.Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Size: 0xD9
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.XRController
  // [TokenAttribute] Offset: FFFFFFFF
  // [HelpURLAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: FFFFFFFF
  class XRController : public ::UnityEngine::XR::Interaction::Toolkit::XRBaseController {
    public:
    public:
    // private UnityEngine.XR.XRNode m_ControllerNode
    // Size: 0x4
    // Offset: 0x9C
    ::UnityEngine::XR::XRNode m_ControllerNode;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::XRNode) == 0x4);
    // private UnityEngine.XR.XRNode m_InputDeviceControllerNode
    // Size: 0x4
    // Offset: 0xA0
    ::UnityEngine::XR::XRNode m_InputDeviceControllerNode;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::XRNode) == 0x4);
    // private UnityEngine.XR.Interaction.Toolkit.InputHelpers/Button m_SelectUsage
    // Size: 0x4
    // Offset: 0xA4
    ::UnityEngine::XR::Interaction::Toolkit::InputHelpers::Button m_SelectUsage;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::InputHelpers::Button) == 0x4);
    // private UnityEngine.XR.Interaction.Toolkit.InputHelpers/Button m_ActivateUsage
    // Size: 0x4
    // Offset: 0xA8
    ::UnityEngine::XR::Interaction::Toolkit::InputHelpers::Button m_ActivateUsage;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::InputHelpers::Button) == 0x4);
    // private UnityEngine.XR.Interaction.Toolkit.InputHelpers/Button m_UIPressUsage
    // Size: 0x4
    // Offset: 0xAC
    ::UnityEngine::XR::Interaction::Toolkit::InputHelpers::Button m_UIPressUsage;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::InputHelpers::Button) == 0x4);
    // private System.Single m_AxisToPressThreshold
    // Size: 0x4
    // Offset: 0xB0
    float m_AxisToPressThreshold;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.XR.Interaction.Toolkit.InputHelpers/Button m_RotateAnchorLeft
    // Size: 0x4
    // Offset: 0xB4
    ::UnityEngine::XR::Interaction::Toolkit::InputHelpers::Button m_RotateAnchorLeft;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::InputHelpers::Button) == 0x4);
    // private UnityEngine.XR.Interaction.Toolkit.InputHelpers/Button m_RotateAnchorRight
    // Size: 0x4
    // Offset: 0xB8
    ::UnityEngine::XR::Interaction::Toolkit::InputHelpers::Button m_RotateAnchorRight;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::InputHelpers::Button) == 0x4);
    // private UnityEngine.XR.Interaction.Toolkit.InputHelpers/Button m_MoveObjectIn
    // Size: 0x4
    // Offset: 0xBC
    ::UnityEngine::XR::Interaction::Toolkit::InputHelpers::Button m_MoveObjectIn;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::InputHelpers::Button) == 0x4);
    // private UnityEngine.XR.Interaction.Toolkit.InputHelpers/Button m_MoveObjectOut
    // Size: 0x4
    // Offset: 0xC0
    ::UnityEngine::XR::Interaction::Toolkit::InputHelpers::Button m_MoveObjectOut;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::InputHelpers::Button) == 0x4);
    // private UnityEngine.XR.Interaction.Toolkit.InputHelpers/Axis2D m_DirectionalAnchorRotation
    // Size: 0x4
    // Offset: 0xC4
    ::UnityEngine::XR::Interaction::Toolkit::InputHelpers::Axis2D m_DirectionalAnchorRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::InputHelpers::Axis2D) == 0x4);
    // private UnityEngine.Experimental.XR.Interaction.BasePoseProvider m_PoseProvider
    // Size: 0x8
    // Offset: 0xC8
    ::UnityEngine::Experimental::XR::Interaction::BasePoseProvider* m_PoseProvider;
    // Field size check
    static_assert(sizeof(::UnityEngine::Experimental::XR::Interaction::BasePoseProvider*) == 0x8);
    // private UnityEngine.XR.InputDevice m_InputDevice
    // Size: 0x9
    // Offset: 0xD0
    ::UnityEngine::XR::InputDevice m_InputDevice;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::InputDevice) == 0x9);
    public:
    // Get instance field reference: private UnityEngine.XR.XRNode m_ControllerNode
    [[deprecated("Use field access instead!")]] ::UnityEngine::XR::XRNode& dyn_m_ControllerNode();
    // Get instance field reference: private UnityEngine.XR.XRNode m_InputDeviceControllerNode
    [[deprecated("Use field access instead!")]] ::UnityEngine::XR::XRNode& dyn_m_InputDeviceControllerNode();
    // Get instance field reference: private UnityEngine.XR.Interaction.Toolkit.InputHelpers/Button m_SelectUsage
    [[deprecated("Use field access instead!")]] ::UnityEngine::XR::Interaction::Toolkit::InputHelpers::Button& dyn_m_SelectUsage();
    // Get instance field reference: private UnityEngine.XR.Interaction.Toolkit.InputHelpers/Button m_ActivateUsage
