// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.XR.Interaction.Toolkit.XRBaseInteractable
#include "UnityEngine/XR/Interaction/Toolkit/XRBaseInteractable.hpp"
// Including type: UnityEngine.XR.Interaction.Toolkit.XRBaseInteractable/MovementType
#include "UnityEngine/XR/Interaction/Toolkit/XRBaseInteractable_MovementType.hpp"
// Including type: System.ValueTuple`2
#include "System/ValueTuple_2.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: AnimationCurve
  class AnimationCurve;
  // Forward declaring type: Rigidbody
  class Rigidbody;
  // Skipping declaration: Component because it is already included!
}
// Forward declaring namespace: UnityEngine::XR::Interaction::Toolkit::Transformers
namespace UnityEngine::XR::Interaction::Toolkit::Transformers {
  // Forward declaring type: XRBaseGrabTransformer
  class XRBaseGrabTransformer;
  // Forward declaring type: IXRGrabTransformer
  class IXRGrabTransformer;
}
// Forward declaring namespace: UnityEngine::XR::Interaction::Toolkit::Utilities
namespace UnityEngine::XR::Interaction::Toolkit::Utilities {
  // Forward declaring type: SmallRegistrationList`1<T>
  template<typename T>
  class SmallRegistrationList_1;
  // Forward declaring type: TeleportationMonitor
  class TeleportationMonitor;
  // Forward declaring type: BaseRegistrationList`1<T>
  template<typename T>
  class BaseRegistrationList_1;
}
// Forward declaring namespace: UnityEngine::XR::Interaction::Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Forward declaring type: IXRSelectInteractor
  class IXRSelectInteractor;
  // Skipping declaration: AttachPointCompatibilityMode because it is already included!
  // Forward declaring type: IXRInteractor
  class IXRInteractor;
  // Forward declaring type: SelectEnterEventArgs
  class SelectEnterEventArgs;
  // Forward declaring type: SelectExitEventArgs
  class SelectExitEventArgs;
}
// Forward declaring namespace: UnityEngine::XR::Interaction::Toolkit::Utilities::Pooling
namespace UnityEngine::XR::Interaction::Toolkit::Utilities::Pooling {
  // Forward declaring type: LinkedPool`1<T>
  template<typename T>
  class LinkedPool_1;
}
// Completed forward declares
// Type namespace: UnityEngine.XR.Interaction.Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Forward declaring type: XRGrabInteractable
  class XRGrabInteractable;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::XR::Interaction::Toolkit::XRGrabInteractable);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::XR::Interaction::Toolkit::XRGrabInteractable*, "UnityEngine.XR.Interaction.Toolkit", "XRGrabInteractable");
// Type namespace: UnityEngine.XR.Interaction.Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // WARNING Size may be invalid!
  // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.XRGrabInteractable
  // [TokenAttribute] Offset: FFFFFFFF
  // [SelectionBaseAttribute] Offset: FFFFFFFF
  // [RequireComponent] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: FFFFFFFF
  // [HelpURLAttribute] Offset: FFFFFFFF
  // [DisallowMultipleComponent] Offset: FFFFFFFF
  class XRGrabInteractable : public ::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractable {
    public:
    // Nested type: ::UnityEngine::XR::Interaction::Toolkit::XRGrabInteractable::AttachPointCompatibilityMode
    struct AttachPointCompatibilityMode;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.XRGrabInteractable/AttachPointCompatibilityMode
    // [TokenAttribute] Offset: FFFFFFFF
    struct AttachPointCompatibilityMode/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: AttachPointCompatibilityMode
      constexpr AttachPointCompatibilityMode(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.XRGrabInteractable/AttachPointCompatibilityMode Default
      static constexpr const int Default = 0;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.XRGrabInteractable/AttachPointCompatibilityMode Default
      static ::UnityEngine::XR::Interaction::Toolkit::XRGrabInteractable::AttachPointCompatibilityMode _get_Default();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.XRGrabInteractable/AttachPointCompatibilityMode Default
      static void _set_Default(::UnityEngine::XR::Interaction::Toolkit::XRGrabInteractable::AttachPointCompatibilityMode value);
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.XRGrabInteractable/AttachPointCompatibilityMode Legacy
      static constexpr const int Legacy = 1;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.XRGrabInteractable/AttachPointCompatibilityMode Legacy
      static ::UnityEngine::XR::Interaction::Toolkit::XRGrabInteractable::AttachPointCompatibilityMode _get_Legacy();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.XRGrabInteractable/AttachPointCompatibilityMode Legacy
      static void _set_Legacy(::UnityEngine::XR::Interaction::Toolkit::XRGrabInteractable::AttachPointCompatibilityMode value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.XR.Interaction.Toolkit.XRGrabInteractable/AttachPointCompatibilityMode
    #pragma pack(pop)
    static check_size<sizeof(XRGrabInteractable::AttachPointCompatibilityMode), 0 + sizeof(int)> __UnityEngine_XR_Interaction_Toolkit_XRGrabInteractable_AttachPointCompatibilityModeSizeCheck;
    static_assert(sizeof(XRGrabInteractable::AttachPointCompatibilityMode) == 0x4);
    public:
    // private UnityEngine.Transform m_AttachTransform
    // Size: 0x8
    // Offset: 0x1A0
    ::UnityEngine::Transform* m_AttachTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform m_SecondaryAttachTransform
    // Size: 0x8
    // Offset: 0x1A8
    ::UnityEngine::Transform* m_SecondaryAttachTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private System.Boolean m_UseDynamicAttach
    // Size: 0x1
    // Offset: 0x1B0
    bool m_UseDynamicAttach;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_MatchAttachPosition
    // Size: 0x1
    // Offset: 0x1B1
    bool m_MatchAttachPosition;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_MatchAttachRotation
    // Size: 0x1
    // Offset: 0x1B2
    bool m_MatchAttachRotation;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_SnapToColliderVolume
    // Size: 0x1
    // Offset: 0x1B3
    bool m_SnapToColliderVolume;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_ReinitializeDynamicAttachEverySingleGrab
    // Size: 0x1
    // Offset: 0x1B4
    bool m_ReinitializeDynamicAttachEverySingleGrab;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Single m_AttachEaseInTime
    // Size: 0x4
    // Offset: 0x1B8
    float m_AttachEaseInTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.XR.Interaction.Toolkit.XRBaseInteractable/MovementType m_MovementType
    // Size: 0x4
    // Offset: 0x1BC
    ::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractable::MovementType m_MovementType;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractable::MovementType) == 0x4);
    // private System.Single m_VelocityDamping
    // Size: 0x4
    // Offset: 0x1C0
    float m_VelocityDamping;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_VelocityScale
    // Size: 0x4
    // Offset: 0x1C4
    float m_VelocityScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_AngularVelocityDamping
    // Size: 0x4
    // Offset: 0x1C8
    float m_AngularVelocityDamping;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_AngularVelocityScale
    // Size: 0x4
    // Offset: 0x1CC
    float m_AngularVelocityScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_TrackPosition
    // Size: 0x1
    // Offset: 0x1D0
    bool m_TrackPosition;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_SmoothPosition
    // Size: 0x1
    // Offset: 0x1D1
    bool m_SmoothPosition;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Single m_SmoothPositionAmount
    // Size: 0x4
    // Offset: 0x1D4
    float m_SmoothPositionAmount;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_TightenPosition
    // Size: 0x4
    // Offset: 0x1D8
    float m_TightenPosition;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_TrackRotation
    // Size: 0x1
    // Offset: 0x1DC
    bool m_TrackRotation;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_SmoothRotation
    // Size: 0x1
    // Offset: 0x1DD
    bool m_SmoothRotation;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Single m_SmoothRotationAmount
    // Size: 0x4
    // Offset: 0x1E0
    float m_SmoothRotationAmount;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_TightenRotation
    // Size: 0x4
    // Offset: 0x1E4
    float m_TightenRotation;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_ThrowOnDetach
    // Size: 0x1
    // Offset: 0x1E8
    bool m_ThrowOnDetach;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Single m_ThrowSmoothingDuration
    // Size: 0x4
    // Offset: 0x1EC
    float m_ThrowSmoothingDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.AnimationCurve m_ThrowSmoothingCurve
    // Size: 0x8
    // Offset: 0x1F0
    ::UnityEngine::AnimationCurve* m_ThrowSmoothingCurve;
    // Field size check
    static_assert(sizeof(::UnityEngine::AnimationCurve*) == 0x8);
    // private System.Single m_ThrowVelocityScale
    // Size: 0x4
    // Offset: 0x1F8
    float m_ThrowVelocityScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_ThrowAngularVelocityScale
    // Size: 0x4
    // Offset: 0x1FC
    float m_ThrowAngularVelocityScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_ForceGravityOnDetach
    // Size: 0x1
    // Offset: 0x200
    bool m_ForceGravityOnDetach;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_RetainTransformParent
    // Size: 0x1
    // Offset: 0x201
    bool m_RetainTransformParent;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private UnityEngine.XR.Interaction.Toolkit.XRGrabInteractable/AttachPointCompatibilityMode m_AttachPointCompatibilityMode
    // Size: 0x4
    // Offset: 0x204
    ::UnityEngine::XR::Interaction::Toolkit::XRGrabInteractable::AttachPointCompatibilityMode m_AttachPointCompatibilityMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRGrabInteractable::AttachPointCompatibilityMode) == 0x4);
    // private System.Collections.Generic.List`1<UnityEngine.XR.Interaction.Toolkit.Transformers.XRBaseGrabTransformer> m_StartingSingleGrabTransformers
    // Size: 0x8
    // Offset: 0x208
    ::System::Collections::Generic::List_1<::UnityEngine::XR::Interaction::Toolkit::Transformers::XRBaseGrabTransformer*>* m_StartingSingleGrabTransformers;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::XR::Interaction::Toolkit::Transformers::XRBaseGrabTransformer*>*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.XR.Interaction.Toolkit.Transformers.XRBaseGrabTransformer> m_StartingMultipleGrabTransformers
    // Size: 0x8
    // Offset: 0x210
    ::System::Collections::Generic::List_1<::UnityEngine::XR::Interaction::Toolkit::Transformers::XRBaseGrabTransformer*>* m_StartingMultipleGrabTransformers;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::XR::Interaction::Toolkit::Transformers::XRBaseGrabTransformer*>*) == 0x8);
    // private System.Boolean m_AddDefaultGrabTransformers
    // Size: 0x1
    // Offset: 0x218
    bool m_AddDefaultGrabTransformers;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private readonly UnityEngine.XR.Interaction.Toolkit.Utilities.SmallRegistrationList`1<UnityEngine.XR.Interaction.Toolkit.Transformers.IXRGrabTransformer> m_SingleGrabTransformers
    // Size: 0x8
    // Offset: 0x220
    ::UnityEngine::XR::Interaction::Toolkit::Utilities::SmallRegistrationList_1<::UnityEngine::XR::Interaction::Toolkit::Transformers::IXRGrabTransformer*>* m_SingleGrabTransformers;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::Utilities::SmallRegistrationList_1<::UnityEngine::XR::Interaction::Toolkit::Transformers::IXRGrabTransformer*>*) == 0x8);
    // private readonly UnityEngine.XR.Interaction.Toolkit.Utilities.SmallRegistrationList`1<UnityEngine.XR.Interaction.Toolkit.Transformers.IXRGrabTransformer> m_MultipleGrabTransformers
    // Size: 0x8
    // Offset: 0x228
    ::UnityEngine::XR::Interaction::Toolkit::Utilities::SmallRegistrationList_1<::UnityEngine::XR::Interaction::Toolkit::Transformers::IXRGrabTransformer*>* m_MultipleGrabTransformers;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::Utilities::SmallRegistrationList_1<::UnityEngine::XR::Interaction::Toolkit::Transformers::IXRGrabTransformer*>*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.XR.Interaction.Toolkit.Transformers.IXRGrabTransformer> m_GrabTransformersAddedWhenGrabbed
    // Size: 0x8
    // Offset: 0x230
    ::System::Collections::Generic::List_1<::UnityEngine::XR::Interaction::Toolkit::Transformers::IXRGrabTransformer*>* m_GrabTransformersAddedWhenGrabbed;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::XR::Interaction::Toolkit::Transformers::IXRGrabTransformer*>*) == 0x8);
    // private System.Boolean m_GrabCountChanged
    // Size: 0x1
    // Offset: 0x238
    bool m_GrabCountChanged;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.ValueTuple`2<System.Int32,System.Int32> m_GrabCountBeforeAndAfterChange
    // Size: 0xFFFFFFFF
    // Offset: 0x23C
    ::System::ValueTuple_2<int, int> m_GrabCountBeforeAndAfterChange;
    // private System.Boolean m_IsProcessingGrabTransformers
    // Size: 0x1
    // Offset: 0x244
    bool m_IsProcessingGrabTransformers;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private UnityEngine.Pose m_TargetPose
    // Size: 0x1C
    // Offset: 0x248
    ::UnityEngine::Pose m_TargetPose;
    // Field size check
    static_assert(sizeof(::UnityEngine::Pose) == 0x1C);
    // private UnityEngine.Vector3 m_TargetLocalScale
    // Size: 0xC
    // Offset: 0x264
    ::UnityEngine::Vector3 m_TargetLocalScale;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Single m_CurrentAttachEaseTime
    // Size: 0x4
    // Offset: 0x270
    float m_CurrentAttachEaseTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.XR.Interaction.Toolkit.XRBaseInteractable/MovementType m_CurrentMovementType
    // Size: 0x4
    // Offset: 0x274
    ::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractable::MovementType m_CurrentMovementType;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractable::MovementType) == 0x4);
    // private System.Boolean m_DetachInLateUpdate
    // Size: 0x1
    // Offset: 0x278
    bool m_DetachInLateUpdate;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private UnityEngine.Vector3 m_DetachVelocity
    // Size: 0xC
    // Offset: 0x27C
    ::UnityEngine::Vector3 m_DetachVelocity;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 m_DetachAngularVelocity
    // Size: 0xC
    // Offset: 0x288
    ::UnityEngine::Vector3 m_DetachAngularVelocity;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Int32 m_ThrowSmoothingCurrentFrame
    // Size: 0x4
    // Offset: 0x294
    int m_ThrowSmoothingCurrentFrame;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private readonly System.Single[] m_ThrowSmoothingFrameTimes
    // Size: 0x8
    // Offset: 0x298
    ::ArrayW<float> m_ThrowSmoothingFrameTimes;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    // private readonly UnityEngine.Vector3[] m_ThrowSmoothingVelocityFrames
    // Size: 0x8
    // Offset: 0x2A0
    ::ArrayW<::UnityEngine::Vector3> m_ThrowSmoothingVelocityFrames;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector3>) == 0x8);
    // private readonly UnityEngine.Vector3[] m_ThrowSmoothingAngularVelocityFrames
    // Size: 0x8
    // Offset: 0x2A8
    ::ArrayW<::UnityEngine::Vector3> m_ThrowSmoothingAngularVelocityFrames;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector3>) == 0x8);
    // private System.Boolean m_ThrowSmoothingFirstUpdate
    // Size: 0x1
    // Offset: 0x2B0
    bool m_ThrowSmoothingFirstUpdate;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private UnityEngine.Pose m_LastThrowReferencePose
    // Size: 0x1C
    // Offset: 0x2B4
    ::UnityEngine::Pose m_LastThrowReferencePose;
    // Field size check
    static_assert(sizeof(::UnityEngine::Pose) == 0x1C);
    // private UnityEngine.Rigidbody m_Rigidbody
    // Size: 0x8
    // Offset: 0x2D0
    ::UnityEngine::Rigidbody* m_Rigidbody;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rigidbody*) == 0x8);
    // private System.Boolean m_WasKinematic
    // Size: 0x1
    // Offset: 0x2D8
    bool m_WasKinematic;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_UsedGravity
    // Size: 0x1
    // Offset: 0x2D9
    bool m_UsedGravity;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Single m_OldDrag
    // Size: 0x4
    // Offset: 0x2DC
    float m_OldDrag;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_OldAngularDrag
    // Size: 0x4
    // Offset: 0x2E0
    float m_OldAngularDrag;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Transform m_OriginalSceneParent
    // Size: 0x8
    // Offset: 0x2E8
    ::UnityEngine::Transform* m_OriginalSceneParent;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.XR.Interaction.Toolkit.Utilities.TeleportationMonitor m_TeleportationMonitor
    // Size: 0x8
    // Offset: 0x2F0
    ::UnityEngine::XR::Interaction::Toolkit::Utilities::TeleportationMonitor* m_TeleportationMonitor;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::Utilities::TeleportationMonitor*) == 0x8);
    // private readonly System.Collections.Generic.Dictionary`2<UnityEngine.XR.Interaction.Toolkit.IXRSelectInteractor,UnityEngine.Transform> m_DynamicAttachTransforms
    // Size: 0x8
    // Offset: 0x2F8
    ::System::Collections::Generic::Dictionary_2<::UnityEngine::XR::Interaction::Toolkit::IXRSelectInteractor*, ::UnityEngine::Transform*>* m_DynamicAttachTransforms;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::UnityEngine::XR::Interaction::Toolkit::IXRSelectInteractor*, ::UnityEngine::Transform*>*) == 0x8);
    public:
    // static field const value: static private System.Single k_DefaultTighteningAmount
    static constexpr const float k_DefaultTighteningAmount = 0.5;
    // Get static field: static private System.Single k_DefaultTighteningAmount
    static float _get_k_DefaultTighteningAmount();
    // Set static field: static private System.Single k_DefaultTighteningAmount
    static void _set_k_DefaultTighteningAmount(float value);
    // static field const value: static private System.Single k_DefaultSmoothingAmount
    static constexpr const float k_DefaultSmoothingAmount = 5;
