// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.LayerMask
#include "UnityEngine/LayerMask.hpp"
// Including type: UnityEngine.PhysicsScene
#include "UnityEngine/PhysicsScene.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: Unity::XR::CoreUtils
namespace Unity::XR::CoreUtils {
  // Forward declaring type: XROrigin
  class XROrigin;
}
// Forward declaring namespace: UnityEngine::XR::Interaction::Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Forward declaring type: XRBaseInteractor
  class XRBaseInteractor;
  // Forward declaring type: SelectEnterEventArgs
  class SelectEnterEventArgs;
}
// Completed forward declares
// Type namespace: UnityEngine.XR.Interaction.Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Forward declaring type: XRInteractorReticleVisual
  class XRInteractorReticleVisual;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::XR::Interaction::Toolkit::XRInteractorReticleVisual);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::XR::Interaction::Toolkit::XRInteractorReticleVisual*, "UnityEngine.XR.Interaction.Toolkit", "XRInteractorReticleVisual");
// Type namespace: UnityEngine.XR.Interaction.Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Size: 0x90
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.XRInteractorReticleVisual
  // [TokenAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: FFFFFFFF
  // [DisallowMultipleComponent] Offset: FFFFFFFF
  // [HelpURLAttribute] Offset: FFFFFFFF
  class XRInteractorReticleVisual : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private System.Single m_MaxRaycastDistance
    // Size: 0x4
    // Offset: 0x20
    float m_MaxRaycastDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: m_MaxRaycastDistance and: m_ReticlePrefab
    char __padding0[0x4] = {};
    // private UnityEngine.GameObject m_ReticlePrefab
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::GameObject* m_ReticlePrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Single m_PrefabScalingFactor
    // Size: 0x4
    // Offset: 0x30
    float m_PrefabScalingFactor;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_UndoDistanceScaling
    // Size: 0x1
    // Offset: 0x34
    bool m_UndoDistanceScaling;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_AlignPrefabWithSurfaceNormal
    // Size: 0x1
    // Offset: 0x35
    bool m_AlignPrefabWithSurfaceNormal;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_AlignPrefabWithSurfaceNormal and: m_EndpointSmoothingTime
    char __padding4[0x2] = {};
    // private System.Single m_EndpointSmoothingTime
    // Size: 0x4
    // Offset: 0x38
    float m_EndpointSmoothingTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_DrawWhileSelecting
    // Size: 0x1
    // Offset: 0x3C
    bool m_DrawWhileSelecting;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_DrawOnNoHit
    // Size: 0x1
    // Offset: 0x3D
    bool m_DrawOnNoHit;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_DrawOnNoHit and: m_RaycastMask
    char __padding7[0x2] = {};
    // private UnityEngine.LayerMask m_RaycastMask
    // Size: 0x4
    // Offset: 0x40
    ::UnityEngine::LayerMask m_RaycastMask;
    // Field size check
    static_assert(sizeof(::UnityEngine::LayerMask) == 0x4);
    // private System.Boolean m_ReticleActive
    // Size: 0x1
    // Offset: 0x44
    bool m_ReticleActive;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_ReticleActive and: m_XROrigin
    char __padding9[0x3] = {};
    // private Unity.XR.CoreUtils.XROrigin m_XROrigin
    // Size: 0x8
    // Offset: 0x48
    ::Unity::XR::CoreUtils::XROrigin* m_XROrigin;
    // Field size check
    static_assert(sizeof(::Unity::XR::CoreUtils::XROrigin*) == 0x8);
    // private UnityEngine.GameObject m_ReticleInstance
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::GameObject* m_ReticleInstance;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.XR.Interaction.Toolkit.XRBaseInteractor m_Interactor
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractor* m_Interactor;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractor*) == 0x8);
    // private UnityEngine.Vector3[] m_InteractorLinePoints
    // Size: 0x8
    // Offset: 0x60
    ::ArrayW<::UnityEngine::Vector3> m_InteractorLinePoints;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector3>) == 0x8);
    // private UnityEngine.Vector3 m_TargetEndPoint
    // Size: 0xC
    // Offset: 0x68
    ::UnityEngine::Vector3 m_TargetEndPoint;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 m_TargetEndNormal
    // Size: 0xC
    // Offset: 0x74
    ::UnityEngine::Vector3 m_TargetEndNormal;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.PhysicsScene m_LocalPhysicsScene
    // Size: 0x4
    // Offset: 0x80
    ::UnityEngine::PhysicsScene m_LocalPhysicsScene;
    // Field size check
    static_assert(sizeof(::UnityEngine::PhysicsScene) == 0x4);
    // private System.Boolean m_HasRaycastHit
    // Size: 0x1
    // Offset: 0x84
    bool m_HasRaycastHit;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_HasRaycastHit and: m_RaycastHits
    char __padding17[0x3] = {};
    // private readonly UnityEngine.RaycastHit[] m_RaycastHits
    // Size: 0x8
    // Offset: 0x88
    ::ArrayW<::UnityEngine::RaycastHit> m_RaycastHits;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::RaycastHit>) == 0x8);
    public:
    // static field const value: static private System.Int32 k_MaxRaycastHits
    static constexpr const int k_MaxRaycastHits = 10;
    // Get static field: static private System.Int32 k_MaxRaycastHits
    static int _get_k_MaxRaycastHits();
    // Set static field: static private System.Int32 k_MaxRaycastHits
    static void _set_k_MaxRaycastHits(int value);
    // Get static field: static private Unity.XR.CoreUtils.XROrigin s_XROriginCache
    static ::Unity::XR::CoreUtils::XROrigin* _get_s_XROriginCache();
    // Set static field: static private Unity.XR.CoreUtils.XROrigin s_XROriginCache
    static void _set_s_XROriginCache(::Unity::XR::CoreUtils::XROrigin* value);
    // Get instance field reference: private System.Single m_MaxRaycastDistance
