// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.XR.Interaction.Toolkit.XRBaseInteractor
#include "UnityEngine/XR/Interaction/Toolkit/XRBaseInteractor.hpp"
// Including type: UnityEngine.XR.Interaction.Toolkit.UI.IUIInteractor
#include "UnityEngine/XR/Interaction/Toolkit/UI/IUIInteractor.hpp"
// Including type: UnityEngine.QueryTriggerInteraction
#include "UnityEngine/QueryTriggerInteraction.hpp"
// Including type: UnityEngine.RaycastHit
#include "UnityEngine/RaycastHit.hpp"
// Including type: UnityEngine.PhysicsScene
#include "UnityEngine/PhysicsScene.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::XR::Interaction::Toolkit::Filtering
namespace UnityEngine::XR::Interaction::Toolkit::Filtering {
  // Forward declaring type: IXRSelectFilter
  class IXRSelectFilter;
  // Forward declaring type: XRPokeFilter
  class XRPokeFilter;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: MeshRenderer
  class MeshRenderer;
  // Forward declaring type: Collider
  class Collider;
  // Skipping declaration: Component because it is already included!
}
// Forward declaring namespace: UnityEngine::XR::Interaction::Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Forward declaring type: IXRSelectInteractable
  class IXRSelectInteractable;
  // Forward declaring type: IXRInteractable
  class IXRInteractable;
  // Skipping declaration: PokeCollision because it is already included!
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine::XR::Interaction::Toolkit::UI
namespace UnityEngine::XR::Interaction::Toolkit::UI {
  // Forward declaring type: RegisteredUIInteractorCache
  class RegisteredUIInteractorCache;
  // Forward declaring type: TrackedDeviceModel
  struct TrackedDeviceModel;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Func`1<TResult>
  template<typename TResult>
  class Func_1;
}
// Completed forward declares
// Type namespace: UnityEngine.XR.Interaction.Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Forward declaring type: XRPokeInteractor
  class XRPokeInteractor;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::XR::Interaction::Toolkit::XRPokeInteractor);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::XR::Interaction::Toolkit::XRPokeInteractor*, "UnityEngine.XR.Interaction.Toolkit", "XRPokeInteractor");
// Type namespace: UnityEngine.XR.Interaction.Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Size: 0x218
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.XRPokeInteractor
  // [TokenAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: FFFFFFFF
  // [HelpURLAttribute] Offset: FFFFFFFF
  class XRPokeInteractor : public ::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractor/*, public ::UnityEngine::XR::Interaction::Toolkit::UI::IUIInteractor*/ {
    public:
    // Nested type: ::UnityEngine::XR::Interaction::Toolkit::XRPokeInteractor::PokeCollision
    struct PokeCollision;
    // Size: 0x19
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.XRPokeInteractor/PokeCollision
    // [TokenAttribute] Offset: FFFFFFFF
    // [IsReadOnlyAttribute] Offset: FFFFFFFF
    struct PokeCollision/*, public ::System::ValueType*/ {
      public:
      public:
      // public readonly UnityEngine.Collider collider
      // Size: 0x8
      // Offset: 0x0
      ::UnityEngine::Collider* collider;
      // Field size check
      static_assert(sizeof(::UnityEngine::Collider*) == 0x8);
      // public readonly UnityEngine.XR.Interaction.Toolkit.IXRInteractable interactable
      // Size: 0x8
      // Offset: 0x8
      ::UnityEngine::XR::Interaction::Toolkit::IXRInteractable* interactable;
      // Field size check
      static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::IXRInteractable*) == 0x8);
      // public readonly UnityEngine.XR.Interaction.Toolkit.Filtering.XRPokeFilter filter
      // Size: 0x8
      // Offset: 0x10
      ::UnityEngine::XR::Interaction::Toolkit::Filtering::XRPokeFilter* filter;
      // Field size check
      static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::Filtering::XRPokeFilter*) == 0x8);
      // public readonly System.Boolean hasPokeFilter
      // Size: 0x1
      // Offset: 0x18
      bool hasPokeFilter;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      public:
      // Creating value type constructor for type: PokeCollision
      constexpr PokeCollision(::UnityEngine::Collider* collider_ = {}, ::UnityEngine::XR::Interaction::Toolkit::IXRInteractable* interactable_ = {}, ::UnityEngine::XR::Interaction::Toolkit::Filtering::XRPokeFilter* filter_ = {}, bool hasPokeFilter_ = {}) noexcept : collider{collider_}, interactable{interactable_}, filter{filter_}, hasPokeFilter{hasPokeFilter_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public readonly UnityEngine.Collider collider
      [[deprecated("Use field access instead!")]] ::UnityEngine::Collider*& dyn_collider();
      // Get instance field reference: public readonly UnityEngine.XR.Interaction.Toolkit.IXRInteractable interactable
      [[deprecated("Use field access instead!")]] ::UnityEngine::XR::Interaction::Toolkit::IXRInteractable*& dyn_interactable();
      // Get instance field reference: public readonly UnityEngine.XR.Interaction.Toolkit.Filtering.XRPokeFilter filter
      [[deprecated("Use field access instead!")]] ::UnityEngine::XR::Interaction::Toolkit::Filtering::XRPokeFilter*& dyn_filter();
      // Get instance field reference: public readonly System.Boolean hasPokeFilter
      [[deprecated("Use field access instead!")]] bool& dyn_hasPokeFilter();
      // public System.Void .ctor(UnityEngine.Collider collider, UnityEngine.XR.Interaction.Toolkit.IXRInteractable interactable, UnityEngine.XR.Interaction.Toolkit.Filtering.XRPokeFilter filter)
      // Offset: 0x53F5A5C
      PokeCollision(::UnityEngine::Collider* collider, ::UnityEngine::XR::Interaction::Toolkit::IXRInteractable* interactable, ::UnityEngine::XR::Interaction::Toolkit::Filtering::XRPokeFilter* filter);
    }; // UnityEngine.XR.Interaction.Toolkit.XRPokeInteractor/PokeCollision
    #pragma pack(pop)
    static check_size<sizeof(XRPokeInteractor::PokeCollision), 24 + sizeof(bool)> __UnityEngine_XR_Interaction_Toolkit_XRPokeInteractor_PokeCollisionSizeCheck;
    static_assert(sizeof(XRPokeInteractor::PokeCollision) == 0x19);
    public:
    // private System.Single m_PokeDepth
    // Size: 0x4
    // Offset: 0x198
    float m_PokeDepth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_PokeWidth
    // Size: 0x4
    // Offset: 0x19C
    float m_PokeWidth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_PokeSelectWidth
    // Size: 0x4
    // Offset: 0x1A0
    float m_PokeSelectWidth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_PokeHoverRadius
    // Size: 0x4
    // Offset: 0x1A4
    float m_PokeHoverRadius;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_PokeInteractionOffset
    // Size: 0x4
    // Offset: 0x1A8
    float m_PokeInteractionOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.LayerMask m_PhysicsLayerMask
    // Size: 0x4
    // Offset: 0x1AC
    ::UnityEngine::LayerMask m_PhysicsLayerMask;
    // Field size check
    static_assert(sizeof(::UnityEngine::LayerMask) == 0x4);
    // private UnityEngine.QueryTriggerInteraction m_PhysicsTriggerInteraction
    // Size: 0x4
    // Offset: 0x1B0
    ::UnityEngine::QueryTriggerInteraction m_PhysicsTriggerInteraction;
    // Field size check
    static_assert(sizeof(::UnityEngine::QueryTriggerInteraction) == 0x4);
    // private System.Boolean m_RequirePokeFilter
    // Size: 0x1
    // Offset: 0x1B4
    bool m_RequirePokeFilter;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_EnableUIInteraction
    // Size: 0x1
    // Offset: 0x1B5
    bool m_EnableUIInteraction;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_DebugVisualizationsEnabled
    // Size: 0x1
    // Offset: 0x1B6
    bool m_DebugVisualizationsEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_DebugVisualizationsEnabled and: m_HoverDebugSphere
    char __padding9[0x1] = {};
    // private UnityEngine.GameObject m_HoverDebugSphere
    // Size: 0x8
    // Offset: 0x1B8
    ::UnityEngine::GameObject* m_HoverDebugSphere;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.MeshRenderer m_HoverDebugRenderer
    // Size: 0x8
    // Offset: 0x1C0
    ::UnityEngine::MeshRenderer* m_HoverDebugRenderer;
    // Field size check
    static_assert(sizeof(::UnityEngine::MeshRenderer*) == 0x8);
    // private UnityEngine.Vector3 m_LastPokeInteractionPoint
    // Size: 0xC
    // Offset: 0x1C8
    ::UnityEngine::Vector3 m_LastPokeInteractionPoint;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Boolean m_PokeCanSelect
    // Size: 0x1
    // Offset: 0x1D4
    bool m_PokeCanSelect;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_FirstFrame
    // Size: 0x1
    // Offset: 0x1D5
    bool m_FirstFrame;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_FirstFrame and: m_CurrentPokeTarget
    char __padding14[0x2] = {};
    // private UnityEngine.XR.Interaction.Toolkit.IXRSelectInteractable m_CurrentPokeTarget
    // Size: 0x8
    // Offset: 0x1D8
    ::UnityEngine::XR::Interaction::Toolkit::IXRSelectInteractable* m_CurrentPokeTarget;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::IXRSelectInteractable*) == 0x8);
    // private readonly UnityEngine.RaycastHit[] m_SphereCastHits
    // Size: 0x8
    // Offset: 0x1E0
    ::ArrayW<::UnityEngine::RaycastHit> m_SphereCastHits;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::RaycastHit>) == 0x8);
    // private readonly UnityEngine.Collider[] m_OverlapSphereHits
    // Size: 0x8
    // Offset: 0x1E8
    ::ArrayW<::UnityEngine::Collider*> m_OverlapSphereHits;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Collider*>) == 0x8);
    // private readonly System.Collections.Generic.List`1<UnityEngine.XR.Interaction.Toolkit.XRPokeInteractor/PokeCollision> m_PokeTargets
    // Size: 0x8
    // Offset: 0x1F0
    ::System::Collections::Generic::List_1<::UnityEngine::XR::Interaction::Toolkit::XRPokeInteractor::PokeCollision>* m_PokeTargets;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::XR::Interaction::Toolkit::XRPokeInteractor::PokeCollision>*) == 0x8);
    // private readonly System.Collections.Generic.List`1<UnityEngine.XR.Interaction.Toolkit.Filtering.IXRSelectFilter> m_InteractableSelectFilters
    // Size: 0x8
    // Offset: 0x1F8
    ::System::Collections::Generic::List_1<::UnityEngine::XR::Interaction::Toolkit::Filtering::IXRSelectFilter*>* m_InteractableSelectFilters;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::XR::Interaction::Toolkit::Filtering::IXRSelectFilter*>*) == 0x8);
    // private UnityEngine.XR.Interaction.Toolkit.UI.RegisteredUIInteractorCache m_RegisteredUIInteractorCache
    // Size: 0x8
    // Offset: 0x200
    ::UnityEngine::XR::Interaction::Toolkit::UI::RegisteredUIInteractorCache* m_RegisteredUIInteractorCache;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::UI::RegisteredUIInteractorCache*) == 0x8);
    // private UnityEngine.PhysicsScene m_LocalPhysicsScene
    // Size: 0x4
    // Offset: 0x208
    ::UnityEngine::PhysicsScene m_LocalPhysicsScene;
    // Field size check
    static_assert(sizeof(::UnityEngine::PhysicsScene) == 0x4);
    // Padding between fields: m_LocalPhysicsScene and: m_PositionGetter
    char __padding21[0x4] = {};
    // private System.Func`1<UnityEngine.Vector3> m_PositionGetter
    // Size: 0x8
    // Offset: 0x210
    ::System::Func_1<::UnityEngine::Vector3>* m_PositionGetter;
    // Field size check
    static_assert(sizeof(::System::Func_1<::UnityEngine::Vector3>*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::UnityEngine::XR::Interaction::Toolkit::UI::IUIInteractor
    operator ::UnityEngine::XR::Interaction::Toolkit::UI::IUIInteractor() noexcept {
      return *reinterpret_cast<::UnityEngine::XR::Interaction::Toolkit::UI::IUIInteractor*>(this);
    }
    // Get static field: static private readonly System.Collections.Generic.List`1<UnityEngine.XR.Interaction.Toolkit.IXRInteractable> s_Results
    static ::System::Collections::Generic::List_1<::UnityEngine::XR::Interaction::Toolkit::IXRInteractable*>* _get_s_Results();
    // Set static field: static private readonly System.Collections.Generic.List`1<UnityEngine.XR.Interaction.Toolkit.IXRInteractable> s_Results
