// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.XR.Interaction.Toolkit.XRBaseControllerInteractor
#include "UnityEngine/XR/Interaction/Toolkit/XRBaseControllerInteractor.hpp"
// Including type: UnityEngine.XR.Interaction.Toolkit.ILineRenderable
#include "UnityEngine/XR/Interaction/Toolkit/ILineRenderable.hpp"
// Including type: UnityEngine.XR.Interaction.Toolkit.UI.IUIInteractor
#include "UnityEngine/XR/Interaction/Toolkit/UI/IUIInteractor.hpp"
// Including type: UnityEngine.QueryTriggerInteraction
#include "UnityEngine/QueryTriggerInteraction.hpp"
// Including type: UnityEngine.RaycastHit
#include "UnityEngine/RaycastHit.hpp"
// Including type: UnityEngine.PhysicsScene
#include "UnityEngine/PhysicsScene.hpp"
// Including type: UnityEngine.EventSystems.RaycastResult
#include "UnityEngine/EventSystems/RaycastResult.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares

// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine::XR::Interaction::Toolkit::UI
namespace UnityEngine::XR::Interaction::Toolkit::UI {
  // Forward declaring type: RegisteredUIInteractorCache
  class RegisteredUIInteractorCache;
  // Forward declaring type: TrackedDeviceModel
  struct TrackedDeviceModel;
}
// Forward declaring namespace: UnityEngine::InputSystem
namespace UnityEngine::InputSystem {
  // Forward declaring type: InputAction
  class InputAction;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Nullable`1<T>
  template<typename T>
  struct Nullable_1;
  // Forward declaring type: Func`2<T, TResult>
  template<typename T, typename TResult>
  class Func_2;
}
// Completed forward declares
// Type namespace: UnityEngine.XR.Interaction.Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Forward declaring type: XRRayInteractor
  class XRRayInteractor;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor*, "UnityEngine.XR.Interaction.Toolkit", "XRRayInteractor");
// Type namespace: UnityEngine.XR.Interaction.Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Size: 0x378
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.XRRayInteractor
  // [TokenAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: FFFFFFFF
  // [HelpURLAttribute] Offset: FFFFFFFF
  // [DisallowMultipleComponent] Offset: FFFFFFFF
  class XRRayInteractor : public ::UnityEngine::XR::Interaction::Toolkit::XRBaseControllerInteractor/*, public ::UnityEngine::XR::Interaction::Toolkit::ILineRenderable, public ::UnityEngine::XR::Interaction::Toolkit::UI::IUIInteractor*/ {
    public:
    // Nested type: ::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::RaycastHitComparer
    class RaycastHitComparer;
    // Nested type: ::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::LineType
    struct LineType;
    // Nested type: ::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::QuerySnapVolumeInteraction
    struct QuerySnapVolumeInteraction;
    // Nested type: ::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::HitDetectionType
    struct HitDetectionType;
    // Nested type: ::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::AnchorRotationMode
    struct AnchorRotationMode;
    // Nested type: ::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::SamplePoint
    struct SamplePoint;
    // Nested type: ::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::$$c
    class $$c;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/LineType
    // [TokenAttribute] Offset: FFFFFFFF
    struct LineType/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: LineType
      constexpr LineType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/LineType StraightLine
      static constexpr const int StraightLine = 0;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/LineType StraightLine
      static ::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::LineType _get_StraightLine();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/LineType StraightLine
      static void _set_StraightLine(::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::LineType value);
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/LineType ProjectileCurve
      static constexpr const int ProjectileCurve = 1;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/LineType ProjectileCurve
      static ::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::LineType _get_ProjectileCurve();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/LineType ProjectileCurve
      static void _set_ProjectileCurve(::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::LineType value);
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/LineType BezierCurve
      static constexpr const int BezierCurve = 2;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/LineType BezierCurve
      static ::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::LineType _get_BezierCurve();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/LineType BezierCurve
      static void _set_BezierCurve(::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::LineType value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/LineType
    #pragma pack(pop)
    static check_size<sizeof(XRRayInteractor::LineType), 0 + sizeof(int)> __UnityEngine_XR_Interaction_Toolkit_XRRayInteractor_LineTypeSizeCheck;
    static_assert(sizeof(XRRayInteractor::LineType) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/QuerySnapVolumeInteraction
    // [TokenAttribute] Offset: FFFFFFFF
    struct QuerySnapVolumeInteraction/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: QuerySnapVolumeInteraction
      constexpr QuerySnapVolumeInteraction(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/QuerySnapVolumeInteraction Ignore
      static constexpr const int Ignore = 0;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/QuerySnapVolumeInteraction Ignore
      static ::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::QuerySnapVolumeInteraction _get_Ignore();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/QuerySnapVolumeInteraction Ignore
      static void _set_Ignore(::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::QuerySnapVolumeInteraction value);
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/QuerySnapVolumeInteraction Collide
      static constexpr const int Collide = 1;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/QuerySnapVolumeInteraction Collide
      static ::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::QuerySnapVolumeInteraction _get_Collide();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/QuerySnapVolumeInteraction Collide
      static void _set_Collide(::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::QuerySnapVolumeInteraction value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/QuerySnapVolumeInteraction
    #pragma pack(pop)
    static check_size<sizeof(XRRayInteractor::QuerySnapVolumeInteraction), 0 + sizeof(int)> __UnityEngine_XR_Interaction_Toolkit_XRRayInteractor_QuerySnapVolumeInteractionSizeCheck;
    static_assert(sizeof(XRRayInteractor::QuerySnapVolumeInteraction) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/HitDetectionType
    // [TokenAttribute] Offset: FFFFFFFF
    struct HitDetectionType/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: HitDetectionType
      constexpr HitDetectionType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/HitDetectionType Raycast
      static constexpr const int Raycast = 0;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/HitDetectionType Raycast
      static ::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::HitDetectionType _get_Raycast();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/HitDetectionType Raycast
      static void _set_Raycast(::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::HitDetectionType value);
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/HitDetectionType SphereCast
      static constexpr const int SphereCast = 1;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/HitDetectionType SphereCast
      static ::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::HitDetectionType _get_SphereCast();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/HitDetectionType SphereCast
      static void _set_SphereCast(::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::HitDetectionType value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/HitDetectionType
    #pragma pack(pop)
    static check_size<sizeof(XRRayInteractor::HitDetectionType), 0 + sizeof(int)> __UnityEngine_XR_Interaction_Toolkit_XRRayInteractor_HitDetectionTypeSizeCheck;
    static_assert(sizeof(XRRayInteractor::HitDetectionType) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/AnchorRotationMode
    // [TokenAttribute] Offset: FFFFFFFF
    struct AnchorRotationMode/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: AnchorRotationMode
      constexpr AnchorRotationMode(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/AnchorRotationMode RotateOverTime
      static constexpr const int RotateOverTime = 0;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/AnchorRotationMode RotateOverTime
      static ::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::AnchorRotationMode _get_RotateOverTime();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/AnchorRotationMode RotateOverTime
      static void _set_RotateOverTime(::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::AnchorRotationMode value);
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/AnchorRotationMode MatchDirection
      static constexpr const int MatchDirection = 1;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/AnchorRotationMode MatchDirection
      static ::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::AnchorRotationMode _get_MatchDirection();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/AnchorRotationMode MatchDirection
      static void _set_MatchDirection(::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::AnchorRotationMode value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/AnchorRotationMode
    #pragma pack(pop)
    static check_size<sizeof(XRRayInteractor::AnchorRotationMode), 0 + sizeof(int)> __UnityEngine_XR_Interaction_Toolkit_XRRayInteractor_AnchorRotationModeSizeCheck;
    static_assert(sizeof(XRRayInteractor::AnchorRotationMode) == 0x4);
    // Size: 0x10
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/SamplePoint
    // [TokenAttribute] Offset: FFFFFFFF
    struct SamplePoint/*, public ::System::ValueType*/ {
      public:
      public:
      // private UnityEngine.Vector3 <position>k__BackingField
      // Size: 0xC
      // Offset: 0x0
      ::UnityEngine::Vector3 position;
      // Field size check
      static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
      // private System.Single <parameter>k__BackingField
      // Size: 0x4
      // Offset: 0xC
      float parameter;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      public:
      // Creating value type constructor for type: SamplePoint
      constexpr SamplePoint(::UnityEngine::Vector3 position_ = {}, float parameter_ = {}) noexcept : position{position_}, parameter{parameter_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: private UnityEngine.Vector3 <position>k__BackingField
      [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_$position$k__BackingField();
      // Get instance field reference: private System.Single <parameter>k__BackingField
      [[deprecated("Use field access instead!")]] float& dyn_$parameter$k__BackingField();
      // public UnityEngine.Vector3 get_position()
      // Offset: 0x53FAD74
      ::UnityEngine::Vector3 get_position();
      // public System.Void set_position(UnityEngine.Vector3 value)
      // Offset: 0x53FAD80
      void set_position(::UnityEngine::Vector3 value);
      // public System.Single get_parameter()
      // Offset: 0x53FAD8C
      float get_parameter();
      // public System.Void set_parameter(System.Single value)
      // Offset: 0x53FAD94
      void set_parameter(float value);
    }; // UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/SamplePoint
    #pragma pack(pop)
    static check_size<sizeof(XRRayInteractor::SamplePoint), 12 + sizeof(float)> __UnityEngine_XR_Interaction_Toolkit_XRRayInteractor_SamplePointSizeCheck;
    static_assert(sizeof(XRRayInteractor::SamplePoint) == 0x10);
    public:
    // private UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/LineType m_LineType
    // Size: 0x4
    // Offset: 0x280
    ::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::LineType m_LineType;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::LineType) == 0x4);
    // private System.Boolean m_BlendVisualLinePoints
    // Size: 0x1
    // Offset: 0x284
    bool m_BlendVisualLinePoints;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_BlendVisualLinePoints and: m_MaxRaycastDistance
    char __padding1[0x3] = {};
    // private System.Single m_MaxRaycastDistance
    // Size: 0x4
    // Offset: 0x288
    float m_MaxRaycastDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: m_MaxRaycastDistance and: m_RayOriginTransform
    char __padding2[0x4] = {};
    // private UnityEngine.Transform m_RayOriginTransform
    // Size: 0x8
    // Offset: 0x290
    ::UnityEngine::Transform* m_RayOriginTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform m_ReferenceFrame
    // Size: 0x8
    // Offset: 0x298
    ::UnityEngine::Transform* m_ReferenceFrame;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private System.Single m_Velocity
    // Size: 0x4
    // Offset: 0x2A0
    float m_Velocity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_Acceleration
    // Size: 0x4
    // Offset: 0x2A4
    float m_Acceleration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_AdditionalGroundHeight
    // Size: 0x4
    // Offset: 0x2A8
    float m_AdditionalGroundHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_AdditionalFlightTime
    // Size: 0x4
    // Offset: 0x2AC
    float m_AdditionalFlightTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_EndPointDistance
    // Size: 0x4
    // Offset: 0x2B0
    float m_EndPointDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_EndPointHeight
    // Size: 0x4
    // Offset: 0x2B4
    float m_EndPointHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_ControlPointDistance
    // Size: 0x4
    // Offset: 0x2B8
    float m_ControlPointDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_ControlPointHeight
    // Size: 0x4
    // Offset: 0x2BC
    float m_ControlPointHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 m_SampleFrequency
    // Size: 0x4
    // Offset: 0x2C0
    int m_SampleFrequency;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/HitDetectionType m_HitDetectionType
    // Size: 0x4
    // Offset: 0x2C4
    ::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::HitDetectionType m_HitDetectionType;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::HitDetectionType) == 0x4);
    // private System.Single m_SphereCastRadius
    // Size: 0x4
    // Offset: 0x2C8
    float m_SphereCastRadius;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.LayerMask m_RaycastMask
    // Size: 0x4
    // Offset: 0x2CC
    ::UnityEngine::LayerMask m_RaycastMask;
    // Field size check
    static_assert(sizeof(::UnityEngine::LayerMask) == 0x4);
    // private UnityEngine.QueryTriggerInteraction m_RaycastTriggerInteraction
    // Size: 0x4
    // Offset: 0x2D0
    ::UnityEngine::QueryTriggerInteraction m_RaycastTriggerInteraction;
    // Field size check
    static_assert(sizeof(::UnityEngine::QueryTriggerInteraction) == 0x4);
    // private UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/QuerySnapVolumeInteraction m_RaycastSnapVolumeInteraction
    // Size: 0x4
    // Offset: 0x2D4
    ::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::QuerySnapVolumeInteraction m_RaycastSnapVolumeInteraction;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::QuerySnapVolumeInteraction) == 0x4);
    // private System.Boolean m_HitClosestOnly
    // Size: 0x1
    // Offset: 0x2D8
    bool m_HitClosestOnly;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_HoverToSelect
    // Size: 0x1
    // Offset: 0x2D9
    bool m_HoverToSelect;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_HoverToSelect and: m_HoverTimeToSelect
    char __padding20[0x2] = {};
    // private System.Single m_HoverTimeToSelect
    // Size: 0x4
    // Offset: 0x2DC
    float m_HoverTimeToSelect;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_AutoDeselect
    // Size: 0x1
    // Offset: 0x2E0
    bool m_AutoDeselect;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_AutoDeselect and: m_TimeToAutoDeselect
    char __padding22[0x3] = {};
    // private System.Single m_TimeToAutoDeselect
    // Size: 0x4
    // Offset: 0x2E4
    float m_TimeToAutoDeselect;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_EnableUIInteraction
    // Size: 0x1
    // Offset: 0x2E8
    bool m_EnableUIInteraction;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_AllowAnchorControl
    // Size: 0x1
    // Offset: 0x2E9
    bool m_AllowAnchorControl;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_UseForceGrab
    // Size: 0x1
    // Offset: 0x2EA
    bool m_UseForceGrab;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_UseForceGrab and: m_RotateSpeed
    char __padding26[0x1] = {};
    // private System.Single m_RotateSpeed
    // Size: 0x4
    // Offset: 0x2EC
    float m_RotateSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_TranslateSpeed
    // Size: 0x4
    // Offset: 0x2F0
    float m_TranslateSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: m_TranslateSpeed and: m_AnchorRotateReferenceFrame
    char __padding28[0x4] = {};
    // private UnityEngine.Transform m_AnchorRotateReferenceFrame
    // Size: 0x8
    // Offset: 0x2F8
    ::UnityEngine::Transform* m_AnchorRotateReferenceFrame;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/AnchorRotationMode m_AnchorRotationMode
    // Size: 0x4
    // Offset: 0x300
    ::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::AnchorRotationMode m_AnchorRotationMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::AnchorRotationMode) == 0x4);
    // Padding between fields: m_AnchorRotationMode and: currentNearestValidTarget
    char __padding30[0x4] = {};
    // private UnityEngine.XR.Interaction.Toolkit.IXRInteractable <currentNearestValidTarget>k__BackingField
    // Size: 0x8
    // Offset: 0x308
    ::UnityEngine::XR::Interaction::Toolkit::IXRInteractable* currentNearestValidTarget;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::IXRInteractable*) == 0x8);
    // private readonly System.Collections.Generic.List`1<UnityEngine.XR.Interaction.Toolkit.IXRInteractable> m_ValidTargets
    // Size: 0x8
    // Offset: 0x310
    ::System::Collections::Generic::List_1<::UnityEngine::XR::Interaction::Toolkit::IXRInteractable*>* m_ValidTargets;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::XR::Interaction::Toolkit::IXRInteractable*>*) == 0x8);
    // private System.Single m_LastTimeHoveredObjectChanged
    // Size: 0x4
    // Offset: 0x318
    float m_LastTimeHoveredObjectChanged;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_PassedHoverTimeToSelect
    // Size: 0x1
    // Offset: 0x31C
    bool m_PassedHoverTimeToSelect;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_PassedHoverTimeToSelect and: m_LastTimeAutoSelected
    char __padding34[0x3] = {};
    // private System.Single m_LastTimeAutoSelected
    // Size: 0x4
    // Offset: 0x320
    float m_LastTimeAutoSelected;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_PassedTimeToAutoDeselect
    // Size: 0x1
    // Offset: 0x324
    bool m_PassedTimeToAutoDeselect;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_PassedTimeToAutoDeselect and: m_RaycastHits
    char __padding36[0x3] = {};
    // private readonly UnityEngine.RaycastHit[] m_RaycastHits
    // Size: 0x8
    // Offset: 0x328
    ::ArrayW<::UnityEngine::RaycastHit> m_RaycastHits;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::RaycastHit>) == 0x8);
    // private System.Int32 m_RaycastHitsCount
    // Size: 0x4
    // Offset: 0x330
    int m_RaycastHitsCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: m_RaycastHitsCount and: m_RaycastHitComparer
    char __padding38[0x4] = {};
    // private readonly UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/RaycastHitComparer m_RaycastHitComparer
    // Size: 0x8
    // Offset: 0x338
    ::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::RaycastHitComparer* m_RaycastHitComparer;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::RaycastHitComparer*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.XR.Interaction.Toolkit.XRRayInteractor/SamplePoint> m_SamplePoints
    // Size: 0x8
    // Offset: 0x340
    ::System::Collections::Generic::List_1<::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::SamplePoint>* m_SamplePoints;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::XR::Interaction::Toolkit::XRRayInteractor::SamplePoint>*) == 0x8);
    // private System.Int32 m_SamplePointsFrameUpdated
    // Size: 0x4
    // Offset: 0x348
    int m_SamplePointsFrameUpdated;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_RaycastHitEndpointIndex
    // Size: 0x4
    // Offset: 0x34C
    int m_RaycastHitEndpointIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_UIRaycastHitEndpointIndex
    // Size: 0x4
    // Offset: 0x350
    int m_UIRaycastHitEndpointIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: m_UIRaycastHitEndpointIndex and: m_ControlPoints
    char __padding43[0x4] = {};
    // private readonly UnityEngine.Vector3[] m_ControlPoints
    // Size: 0x8
    // Offset: 0x358
    ::ArrayW<::UnityEngine::Vector3> m_ControlPoints;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector3>) == 0x8);
    // private readonly UnityEngine.Vector3[] m_HitChordControlPoints
    // Size: 0x8
    // Offset: 0x360
    ::ArrayW<::UnityEngine::Vector3> m_HitChordControlPoints;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector3>) == 0x8);
    // private UnityEngine.PhysicsScene m_LocalPhysicsScene
    // Size: 0x4
    // Offset: 0x368
    ::UnityEngine::PhysicsScene m_LocalPhysicsScene;
    // Field size check
    static_assert(sizeof(::UnityEngine::PhysicsScene) == 0x4);
    // Padding between fields: m_LocalPhysicsScene and: m_RegisteredUIInteractorCache
    char __padding46[0x4] = {};
    // private UnityEngine.XR.Interaction.Toolkit.UI.RegisteredUIInteractorCache m_RegisteredUIInteractorCache
    // Size: 0x8
    // Offset: 0x370
    ::UnityEngine::XR::Interaction::Toolkit::UI::RegisteredUIInteractorCache* m_RegisteredUIInteractorCache;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::UI::RegisteredUIInteractorCache*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::UnityEngine::XR::Interaction::Toolkit::ILineRenderable
    operator ::UnityEngine::XR::Interaction::Toolkit::ILineRenderable() noexcept {
      return *reinterpret_cast<::UnityEngine::XR::Interaction::Toolkit::ILineRenderable*>(this);
    }
    // Creating interface conversion operator: operator ::UnityEngine::XR::Interaction::Toolkit::UI::IUIInteractor
    operator ::UnityEngine::XR::Interaction::Toolkit::UI::IUIInteractor() noexcept {
      return *reinterpret_cast<::UnityEngine::XR::Interaction::Toolkit::UI::IUIInteractor*>(this);
    }
