// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.XR.Interaction.Toolkit.XRBaseInteractor
#include "UnityEngine/XR/Interaction/Toolkit/XRBaseInteractor.hpp"
// Including type: System.ValueTuple`2
#include "System/ValueTuple_2.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::XR::Interaction::Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Forward declaring type: IXRInteractable
  class IXRInteractable;
  // Forward declaring type: IXRHoverInteractable
  class IXRHoverInteractable;
  // Forward declaring type: InteractableRegisteredEventArgs
  class InteractableRegisteredEventArgs;
  // Forward declaring type: InteractableUnregisteredEventArgs
  class InteractableUnregisteredEventArgs;
  // Forward declaring type: HoverEnterEventArgs
  class HoverEnterEventArgs;
  // Forward declaring type: HoverExitEventArgs
  class HoverExitEventArgs;
  // Forward declaring type: SelectExitEventArgs
  class SelectExitEventArgs;
  // Forward declaring type: IXRSelectInteractable
  class IXRSelectInteractable;
  // Forward declaring type: InteractorRegisteredEventArgs
  class InteractorRegisteredEventArgs;
  // Forward declaring type: InteractorUnregisteredEventArgs
  class InteractorUnregisteredEventArgs;
  // Skipping declaration: XRBaseInteractable because it is already included!
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: Collider
  class Collider;
  // Forward declaring type: MeshFilter
  class MeshFilter;
  // Forward declaring type: Renderer
  class Renderer;
  // Forward declaring type: WaitForFixedUpdate
  class WaitForFixedUpdate;
  // Forward declaring type: Color
  struct Color;
  // Forward declaring type: Matrix4x4
  struct Matrix4x4;
  // Skipping declaration: Vector3 because it is already included!
  // Skipping declaration: Pose because it is already included!
  // Forward declaring type: Camera
  class Camera;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: HashSet`1<T>
  template<typename T>
  class HashSet_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: UnityEngine::XR::Interaction::Toolkit::Utilities
namespace UnityEngine::XR::Interaction::Toolkit::Utilities {
  // Forward declaring type: TriggerContactMonitor
  class TriggerContactMonitor;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Nullable`1<T>
  template<typename T>
  struct Nullable_1;
}
// Completed forward declares
// Type namespace: UnityEngine.XR.Interaction.Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Forward declaring type: XRSocketInteractor
  class XRSocketInteractor;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::XR::Interaction::Toolkit::XRSocketInteractor);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::XR::Interaction::Toolkit::XRSocketInteractor*, "UnityEngine.XR.Interaction.Toolkit", "XRSocketInteractor");
// Type namespace: UnityEngine.XR.Interaction.Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Size: 0x1E8
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.XRSocketInteractor
  // [TokenAttribute] Offset: FFFFFFFF
  // [DisallowMultipleComponent] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: FFFFFFFF
  // [HelpURLAttribute] Offset: FFFFFFFF
  class XRSocketInteractor : public ::UnityEngine::XR::Interaction::Toolkit::XRBaseInteractor {
    public:
    // Nested type: ::UnityEngine::XR::Interaction::Toolkit::XRSocketInteractor::ShaderPropertyLookup
    struct ShaderPropertyLookup;
    // Nested type: ::UnityEngine::XR::Interaction::Toolkit::XRSocketInteractor::$UpdateCollidersAfterOnTriggerStay$d__40
    class $UpdateCollidersAfterOnTriggerStay$d__40;
    public:
    // private System.Boolean m_ShowInteractableHoverMeshes
    // Size: 0x1
    // Offset: 0x198
    bool m_ShowInteractableHoverMeshes;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_ShowInteractableHoverMeshes and: m_InteractableHoverMeshMaterial
    char __padding0[0x7] = {};
    // private UnityEngine.Material m_InteractableHoverMeshMaterial
    // Size: 0x8
    // Offset: 0x1A0
    ::UnityEngine::Material* m_InteractableHoverMeshMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private UnityEngine.Material m_InteractableCantHoverMeshMaterial
    // Size: 0x8
    // Offset: 0x1A8
    ::UnityEngine::Material* m_InteractableCantHoverMeshMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private System.Boolean m_SocketActive
    // Size: 0x1
    // Offset: 0x1B0
    bool m_SocketActive;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_SocketActive and: m_InteractableHoverScale
    char __padding3[0x3] = {};
    // private System.Single m_InteractableHoverScale
    // Size: 0x4
    // Offset: 0x1B4
    float m_InteractableHoverScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_RecycleDelayTime
    // Size: 0x4
    // Offset: 0x1B8
    float m_RecycleDelayTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_LastRemoveTime
    // Size: 0x4
    // Offset: 0x1BC
    float m_LastRemoveTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private readonly System.Collections.Generic.List`1<UnityEngine.XR.Interaction.Toolkit.IXRInteractable> <unsortedValidTargets>k__BackingField
    // Size: 0x8
    // Offset: 0x1C0
    ::System::Collections::Generic::List_1<::UnityEngine::XR::Interaction::Toolkit::IXRInteractable*>* unsortedValidTargets;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::XR::Interaction::Toolkit::IXRInteractable*>*) == 0x8);
    // private readonly System.Collections.Generic.HashSet`1<UnityEngine.Collider> m_StayedColliders
    // Size: 0x8
    // Offset: 0x1C8
    ::System::Collections::Generic::HashSet_1<::UnityEngine::Collider*>* m_StayedColliders;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::HashSet_1<::UnityEngine::Collider*>*) == 0x8);
    // private readonly UnityEngine.XR.Interaction.Toolkit.Utilities.TriggerContactMonitor m_TriggerContactMonitor
    // Size: 0x8
    // Offset: 0x1D0
    ::UnityEngine::XR::Interaction::Toolkit::Utilities::TriggerContactMonitor* m_TriggerContactMonitor;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::Utilities::TriggerContactMonitor*) == 0x8);
    // private readonly System.Collections.Generic.Dictionary`2<UnityEngine.XR.Interaction.Toolkit.IXRInteractable,System.ValueTuple`2<UnityEngine.MeshFilter,UnityEngine.Renderer>[]> m_MeshFilterCache
    // Size: 0x8
    // Offset: 0x1D8
    ::System::Collections::Generic::Dictionary_2<::UnityEngine::XR::Interaction::Toolkit::IXRInteractable*, ::ArrayW<::System::ValueTuple_2<::UnityEngine::MeshFilter*, ::UnityEngine::Renderer*>>>* m_MeshFilterCache;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::UnityEngine::XR::Interaction::Toolkit::IXRInteractable*, ::ArrayW<::System::ValueTuple_2<::UnityEngine::MeshFilter*, ::UnityEngine::Renderer*>>>*) == 0x8);
    // private System.Collections.IEnumerator m_UpdateCollidersAfterTriggerStay
    // Size: 0x8
    // Offset: 0x1E0
    ::System::Collections::IEnumerator* m_UpdateCollidersAfterTriggerStay;
    // Field size check
    static_assert(sizeof(::System::Collections::IEnumerator*) == 0x8);
    public:
    // Get static field: static private readonly System.Collections.Generic.List`1<UnityEngine.MeshFilter> s_MeshFilters
    static ::System::Collections::Generic::List_1<::UnityEngine::MeshFilter*>* _get_s_MeshFilters();
    // Set static field: static private readonly System.Collections.Generic.List`1<UnityEngine.MeshFilter> s_MeshFilters
    static void _set_s_MeshFilters(::System::Collections::Generic::List_1<::UnityEngine::MeshFilter*>* value);
    // Get static field: static private readonly UnityEngine.WaitForFixedUpdate s_WaitForFixedUpdate
    static ::UnityEngine::WaitForFixedUpdate* _get_s_WaitForFixedUpdate();
    // Set static field: static private readonly UnityEngine.WaitForFixedUpdate s_WaitForFixedUpdate
