// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.Rendering.Universal.ScriptableRenderPass
#include "UnityEngine/Rendering/Universal/ScriptableRenderPass.hpp"
// Including type: UnityEngine.Rendering.Universal.ShadowSliceData
#include "UnityEngine/Rendering/Universal/ShadowSliceData.hpp"
// Including type: UnityEngine.RectInt
#include "UnityEngine/RectInt.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::Rendering::Universal::Internal
namespace UnityEngine::Rendering::Universal::Internal {
}
// Forward declaring namespace: UnityEngine::Rendering
namespace UnityEngine::Rendering {
  // Forward declaring type: ProfilingSampler
  class ProfilingSampler;
  // Forward declaring type: RTHandle
  class RTHandle;
  // Forward declaring type: ScriptableRenderContext
  struct ScriptableRenderContext;
  // Forward declaring type: CommandBuffer
  class CommandBuffer;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: LightType
  struct LightType;
  // Forward declaring type: RenderTextureDescriptor
  struct RenderTextureDescriptor;
}
// Forward declaring namespace: UnityEngine::Rendering::Universal
namespace UnityEngine::Rendering::Universal {
  // Forward declaring type: RenderingData
  struct RenderingData;
  // Forward declaring type: LightData
  struct LightData;
}
// Forward declaring namespace: UnityEngine::Experimental::Rendering::RenderGraphModule
namespace UnityEngine::Experimental::Rendering::RenderGraphModule {
  // Forward declaring type: TextureHandle
  struct TextureHandle;
  // Forward declaring type: RenderGraph
  class RenderGraph;
}
// Completed forward declares
// Type namespace: UnityEngine.Rendering.Universal.Internal
namespace UnityEngine::Rendering::Universal::Internal {
  // Forward declaring type: AdditionalLightsShadowCasterPass
  class AdditionalLightsShadowCasterPass;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::Rendering::Universal::Internal::AdditionalLightsShadowCasterPass);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::Rendering::Universal::Internal::AdditionalLightsShadowCasterPass*, "UnityEngine.Rendering.Universal.Internal", "AdditionalLightsShadowCasterPass");
// Type namespace: UnityEngine.Rendering.Universal.Internal
namespace UnityEngine::Rendering::Universal::Internal {
  // WARNING Size may be invalid!
  // Autogenerated type: UnityEngine.Rendering.Universal.Internal.AdditionalLightsShadowCasterPass
  // [TokenAttribute] Offset: FFFFFFFF
  class AdditionalLightsShadowCasterPass : public ::UnityEngine::Rendering::Universal::ScriptableRenderPass {
    public:
    // Nested type: ::UnityEngine::Rendering::Universal::Internal::AdditionalLightsShadowCasterPass::AdditionalShadowsConstantBuffer
    class AdditionalShadowsConstantBuffer;
    // Nested type: ::UnityEngine::Rendering::Universal::Internal::AdditionalLightsShadowCasterPass::ShadowResolutionRequest
    struct ShadowResolutionRequest;
    // Nested type: ::UnityEngine::Rendering::Universal::Internal::AdditionalLightsShadowCasterPass::PassData
    class PassData;
    // Nested type: ::UnityEngine::Rendering::Universal::Internal::AdditionalLightsShadowCasterPass::$$c
    class $$c;
    // Size: 0x1C
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.Rendering.Universal.Internal.AdditionalLightsShadowCasterPass/ShadowResolutionRequest
    // [TokenAttribute] Offset: FFFFFFFF
    struct ShadowResolutionRequest/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.Int32 visibleLightIndex
      // Size: 0x4
      // Offset: 0x0
      int visibleLightIndex;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Int32 perLightShadowSliceIndex
      // Size: 0x4
      // Offset: 0x4
      int perLightShadowSliceIndex;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Int32 requestedResolution
      // Size: 0x4
      // Offset: 0x8
      int requestedResolution;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Boolean softShadow
      // Size: 0x1
      // Offset: 0xC
      bool softShadow;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // public System.Boolean pointLightShadow
      // Size: 0x1
      // Offset: 0xD
      bool pointLightShadow;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // Padding between fields: pointLightShadow and: offsetX
      char __padding4[0x2] = {};
      // public System.Int32 offsetX
      // Size: 0x4
      // Offset: 0x10
      int offsetX;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Int32 offsetY
      // Size: 0x4
      // Offset: 0x14
      int offsetY;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Int32 allocatedResolution
      // Size: 0x4
      // Offset: 0x18
      int allocatedResolution;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: ShadowResolutionRequest
      constexpr ShadowResolutionRequest(int visibleLightIndex_ = {}, int perLightShadowSliceIndex_ = {}, int requestedResolution_ = {}, bool softShadow_ = {}, bool pointLightShadow_ = {}, int offsetX_ = {}, int offsetY_ = {}, int allocatedResolution_ = {}) noexcept : visibleLightIndex{visibleLightIndex_}, perLightShadowSliceIndex{perLightShadowSliceIndex_}, requestedResolution{requestedResolution_}, softShadow{softShadow_}, pointLightShadow{pointLightShadow_}, offsetX{offsetX_}, offsetY{offsetY_}, allocatedResolution{allocatedResolution_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public System.Int32 visibleLightIndex
      [[deprecated("Use field access instead!")]] int& dyn_visibleLightIndex();
      // Get instance field reference: public System.Int32 perLightShadowSliceIndex
      [[deprecated("Use field access instead!")]] int& dyn_perLightShadowSliceIndex();
      // Get instance field reference: public System.Int32 requestedResolution
      [[deprecated("Use field access instead!")]] int& dyn_requestedResolution();
      // Get instance field reference: public System.Boolean softShadow
      [[deprecated("Use field access instead!")]] bool& dyn_softShadow();
      // Get instance field reference: public System.Boolean pointLightShadow
      [[deprecated("Use field access instead!")]] bool& dyn_pointLightShadow();
      // Get instance field reference: public System.Int32 offsetX
      [[deprecated("Use field access instead!")]] int& dyn_offsetX();
      // Get instance field reference: public System.Int32 offsetY
      [[deprecated("Use field access instead!")]] int& dyn_offsetY();
      // Get instance field reference: public System.Int32 allocatedResolution
      [[deprecated("Use field access instead!")]] int& dyn_allocatedResolution();
      // public System.Void .ctor(System.Int32 _visibleLightIndex, System.Int32 _perLightShadowSliceIndex, System.Int32 _requestedResolution, System.Boolean _softShadow, System.Boolean _pointLightShadow)
      // Offset: 0x530ACE0
      ShadowResolutionRequest(int _visibleLightIndex, int _perLightShadowSliceIndex, int _requestedResolution, bool _softShadow, bool _pointLightShadow);
    }; // UnityEngine.Rendering.Universal.Internal.AdditionalLightsShadowCasterPass/ShadowResolutionRequest
    #pragma pack(pop)
    static check_size<sizeof(AdditionalLightsShadowCasterPass::ShadowResolutionRequest), 24 + sizeof(int)> __UnityEngine_Rendering_Universal_Internal_AdditionalLightsShadowCasterPass_ShadowResolutionRequestSizeCheck;
    static_assert(sizeof(AdditionalLightsShadowCasterPass::ShadowResolutionRequest) == 0x1C);
    public:
    // private System.Boolean m_UseStructuredBuffer
    // Size: 0x1
    // Offset: 0xE0
    bool m_UseStructuredBuffer;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Int32 m_AdditionalLightsShadowmapID
    // Size: 0x4
    // Offset: 0xE4
    int m_AdditionalLightsShadowmapID;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // UnityEngine.Rendering.RTHandle m_AdditionalLightsShadowmapHandle
    // Size: 0x8
    // Offset: 0xE8
    ::UnityEngine::Rendering::RTHandle* m_AdditionalLightsShadowmapHandle;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::RTHandle*) == 0x8);
    // private System.Single m_MaxShadowDistanceSq
    // Size: 0x4
    // Offset: 0xF0
    float m_MaxShadowDistanceSq;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_CascadeBorder
    // Size: 0x4
    // Offset: 0xF4
    float m_CascadeBorder;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Rendering.Universal.ShadowSliceData[] m_AdditionalLightsShadowSlices
    // Size: 0x8
    // Offset: 0xF8
    ::ArrayW<::UnityEngine::Rendering::Universal::ShadowSliceData> m_AdditionalLightsShadowSlices;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Rendering::Universal::ShadowSliceData>) == 0x8);
    // private System.Int32[] m_VisibleLightIndexToAdditionalLightIndex
    // Size: 0x8
    // Offset: 0x100
    ::ArrayW<int> m_VisibleLightIndexToAdditionalLightIndex;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // private System.Int32[] m_AdditionalLightIndexToVisibleLightIndex
    // Size: 0x8
    // Offset: 0x108
    ::ArrayW<int> m_AdditionalLightIndexToVisibleLightIndex;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // private System.Collections.Generic.List`1<System.Int32> m_ShadowSliceToAdditionalLightIndex
    // Size: 0x8
    // Offset: 0x110
    ::System::Collections::Generic::List_1<int>* m_ShadowSliceToAdditionalLightIndex;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<int>*) == 0x8);
    // private System.Collections.Generic.List`1<System.Int32> m_GlobalShadowSliceIndexToPerLightShadowSliceIndex
    // Size: 0x8
    // Offset: 0x118
    ::System::Collections::Generic::List_1<int>* m_GlobalShadowSliceIndexToPerLightShadowSliceIndex;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<int>*) == 0x8);
    // private UnityEngine.Vector4[] m_AdditionalLightIndexToShadowParams
    // Size: 0x8
    // Offset: 0x120
    ::ArrayW<::UnityEngine::Vector4> m_AdditionalLightIndexToShadowParams;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector4>) == 0x8);
    // private UnityEngine.Matrix4x4[] m_AdditionalLightShadowSliceIndexTo_WorldShadowMatrix
    // Size: 0x8
    // Offset: 0x128
    ::ArrayW<::UnityEngine::Matrix4x4> m_AdditionalLightShadowSliceIndexTo_WorldShadowMatrix;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Matrix4x4>) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.Rendering.Universal.Internal.AdditionalLightsShadowCasterPass/ShadowResolutionRequest> m_ShadowResolutionRequests
    // Size: 0x8
    // Offset: 0x130
    ::System::Collections::Generic::List_1<::UnityEngine::Rendering::Universal::Internal::AdditionalLightsShadowCasterPass::ShadowResolutionRequest>* m_ShadowResolutionRequests;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Rendering::Universal::Internal::AdditionalLightsShadowCasterPass::ShadowResolutionRequest>*) == 0x8);
    // private System.Single[] m_VisibleLightIndexToCameraSquareDistance
    // Size: 0x8
    // Offset: 0x138
    ::ArrayW<float> m_VisibleLightIndexToCameraSquareDistance;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    // private UnityEngine.Rendering.Universal.Internal.AdditionalLightsShadowCasterPass/ShadowResolutionRequest[] m_SortedShadowResolutionRequests
    // Size: 0x8
    // Offset: 0x140
    ::ArrayW<::UnityEngine::Rendering::Universal::Internal::AdditionalLightsShadowCasterPass::ShadowResolutionRequest> m_SortedShadowResolutionRequests;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Rendering::Universal::Internal::AdditionalLightsShadowCasterPass::ShadowResolutionRequest>) == 0x8);
    // private System.Int32[] m_VisibleLightIndexToSortedShadowResolutionRequestsFirstSliceIndex
    // Size: 0x8
    // Offset: 0x148
    ::ArrayW<int> m_VisibleLightIndexToSortedShadowResolutionRequestsFirstSliceIndex;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.RectInt> m_UnusedAtlasSquareAreas
    // Size: 0x8
    // Offset: 0x150
    ::System::Collections::Generic::List_1<::UnityEngine::RectInt>* m_UnusedAtlasSquareAreas;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::RectInt>*) == 0x8);
    // private System.Boolean m_CreateEmptyShadowmap
    // Size: 0x1
    // Offset: 0x158
    bool m_CreateEmptyShadowmap;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Int32 renderTargetWidth
    // Size: 0x4
    // Offset: 0x15C
    int renderTargetWidth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 renderTargetHeight
    // Size: 0x4
    // Offset: 0x160
    int renderTargetHeight;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.Rendering.ProfilingSampler m_ProfilingSetupSampler
    // Size: 0x8
    // Offset: 0x168
    ::UnityEngine::Rendering::ProfilingSampler* m_ProfilingSetupSampler;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::ProfilingSampler*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.Int32,System.UInt64> m_ShadowRequestsHashes
    // Size: 0x8
    // Offset: 0x170
    ::System::Collections::Generic::Dictionary_2<int, uint64_t>* m_ShadowRequestsHashes;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<int, uint64_t>*) == 0x8);
    public:
    // Get static field: static public System.Int32 m_AdditionalShadowsBufferId
    static int _get_m_AdditionalShadowsBufferId();
    // Set static field: static public System.Int32 m_AdditionalShadowsBufferId
    static void _set_m_AdditionalShadowsBufferId(int value);
    // Get static field: static public System.Int32 m_AdditionalShadowsIndicesId
    static int _get_m_AdditionalShadowsIndicesId();
    // Set static field: static public System.Int32 m_AdditionalShadowsIndicesId
    static void _set_m_AdditionalShadowsIndicesId(int value);
    // Get static field: static private readonly UnityEngine.Vector4 c_DefaultShadowParams
    static ::UnityEngine::Vector4 _get_c_DefaultShadowParams();
