// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.Rendering.Universal.Internal.CopyDepthPass
#include "UnityEngine/Rendering/Universal/Internal/CopyDepthPass.hpp"
// Including type: UnityEngine.Experimental.Rendering.RenderGraphModule.TextureHandle
#include "UnityEngine/Experimental/Rendering/RenderGraphModule/TextureHandle.hpp"
// Including type: UnityEngine.Rendering.Universal.CameraData
#include "UnityEngine/Rendering/Universal/CameraData.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::Rendering
namespace UnityEngine::Rendering {
  // Forward declaring type: CommandBuffer
  class CommandBuffer;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Material
  class Material;
}
// Completed forward declares
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::Rendering::Universal::Internal::CopyDepthPass::PassData);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::Rendering::Universal::Internal::CopyDepthPass::PassData*, "UnityEngine.Rendering.Universal.Internal", "CopyDepthPass/PassData");
// Type namespace: UnityEngine.Rendering.Universal.Internal
namespace UnityEngine::Rendering::Universal::Internal {
  // Size: 0x246
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.Rendering.Universal.Internal.CopyDepthPass/PassData
  // [TokenAttribute] Offset: FFFFFFFF
  class CopyDepthPass::PassData : public ::Il2CppObject {
    public:
    public:
    // UnityEngine.Experimental.Rendering.RenderGraphModule.TextureHandle source
    // Size: 0x8
    // Offset: 0x10
    ::UnityEngine::Experimental::Rendering::RenderGraphModule::TextureHandle source;
    // Field size check
    static_assert(sizeof(::UnityEngine::Experimental::Rendering::RenderGraphModule::TextureHandle) == 0x8);
    // UnityEngine.Experimental.Rendering.RenderGraphModule.TextureHandle destination
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::Experimental::Rendering::RenderGraphModule::TextureHandle destination;
    // Field size check
    static_assert(sizeof(::UnityEngine::Experimental::Rendering::RenderGraphModule::TextureHandle) == 0x8);
    // UnityEngine.Rendering.CommandBuffer cmd
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::Rendering::CommandBuffer* cmd;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::CommandBuffer*) == 0x8);
    // UnityEngine.Rendering.Universal.CameraData cameraData
    // Size: 0x210
    // Offset: 0x28
    ::UnityEngine::Rendering::Universal::CameraData cameraData;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::CameraData) == 0x210);
    // UnityEngine.Material copyDepthMaterial
    // Size: 0x8
    // Offset: 0x238
    ::UnityEngine::Material* copyDepthMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // System.Int32 msaaSamples
    // Size: 0x4
    // Offset: 0x240
    int msaaSamples;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Boolean copyResolvedDepth
    // Size: 0x1
    // Offset: 0x244
    bool copyResolvedDepth;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // System.Boolean copyToDepth
    // Size: 0x1
    // Offset: 0x245
    bool copyToDepth;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get instance field reference: UnityEngine.Experimental.Rendering.RenderGraphModule.TextureHandle source
    [[deprecated("Use field access instead!")]] ::UnityEngine::Experimental::Rendering::RenderGraphModule::TextureHandle& dyn_source();
    // Get instance field reference: UnityEngine.Experimental.Rendering.RenderGraphModule.TextureHandle destination
    [[deprecated("Use field access instead!")]] ::UnityEngine::Experimental::Rendering::RenderGraphModule::TextureHandle& dyn_destination();
    // Get instance field reference: UnityEngine.Rendering.CommandBuffer cmd
    [[deprecated("Use field access instead!")]] ::UnityEngine::Rendering::CommandBuffer*& dyn_cmd();
    // Get instance field reference: UnityEngine.Rendering.Universal.CameraData cameraData
    [[deprecated("Use field access instead!")]] ::UnityEngine::Rendering::Universal::CameraData& dyn_cameraData();
    // Get instance field reference: UnityEngine.Material copyDepthMaterial
    [[deprecated("Use field access instead!")]] ::UnityEngine::Material*& dyn_copyDepthMaterial();
    // Get instance field reference: System.Int32 msaaSamples
    [[deprecated("Use field access instead!")]] int& dyn_msaaSamples();
    // Get instance field reference: System.Boolean copyResolvedDepth
    [[deprecated("Use field access instead!")]] bool& dyn_copyResolvedDepth();
    // Get instance field reference: System.Boolean copyToDepth
    [[deprecated("Use field access instead!")]] bool& dyn_copyToDepth();
    // public System.Void .ctor()
    // Offset: 0x5311B10
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static CopyDepthPass::PassData* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::Rendering::Universal::Internal::CopyDepthPass::PassData::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<CopyDepthPass::PassData*, creationType>()));
    }
  }; // UnityEngine.Rendering.Universal.Internal.CopyDepthPass/PassData
  #pragma pack(pop)
  static check_size<sizeof(CopyDepthPass::PassData), 581 + sizeof(bool)> __UnityEngine_Rendering_Universal_Internal_CopyDepthPass_PassDataSizeCheck;
  static_assert(sizeof(CopyDepthPass::PassData) == 0x246);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: UnityEngine::Rendering::Universal::Internal::CopyDepthPass::PassData::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
