// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.Rendering.Universal.RenderingLayerUtils/MaskSize
#include "UnityEngine/Rendering/Universal/RenderingLayerUtils_MaskSize.hpp"
// Including type: UnityEngine.Rendering.Universal.MixedLightingSetup
#include "UnityEngine/Rendering/Universal/MixedLightingSetup.hpp"
// Including type: UnityEngine.Experimental.Rendering.RenderGraphModule.TextureHandle
#include "UnityEngine/Experimental/Rendering/RenderGraphModule/TextureHandle.hpp"
// Including type: UnityEngine.Experimental.Rendering.GraphicsFormat
#include "UnityEngine/Experimental/Rendering/GraphicsFormat.hpp"
// Including type: Unity.Collections.NativeArray`1
#include "Unity/Collections/NativeArray_1.hpp"
// Including type: UnityEngine.Matrix4x4
#include "UnityEngine/Matrix4x4.hpp"
// Including type: UnityEngine.Rendering.VisibleLight
#include "UnityEngine/Rendering/VisibleLight.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::Rendering::Universal::Internal
namespace UnityEngine::Rendering::Universal::Internal {
  // Forward declaring type: AdditionalLightsShadowCasterPass
  class AdditionalLightsShadowCasterPass;
}
// Forward declaring namespace: UnityEngine::Rendering
namespace UnityEngine::Rendering {
  // Forward declaring type: ScriptableRenderContext
  struct ScriptableRenderContext;
  // Forward declaring type: RTHandle
  class RTHandle;
  // Forward declaring type: ProfilingSampler
  class ProfilingSampler;
  // Forward declaring type: CommandBuffer
  class CommandBuffer;
  // Forward declaring type: StencilState
  struct StencilState;
  // Forward declaring type: RenderStateBlock
  struct RenderStateBlock;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Mesh
  class Mesh;
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: RenderTextureDescriptor
  struct RenderTextureDescriptor;
  // Skipping declaration: LightType because it is already included!
}
// Forward declaring namespace: UnityEngine::Rendering::Universal
namespace UnityEngine::Rendering::Universal {
  // Forward declaring type: LightCookieManager
  class LightCookieManager;
  // Forward declaring type: RenderingData
  struct RenderingData;
  // Forward declaring type: LightData
  struct LightData;
}
// Completed forward declares
// Type namespace: UnityEngine.Rendering.Universal.Internal
namespace UnityEngine::Rendering::Universal::Internal {
  // Forward declaring type: DeferredLights
  class DeferredLights;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::Rendering::Universal::Internal::DeferredLights);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::Rendering::Universal::Internal::DeferredLights*, "UnityEngine.Rendering.Universal.Internal", "DeferredLights");
// Type namespace: UnityEngine.Rendering.Universal.Internal
namespace UnityEngine::Rendering::Universal::Internal {
  // WARNING Size may be invalid!
  // Autogenerated type: UnityEngine.Rendering.Universal.Internal.DeferredLights
  // [TokenAttribute] Offset: FFFFFFFF
  class DeferredLights : public ::Il2CppObject {
    public:
    // Nested type: ::UnityEngine::Rendering::Universal::Internal::DeferredLights::ShaderConstants
    class ShaderConstants;
    // Nested type: ::UnityEngine::Rendering::Universal::Internal::DeferredLights::StencilDeferredPasses
    struct StencilDeferredPasses;
    // Nested type: ::UnityEngine::Rendering::Universal::Internal::DeferredLights::InitParams
    struct InitParams;
    // Size: 0x10
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.Rendering.Universal.Internal.DeferredLights/InitParams
    // [TokenAttribute] Offset: FFFFFFFF
    struct InitParams/*, public ::System::ValueType*/ {
      public:
      public:
      // public UnityEngine.Material stencilDeferredMaterial
      // Size: 0x8
      // Offset: 0x0
      ::UnityEngine::Material* stencilDeferredMaterial;
      // Field size check
      static_assert(sizeof(::UnityEngine::Material*) == 0x8);
      // public UnityEngine.Rendering.Universal.LightCookieManager lightCookieManager
      // Size: 0x8
      // Offset: 0x8
      ::UnityEngine::Rendering::Universal::LightCookieManager* lightCookieManager;
      // Field size check
      static_assert(sizeof(::UnityEngine::Rendering::Universal::LightCookieManager*) == 0x8);
      public:
      // Creating value type constructor for type: InitParams
      constexpr InitParams(::UnityEngine::Material* stencilDeferredMaterial_ = {}, ::UnityEngine::Rendering::Universal::LightCookieManager* lightCookieManager_ = {}) noexcept : stencilDeferredMaterial{stencilDeferredMaterial_}, lightCookieManager{lightCookieManager_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public UnityEngine.Material stencilDeferredMaterial
      [[deprecated("Use field access instead!")]] ::UnityEngine::Material*& dyn_stencilDeferredMaterial();
      // Get instance field reference: public UnityEngine.Rendering.Universal.LightCookieManager lightCookieManager
      [[deprecated("Use field access instead!")]] ::UnityEngine::Rendering::Universal::LightCookieManager*& dyn_lightCookieManager();
    }; // UnityEngine.Rendering.Universal.Internal.DeferredLights/InitParams
    #pragma pack(pop)
    static check_size<sizeof(DeferredLights::InitParams), 8 + sizeof(::UnityEngine::Rendering::Universal::LightCookieManager*)> __UnityEngine_Rendering_Universal_Internal_DeferredLights_InitParamsSizeCheck;
    static_assert(sizeof(DeferredLights::InitParams) == 0x10);
    public:
    // private UnityEngine.Rendering.Universal.RenderingLayerUtils/MaskSize <RenderingLayerMaskSize>k__BackingField
    // Size: 0x4
    // Offset: 0x10
    ::UnityEngine::Rendering::Universal::RenderingLayerUtils::MaskSize RenderingLayerMaskSize;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::RenderingLayerUtils::MaskSize) == 0x4);
    // private System.Boolean <UseDecalLayers>k__BackingField
    // Size: 0x1
    // Offset: 0x14
    bool UseDecalLayers;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <UseRenderPass>k__BackingField
    // Size: 0x1
    // Offset: 0x15
    bool UseRenderPass;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <HasDepthPrepass>k__BackingField
    // Size: 0x1
    // Offset: 0x16
    bool HasDepthPrepass;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <HasNormalPrepass>k__BackingField
    // Size: 0x1
    // Offset: 0x17
    bool HasNormalPrepass;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <HasRenderingLayerPrepass>k__BackingField
    // Size: 0x1
    // Offset: 0x18
    bool HasRenderingLayerPrepass;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <IsOverlay>k__BackingField
    // Size: 0x1
    // Offset: 0x19
    bool IsOverlay;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_AccurateGbufferNormals
    // Size: 0x1
    // Offset: 0x1A
    bool m_AccurateGbufferNormals;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private UnityEngine.Rendering.Universal.MixedLightingSetup <MixedLightingSetup>k__BackingField
    // Size: 0x4
    // Offset: 0x1C
    ::UnityEngine::Rendering::Universal::MixedLightingSetup MixedLightingSetup;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::MixedLightingSetup) == 0x4);
    // private System.Boolean <UseJobSystem>k__BackingField
    // Size: 0x1
    // Offset: 0x20
    bool UseJobSystem;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Int32 <RenderWidth>k__BackingField
    // Size: 0x4
    // Offset: 0x24
    int RenderWidth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 <RenderHeight>k__BackingField
    // Size: 0x4
    // Offset: 0x28
    int RenderHeight;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.Rendering.RTHandle[] <GbufferAttachments>k__BackingField
    // Size: 0x8
    // Offset: 0x30
    ::ArrayW<::UnityEngine::Rendering::RTHandle*> GbufferAttachments;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Rendering::RTHandle*>) == 0x8);
    // private UnityEngine.Rendering.RTHandle[] GbufferRTHandles
    // Size: 0x8
    // Offset: 0x38
    ::ArrayW<::UnityEngine::Rendering::RTHandle*> GbufferRTHandles;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Rendering::RTHandle*>) == 0x8);
    // private UnityEngine.Experimental.Rendering.RenderGraphModule.TextureHandle[] <GbufferTextureHandles>k__BackingField
    // Size: 0x8
    // Offset: 0x40
    ::ArrayW<::UnityEngine::Experimental::Rendering::RenderGraphModule::TextureHandle> GbufferTextureHandles;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Experimental::Rendering::RenderGraphModule::TextureHandle>) == 0x8);
    // private UnityEngine.Rendering.RTHandle[] <DeferredInputAttachments>k__BackingField
    // Size: 0x8
    // Offset: 0x48
    ::ArrayW<::UnityEngine::Rendering::RTHandle*> DeferredInputAttachments;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Rendering::RTHandle*>) == 0x8);
    // private System.Boolean[] <DeferredInputIsTransient>k__BackingField
    // Size: 0x8
    // Offset: 0x50
    ::ArrayW<bool> DeferredInputIsTransient;
    // Field size check
    static_assert(sizeof(::ArrayW<bool>) == 0x8);
    // private UnityEngine.Rendering.RTHandle <DepthAttachment>k__BackingField
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::Rendering::RTHandle* DepthAttachment;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::RTHandle*) == 0x8);
    // private UnityEngine.Rendering.RTHandle <DepthCopyTexture>k__BackingField
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::Rendering::RTHandle* DepthCopyTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::RTHandle*) == 0x8);
    // private UnityEngine.Experimental.Rendering.GraphicsFormat[] <GbufferFormats>k__BackingField
    // Size: 0x8
    // Offset: 0x68
    ::ArrayW<::UnityEngine::Experimental::Rendering::GraphicsFormat> GbufferFormats;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Experimental::Rendering::GraphicsFormat>) == 0x8);
    // private UnityEngine.Rendering.RTHandle <DepthAttachmentHandle>k__BackingField
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::Rendering::RTHandle* DepthAttachmentHandle;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::RTHandle*) == 0x8);
    // private Unity.Collections.NativeArray`1<System.UInt16> m_stencilVisLights
    // Size: 0xFFFFFFFF
    // Offset: 0x78
    ::Unity::Collections::NativeArray_1<uint16_t> m_stencilVisLights;
    // private Unity.Collections.NativeArray`1<System.UInt16> m_stencilVisLightOffsets
    // Size: 0xFFFFFFFF
    // Offset: 0x88
    ::Unity::Collections::NativeArray_1<uint16_t> m_stencilVisLightOffsets;
    // private UnityEngine.Rendering.Universal.Internal.AdditionalLightsShadowCasterPass m_AdditionalLightsShadowCasterPass
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::Rendering::Universal::Internal::AdditionalLightsShadowCasterPass* m_AdditionalLightsShadowCasterPass;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::Internal::AdditionalLightsShadowCasterPass*) == 0x8);
    // private UnityEngine.Mesh m_SphereMesh
    // Size: 0x8
    // Offset: 0xA0
    ::UnityEngine::Mesh* m_SphereMesh;
    // Field size check
    static_assert(sizeof(::UnityEngine::Mesh*) == 0x8);
    // private UnityEngine.Mesh m_HemisphereMesh
    // Size: 0x8
    // Offset: 0xA8
    ::UnityEngine::Mesh* m_HemisphereMesh;
    // Field size check
    static_assert(sizeof(::UnityEngine::Mesh*) == 0x8);
    // private UnityEngine.Mesh m_FullscreenMesh
    // Size: 0x8
    // Offset: 0xB0
    ::UnityEngine::Mesh* m_FullscreenMesh;
    // Field size check
    static_assert(sizeof(::UnityEngine::Mesh*) == 0x8);
    // private UnityEngine.Material m_StencilDeferredMaterial
    // Size: 0x8
    // Offset: 0xB8
    ::UnityEngine::Material* m_StencilDeferredMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private System.Int32[] m_StencilDeferredPasses
    // Size: 0x8
    // Offset: 0xC0
    ::ArrayW<int> m_StencilDeferredPasses;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // private UnityEngine.Matrix4x4[] m_ScreenToWorld
    // Size: 0x8
    // Offset: 0xC8
    ::ArrayW<::UnityEngine::Matrix4x4> m_ScreenToWorld;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Matrix4x4>) == 0x8);
    // private UnityEngine.Rendering.ProfilingSampler m_ProfilingSamplerDeferredStencilPass
    // Size: 0x8
    // Offset: 0xD0
    ::UnityEngine::Rendering::ProfilingSampler* m_ProfilingSamplerDeferredStencilPass;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::ProfilingSampler*) == 0x8);
    // private UnityEngine.Rendering.ProfilingSampler m_ProfilingSamplerDeferredFogPass
    // Size: 0x8
    // Offset: 0xD8
    ::UnityEngine::Rendering::ProfilingSampler* m_ProfilingSamplerDeferredFogPass;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::ProfilingSampler*) == 0x8);
    // private UnityEngine.Rendering.ProfilingSampler m_ProfilingSamplerClearStencilPartialPass
    // Size: 0x8
    // Offset: 0xE0
    ::UnityEngine::Rendering::ProfilingSampler* m_ProfilingSamplerClearStencilPartialPass;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::ProfilingSampler*) == 0x8);
    // private UnityEngine.Rendering.Universal.LightCookieManager m_LightCookieManager
    // Size: 0x8
    // Offset: 0xE8
    ::UnityEngine::Rendering::Universal::LightCookieManager* m_LightCookieManager;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::LightCookieManager*) == 0x8);
    public:
    // Get static field: static readonly System.String[] k_GBufferNames
    static ::ArrayW<::StringW> _get_k_GBufferNames();
    // Set static field: static readonly System.String[] k_GBufferNames
    static void _set_k_GBufferNames(::ArrayW<::StringW> value);
    // Get static field: static private readonly System.String[] k_StencilDeferredPassNames
    static ::ArrayW<::StringW> _get_k_StencilDeferredPassNames();
    // Set static field: static private readonly System.String[] k_StencilDeferredPassNames
    static void _set_k_StencilDeferredPassNames(::ArrayW<::StringW> value);
    // Get static field: static private readonly System.UInt16 k_InvalidLightOffset
    static uint16_t _get_k_InvalidLightOffset();
