// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.Rendering.Universal.ScriptableRenderPass
#include "UnityEngine/Rendering/Universal/ScriptableRenderPass.hpp"
// Including type: UnityEngine.Rendering.FilteringSettings
#include "UnityEngine/Rendering/FilteringSettings.hpp"
// Including type: UnityEngine.LayerMask
#include "UnityEngine/LayerMask.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::Rendering::Universal::Internal
namespace UnityEngine::Rendering::Universal::Internal {
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine::Rendering
namespace UnityEngine::Rendering {
  // Forward declaring type: RTHandle
  class RTHandle;
  // Forward declaring type: ScriptableRenderContext
  struct ScriptableRenderContext;
  // Forward declaring type: CommandBuffer
  class CommandBuffer;
}
// Forward declaring namespace: UnityEngine::Experimental::Rendering
namespace UnityEngine::Experimental::Rendering {
  // Skipping declaration: GraphicsFormat because it is already included!
}
// Forward declaring namespace: UnityEngine::Rendering::Universal
namespace UnityEngine::Rendering::Universal {
  // Forward declaring type: RenderingData
  struct RenderingData;
}
// Forward declaring namespace: UnityEngine::Experimental::Rendering::RenderGraphModule
namespace UnityEngine::Experimental::Rendering::RenderGraphModule {
  // Forward declaring type: RenderGraph
  class RenderGraph;
  // Forward declaring type: TextureHandle
  struct TextureHandle;
}
// Completed forward declares
// Type namespace: UnityEngine.Rendering.Universal.Internal
namespace UnityEngine::Rendering::Universal::Internal {
  // Forward declaring type: DepthNormalOnlyPass
  class DepthNormalOnlyPass;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::Rendering::Universal::Internal::DepthNormalOnlyPass);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::Rendering::Universal::Internal::DepthNormalOnlyPass*, "UnityEngine.Rendering.Universal.Internal", "DepthNormalOnlyPass");
// Type namespace: UnityEngine.Rendering.Universal.Internal
namespace UnityEngine::Rendering::Universal::Internal {
  // WARNING Size may be invalid!
  // Autogenerated type: UnityEngine.Rendering.Universal.Internal.DepthNormalOnlyPass
  // [TokenAttribute] Offset: FFFFFFFF
  class DepthNormalOnlyPass : public ::UnityEngine::Rendering::Universal::ScriptableRenderPass {
    public:
    // Nested type: ::UnityEngine::Rendering::Universal::Internal::DepthNormalOnlyPass::PassData
    class PassData;
    // Nested type: ::UnityEngine::Rendering::Universal::Internal::DepthNormalOnlyPass::$$c
    class $$c;
    public:
    // private System.Collections.Generic.List`1<UnityEngine.Rendering.ShaderTagId> <shaderTagIds>k__BackingField
    // Size: 0x8
    // Offset: 0xE0
    ::System::Collections::Generic::List_1<::UnityEngine::Rendering::ShaderTagId>* shaderTagIds;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Rendering::ShaderTagId>*) == 0x8);
    // private UnityEngine.Rendering.RTHandle <depthHandle>k__BackingField
    // Size: 0x8
    // Offset: 0xE8
    ::UnityEngine::Rendering::RTHandle* depthHandle;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::RTHandle*) == 0x8);
    // private UnityEngine.Rendering.RTHandle <normalHandle>k__BackingField
    // Size: 0x8
    // Offset: 0xF0
    ::UnityEngine::Rendering::RTHandle* normalHandle;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::RTHandle*) == 0x8);
    // private UnityEngine.Rendering.RTHandle <renderingLayersHandle>k__BackingField
    // Size: 0x8
    // Offset: 0xF8
    ::UnityEngine::Rendering::RTHandle* renderingLayersHandle;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::RTHandle*) == 0x8);
    // private System.Boolean <enableRenderingLayers>k__BackingField
    // Size: 0x1
    // Offset: 0x100
    bool enableRenderingLayers;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private UnityEngine.Rendering.FilteringSettings m_FilteringSettings
    // Size: 0x18
    // Offset: 0x104
    ::UnityEngine::Rendering::FilteringSettings m_FilteringSettings;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::FilteringSettings) == 0x18);
    // private UnityEngine.Rendering.Universal.Internal.DepthNormalOnlyPass/PassData m_PassData
    // Size: 0x8
    // Offset: 0x120
    ::UnityEngine::Rendering::Universal::Internal::DepthNormalOnlyPass::PassData* m_PassData;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::Internal::DepthNormalOnlyPass::PassData*) == 0x8);
    public:
    // Get static field: static private readonly System.Collections.Generic.List`1<UnityEngine.Rendering.ShaderTagId> k_DepthNormals
    static ::System::Collections::Generic::List_1<::UnityEngine::Rendering::ShaderTagId>* _get_k_DepthNormals();
    // Set static field: static private readonly System.Collections.Generic.List`1<UnityEngine.Rendering.ShaderTagId> k_DepthNormals
    static void _set_k_DepthNormals(::System::Collections::Generic::List_1<::UnityEngine::Rendering::ShaderTagId>* value);
    // Get static field: static private readonly UnityEngine.Rendering.RTHandle[] k_ColorAttachment1
    static ::ArrayW<::UnityEngine::Rendering::RTHandle*> _get_k_ColorAttachment1();
    // Set static field: static private readonly UnityEngine.Rendering.RTHandle[] k_ColorAttachment1
    static void _set_k_ColorAttachment1(::ArrayW<::UnityEngine::Rendering::RTHandle*> value);
