// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.Rendering.Universal.Internal.FinalBlitPass
#include "UnityEngine/Rendering/Universal/Internal/FinalBlitPass.hpp"
// Including type: UnityEngine.Experimental.Rendering.RenderGraphModule.TextureHandle
#include "UnityEngine/Experimental/Rendering/RenderGraphModule/TextureHandle.hpp"
// Including type: UnityEngine.Vector4
#include "UnityEngine/Vector4.hpp"
// Including type: UnityEngine.Rendering.Universal.RenderingData
#include "UnityEngine/Rendering/Universal/RenderingData.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Material
  class Material;
}
// Completed forward declares
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::Rendering::Universal::Internal::FinalBlitPass::PassData);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::Rendering::Universal::Internal::FinalBlitPass::PassData*, "UnityEngine.Rendering.Universal.Internal", "FinalBlitPass/PassData");
// Type namespace: UnityEngine.Rendering.Universal.Internal
namespace UnityEngine::Rendering::Universal::Internal {
  // WARNING Size may be invalid!
  // Autogenerated type: UnityEngine.Rendering.Universal.Internal.FinalBlitPass/PassData
  // [TokenAttribute] Offset: FFFFFFFF
  class FinalBlitPass::PassData : public ::Il2CppObject {
    public:
    public:
    // UnityEngine.Material blitMaterial
    // Size: 0x8
    // Offset: 0x10
    ::UnityEngine::Material* blitMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // UnityEngine.Experimental.Rendering.RenderGraphModule.TextureHandle source
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::Experimental::Rendering::RenderGraphModule::TextureHandle source;
    // Field size check
    static_assert(sizeof(::UnityEngine::Experimental::Rendering::RenderGraphModule::TextureHandle) == 0x8);
    // UnityEngine.Experimental.Rendering.RenderGraphModule.TextureHandle destination
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::Experimental::Rendering::RenderGraphModule::TextureHandle destination;
    // Field size check
    static_assert(sizeof(::UnityEngine::Experimental::Rendering::RenderGraphModule::TextureHandle) == 0x8);
    // System.Int32 sourceID
    // Size: 0x4
    // Offset: 0x28
    int sourceID;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // UnityEngine.Vector4 hdrOutputLuminanceParams
    // Size: 0x10
    // Offset: 0x2C
    ::UnityEngine::Vector4 hdrOutputLuminanceParams;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector4) == 0x10);
    // UnityEngine.Rendering.Universal.RenderingData renderingData
    // Size: 0xFFFFFFFF
    // Offset: 0x40
    ::UnityEngine::Rendering::Universal::RenderingData renderingData;
    public:
    // Get instance field reference: UnityEngine.Material blitMaterial
    [[deprecated("Use field access instead!")]] ::UnityEngine::Material*& dyn_blitMaterial();
    // Get instance field reference: UnityEngine.Experimental.Rendering.RenderGraphModule.TextureHandle source
    [[deprecated("Use field access instead!")]] ::UnityEngine::Experimental::Rendering::RenderGraphModule::TextureHandle& dyn_source();
    // Get instance field reference: UnityEngine.Experimental.Rendering.RenderGraphModule.TextureHandle destination
    [[deprecated("Use field access instead!")]] ::UnityEngine::Experimental::Rendering::RenderGraphModule::TextureHandle& dyn_destination();
    // Get instance field reference: System.Int32 sourceID
    [[deprecated("Use field access instead!")]] int& dyn_sourceID();
    // Get instance field reference: UnityEngine.Vector4 hdrOutputLuminanceParams
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector4& dyn_hdrOutputLuminanceParams();
    // Get instance field reference: UnityEngine.Rendering.Universal.RenderingData renderingData
    [[deprecated("Use field access instead!")]] ::UnityEngine::Rendering::Universal::RenderingData& dyn_renderingData();
    // public System.Void .ctor()
    // Offset: 0x5317624
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static FinalBlitPass::PassData* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::Rendering::Universal::Internal::FinalBlitPass::PassData::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<FinalBlitPass::PassData*, creationType>()));
    }
  }; // UnityEngine.Rendering.Universal.Internal.FinalBlitPass/PassData
  // WARNING Not writing size check since size may be invalid!
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: UnityEngine::Rendering::Universal::Internal::FinalBlitPass::PassData::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
