// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.Rendering.Universal.MixedLightingSetup
#include "UnityEngine/Rendering/Universal/MixedLightingSetup.hpp"
// Including type: UnityEngine.Vector4
#include "UnityEngine/Vector4.hpp"
// Including type: Unity.Mathematics.int2
#include "Unity/Mathematics/int2.hpp"
// Including type: Unity.Jobs.JobHandle
#include "Unity/Jobs/JobHandle.hpp"
// Including type: Unity.Collections.NativeArray`1
#include "Unity/Collections/NativeArray_1.hpp"
// Including type: UnityEngine.Rendering.Universal.ReflectionProbeManager
#include "UnityEngine/Rendering/Universal/ReflectionProbeManager.hpp"
// Including type: UnityEngine.Rendering.VisibleLight
#include "UnityEngine/Rendering/VisibleLight.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::Rendering::Universal::Internal
namespace UnityEngine::Rendering::Universal::Internal {
}
// Forward declaring namespace: UnityEngine::Rendering::Universal
namespace UnityEngine::Rendering::Universal {
  // Forward declaring type: RenderingData
  struct RenderingData;
  // Forward declaring type: LightCookieManager
  class LightCookieManager;
  // Forward declaring type: LightData
  struct LightData;
  // Forward declaring type: ShEvalMode
  struct ShEvalMode;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GraphicsBuffer
  class GraphicsBuffer;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
}
// Forward declaring namespace: UnityEngine::Rendering
namespace UnityEngine::Rendering {
  // Forward declaring type: ProfilingSampler
  class ProfilingSampler;
  // Forward declaring type: ScriptableRenderContext
  struct ScriptableRenderContext;
  // Forward declaring type: CommandBuffer
  class CommandBuffer;
  // Forward declaring type: CullingResults
  struct CullingResults;
  // Forward declaring type: VisibleReflectionProbe
  struct VisibleReflectionProbe;
}
// Completed forward declares
// Type namespace: UnityEngine.Rendering.Universal.Internal
namespace UnityEngine::Rendering::Universal::Internal {
  // Forward declaring type: ForwardLights
  class ForwardLights;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::Rendering::Universal::Internal::ForwardLights);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::Rendering::Universal::Internal::ForwardLights*, "UnityEngine.Rendering.Universal.Internal", "ForwardLights");
// Type namespace: UnityEngine.Rendering.Universal.Internal
namespace UnityEngine::Rendering::Universal::Internal {
  // WARNING Size may be invalid!
  // Autogenerated type: UnityEngine.Rendering.Universal.Internal.ForwardLights
  // [TokenAttribute] Offset: FFFFFFFF
  class ForwardLights : public ::Il2CppObject {
    public:
    // Nested type: ::UnityEngine::Rendering::Universal::Internal::ForwardLights::LightConstantBuffer
    class LightConstantBuffer;
    // Nested type: ::UnityEngine::Rendering::Universal::Internal::ForwardLights::InitParams
    struct InitParams;
    // Size: 0x9
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.Rendering.Universal.Internal.ForwardLights/InitParams
    // [TokenAttribute] Offset: FFFFFFFF
    struct InitParams/*, public ::System::ValueType*/ {
      public:
      public:
      // public UnityEngine.Rendering.Universal.LightCookieManager lightCookieManager
      // Size: 0x8
      // Offset: 0x0
      ::UnityEngine::Rendering::Universal::LightCookieManager* lightCookieManager;
      // Field size check
      static_assert(sizeof(::UnityEngine::Rendering::Universal::LightCookieManager*) == 0x8);
      // public System.Boolean forwardPlus
      // Size: 0x1
      // Offset: 0x8
      bool forwardPlus;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      public:
      // Creating value type constructor for type: InitParams
      constexpr InitParams(::UnityEngine::Rendering::Universal::LightCookieManager* lightCookieManager_ = {}, bool forwardPlus_ = {}) noexcept : lightCookieManager{lightCookieManager_}, forwardPlus{forwardPlus_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public UnityEngine.Rendering.Universal.LightCookieManager lightCookieManager
      [[deprecated("Use field access instead!")]] ::UnityEngine::Rendering::Universal::LightCookieManager*& dyn_lightCookieManager();
      // Get instance field reference: public System.Boolean forwardPlus
      [[deprecated("Use field access instead!")]] bool& dyn_forwardPlus();
      // static UnityEngine.Rendering.Universal.Internal.ForwardLights/InitParams Create()
      // Offset: 0x530AEA4
      static ::UnityEngine::Rendering::Universal::Internal::ForwardLights::InitParams Create();
    }; // UnityEngine.Rendering.Universal.Internal.ForwardLights/InitParams
    #pragma pack(pop)
    static check_size<sizeof(ForwardLights::InitParams), 8 + sizeof(bool)> __UnityEngine_Rendering_Universal_Internal_ForwardLights_InitParamsSizeCheck;
    static_assert(sizeof(ForwardLights::InitParams) == 0x9);
    public:
    // private System.Int32 m_AdditionalLightsBufferId
    // Size: 0x4
    // Offset: 0x10
    int m_AdditionalLightsBufferId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_AdditionalLightsIndicesId
    // Size: 0x4
    // Offset: 0x14
    int m_AdditionalLightsIndicesId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.Rendering.Universal.MixedLightingSetup m_MixedLightingSetup
    // Size: 0x4
    // Offset: 0x18
    ::UnityEngine::Rendering::Universal::MixedLightingSetup m_MixedLightingSetup;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::MixedLightingSetup) == 0x4);
    // private UnityEngine.Vector4[] m_AdditionalLightPositions
    // Size: 0x8
    // Offset: 0x20
    ::ArrayW<::UnityEngine::Vector4> m_AdditionalLightPositions;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector4>) == 0x8);
    // private UnityEngine.Vector4[] m_AdditionalLightColors
    // Size: 0x8
    // Offset: 0x28
    ::ArrayW<::UnityEngine::Vector4> m_AdditionalLightColors;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector4>) == 0x8);
    // private UnityEngine.Vector4[] m_AdditionalLightAttenuations
    // Size: 0x8
    // Offset: 0x30
    ::ArrayW<::UnityEngine::Vector4> m_AdditionalLightAttenuations;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector4>) == 0x8);
    // private UnityEngine.Vector4[] m_AdditionalLightSpotDirections
    // Size: 0x8
    // Offset: 0x38
    ::ArrayW<::UnityEngine::Vector4> m_AdditionalLightSpotDirections;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector4>) == 0x8);
    // private UnityEngine.Vector4[] m_AdditionalLightOcclusionProbeChannels
    // Size: 0x8
    // Offset: 0x40
    ::ArrayW<::UnityEngine::Vector4> m_AdditionalLightOcclusionProbeChannels;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector4>) == 0x8);
    // private System.Single[] m_AdditionalLightsLayerMasks
    // Size: 0x8
    // Offset: 0x48
    ::ArrayW<float> m_AdditionalLightsLayerMasks;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    // private System.Boolean m_UseStructuredBuffer
    // Size: 0x1
    // Offset: 0x50
    bool m_UseStructuredBuffer;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_UseForwardPlus
    // Size: 0x1
    // Offset: 0x51
    bool m_UseForwardPlus;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Int32 m_DirectionalLightCount
    // Size: 0x4
    // Offset: 0x54
    int m_DirectionalLightCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_ActualTileWidth
    // Size: 0x4
    // Offset: 0x58
    int m_ActualTileWidth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private Unity.Mathematics.int2 m_TileResolution
    // Size: 0x8
    // Offset: 0x5C
    ::Unity::Mathematics::int2 m_TileResolution;
    // Field size check
    static_assert(sizeof(::Unity::Mathematics::int2) == 0x8);
    // private Unity.Jobs.JobHandle m_CullingHandle
    // Size: 0xC
    // Offset: 0x68
    ::Unity::Jobs::JobHandle m_CullingHandle;
    // Field size check
    static_assert(sizeof(::Unity::Jobs::JobHandle) == 0xC);
    // private Unity.Collections.NativeArray`1<System.UInt32> m_ZBins
    // Size: 0xFFFFFFFF
    // Offset: 0x78
    ::Unity::Collections::NativeArray_1<uint> m_ZBins;
    // private UnityEngine.GraphicsBuffer m_ZBinsBuffer
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::GraphicsBuffer* m_ZBinsBuffer;
    // Field size check
    static_assert(sizeof(::UnityEngine::GraphicsBuffer*) == 0x8);
    // private Unity.Collections.NativeArray`1<System.UInt32> m_TileMasks
    // Size: 0xFFFFFFFF
    // Offset: 0x90
    ::Unity::Collections::NativeArray_1<uint> m_TileMasks;
    // private UnityEngine.GraphicsBuffer m_TileMasksBuffer
    // Size: 0x8
    // Offset: 0xA0
    ::UnityEngine::GraphicsBuffer* m_TileMasksBuffer;
    // Field size check
    static_assert(sizeof(::UnityEngine::GraphicsBuffer*) == 0x8);
    // private UnityEngine.Rendering.Universal.LightCookieManager m_LightCookieManager
    // Size: 0x8
    // Offset: 0xA8
    ::UnityEngine::Rendering::Universal::LightCookieManager* m_LightCookieManager;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::LightCookieManager*) == 0x8);
    // private UnityEngine.Rendering.Universal.ReflectionProbeManager m_ReflectionProbeManager
    // Size: 0xFFFFFFFF
    // Offset: 0xB0
    ::UnityEngine::Rendering::Universal::ReflectionProbeManager m_ReflectionProbeManager;
    // private System.Int32 m_WordsPerTile
    // Size: 0x4
    // Offset: 0x130
    int m_WordsPerTile;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single m_ZBinScale
    // Size: 0x4
    // Offset: 0x134
    float m_ZBinScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_ZBinOffset
    // Size: 0x4
    // Offset: 0x138
    float m_ZBinOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 m_LightCount
    // Size: 0x4
    // Offset: 0x13C
    int m_LightCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_BinCount
    // Size: 0x4
    // Offset: 0x140
    int m_BinCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // static field const value: static private System.String k_SetupLightConstants
    static constexpr const char* k_SetupLightConstants = "Setup Light Constants";
    // Get static field: static private System.String k_SetupLightConstants
    static ::StringW _get_k_SetupLightConstants();
    // Set static field: static private System.String k_SetupLightConstants
    static void _set_k_SetupLightConstants(::StringW value);
    // Get static field: static private readonly UnityEngine.Rendering.ProfilingSampler m_ProfilingSampler
    static ::UnityEngine::Rendering::ProfilingSampler* _get_m_ProfilingSampler();
    // Set static field: static private readonly UnityEngine.Rendering.ProfilingSampler m_ProfilingSampler
    static void _set_m_ProfilingSampler(::UnityEngine::Rendering::ProfilingSampler* value);
