// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: Backtrace.Unity.Interfaces.IBacktraceDatabase
#include "Backtrace/Unity/Interfaces/IBacktraceDatabase.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Backtrace::Unity
namespace Backtrace::Unity {
  // Forward declaring type: BacktraceClient
  class BacktraceClient;
}
// Forward declaring namespace: Backtrace::Unity::Model
namespace Backtrace::Unity::Model {
  // Forward declaring type: BacktraceConfiguration
  class BacktraceConfiguration;
  // Forward declaring type: BacktraceData
  class BacktraceData;
  // Forward declaring type: BacktraceReport
  class BacktraceReport;
}
// Forward declaring namespace: Backtrace::Unity::Model::Breadcrumbs
namespace Backtrace::Unity::Model::Breadcrumbs {
  // Forward declaring type: BacktraceBreadcrumbs
  class BacktraceBreadcrumbs;
  // Forward declaring type: IBacktraceBreadcrumbs
  class IBacktraceBreadcrumbs;
}
// Forward declaring namespace: Backtrace::Unity::Model::Database
namespace Backtrace::Unity::Model::Database {
  // Forward declaring type: BacktraceDatabaseSettings
  class BacktraceDatabaseSettings;
  // Forward declaring type: BacktraceDatabaseRecord
  class BacktraceDatabaseRecord;
}
// Forward declaring namespace: Backtrace::Unity::Interfaces
namespace Backtrace::Unity::Interfaces {
  // Forward declaring type: IBacktraceApi
  class IBacktraceApi;
  // Forward declaring type: IBacktraceDatabaseContext
  class IBacktraceDatabaseContext;
  // Forward declaring type: IBacktraceDatabaseFileContext
  class IBacktraceDatabaseFileContext;
}
// Forward declaring namespace: Backtrace::Unity::Services
namespace Backtrace::Unity::Services {
  // Forward declaring type: ReportLimitWatcher
  class ReportLimitWatcher;
}
// Forward declaring namespace: Backtrace::Unity::Types
namespace Backtrace::Unity::Types {
  // Forward declaring type: DeduplicationStrategy
  struct DeduplicationStrategy;
  // Forward declaring type: MiniDumpType
  struct MiniDumpType;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: IEnumerable`1<T>
  template<typename T>
  class IEnumerable_1;
}
// Completed forward declares
// Type namespace: Backtrace.Unity
namespace Backtrace::Unity {
  // Forward declaring type: BacktraceDatabase
  class BacktraceDatabase;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Backtrace::Unity::BacktraceDatabase);
DEFINE_IL2CPP_ARG_TYPE(::Backtrace::Unity::BacktraceDatabase*, "Backtrace.Unity", "BacktraceDatabase");
// Type namespace: Backtrace.Unity
namespace Backtrace::Unity {
  // Size: 0x80
  #pragma pack(push, 1)
  // Autogenerated type: Backtrace.Unity.BacktraceDatabase
  // [TokenAttribute] Offset: FFFFFFFF
  // [RequireComponent] Offset: FFFFFFFF
  class BacktraceDatabase : public ::UnityEngine::MonoBehaviour/*, public ::Backtrace::Unity::Interfaces::IBacktraceDatabase*/ {
    public:
    // Nested type: ::Backtrace::Unity::BacktraceDatabase::$$c__DisplayClass59_0
    class $$c__DisplayClass59_0;
    // Nested type: ::Backtrace::Unity::BacktraceDatabase::$$c__DisplayClass60_0
    class $$c__DisplayClass60_0;
    public:
    // private System.Boolean _timerBackgroundWork
    // Size: 0x1
    // Offset: 0x20
    bool timerBackgroundWork;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: timerBackgroundWork and: Configuration
    char __padding0[0x7] = {};
    // public Backtrace.Unity.Model.BacktraceConfiguration Configuration
    // Size: 0x8
    // Offset: 0x28
    ::Backtrace::Unity::Model::BacktraceConfiguration* Configuration;
    // Field size check
    static_assert(sizeof(::Backtrace::Unity::Model::BacktraceConfiguration*) == 0x8);
    // private Backtrace.Unity.Model.Breadcrumbs.BacktraceBreadcrumbs _breadcrumbs
    // Size: 0x8
    // Offset: 0x30
    ::Backtrace::Unity::Model::Breadcrumbs::BacktraceBreadcrumbs* breadcrumbs;
    // Field size check
    static_assert(sizeof(::Backtrace::Unity::Model::Breadcrumbs::BacktraceBreadcrumbs*) == 0x8);
    // private Backtrace.Unity.BacktraceClient _client
    // Size: 0x8
    // Offset: 0x38
    ::Backtrace::Unity::BacktraceClient* client;
    // Field size check
    static_assert(sizeof(::Backtrace::Unity::BacktraceClient*) == 0x8);
    // private System.String <DatabasePath>k__BackingField
    // Size: 0x8
    // Offset: 0x40
    ::StringW DatabasePath;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private Backtrace.Unity.Model.Database.BacktraceDatabaseSettings <DatabaseSettings>k__BackingField
    // Size: 0x8
    // Offset: 0x48
    ::Backtrace::Unity::Model::Database::BacktraceDatabaseSettings* DatabaseSettings;
    // Field size check
    static_assert(sizeof(::Backtrace::Unity::Model::Database::BacktraceDatabaseSettings*) == 0x8);
    // private System.Single _lastConnection
    // Size: 0x4
    // Offset: 0x50
    float lastConnection;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: lastConnection and: BacktraceApi
    char __padding6[0x4] = {};
    // private Backtrace.Unity.Interfaces.IBacktraceApi <BacktraceApi>k__BackingField
    // Size: 0x8
    // Offset: 0x58
    ::Backtrace::Unity::Interfaces::IBacktraceApi* BacktraceApi;
    // Field size check
    static_assert(sizeof(::Backtrace::Unity::Interfaces::IBacktraceApi*) == 0x8);
    // private Backtrace.Unity.Interfaces.IBacktraceDatabaseContext <BacktraceDatabaseContext>k__BackingField
    // Size: 0x8
    // Offset: 0x60
    ::Backtrace::Unity::Interfaces::IBacktraceDatabaseContext* BacktraceDatabaseContext;
    // Field size check
    static_assert(sizeof(::Backtrace::Unity::Interfaces::IBacktraceDatabaseContext*) == 0x8);
    // private Backtrace.Unity.Interfaces.IBacktraceDatabaseFileContext <BacktraceDatabaseFileContext>k__BackingField
    // Size: 0x8
    // Offset: 0x68
    ::Backtrace::Unity::Interfaces::IBacktraceDatabaseFileContext* BacktraceDatabaseFileContext;
    // Field size check
    static_assert(sizeof(::Backtrace::Unity::Interfaces::IBacktraceDatabaseFileContext*) == 0x8);
    // private System.Boolean <Enable>k__BackingField
    // Size: 0x1
    // Offset: 0x70
    bool Enable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: Enable and: reportLimitWatcher
    char __padding10[0x7] = {};
    // private Backtrace.Unity.Services.ReportLimitWatcher _reportLimitWatcher
    // Size: 0x8
    // Offset: 0x78
    ::Backtrace::Unity::Services::ReportLimitWatcher* reportLimitWatcher;
    // Field size check
    static_assert(sizeof(::Backtrace::Unity::Services::ReportLimitWatcher*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::Backtrace::Unity::Interfaces::IBacktraceDatabase
    operator ::Backtrace::Unity::Interfaces::IBacktraceDatabase() noexcept {
      return *reinterpret_cast<::Backtrace::Unity::Interfaces::IBacktraceDatabase*>(this);
    }
    // Get static field: static System.Single LastFrameTime
    static float _get_LastFrameTime();
    // Set static field: static System.Single LastFrameTime
    static void _set_LastFrameTime(float value);
    // Get static field: static private Backtrace.Unity.BacktraceDatabase _instance
    static ::Backtrace::Unity::BacktraceDatabase* _get__instance();
    // Set static field: static private Backtrace.Unity.BacktraceDatabase _instance
