// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: Backtrace.Unity.Interfaces.IBacktraceClient
#include "Backtrace/Unity/Interfaces/IBacktraceClient.hpp"
// Including type: Backtrace.Unity.Types.ReportFilterType
#include "Backtrace/Unity/Types/ReportFilterType.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Backtrace::Unity
namespace Backtrace::Unity {
}
// Forward declaring namespace: Backtrace::Unity::Model
namespace Backtrace::Unity::Model {
  // Forward declaring type: BacktraceConfiguration
  class BacktraceConfiguration;
  // Forward declaring type: BacktraceReport
  class BacktraceReport;
  // Forward declaring type: BacktraceLogManager
  class BacktraceLogManager;
  // Forward declaring type: BacktraceData
  class BacktraceData;

namespace Backtrace::Unity::Services {
  // Forward declaring type: BacktraceMetrics
  class BacktraceMetrics;
  // Forward declaring type: ReportLimitWatcher
  class ReportLimitWatcher;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Random
  class Random;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Func`2<T, TResult>
  template<typename T, typename TResult>
  class Func_2;
  // Forward declaring type: Func`4<T1, T2, T3, TResult>
  template<typename T1, typename T2, typename T3, typename TResult>
  class Func_4;
  // Forward declaring type: Exception
  class Exception;
  // Forward declaring type: String
  class String;
  // Forward declaring type: Func`3<T1, T2, TResult>
  template<typename T1, typename T2, typename TResult>
  class Func_3;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Stack`1<T>
  template<typename T>
  class Stack_1;
  // Forward declaring type: HashSet`1<T>
  template<typename T>
  class HashSet_1;
  // Forward declaring type: IEnumerable`1<T>
  template<typename T>
  class IEnumerable_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: IList`1<T>
  template<typename T>
  class IList_1;
}
// Forward declaring namespace: Backtrace::Unity::Interfaces
namespace Backtrace::Unity::Interfaces {
  // Forward declaring type: IBacktraceDatabase
  class IBacktraceDatabase;
  // Forward declaring type: IBacktraceApi
  class IBacktraceApi;
  // Forward declaring type: IBacktraceMetrics
  class IBacktraceMetrics;
}
// Forward declaring namespace: Backtrace::Unity::Runtime::Native
namespace Backtrace::Unity::Runtime::Native {
  // Forward declaring type: INativeClient
  class INativeClient;
}
// Forward declaring namespace: System::Threading
namespace System::Threading {
  // Forward declaring type: Thread
  class Thread;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: LogType
  struct LogType;
}
// Completed forward declares
// Type namespace: Backtrace.Unity
namespace Backtrace::Unity {
  // Forward declaring type: BacktraceClient
  class BacktraceClient;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Backtrace::Unity::BacktraceClient);
DEFINE_IL2CPP_ARG_TYPE(::Backtrace::Unity::BacktraceClient*, "Backtrace.Unity", "BacktraceClient");
// Type namespace: Backtrace.Unity
namespace Backtrace::Unity {
  // Size: 0xB0
  #pragma pack(push, 1)
  // Autogenerated type: Backtrace.Unity.BacktraceClient
  // [TokenAttribute] Offset: FFFFFFFF
  // [DefaultMemberAttribute] Offset: FFFFFFFF
  class BacktraceClient : public ::UnityEngine::MonoBehaviour/*, public ::Backtrace::Unity::Interfaces::IBacktraceClient*/ {
    public:
    // Nested type: ::Backtrace::Unity::BacktraceClient::$$c
    class $$c;
    // Nested type: ::Backtrace::Unity::BacktraceClient::$$c__DisplayClass87_0
    class $$c__DisplayClass87_0;
    // Nested type: ::Backtrace::Unity::BacktraceClient::$CollectDataAndSend$d__87
    class $CollectDataAndSend$d__87;
    public:
    // public Backtrace.Unity.Model.BacktraceConfiguration Configuration
    // Size: 0x8
    // Offset: 0x20
    ::Backtrace::Unity::Model::BacktraceConfiguration* Configuration;
    // Field size check
    static_assert(sizeof(::Backtrace::Unity::Model::BacktraceConfiguration*) == 0x8);
    // private Backtrace.Unity.Model.Breadcrumbs.BacktraceBreadcrumbs _breadcrumbs
    // Size: 0x8
    // Offset: 0x28
    ::Backtrace::Unity::Model::Breadcrumbs::BacktraceBreadcrumbs* breadcrumbs;
    // Field size check
    static_assert(sizeof(::Backtrace::Unity::Model::Breadcrumbs::BacktraceBreadcrumbs*) == 0x8);
    // private System.Boolean <Enabled>k__BackingField
    // Size: 0x1
    // Offset: 0x30
    bool Enabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: Enabled and: attributeProvider
    char __padding2[0x7] = {};
    // private Backtrace.Unity.Model.JsonData.AttributeProvider _attributeProvider
    // Size: 0x8
    // Offset: 0x38
    ::Backtrace::Unity::Model::JsonData::AttributeProvider* attributeProvider;
    // Field size check
    static_assert(sizeof(::Backtrace::Unity::Model::JsonData::AttributeProvider*) == 0x8);
    // private Backtrace.Unity.Services.BacktraceMetrics _metrics
    // Size: 0x8
    // Offset: 0x40
    ::Backtrace::Unity::Services::BacktraceMetrics* metrics;
    // Field size check
    static_assert(sizeof(::Backtrace::Unity::Services::BacktraceMetrics*) == 0x8);
    // private System.Random _random
    // Size: 0x8
    // Offset: 0x48
    ::System::Random* random;
    // Field size check
    static_assert(sizeof(::System::Random*) == 0x8);
    // System.Collections.Generic.Stack`1<Backtrace.Unity.Model.BacktraceReport> BackgroundExceptions
    // Size: 0x8
    // Offset: 0x50
    ::System::Collections::Generic::Stack_1<::Backtrace::Unity::Model::BacktraceReport*>* BackgroundExceptions;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Stack_1<::Backtrace::Unity::Model::BacktraceReport*>*) == 0x8);
    // private System.Collections.Generic.HashSet`1<System.String> _clientReportAttachments
    // Size: 0x8
    // Offset: 0x58
    ::System::Collections::Generic::HashSet_1<::StringW>* clientReportAttachments;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::HashSet_1<::StringW>*) == 0x8);
    // public Backtrace.Unity.Interfaces.IBacktraceDatabase Database
    // Size: 0x8
    // Offset: 0x60
    ::Backtrace::Unity::Interfaces::IBacktraceDatabase* Database;
    // Field size check
    static_assert(sizeof(::Backtrace::Unity::Interfaces::IBacktraceDatabase*) == 0x8);
    // private Backtrace.Unity.Interfaces.IBacktraceApi _backtraceApi
    // Size: 0x8
    // Offset: 0x68
    ::Backtrace::Unity::Interfaces::IBacktraceApi* backtraceApi;
    // Field size check
    static_assert(sizeof(::Backtrace::Unity::Interfaces::IBacktraceApi*) == 0x8);
    // private Backtrace.Unity.Services.ReportLimitWatcher _reportLimitWatcher
    // Size: 0x8
    // Offset: 0x70
    ::Backtrace::Unity::Services::ReportLimitWatcher* reportLimitWatcher;
    // Field size check
    static_assert(sizeof(::Backtrace::Unity::Services::ReportLimitWatcher*) == 0x8);
    // private Backtrace.Unity.Model.BacktraceLogManager _backtraceLogManager
    // Size: 0x8
    // Offset: 0x78
    ::Backtrace::Unity::Model::BacktraceLogManager* backtraceLogManager;
    // Field size check
    static_assert(sizeof(::Backtrace::Unity::Model::BacktraceLogManager*) == 0x8);
    // System.Action`1<Backtrace.Unity.Model.BacktraceReport> _onClientReportLimitReached
    // Size: 0x8
    // Offset: 0x80
    ::System::Action_1<::Backtrace::Unity::Model::BacktraceReport*>* onClientReportLimitReached;
    // Field size check
    static_assert(sizeof(::System::Action_1<::Backtrace::Unity::Model::BacktraceReport*>*) == 0x8);
    // public System.Func`2<Backtrace.Unity.Model.BacktraceData,Backtrace.Unity.Model.BacktraceData> BeforeSend
    // Size: 0x8
    // Offset: 0x88
    ::System::Func_2<::Backtrace::Unity::Model::BacktraceData*, ::Backtrace::Unity::Model::BacktraceData*>* BeforeSend;
    // Field size check
    static_assert(sizeof(::System::Func_2<::Backtrace::Unity::Model::BacktraceData*, ::Backtrace::Unity::Model::BacktraceData*>*) == 0x8);
    // public System.Func`4<Backtrace.Unity.Types.ReportFilterType,System.Exception,System.String,System.Boolean> SkipReport
    // Size: 0x8
    // Offset: 0x90
    ::System::Func_4<::Backtrace::Unity::Types::ReportFilterType, ::System::Exception*, ::StringW, bool>* SkipReport;
    // Field size check
    static_assert(sizeof(::System::Func_4<::Backtrace::Unity::Types::ReportFilterType, ::System::Exception*, ::StringW, bool>*) == 0x8);
    // public System.Action`1<System.Exception> OnUnhandledApplicationException
    // Size: 0x8
    // Offset: 0x98
    ::System::Action_1<::System::Exception*>* OnUnhandledApplicationException;
    // Field size check
    static_assert(sizeof(::System::Action_1<::System::Exception*>*) == 0x8);
    // private Backtrace.Unity.Runtime.Native.INativeClient _nativeClient
    // Size: 0x8
    // Offset: 0xA0
    ::Backtrace::Unity::Runtime::Native::INativeClient* nativeClient;
    // Field size check
    static_assert(sizeof(::Backtrace::Unity::Runtime::Native::INativeClient*) == 0x8);
    // private System.Threading.Thread _current
    // Size: 0x8
    // Offset: 0xA8
    ::System::Threading::Thread* current;
    // Field size check
    static_assert(sizeof(::System::Threading::Thread*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::Backtrace::Unity::Interfaces::IBacktraceClient
    operator ::Backtrace::Unity::Interfaces::IBacktraceClient() noexcept {
      return *reinterpret_cast<::Backtrace::Unity::Interfaces::IBacktraceClient*>(this);
    }
    // static field const value: static public System.String VERSION
    static constexpr const char* _VERSION = "3.7.8";
    // Get static field: static public System.String VERSION
    static ::StringW _get_VERSION();
    // Set static field: static public System.String VERSION
    static void _set_VERSION(::StringW value);
    // static field const value: static System.String DefaultBacktraceGameObjectName
    static constexpr const char* DefaultBacktraceGameObjectName = "BacktraceClient";
