// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Backtrace.Unity.BacktraceClient
#include "Backtrace/Unity/BacktraceClient.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Backtrace::Unity::Model::Database
namespace Backtrace::Unity::Model::Database {
  // Forward declaring type: BacktraceDatabaseRecord
  class BacktraceDatabaseRecord;
}
// Forward declaring namespace: Backtrace::Unity::Model
namespace Backtrace::Unity::Model {
  // Forward declaring type: BacktraceReport
  class BacktraceReport;
  // Forward declaring type: BacktraceResult
  class BacktraceResult;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Completed forward declares
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Backtrace::Unity::BacktraceClient::$$c__DisplayClass87_0);
DEFINE_IL2CPP_ARG_TYPE(::Backtrace::Unity::BacktraceClient::$$c__DisplayClass87_0*, "Backtrace.Unity", "BacktraceClient/<>c__DisplayClass87_0");
// Type namespace: Backtrace.Unity
namespace Backtrace::Unity {
  // Size: 0x30
  #pragma pack(push, 1)
  // Autogenerated type: Backtrace.Unity.BacktraceClient/<>c__DisplayClass87_0
  // [TokenAttribute] Offset: FFFFFFFF
  // [CompilerGeneratedAttribute] Offset: FFFFFFFF
  class BacktraceClient::$$c__DisplayClass87_0 : public ::Il2CppObject {
    public:
    public:
    // public Backtrace.Unity.Model.Database.BacktraceDatabaseRecord record
    // Size: 0x8
    // Offset: 0x10
    ::Backtrace::Unity::Model::Database::BacktraceDatabaseRecord* record;
    // Field size check
    static_assert(sizeof(::Backtrace::Unity::Model::Database::BacktraceDatabaseRecord*) == 0x8);
    // public Backtrace.Unity.BacktraceClient <>4__this
    // Size: 0x8
    // Offset: 0x18
    ::Backtrace::Unity::BacktraceClient* $$4__this;
    // Field size check
    static_assert(sizeof(::Backtrace::Unity::BacktraceClient*) == 0x8);
    // public Backtrace.Unity.Model.BacktraceReport report
    // Size: 0x8
    // Offset: 0x20
    ::Backtrace::Unity::Model::BacktraceReport* report;
    // Field size check
    static_assert(sizeof(::Backtrace::Unity::Model::BacktraceReport*) == 0x8);
    // public System.Action`1<Backtrace.Unity.Model.BacktraceResult> sendCallback
    // Size: 0x8
    // Offset: 0x28
    ::System::Action_1<::Backtrace::Unity::Model::BacktraceResult*>* sendCallback;
    // Field size check
    static_assert(sizeof(::System::Action_1<::Backtrace::Unity::Model::BacktraceResult*>*) == 0x8);
    public:
    // Get instance field reference: public Backtrace.Unity.Model.Database.BacktraceDatabaseRecord record
    [[deprecated("Use field access instead!")]] ::Backtrace::Unity::Model::Database::BacktraceDatabaseRecord*& dyn_record();
    // Get instance field reference: public Backtrace.Unity.BacktraceClient <>4__this
    [[deprecated("Use field access instead!")]] ::Backtrace::Unity::BacktraceClient*& dyn_$$4__this();
    // Get instance field reference: public Backtrace.Unity.Model.BacktraceReport report
    [[deprecated("Use field access instead!")]] ::Backtrace::Unity::Model::BacktraceReport*& dyn_report();
    // Get instance field reference: public System.Action`1<Backtrace.Unity.Model.BacktraceResult> sendCallback
    [[deprecated("Use field access instead!")]] ::System::Action_1<::Backtrace::Unity::Model::BacktraceResult*>*& dyn_sendCallback();
    // public System.Void .ctor()
    // Offset: 0x2A53920
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static BacktraceClient::$$c__DisplayClass87_0* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::Backtrace::Unity::BacktraceClient::$$c__DisplayClass87_0::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<BacktraceClient::$$c__DisplayClass87_0*, creationType>()));
    }
    // System.Void <CollectDataAndSend>b__0(Backtrace.Unity.Model.BacktraceResult result)
    // Offset: 0x2A53928
    void $CollectDataAndSend$b__0(::Backtrace::Unity::Model::BacktraceResult* result);
  }; // Backtrace.Unity.BacktraceClient/<>c__DisplayClass87_0
  #pragma pack(pop)
  static check_size<sizeof(BacktraceClient::$$c__DisplayClass87_0), 40 + sizeof(::System::Action_1<::Backtrace::Unity::Model::BacktraceResult*>*)> __Backtrace_Unity_BacktraceClient_$$c__DisplayClass87_0SizeCheck;
  static_assert(sizeof(BacktraceClient::$$c__DisplayClass87_0) == 0x30);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Backtrace::Unity::BacktraceClient::$$c__DisplayClass87_0::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: Backtrace::Unity::BacktraceClient::$$c__DisplayClass87_0::$CollectDataAndSend$b__0
// Il2CppName: <CollectDataAndSend>b__0
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Backtrace::Unity::BacktraceClient::$$c__DisplayClass87_0::*)(::Backtrace::Unity::Model::BacktraceResult*)>(&Backtrace::Unity::BacktraceClient::$$c__DisplayClass87_0::$CollectDataAndSend$b__0)> {
  static const MethodInfo* get() {
    static auto* result = &::il2cpp_utils::GetClassFromName("Backtrace.Unity.Model", "BacktraceResult")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Backtrace::Unity::BacktraceClient::$$c__DisplayClass87_0*), "<CollectDataAndSend>b__0", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{result});
  }
};
