// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.XR.XRDisplaySubsystem
#include "UnityEngine/XR/XRDisplaySubsystem.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: System.IntPtr
#include "System/IntPtr.hpp"
// Completed includes
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::XR::XRDisplaySubsystem::XRMirrorViewBlitDesc, "UnityEngine.XR", "XRDisplaySubsystem/XRMirrorViewBlitDesc");
// Type namespace: UnityEngine.XR
namespace UnityEngine::XR {
  // Size: 0x10
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: UnityEngine.XR.XRDisplaySubsystem/XRMirrorViewBlitDesc
  // [TokenAttribute] Offset: FFFFFFFF
  // [NativeHeaderAttribute] Offset: FFFFFFFF
  struct XRDisplaySubsystem::XRMirrorViewBlitDesc/*, public ::System::ValueType*/ {
    public:
    public:
    // private System.IntPtr displaySubsystemInstance
    // Size: 0x8
    // Offset: 0x0
    ::System::IntPtr displaySubsystemInstance;
    // Field size check
    static_assert(sizeof(::System::IntPtr) == 0x8);
    // public System.Boolean nativeBlitAvailable
    // Size: 0x1
    // Offset: 0x8
    bool nativeBlitAvailable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean nativeBlitInvalidStates
    // Size: 0x1
    // Offset: 0x9
    bool nativeBlitInvalidStates;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: nativeBlitInvalidStates and: blitParamsCount
    char __padding2[0x2] = {};
    // public System.Int32 blitParamsCount
    // Size: 0x4
    // Offset: 0xC
    int blitParamsCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Creating value type constructor for type: XRMirrorViewBlitDesc
    constexpr XRMirrorViewBlitDesc(::System::IntPtr displaySubsystemInstance_ = {}, bool nativeBlitAvailable_ = {}, bool nativeBlitInvalidStates_ = {}, int blitParamsCount_ = {}) noexcept : displaySubsystemInstance{displaySubsystemInstance_}, nativeBlitAvailable{nativeBlitAvailable_}, nativeBlitInvalidStates{nativeBlitInvalidStates_}, blitParamsCount{blitParamsCount_} {}
    // Creating interface conversion operator: operator ::System::ValueType
    operator ::System::ValueType() noexcept {
      return *reinterpret_cast<::System::ValueType*>(this);
    }
    // Get instance field reference: private System.IntPtr displaySubsystemInstance
    [[deprecated("Use field access instead!")]] ::System::IntPtr& dyn_displaySubsystemInstance();
    // Get instance field reference: public System.Boolean nativeBlitAvailable
    [[deprecated("Use field access instead!")]] bool& dyn_nativeBlitAvailable();
    // Get instance field reference: public System.Boolean nativeBlitInvalidStates
    [[deprecated("Use field access instead!")]] bool& dyn_nativeBlitInvalidStates();
    // Get instance field reference: public System.Int32 blitParamsCount
    [[deprecated("Use field access instead!")]] int& dyn_blitParamsCount();
    // public System.Void GetBlitParameter(System.Int32 blitParameterIndex, out UnityEngine.XR.XRDisplaySubsystem/XRBlitParams blitParameter)
    // Offset: 0x5715AB8
    void GetBlitParameter(int blitParameterIndex, ByRef<::UnityEngine::XR::XRDisplaySubsystem::XRBlitParams> blitParameter);
    // static private System.Void GetBlitParameter_Injected(ref UnityEngine.XR.XRDisplaySubsystem/XRMirrorViewBlitDesc _unity_self, System.Int32 blitParameterIndex, out UnityEngine.XR.XRDisplaySubsystem/XRBlitParams blitParameter)
    // Offset: 0x5715B0C
    static void GetBlitParameter_Injected(ByRef<::UnityEngine::XR::XRDisplaySubsystem::XRMirrorViewBlitDesc> _unity_self, int blitParameterIndex, ByRef<::UnityEngine::XR::XRDisplaySubsystem::XRBlitParams> blitParameter);
  }; // UnityEngine.XR.XRDisplaySubsystem/XRMirrorViewBlitDesc
  #pragma pack(pop)
  static check_size<sizeof(XRDisplaySubsystem::XRMirrorViewBlitDesc), 12 + sizeof(int)> __UnityEngine_XR_XRDisplaySubsystem_XRMirrorViewBlitDescSizeCheck;
  static_assert(sizeof(XRDisplaySubsystem::XRMirrorViewBlitDesc) == 0x10);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: UnityEngine::XR::XRDisplaySubsystem::XRMirrorViewBlitDesc::GetBlitParameter
// Il2CppName: GetBlitParameter
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (UnityEngine::XR::XRDisplaySubsystem::XRMirrorViewBlitDesc::*)(int, ByRef<::UnityEngine::XR::XRDisplaySubsystem::XRBlitParams>)>(&UnityEngine::XR::XRDisplaySubsystem::XRMirrorViewBlitDesc::GetBlitParameter)> {
  static const MethodInfo* get() {
    static auto* blitParameterIndex = &::il2cpp_utils::GetClassFromName("System", "Int32")->byval_arg;
    static auto* blitParameter = &::il2cpp_utils::GetClassFromName("UnityEngine.XR", "XRDisplaySubsystem/XRBlitParams")->this_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::XR::XRDisplaySubsystem::XRMirrorViewBlitDesc), "GetBlitParameter", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{blitParameterIndex, blitParameter});
  }
};
// Writing MetadataGetter for method: UnityEngine::XR::XRDisplaySubsystem::XRMirrorViewBlitDesc::GetBlitParameter_Injected
// Il2CppName: GetBlitParameter_Injected
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (*)(ByRef<::UnityEngine::XR::XRDisplaySubsystem::XRMirrorViewBlitDesc>, int, ByRef<::UnityEngine::XR::XRDisplaySubsystem::XRBlitParams>)>(&UnityEngine::XR::XRDisplaySubsystem::XRMirrorViewBlitDesc::GetBlitParameter_Injected)> {
  static const MethodInfo* get() {
    static auto* _unity_self = &::il2cpp_utils::GetClassFromName("UnityEngine.XR", "XRDisplaySubsystem/XRMirrorViewBlitDesc")->this_arg;
    static auto* blitParameterIndex = &::il2cpp_utils::GetClassFromName("System", "Int32")->byval_arg;
    static auto* blitParameter = &::il2cpp_utils::GetClassFromName("UnityEngine.XR", "XRDisplaySubsystem/XRBlitParams")->this_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::XR::XRDisplaySubsystem::XRMirrorViewBlitDesc), "GetBlitParameter_Injected", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{_unity_self, blitParameterIndex, blitParameter});
  }
};
