// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: RectTransform
  class RectTransform;
  // Forward declaring type: AnimationCurve
  class AnimationCurve;
  // Forward declaring type: GameObject
  class GameObject;
}
// Completed forward declares
// Type namespace: Oculus.Interaction.Samples
namespace Oculus::Interaction::Samples {
  // Forward declaring type: CarouselView
  class CarouselView;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Oculus::Interaction::Samples::CarouselView);
DEFINE_IL2CPP_ARG_TYPE(::Oculus::Interaction::Samples::CarouselView*, "Oculus.Interaction.Samples", "CarouselView");
// Type namespace: Oculus.Interaction.Samples
namespace Oculus::Interaction::Samples {
  // Size: 0x48
  #pragma pack(push, 1)
  // Autogenerated type: Oculus.Interaction.Samples.CarouselView
  // [TokenAttribute] Offset: FFFFFFFF
  class CarouselView : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private UnityEngine.RectTransform _viewport
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::RectTransform* viewport;
    // Field size check
    static_assert(sizeof(::UnityEngine::RectTransform*) == 0x8);
    // private UnityEngine.RectTransform _content
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::RectTransform* content;
    // Field size check
    static_assert(sizeof(::UnityEngine::RectTransform*) == 0x8);
    // private UnityEngine.AnimationCurve _easeCurve
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::AnimationCurve* easeCurve;
    // Field size check
    static_assert(sizeof(::UnityEngine::AnimationCurve*) == 0x8);
    // private UnityEngine.GameObject _emptyCarouselVisuals
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::GameObject* emptyCarouselVisuals;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Int32 _currentChildIndex
    // Size: 0x4
    // Offset: 0x40
    int currentChildIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single _scrollVal
    // Size: 0x4
    // Offset: 0x44
    float scrollVal;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Get instance field reference: private UnityEngine.RectTransform _viewport
    [[deprecated("Use field access instead!")]] ::UnityEngine::RectTransform*& dyn__viewport();
    // Get instance field reference: private UnityEngine.RectTransform _content
    [[deprecated("Use field access instead!")]] ::UnityEngine::RectTransform*& dyn__content();
    // Get instance field reference: private UnityEngine.AnimationCurve _easeCurve
    [[deprecated("Use field access instead!")]] ::UnityEngine::AnimationCurve*& dyn__easeCurve();
    // Get instance field reference: private UnityEngine.GameObject _emptyCarouselVisuals
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn__emptyCarouselVisuals();
    // Get instance field reference: private System.Int32 _currentChildIndex
    [[deprecated("Use field access instead!")]] int& dyn__currentChildIndex();
    // Get instance field reference: private System.Single _scrollVal
    [[deprecated("Use field access instead!")]] float& dyn__scrollVal();
    // public System.Int32 get_CurrentChildIndex()
    // Offset: 0x479E064
    int get_CurrentChildIndex();
    // public UnityEngine.RectTransform get_ContentArea()
    // Offset: 0x479E06C
    ::UnityEngine::RectTransform* get_ContentArea();
    // protected System.Void Start()
    // Offset: 0x479E074
    void Start();
    // public System.Void ScrollRight()
    // Offset: 0x479E078
    void ScrollRight();
    // public System.Void ScrollLeft()
    // Offset: 0x479E3C8
    void ScrollLeft();
    // private UnityEngine.RectTransform GetCurrentChild()
    // Offset: 0x479E158
    ::UnityEngine::RectTransform* GetCurrentChild();
    // private System.Void ScrollToChild(UnityEngine.RectTransform child, System.Single amount01)
    // Offset: 0x479E1C4
    void ScrollToChild(::UnityEngine::RectTransform* child, float amount01);
    // protected System.Void Update()
    // Offset: 0x479E4CC
    void Update();
    // public System.Void .ctor()
    // Offset: 0x479E5D4
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static CarouselView* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::Samples::CarouselView::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<CarouselView*, creationType>()));
    }
  }; // Oculus.Interaction.Samples.CarouselView
  #pragma pack(pop)
  static check_size<sizeof(CarouselView), 68 + sizeof(float)> __Oculus_Interaction_Samples_CarouselViewSizeCheck;
  static_assert(sizeof(CarouselView) == 0x48);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Oculus::Interaction::Samples::CarouselView::get_CurrentChildIndex
// Il2CppName: get_CurrentChildIndex
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<int (Oculus::Interaction::Samples::CarouselView::*)()>(&Oculus::Interaction::Samples::CarouselView::get_CurrentChildIndex)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Oculus::Interaction::Samples::CarouselView*), "get_CurrentChildIndex", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Oculus::Interaction::Samples::CarouselView::get_ContentArea
// Il2CppName: get_ContentArea
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::RectTransform* (Oculus::Interaction::Samples::CarouselView::*)()>(&Oculus::Interaction::Samples::CarouselView::get_ContentArea)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Oculus::Interaction::Samples::CarouselView*), "get_ContentArea", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Oculus::Interaction::Samples::CarouselView::Start
// Il2CppName: Start
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Oculus::Interaction::Samples::CarouselView::*)()>(&Oculus::Interaction::Samples::CarouselView::Start)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Oculus::Interaction::Samples::CarouselView*), "Start", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Oculus::Interaction::Samples::CarouselView::ScrollRight
// Il2CppName: ScrollRight
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Oculus::Interaction::Samples::CarouselView::*)()>(&Oculus::Interaction::Samples::CarouselView::ScrollRight)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Oculus::Interaction::Samples::CarouselView*), "ScrollRight", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Oculus::Interaction::Samples::CarouselView::ScrollLeft
// Il2CppName: ScrollLeft
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Oculus::Interaction::Samples::CarouselView::*)()>(&Oculus::Interaction::Samples::CarouselView::ScrollLeft)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Oculus::Interaction::Samples::CarouselView*), "ScrollLeft", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Oculus::Interaction::Samples::CarouselView::GetCurrentChild
// Il2CppName: GetCurrentChild
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::RectTransform* (Oculus::Interaction::Samples::CarouselView::*)()>(&Oculus::Interaction::Samples::CarouselView::GetCurrentChild)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Oculus::Interaction::Samples::CarouselView*), "GetCurrentChild", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Oculus::Interaction::Samples::CarouselView::ScrollToChild
// Il2CppName: ScrollToChild
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Oculus::Interaction::Samples::CarouselView::*)(::UnityEngine::RectTransform*, float)>(&Oculus::Interaction::Samples::CarouselView::ScrollToChild)> {
  static const MethodInfo* get() {
    static auto* child = &::il2cpp_utils::GetClassFromName("UnityEngine", "RectTransform")->byval_arg;
    static auto* amount01 = &::il2cpp_utils::GetClassFromName("System", "Single")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Oculus::Interaction::Samples::CarouselView*), "ScrollToChild", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{child, amount01});
  }
};
// Writing MetadataGetter for method: Oculus::Interaction::Samples::CarouselView::Update
// Il2CppName: Update
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Oculus::Interaction::Samples::CarouselView::*)()>(&Oculus::Interaction::Samples::CarouselView::Update)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Oculus::Interaction::Samples::CarouselView*), "Update", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Oculus::Interaction::Samples::CarouselView::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
