// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Fusion::LagCompensation
namespace Fusion::LagCompensation {
  // Forward declaring type: Query
  struct Query;
  // Forward declaring type: PreProcessingDelegate
  class PreProcessingDelegate;
}
// Forward declaring namespace: Fusion
namespace Fusion {
  // Forward declaring type: PlayerRef
  struct PlayerRef;
  // Forward declaring type: HitOptions
  struct HitOptions;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: QueryTriggerInteraction
  struct QueryTriggerInteraction;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Nullable`1<T>
  template<typename T>
  struct Nullable_1;
}
// Completed forward declares
// Type namespace: Fusion.LagCompensation
namespace Fusion::LagCompensation {
  // Forward declaring type: RaycastQuery
  struct RaycastQuery;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::Fusion::LagCompensation::RaycastQuery, "Fusion.LagCompensation", "RaycastQuery");
// Type namespace: Fusion.LagCompensation
namespace Fusion::LagCompensation {
  // Size: 0x1D
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: Fusion.LagCompensation.RaycastQuery
  // [TokenAttribute] Offset: FFFFFFFF
  struct RaycastQuery/*, public ::System::ValueType*/ {
    public:
    public:
    // public UnityEngine.Vector3 Origin
    // Size: 0xC
    // Offset: 0x0
    ::UnityEngine::Vector3 Origin;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 Direction
    // Size: 0xC
    // Offset: 0xC
    ::UnityEngine::Vector3 Direction;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public System.Single Length
    // Size: 0x4
    // Offset: 0x18
    float Length;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean HitAll
    // Size: 0x1
    // Offset: 0x1C
    bool HitAll;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating value type constructor for type: RaycastQuery
    constexpr RaycastQuery(::UnityEngine::Vector3 Origin_ = {}, ::UnityEngine::Vector3 Direction_ = {}, float Length_ = {}, bool HitAll_ = {}) noexcept : Origin{Origin_}, Direction{Direction_}, Length{Length_}, HitAll{HitAll_} {}
    // Creating interface conversion operator: operator ::System::ValueType
    operator ::System::ValueType() noexcept {
      return *reinterpret_cast<::System::ValueType*>(this);
    }
    // Get instance field reference: public UnityEngine.Vector3 Origin
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_Origin();
    // Get instance field reference: public UnityEngine.Vector3 Direction
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_Direction();
    // Get instance field reference: public System.Single Length
    [[deprecated("Use field access instead!")]] float& dyn_Length();
    // Get instance field reference: public System.Boolean HitAll
    [[deprecated("Use field access instead!")]] bool& dyn_HitAll();
    // static public Fusion.LagCompensation.Query CreateQuery(UnityEngine.Vector3 origin, UnityEngine.Vector3 direction, System.Single length, System.Boolean hitAll, Fusion.PlayerRef player, System.Int32 layerMask, Fusion.HitOptions options, UnityEngine.QueryTriggerInteraction queryTriggerInteraction, Fusion.LagCompensation.PreProcessingDelegate preProcessRoots)
    // Offset: 0x2B89734
    static ::Fusion::LagCompensation::Query CreateQuery(::UnityEngine::Vector3 origin, ::UnityEngine::Vector3 direction, float length, bool hitAll, ::Fusion::PlayerRef player, int layerMask, ::Fusion::HitOptions options, ::UnityEngine::QueryTriggerInteraction queryTriggerInteraction, ::Fusion::LagCompensation::PreProcessingDelegate* preProcessRoots);
    // static public Fusion.LagCompensation.Query CreateQuery(UnityEngine.Vector3 origin, UnityEngine.Vector3 direction, System.Single length, System.Boolean hitAll, System.Int32 tick, System.Nullable`1<System.Int32> tickTo, System.Nullable`1<System.Single> alpha, System.Int32 layerMask, Fusion.HitOptions options, UnityEngine.QueryTriggerInteraction queryTriggerInteraction, Fusion.LagCompensation.PreProcessingDelegate preProcessRoots)
    // Offset: 0x2B89818
    static ::Fusion::LagCompensation::Query CreateQuery(::UnityEngine::Vector3 origin, ::UnityEngine::Vector3 direction, float length, bool hitAll, int tick, ::System::Nullable_1<int> tickTo, ::System::Nullable_1<float> alpha, int layerMask, ::Fusion::HitOptions options, ::UnityEngine::QueryTriggerInteraction queryTriggerInteraction, ::Fusion::LagCompensation::PreProcessingDelegate* preProcessRoots);
  }; // Fusion.LagCompensation.RaycastQuery
  #pragma pack(pop)
  static check_size<sizeof(RaycastQuery), 28 + sizeof(bool)> __Fusion_LagCompensation_RaycastQuerySizeCheck;
  static_assert(sizeof(RaycastQuery) == 0x1D);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Fusion::LagCompensation::RaycastQuery::CreateQuery
// Il2CppName: CreateQuery
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::Fusion::LagCompensation::Query (*)(::UnityEngine::Vector3, ::UnityEngine::Vector3, float, bool, ::Fusion::PlayerRef, int, ::Fusion::HitOptions, ::UnityEngine::QueryTriggerInteraction, ::Fusion::LagCompensation::PreProcessingDelegate*)>(&Fusion::LagCompensation::RaycastQuery::CreateQuery)> {
  static const MethodInfo* get() {
    static auto* origin = &::il2cpp_utils::GetClassFromName("UnityEngine", "Vector3")->byval_arg;
    static auto* direction = &::il2cpp_utils::GetClassFromName("UnityEngine", "Vector3")->byval_arg;
    static auto* length = &::il2cpp_utils::GetClassFromName("System", "Single")->byval_arg;
    static auto* hitAll = &::il2cpp_utils::GetClassFromName("System", "Boolean")->byval_arg;
    static auto* player = &::il2cpp_utils::GetClassFromName("Fusion", "PlayerRef")->byval_arg;
    static auto* layerMask = &::il2cpp_utils::GetClassFromName("System", "Int32")->byval_arg;
    static auto* options = &::il2cpp_utils::GetClassFromName("Fusion", "HitOptions")->byval_arg;
    static auto* queryTriggerInteraction = &::il2cpp_utils::GetClassFromName("UnityEngine", "QueryTriggerInteraction")->byval_arg;
    static auto* preProcessRoots = &::il2cpp_utils::GetClassFromName("Fusion.LagCompensation", "PreProcessingDelegate")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Fusion::LagCompensation::RaycastQuery), "CreateQuery", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{origin, direction, length, hitAll, player, layerMask, options, queryTriggerInteraction, preProcessRoots});
  }
};
// Writing MetadataGetter for method: Fusion::LagCompensation::RaycastQuery::CreateQuery
// Il2CppName: CreateQuery
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::Fusion::LagCompensation::Query (*)(::UnityEngine::Vector3, ::UnityEngine::Vector3, float, bool, int, ::System::Nullable_1<int>, ::System::Nullable_1<float>, int, ::Fusion::HitOptions, ::UnityEngine::QueryTriggerInteraction, ::Fusion::LagCompensation::PreProcessingDelegate*)>(&Fusion::LagCompensation::RaycastQuery::CreateQuery)> {
  static const MethodInfo* get() {
    static auto* origin = &::il2cpp_utils::GetClassFromName("UnityEngine", "Vector3")->byval_arg;
    static auto* direction = &::il2cpp_utils::GetClassFromName("UnityEngine", "Vector3")->byval_arg;
    static auto* length = &::il2cpp_utils::GetClassFromName("System", "Single")->byval_arg;
    static auto* hitAll = &::il2cpp_utils::GetClassFromName("System", "Boolean")->byval_arg;
    static auto* tick = &::il2cpp_utils::GetClassFromName("System", "Int32")->byval_arg;
    static auto* tickTo = &::il2cpp_utils::MakeGeneric(::il2cpp_utils::GetClassFromName("System", "Nullable`1"), ::std::vector<const Il2CppClass*>{::il2cpp_utils::GetClassFromName("System", "Int32")})->byval_arg;
    static auto* alpha = &::il2cpp_utils::MakeGeneric(::il2cpp_utils::GetClassFromName("System", "Nullable`1"), ::std::vector<const Il2CppClass*>{::il2cpp_utils::GetClassFromName("System", "Single")})->byval_arg;
    static auto* layerMask = &::il2cpp_utils::GetClassFromName("System", "Int32")->byval_arg;
    static auto* options = &::il2cpp_utils::GetClassFromName("Fusion", "HitOptions")->byval_arg;
    static auto* queryTriggerInteraction = &::il2cpp_utils::GetClassFromName("UnityEngine", "QueryTriggerInteraction")->byval_arg;
    static auto* preProcessRoots = &::il2cpp_utils::GetClassFromName("Fusion.LagCompensation", "PreProcessingDelegate")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Fusion::LagCompensation::RaycastQuery), "CreateQuery", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{origin, direction, length, hitAll, tick, tickTo, alpha, layerMask, options, queryTriggerInteraction, preProcessRoots});
  }
};
