// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.ISerializationCallbackReceiver
#include "UnityEngine/ISerializationCallbackReceiver.hpp"
// Including type: UnityEngine.InputSystem.InputActionProperty
#include "UnityEngine/InputSystem/InputActionProperty.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::InputSystem
namespace UnityEngine::InputSystem {
  // Forward declaring type: InputAction
  class InputAction;
  // Forward declaring type: CallbackContext
  struct InputAction_CallbackContext;
}
// Forward declaring namespace: UnityEngine::InputSystem::XR
namespace UnityEngine::InputSystem::XR {
  // Skipping declaration: TrackingType because it is already included!
  // Skipping declaration: UpdateType because it is already included!
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Camera
  class Camera;
}
// Completed forward declares
// Type namespace: UnityEngine.InputSystem.XR
namespace UnityEngine::InputSystem::XR {
  // Forward declaring type: TrackedPoseDriver
  class TrackedPoseDriver;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::InputSystem::XR::TrackedPoseDriver);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::InputSystem::XR::TrackedPoseDriver*, "UnityEngine.InputSystem.XR", "TrackedPoseDriver");
// Type namespace: UnityEngine.InputSystem.XR
namespace UnityEngine::InputSystem::XR {
  // Size: 0xB1
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.InputSystem.XR.TrackedPoseDriver
  // [TokenAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: FFFFFFFF
  class TrackedPoseDriver : public ::UnityEngine::MonoBehaviour/*, public ::UnityEngine::ISerializationCallbackReceiver*/ {
    public:
    // Nested type: ::UnityEngine::InputSystem::XR::TrackedPoseDriver::TrackingType
    struct TrackingType;
    // Nested type: ::UnityEngine::InputSystem::XR::TrackedPoseDriver::TrackingStates
    struct TrackingStates;
    // Nested type: ::UnityEngine::InputSystem::XR::TrackedPoseDriver::UpdateType
    struct UpdateType;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.InputSystem.XR.TrackedPoseDriver/TrackingType
    // [TokenAttribute] Offset: FFFFFFFF
    struct TrackingType/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: TrackingType
      constexpr TrackingType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.InputSystem.XR.TrackedPoseDriver/TrackingType RotationAndPosition
      static constexpr const int RotationAndPosition = 0;
      // Get static field: static public UnityEngine.InputSystem.XR.TrackedPoseDriver/TrackingType RotationAndPosition
      static ::UnityEngine::InputSystem::XR::TrackedPoseDriver::TrackingType _get_RotationAndPosition();
      // Set static field: static public UnityEngine.InputSystem.XR.TrackedPoseDriver/TrackingType RotationAndPosition
      static void _set_RotationAndPosition(::UnityEngine::InputSystem::XR::TrackedPoseDriver::TrackingType value);
      // static field const value: static public UnityEngine.InputSystem.XR.TrackedPoseDriver/TrackingType RotationOnly
      static constexpr const int RotationOnly = 1;
      // Get static field: static public UnityEngine.InputSystem.XR.TrackedPoseDriver/TrackingType RotationOnly
      static ::UnityEngine::InputSystem::XR::TrackedPoseDriver::TrackingType _get_RotationOnly();
      // Set static field: static public UnityEngine.InputSystem.XR.TrackedPoseDriver/TrackingType RotationOnly
      static void _set_RotationOnly(::UnityEngine::InputSystem::XR::TrackedPoseDriver::TrackingType value);
      // static field const value: static public UnityEngine.InputSystem.XR.TrackedPoseDriver/TrackingType PositionOnly
      static constexpr const int PositionOnly = 2;
      // Get static field: static public UnityEngine.InputSystem.XR.TrackedPoseDriver/TrackingType PositionOnly
      static ::UnityEngine::InputSystem::XR::TrackedPoseDriver::TrackingType _get_PositionOnly();
      // Set static field: static public UnityEngine.InputSystem.XR.TrackedPoseDriver/TrackingType PositionOnly
      static void _set_PositionOnly(::UnityEngine::InputSystem::XR::TrackedPoseDriver::TrackingType value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.InputSystem.XR.TrackedPoseDriver/TrackingType
    #pragma pack(pop)
    static check_size<sizeof(TrackedPoseDriver::TrackingType), 0 + sizeof(int)> __UnityEngine_InputSystem_XR_TrackedPoseDriver_TrackingTypeSizeCheck;
    static_assert(sizeof(TrackedPoseDriver::TrackingType) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.InputSystem.XR.TrackedPoseDriver/TrackingStates
    // [TokenAttribute] Offset: FFFFFFFF
    // [FlagsAttribute] Offset: FFFFFFFF
    struct TrackingStates/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: TrackingStates
      constexpr TrackingStates(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.InputSystem.XR.TrackedPoseDriver/TrackingStates None
      static constexpr const int None = 0;
      // Get static field: static public UnityEngine.InputSystem.XR.TrackedPoseDriver/TrackingStates None
      static ::UnityEngine::InputSystem::XR::TrackedPoseDriver::TrackingStates _get_None();
      // Set static field: static public UnityEngine.InputSystem.XR.TrackedPoseDriver/TrackingStates None
      static void _set_None(::UnityEngine::InputSystem::XR::TrackedPoseDriver::TrackingStates value);
      // static field const value: static public UnityEngine.InputSystem.XR.TrackedPoseDriver/TrackingStates Position
      static constexpr const int Position = 1;
      // Get static field: static public UnityEngine.InputSystem.XR.TrackedPoseDriver/TrackingStates Position
      static ::UnityEngine::InputSystem::XR::TrackedPoseDriver::TrackingStates _get_Position();
      // Set static field: static public UnityEngine.InputSystem.XR.TrackedPoseDriver/TrackingStates Position
      static void _set_Position(::UnityEngine::InputSystem::XR::TrackedPoseDriver::TrackingStates value);
      // static field const value: static public UnityEngine.InputSystem.XR.TrackedPoseDriver/TrackingStates Rotation
      static constexpr const int Rotation = 2;
      // Get static field: static public UnityEngine.InputSystem.XR.TrackedPoseDriver/TrackingStates Rotation
      static ::UnityEngine::InputSystem::XR::TrackedPoseDriver::TrackingStates _get_Rotation();
      // Set static field: static public UnityEngine.InputSystem.XR.TrackedPoseDriver/TrackingStates Rotation
      static void _set_Rotation(::UnityEngine::InputSystem::XR::TrackedPoseDriver::TrackingStates value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.InputSystem.XR.TrackedPoseDriver/TrackingStates
    #pragma pack(pop)
    static check_size<sizeof(TrackedPoseDriver::TrackingStates), 0 + sizeof(int)> __UnityEngine_InputSystem_XR_TrackedPoseDriver_TrackingStatesSizeCheck;
    static_assert(sizeof(TrackedPoseDriver::TrackingStates) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.InputSystem.XR.TrackedPoseDriver/UpdateType
    // [TokenAttribute] Offset: FFFFFFFF
    struct UpdateType/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: UpdateType
      constexpr UpdateType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.InputSystem.XR.TrackedPoseDriver/UpdateType UpdateAndBeforeRender
      static constexpr const int UpdateAndBeforeRender = 0;
      // Get static field: static public UnityEngine.InputSystem.XR.TrackedPoseDriver/UpdateType UpdateAndBeforeRender
      static ::UnityEngine::InputSystem::XR::TrackedPoseDriver::UpdateType _get_UpdateAndBeforeRender();
      // Set static field: static public UnityEngine.InputSystem.XR.TrackedPoseDriver/UpdateType UpdateAndBeforeRender
      static void _set_UpdateAndBeforeRender(::UnityEngine::InputSystem::XR::TrackedPoseDriver::UpdateType value);
      // static field const value: static public UnityEngine.InputSystem.XR.TrackedPoseDriver/UpdateType Update
      static constexpr const int Update = 1;
      // Get static field: static public UnityEngine.InputSystem.XR.TrackedPoseDriver/UpdateType Update
      static ::UnityEngine::InputSystem::XR::TrackedPoseDriver::UpdateType _get_Update();
      // Set static field: static public UnityEngine.InputSystem.XR.TrackedPoseDriver/UpdateType Update
      static void _set_Update(::UnityEngine::InputSystem::XR::TrackedPoseDriver::UpdateType value);
      // static field const value: static public UnityEngine.InputSystem.XR.TrackedPoseDriver/UpdateType BeforeRender
      static constexpr const int BeforeRender = 2;
      // Get static field: static public UnityEngine.InputSystem.XR.TrackedPoseDriver/UpdateType BeforeRender
      static ::UnityEngine::InputSystem::XR::TrackedPoseDriver::UpdateType _get_BeforeRender();
      // Set static field: static public UnityEngine.InputSystem.XR.TrackedPoseDriver/UpdateType BeforeRender
      static void _set_BeforeRender(::UnityEngine::InputSystem::XR::TrackedPoseDriver::UpdateType value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.InputSystem.XR.TrackedPoseDriver/UpdateType
    #pragma pack(pop)
    static check_size<sizeof(TrackedPoseDriver::UpdateType), 0 + sizeof(int)> __UnityEngine_InputSystem_XR_TrackedPoseDriver_UpdateTypeSizeCheck;
    static_assert(sizeof(TrackedPoseDriver::UpdateType) == 0x4);
    public:
    // private UnityEngine.InputSystem.XR.TrackedPoseDriver/TrackingType m_TrackingType
    // Size: 0x4
    // Offset: 0x20
    ::UnityEngine::InputSystem::XR::TrackedPoseDriver::TrackingType m_TrackingType;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::XR::TrackedPoseDriver::TrackingType) == 0x4);
    // private UnityEngine.InputSystem.XR.TrackedPoseDriver/UpdateType m_UpdateType
    // Size: 0x4
    // Offset: 0x24
    ::UnityEngine::InputSystem::XR::TrackedPoseDriver::UpdateType m_UpdateType;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::XR::TrackedPoseDriver::UpdateType) == 0x4);
    // private System.Boolean m_IgnoreTrackingState
    // Size: 0x1
    // Offset: 0x28
    bool m_IgnoreTrackingState;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_IgnoreTrackingState and: m_PositionInput
    char __padding2[0x7] = {};
    // private UnityEngine.InputSystem.InputActionProperty m_PositionInput
    // Size: 0x18
    // Offset: 0x30
    ::UnityEngine::InputSystem::InputActionProperty m_PositionInput;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionProperty) == 0x18);
    // private UnityEngine.InputSystem.InputActionProperty m_RotationInput
    // Size: 0x18
    // Offset: 0x48
    ::UnityEngine::InputSystem::InputActionProperty m_RotationInput;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionProperty) == 0x18);
    // private UnityEngine.InputSystem.InputActionProperty m_TrackingStateInput
    // Size: 0x18
    // Offset: 0x60
    ::UnityEngine::InputSystem::InputActionProperty m_TrackingStateInput;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionProperty) == 0x18);
    // private UnityEngine.Vector3 m_CurrentPosition
    // Size: 0xC
    // Offset: 0x78
    ::UnityEngine::Vector3 m_CurrentPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Quaternion m_CurrentRotation
    // Size: 0x10
    // Offset: 0x84
    ::UnityEngine::Quaternion m_CurrentRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.InputSystem.XR.TrackedPoseDriver/TrackingStates m_CurrentTrackingState
    // Size: 0x4
    // Offset: 0x94
    ::UnityEngine::InputSystem::XR::TrackedPoseDriver::TrackingStates m_CurrentTrackingState;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::XR::TrackedPoseDriver::TrackingStates) == 0x4);
    // private System.Boolean m_RotationBound
    // Size: 0x1
    // Offset: 0x98
    bool m_RotationBound;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_PositionBound
    // Size: 0x1
    // Offset: 0x99
    bool m_PositionBound;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_TrackingStateBound
    // Size: 0x1
    // Offset: 0x9A
    bool m_TrackingStateBound;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_IsFirstUpdate
    // Size: 0x1
    // Offset: 0x9B
    bool m_IsFirstUpdate;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_IsFirstUpdate and: m_PositionAction
    char __padding12[0x4] = {};
    // private UnityEngine.InputSystem.InputAction m_PositionAction
    // Size: 0x8
    // Offset: 0xA0
    ::UnityEngine::InputSystem::InputAction* m_PositionAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputAction*) == 0x8);
    // private UnityEngine.InputSystem.InputAction m_RotationAction
    // Size: 0x8
    // Offset: 0xA8
    ::UnityEngine::InputSystem::InputAction* m_RotationAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputAction*) == 0x8);
    // private System.Boolean m_HasMigratedActions
    // Size: 0x1
    // Offset: 0xB0
    bool m_HasMigratedActions;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating interface conversion operator: operator ::UnityEngine::ISerializationCallbackReceiver
    operator ::UnityEngine::ISerializationCallbackReceiver() noexcept {
      return *reinterpret_cast<::UnityEngine::ISerializationCallbackReceiver*>(this);
    }
    // Get instance field reference: private UnityEngine.InputSystem.XR.TrackedPoseDriver/TrackingType m_TrackingType
    [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::XR::TrackedPoseDriver::TrackingType& dyn_m_TrackingType();
    // Get instance field reference: private UnityEngine.InputSystem.XR.TrackedPoseDriver/UpdateType m_UpdateType
    [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::XR::TrackedPoseDriver::UpdateType& dyn_m_UpdateType();
    // Get instance field reference: private System.Boolean m_IgnoreTrackingState
