// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.IDisposable
#include "System/IDisposable.hpp"
// Including type: UnityEngine.UIElements.UIR.TextureEntry
#include "UnityEngine/UIElements/UIR/TextureEntry.hpp"
// Including type: UnityEngine.UIElements.UIR.ChainBuilderStats
#include "UnityEngine/UIElements/UIR/ChainBuilderStats.hpp"
// Including type: UnityEngine.UIElements.Vertex
#include "UnityEngine/UIElements/Vertex.hpp"
// Including type: UnityEngine.UIElements.UIR.UIRVEShaderInfoAllocator
#include "UnityEngine/UIElements/UIR/UIRVEShaderInfoAllocator.hpp"
// Including type: Unity.Profiling.ProfilerMarker
#include "Unity/Profiling/ProfilerMarker.hpp"
// Including type: Unity.Collections.NativeSlice`1
#include "Unity/Collections/NativeSlice_1.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UIElements::UIR
namespace UnityEngine::UIElements::UIR {
  // Forward declaring type: LinkedPool`1<T>
  template<typename T>
  class LinkedPool_1;
  // Forward declaring type: RenderChainCommand
  class RenderChainCommand;
  // Forward declaring type: BasicNodePool`1<T>
  template<typename T>
  class BasicNodePool_1;
  // Forward declaring type: OpacityIdAccelerator
  class OpacityIdAccelerator;
  // Forward declaring type: UIRenderDevice
  class UIRenderDevice;
  // Forward declaring type: VectorImageManager
  class VectorImageManager;
  // Forward declaring type: TempAllocator`1<T>
  template<typename T>
  class TempAllocator_1;
  // Forward declaring type: JobManager
  class JobManager;
  // Skipping declaration: RenderNodeData because it is already included!
  // Forward declaring type: RenderDataDirtyTypes
  struct RenderDataDirtyTypes;
  // Forward declaring type: RenderDataDirtyTypeClasses
  struct RenderDataDirtyTypeClasses;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Shader
  class Shader;
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: Camera
  class Camera;
  // Forward declaring type: Texture
  class Texture;
  // Forward declaring type: MaterialPropertyBlock
  class MaterialPropertyBlock;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine::UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: TextureRegistry
  class TextureRegistry;
  // Forward declaring type: BaseVisualElementPanel
  class BaseVisualElementPanel;
  // Forward declaring type: AtlasBase
  class AtlasBase;
  // Forward declaring type: VisualElement
  class VisualElement;
  // Forward declaring type: BaseRuntimePanel
  class BaseRuntimePanel;
  // Skipping declaration: TextureId because it is already included!
}
// Forward declaring namespace: UnityEngine::UIElements::UIR::Implementation
namespace UnityEngine::UIElements::UIR::Implementation {
  // Forward declaring type: UIRStylePainter
  class UIRStylePainter;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
  // Skipping declaration: IntPtr because it is already included!
}
// Completed forward declares
// Type namespace: UnityEngine.UIElements.UIR
namespace UnityEngine::UIElements::UIR {
  // Forward declaring type: RenderChain
  class RenderChain;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::UIElements::UIR::RenderChain);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UIElements::UIR::RenderChain*, "UnityEngine.UIElements.UIR", "RenderChain");
// Type namespace: UnityEngine.UIElements.UIR
namespace UnityEngine::UIElements::UIR {
  // WARNING Size may be invalid!
  // Autogenerated type: UnityEngine.UIElements.UIR.RenderChain
  // [TokenAttribute] Offset: FFFFFFFF
  class RenderChain : public ::Il2CppObject/*, public ::System::IDisposable*/ {
    public:
    // Nested type: ::UnityEngine::UIElements::UIR::RenderChain::DepthOrderedDirtyTracking
    struct DepthOrderedDirtyTracking;
    // Nested type: ::UnityEngine::UIElements::UIR::RenderChain::RenderChainStaticIndexAllocator
    struct RenderChainStaticIndexAllocator;
    // Nested type: ::UnityEngine::UIElements::UIR::RenderChain::RenderNodeData
    struct RenderNodeData;
    // Nested type: ::UnityEngine::UIElements::UIR::RenderChain::$$c
    class $$c;
    // Size: 0x24
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.UIElements.UIR.RenderChain/DepthOrderedDirtyTracking
    // [TokenAttribute] Offset: FFFFFFFF
    struct DepthOrderedDirtyTracking/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.Collections.Generic.List`1<UnityEngine.UIElements.VisualElement> heads
      // Size: 0x8
      // Offset: 0x0
      ::System::Collections::Generic::List_1<::UnityEngine::UIElements::VisualElement*>* heads;
      // Field size check
      static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::UIElements::VisualElement*>*) == 0x8);
      // public System.Collections.Generic.List`1<UnityEngine.UIElements.VisualElement> tails
      // Size: 0x8
      // Offset: 0x8
      ::System::Collections::Generic::List_1<::UnityEngine::UIElements::VisualElement*>* tails;
      // Field size check
      static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::UIElements::VisualElement*>*) == 0x8);
      // public System.Int32[] minDepths
      // Size: 0x8
      // Offset: 0x10
      ::ArrayW<int> minDepths;
      // Field size check
      static_assert(sizeof(::ArrayW<int>) == 0x8);
      // public System.Int32[] maxDepths
      // Size: 0x8
      // Offset: 0x18
      ::ArrayW<int> maxDepths;
      // Field size check
      static_assert(sizeof(::ArrayW<int>) == 0x8);
      // public System.UInt32 dirtyID
      // Size: 0x4
      // Offset: 0x20
      uint dirtyID;
      // Field size check
      static_assert(sizeof(uint) == 0x4);
      public:
      // Creating value type constructor for type: DepthOrderedDirtyTracking
      constexpr DepthOrderedDirtyTracking(::System::Collections::Generic::List_1<::UnityEngine::UIElements::VisualElement*>* heads_ = {}, ::System::Collections::Generic::List_1<::UnityEngine::UIElements::VisualElement*>* tails_ = {}, ::ArrayW<int> minDepths_ = ::ArrayW<int>(static_cast<void*>(nullptr)), ::ArrayW<int> maxDepths_ = ::ArrayW<int>(static_cast<void*>(nullptr)), uint dirtyID_ = {}) noexcept : heads{heads_}, tails{tails_}, minDepths{minDepths_}, maxDepths{maxDepths_}, dirtyID{dirtyID_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public System.Collections.Generic.List`1<UnityEngine.UIElements.VisualElement> heads
      [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::UnityEngine::UIElements::VisualElement*>*& dyn_heads();
      // Get instance field reference: public System.Collections.Generic.List`1<UnityEngine.UIElements.VisualElement> tails
      [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::UnityEngine::UIElements::VisualElement*>*& dyn_tails();
      // Get instance field reference: public System.Int32[] minDepths
      [[deprecated("Use field access instead!")]] ::ArrayW<int>& dyn_minDepths();
      // Get instance field reference: public System.Int32[] maxDepths
      [[deprecated("Use field access instead!")]] ::ArrayW<int>& dyn_maxDepths();
      // Get instance field reference: public System.UInt32 dirtyID
      [[deprecated("Use field access instead!")]] uint& dyn_dirtyID();
      // public System.Void EnsureFits(System.Int32 maxDepth)
      // Offset: 0x55D1808
      void EnsureFits(int maxDepth);
      // public System.Void RegisterDirty(UnityEngine.UIElements.VisualElement ve, UnityEngine.UIElements.UIR.RenderDataDirtyTypes dirtyTypes, UnityEngine.UIElements.UIR.RenderDataDirtyTypeClasses dirtyTypeClass)
      // Offset: 0x55D10F8
      void RegisterDirty(::UnityEngine::UIElements::VisualElement* ve, ::UnityEngine::UIElements::UIR::RenderDataDirtyTypes dirtyTypes, ::UnityEngine::UIElements::UIR::RenderDataDirtyTypeClasses dirtyTypeClass);
      // public System.Void ClearDirty(UnityEngine.UIElements.VisualElement ve, UnityEngine.UIElements.UIR.RenderDataDirtyTypes dirtyTypesInverse)
      // Offset: 0x55CF9F4
      void ClearDirty(::UnityEngine::UIElements::VisualElement* ve, ::UnityEngine::UIElements::UIR::RenderDataDirtyTypes dirtyTypesInverse);
      // public System.Void Reset()
      // Offset: 0x55CEEBC
      void Reset();
    }; // UnityEngine.UIElements.UIR.RenderChain/DepthOrderedDirtyTracking
    #pragma pack(pop)
    static check_size<sizeof(RenderChain::DepthOrderedDirtyTracking), 32 + sizeof(uint)> __UnityEngine_UIElements_UIR_RenderChain_DepthOrderedDirtyTrackingSizeCheck;
    static_assert(sizeof(RenderChain::DepthOrderedDirtyTracking) == 0x24);
    // WARNING Size may be invalid!
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.UIElements.UIR.RenderChain/RenderNodeData
    // [TokenAttribute] Offset: FFFFFFFF
    struct RenderNodeData/*, public ::System::ValueType*/ {
      public:
      public:
      // public UnityEngine.Material standardMaterial
      // Size: 0x8
      // Offset: 0x0
      ::UnityEngine::Material* standardMaterial;
      // Field size check
      static_assert(sizeof(::UnityEngine::Material*) == 0x8);
      // public UnityEngine.Material initialMaterial
      // Size: 0x8
      // Offset: 0x8
      ::UnityEngine::Material* initialMaterial;
      // Field size check
      static_assert(sizeof(::UnityEngine::Material*) == 0x8);
      // public UnityEngine.MaterialPropertyBlock matPropBlock
      // Size: 0x8
      // Offset: 0x10
      ::UnityEngine::MaterialPropertyBlock* matPropBlock;
      // Field size check
      static_assert(sizeof(::UnityEngine::MaterialPropertyBlock*) == 0x8);
      // public UnityEngine.UIElements.UIR.RenderChainCommand firstCommand
      // Size: 0x8
      // Offset: 0x18
      ::UnityEngine::UIElements::UIR::RenderChainCommand* firstCommand;
      // Field size check
      static_assert(sizeof(::UnityEngine::UIElements::UIR::RenderChainCommand*) == 0x8);
      // public UnityEngine.UIElements.UIR.UIRenderDevice device
      // Size: 0x8
      // Offset: 0x20
      ::UnityEngine::UIElements::UIR::UIRenderDevice* device;
      // Field size check
      static_assert(sizeof(::UnityEngine::UIElements::UIR::UIRenderDevice*) == 0x8);
      // public UnityEngine.Texture vectorAtlas
      // Size: 0x8
      // Offset: 0x28
      ::UnityEngine::Texture* vectorAtlas;
      // Field size check
      static_assert(sizeof(::UnityEngine::Texture*) == 0x8);
      // public UnityEngine.Texture shaderInfoAtlas
      // Size: 0x8
      // Offset: 0x30
      ::UnityEngine::Texture* shaderInfoAtlas;
      // Field size check
      static_assert(sizeof(::UnityEngine::Texture*) == 0x8);
      // public System.Single dpiScale
      // Size: 0x4
      // Offset: 0x38
      float dpiScale;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public Unity.Collections.NativeSlice`1<UnityEngine.UIElements.UIR.Transform3x4> transformConstants
      // Size: 0xFFFFFFFF
      // Offset: 0x40
      ::Unity::Collections::NativeSlice_1<::UnityEngine::UIElements::UIR::Transform3x4> transformConstants;
      // public Unity.Collections.NativeSlice`1<UnityEngine.Vector4> clipRectConstants
      // Size: 0xFFFFFFFF
      // Offset: 0x50
      ::Unity::Collections::NativeSlice_1<::UnityEngine::Vector4> clipRectConstants;
      public:
      // Creating value type constructor for type: RenderNodeData
      constexpr RenderNodeData(::UnityEngine::Material* standardMaterial_ = {}, ::UnityEngine::Material* initialMaterial_ = {}, ::UnityEngine::MaterialPropertyBlock* matPropBlock_ = {}, ::UnityEngine::UIElements::UIR::RenderChainCommand* firstCommand_ = {}, ::UnityEngine::UIElements::UIR::UIRenderDevice* device_ = {}, ::UnityEngine::Texture* vectorAtlas_ = {}, ::UnityEngine::Texture* shaderInfoAtlas_ = {}, float dpiScale_ = {}, ::Unity::Collections::NativeSlice_1<::UnityEngine::UIElements::UIR::Transform3x4> transformConstants_ = {}, ::Unity::Collections::NativeSlice_1<::UnityEngine::Vector4> clipRectConstants_ = {}) noexcept : standardMaterial{standardMaterial_}, initialMaterial{initialMaterial_}, matPropBlock{matPropBlock_}, firstCommand{firstCommand_}, device{device_}, vectorAtlas{vectorAtlas_}, shaderInfoAtlas{shaderInfoAtlas_}, dpiScale{dpiScale_}, transformConstants{transformConstants_}, clipRectConstants{clipRectConstants_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public UnityEngine.Material standardMaterial
      [[deprecated("Use field access instead!")]] ::UnityEngine::Material*& dyn_standardMaterial();
      // Get instance field reference: public UnityEngine.Material initialMaterial
      [[deprecated("Use field access instead!")]] ::UnityEngine::Material*& dyn_initialMaterial();
      // Get instance field reference: public UnityEngine.MaterialPropertyBlock matPropBlock
      [[deprecated("Use field access instead!")]] ::UnityEngine::MaterialPropertyBlock*& dyn_matPropBlock();
      // Get instance field reference: public UnityEngine.UIElements.UIR.RenderChainCommand firstCommand
      [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::UIR::RenderChainCommand*& dyn_firstCommand();
      // Get instance field reference: public UnityEngine.UIElements.UIR.UIRenderDevice device
      [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::UIR::UIRenderDevice*& dyn_device();
      // Get instance field reference: public UnityEngine.Texture vectorAtlas
      [[deprecated("Use field access instead!")]] ::UnityEngine::Texture*& dyn_vectorAtlas();
      // Get instance field reference: public UnityEngine.Texture shaderInfoAtlas
      [[deprecated("Use field access instead!")]] ::UnityEngine::Texture*& dyn_shaderInfoAtlas();
      // Get instance field reference: public System.Single dpiScale
      [[deprecated("Use field access instead!")]] float& dyn_dpiScale();
      // Get instance field reference: public Unity.Collections.NativeSlice`1<UnityEngine.UIElements.UIR.Transform3x4> transformConstants
      [[deprecated("Use field access instead!")]] ::Unity::Collections::NativeSlice_1<::UnityEngine::UIElements::UIR::Transform3x4>& dyn_transformConstants();
      // Get instance field reference: public Unity.Collections.NativeSlice`1<UnityEngine.Vector4> clipRectConstants
      [[deprecated("Use field access instead!")]] ::Unity::Collections::NativeSlice_1<::UnityEngine::Vector4>& dyn_clipRectConstants();
    }; // UnityEngine.UIElements.UIR.RenderChain/RenderNodeData
    // WARNING Not writing size check since size may be invalid!
    public:
    // private UnityEngine.UIElements.UIR.RenderChainCommand m_FirstCommand
    // Size: 0x8
    // Offset: 0x10
    ::UnityEngine::UIElements::UIR::RenderChainCommand* m_FirstCommand;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UIR::RenderChainCommand*) == 0x8);
    // private UnityEngine.UIElements.UIR.RenderChain/DepthOrderedDirtyTracking m_DirtyTracker
    // Size: 0x24
    // Offset: 0x18
    ::UnityEngine::UIElements::UIR::RenderChain::DepthOrderedDirtyTracking m_DirtyTracker;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UIR::RenderChain::DepthOrderedDirtyTracking) == 0x24);
    // private UnityEngine.UIElements.UIR.LinkedPool`1<UnityEngine.UIElements.UIR.RenderChainCommand> m_CommandPool
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::UIElements::UIR::LinkedPool_1<::UnityEngine::UIElements::UIR::RenderChainCommand*>* m_CommandPool;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UIR::LinkedPool_1<::UnityEngine::UIElements::UIR::RenderChainCommand*>*) == 0x8);
    // private UnityEngine.UIElements.UIR.BasicNodePool`1<UnityEngine.UIElements.UIR.TextureEntry> m_TexturePool
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::UIElements::UIR::BasicNodePool_1<::UnityEngine::UIElements::UIR::TextureEntry>* m_TexturePool;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UIR::BasicNodePool_1<::UnityEngine::UIElements::UIR::TextureEntry>*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.UIElements.UIR.RenderChain/RenderNodeData> m_RenderNodesData
    // Size: 0x8
    // Offset: 0x50
    ::System::Collections::Generic::List_1<::UnityEngine::UIElements::UIR::RenderChain::RenderNodeData>* m_RenderNodesData;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::UIElements::UIR::RenderChain::RenderNodeData>*) == 0x8);
    // private UnityEngine.Shader m_DefaultShader
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::Shader* m_DefaultShader;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // private UnityEngine.Shader m_DefaultWorldSpaceShader
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::Shader* m_DefaultWorldSpaceShader;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // private UnityEngine.Material m_DefaultMat
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::Material* m_DefaultMat;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private UnityEngine.Material m_DefaultWorldSpaceMat
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::Material* m_DefaultWorldSpaceMat;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private System.Boolean m_BlockDirtyRegistration
    // Size: 0x1
    // Offset: 0x78
    bool m_BlockDirtyRegistration;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Int32 m_StaticIndex
    // Size: 0x4
    // Offset: 0x7C
    int m_StaticIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_ActiveRenderNodes
    // Size: 0x4
    // Offset: 0x80
    int m_ActiveRenderNodes;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_CustomMaterialCommands
    // Size: 0x4
    // Offset: 0x84
    int m_CustomMaterialCommands;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.UIElements.UIR.ChainBuilderStats m_Stats
    // Size: 0x60
    // Offset: 0x88
    ::UnityEngine::UIElements::UIR::ChainBuilderStats m_Stats;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UIR::ChainBuilderStats) == 0x60);
    // private System.UInt32 m_StatsElementsAdded
    // Size: 0x4
    // Offset: 0xE8
    uint m_StatsElementsAdded;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 m_StatsElementsRemoved
    // Size: 0x4
    // Offset: 0xEC
    uint m_StatsElementsRemoved;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private UnityEngine.UIElements.TextureRegistry m_TextureRegistry
    // Size: 0x8
    // Offset: 0xF0
    ::UnityEngine::UIElements::TextureRegistry* m_TextureRegistry;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::TextureRegistry*) == 0x8);
    // private UnityEngine.UIElements.UIR.OpacityIdAccelerator <opacityIdAccelerator>k__BackingField
    // Size: 0x8
    // Offset: 0xF8
    ::UnityEngine::UIElements::UIR::OpacityIdAccelerator* opacityIdAccelerator;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UIR::OpacityIdAccelerator*) == 0x8);
    // private System.Boolean <disposed>k__BackingField
    // Size: 0x1
    // Offset: 0x100
    bool disposed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private UnityEngine.UIElements.BaseVisualElementPanel <panel>k__BackingField
    // Size: 0x8
    // Offset: 0x108
    ::UnityEngine::UIElements::BaseVisualElementPanel* panel;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::BaseVisualElementPanel*) == 0x8);
    // private UnityEngine.UIElements.UIR.UIRenderDevice <device>k__BackingField
    // Size: 0x8
    // Offset: 0x110
    ::UnityEngine::UIElements::UIR::UIRenderDevice* device;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UIR::UIRenderDevice*) == 0x8);
    // private UnityEngine.UIElements.AtlasBase <atlas>k__BackingField
    // Size: 0x8
    // Offset: 0x118
    ::UnityEngine::UIElements::AtlasBase* atlas;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::AtlasBase*) == 0x8);
    // private UnityEngine.UIElements.UIR.VectorImageManager <vectorImageManager>k__BackingField
    // Size: 0x8
    // Offset: 0x120
    ::UnityEngine::UIElements::UIR::VectorImageManager* vectorImageManager;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UIR::VectorImageManager*) == 0x8);
    // private UnityEngine.UIElements.UIR.TempAllocator`1<UnityEngine.UIElements.Vertex> <vertsPool>k__BackingField
    // Size: 0x8
    // Offset: 0x128
    ::UnityEngine::UIElements::UIR::TempAllocator_1<::UnityEngine::UIElements::Vertex>* vertsPool;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UIR::TempAllocator_1<::UnityEngine::UIElements::Vertex>*) == 0x8);
    // private UnityEngine.UIElements.UIR.TempAllocator`1<System.UInt16> <indicesPool>k__BackingField
    // Size: 0x8
    // Offset: 0x130
    ::UnityEngine::UIElements::UIR::TempAllocator_1<uint16_t>* indicesPool;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UIR::TempAllocator_1<uint16_t>*) == 0x8);
    // private UnityEngine.UIElements.UIR.JobManager <jobManager>k__BackingField
    // Size: 0x8
    // Offset: 0x138
    ::UnityEngine::UIElements::UIR::JobManager* jobManager;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UIR::JobManager*) == 0x8);
    // UnityEngine.UIElements.UIR.UIRVEShaderInfoAllocator shaderInfoAllocator
    // Size: 0xFFFFFFFF
    // Offset: 0x140
    ::UnityEngine::UIElements::UIR::UIRVEShaderInfoAllocator shaderInfoAllocator;
    // private UnityEngine.UIElements.UIR.Implementation.UIRStylePainter <painter>k__BackingField
    // Size: 0x8
    // Offset: 0x210
    ::UnityEngine::UIElements::UIR::Implementation::UIRStylePainter* painter;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UIR::Implementation::UIRStylePainter*) == 0x8);
    // private System.Boolean <drawStats>k__BackingField
    // Size: 0x1
    // Offset: 0x218
    bool drawStats;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <drawInCameras>k__BackingField
    // Size: 0x1
    // Offset: 0x219
    bool drawInCameras;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating interface conversion operator: operator ::System::IDisposable
    operator ::System::IDisposable() noexcept {
      return *reinterpret_cast<::System::IDisposable*>(this);
    }
    // Get static field: static private Unity.Profiling.ProfilerMarker s_MarkerProcess
    static ::Unity::Profiling::ProfilerMarker _get_s_MarkerProcess();
    // Set static field: static private Unity.Profiling.ProfilerMarker s_MarkerProcess
    static void _set_s_MarkerProcess(::Unity::Profiling::ProfilerMarker value);
    // Get static field: static private Unity.Profiling.ProfilerMarker s_MarkerClipProcessing
    static ::Unity::Profiling::ProfilerMarker _get_s_MarkerClipProcessing();
    // Set static field: static private Unity.Profiling.ProfilerMarker s_MarkerClipProcessing
    static void _set_s_MarkerClipProcessing(::Unity::Profiling::ProfilerMarker value);
