// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.IDisposable
#include "System/IDisposable.hpp"
// Including type: System.IntPtr
#include "System/IntPtr.hpp"
// Including type: Unity.Profiling.ProfilerMarker
#include "Unity/Profiling/ProfilerMarker.hpp"
// Including type: System.Nullable`1
#include "System/Nullable_1.hpp"
// Including type: UnityEngine.UIElements.Vertex
#include "UnityEngine/UIElements/Vertex.hpp"
// Including type: Unity.Collections.NativeSlice`1
#include "Unity/Collections/NativeSlice_1.hpp"
// Including type: UnityEngine.UIElements.UIR.Transform3x4
#include "UnityEngine/UIElements/UIR/Transform3x4.hpp"
// Including type: UnityEngine.UIElements.UIR.Utility
#include "UnityEngine/UIElements/UIR/Utility.hpp"
// Including type: UnityEngine.UIElements.UIR.DrawBufferRange
#include "UnityEngine/UIElements/UIR/DrawBufferRange.hpp"
// Including type: UnityEngine.UIElements.UIR.Alloc
#include "UnityEngine/UIElements/UIR/Alloc.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: MaterialPropertyBlock
  class MaterialPropertyBlock;
  // Forward declaring type: Texture2D
  class Texture2D;
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: Texture
  class Texture;
}
// Forward declaring namespace: UnityEngine::UIElements::UIR
namespace UnityEngine::UIElements::UIR {
  // Forward declaring type: MeshHandle
  class MeshHandle;
  // Forward declaring type: LinkedPool`1<T>
  template<typename T>
  class LinkedPool_1;
  // Forward declaring type: Page
  class Page;
  // Forward declaring type: DrawParams
  class DrawParams;
  // Forward declaring type: TextureSlotManager
  class TextureSlotManager;
  // Forward declaring type: RenderChainCommand
  class RenderChainCommand;
  // Skipping declaration: AllocToUpdate because it is already included!
  // Skipping declaration: DrawStatistics because it is already included!
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: LinkedList`1<T>
  template<typename T>
  class LinkedList_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Exception
  class Exception;
}
// Completed forward declares
// Type namespace: UnityEngine.UIElements.UIR
namespace UnityEngine::UIElements::UIR {
  // Forward declaring type: UIRenderDevice
  class UIRenderDevice;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::UIElements::UIR::UIRenderDevice);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UIElements::UIR::UIRenderDevice*, "UnityEngine.UIElements.UIR", "UIRenderDevice");
// Type namespace: UnityEngine.UIElements.UIR
namespace UnityEngine::UIElements::UIR {
  // Size: 0xAE
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.UIElements.UIR.UIRenderDevice
  // [TokenAttribute] Offset: FFFFFFFF
  class UIRenderDevice : public ::Il2CppObject/*, public ::System::IDisposable*/ {
    public:
    // Nested type: ::UnityEngine::UIElements::UIR::UIRenderDevice::AllocToUpdate
    struct AllocToUpdate;
    // Nested type: ::UnityEngine::UIElements::UIR::UIRenderDevice::AllocToFree
    struct AllocToFree;
    // Nested type: ::UnityEngine::UIElements::UIR::UIRenderDevice::DeviceToFree
    struct DeviceToFree;
    // Nested type: ::UnityEngine::UIElements::UIR::UIRenderDevice::EvaluationState
    struct EvaluationState;
    // Nested type: ::UnityEngine::UIElements::UIR::UIRenderDevice::DrawStatistics
    struct DrawStatistics;
    // Nested type: ::UnityEngine::UIElements::UIR::UIRenderDevice::$$c
    class $$c;
    // Size: 0x49
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.UIElements.UIR.UIRenderDevice/AllocToUpdate
    // [TokenAttribute] Offset: FFFFFFFF
    struct AllocToUpdate/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.UInt32 id
      // Size: 0x4
      // Offset: 0x0
      uint id;
      // Field size check
      static_assert(sizeof(uint) == 0x4);
      // public System.UInt32 allocTime
      // Size: 0x4
      // Offset: 0x4
      uint allocTime;
      // Field size check
      static_assert(sizeof(uint) == 0x4);
      // public UnityEngine.UIElements.UIR.MeshHandle meshHandle
      // Size: 0x8
      // Offset: 0x8
      ::UnityEngine::UIElements::UIR::MeshHandle* meshHandle;
      // Field size check
      static_assert(sizeof(::UnityEngine::UIElements::UIR::MeshHandle*) == 0x8);
      // public UnityEngine.UIElements.UIR.Alloc permAllocVerts
      // Size: 0x11
      // Offset: 0x10
      ::UnityEngine::UIElements::UIR::Alloc permAllocVerts;
      // Field size check
      static_assert(sizeof(::UnityEngine::UIElements::UIR::Alloc) == 0x11);
      // Padding between fields: permAllocVerts and: permAllocIndices
      char __padding3[0x7] = {};
      // public UnityEngine.UIElements.UIR.Alloc permAllocIndices
      // Size: 0x11
      // Offset: 0x28
      ::UnityEngine::UIElements::UIR::Alloc permAllocIndices;
      // Field size check
      static_assert(sizeof(::UnityEngine::UIElements::UIR::Alloc) == 0x11);
      // Padding between fields: permAllocIndices and: permPage
      char __padding4[0x7] = {};
      // public UnityEngine.UIElements.UIR.Page permPage
      // Size: 0x8
      // Offset: 0x40
      ::UnityEngine::UIElements::UIR::Page* permPage;
      // Field size check
      static_assert(sizeof(::UnityEngine::UIElements::UIR::Page*) == 0x8);
      // public System.Boolean copyBackIndices
      // Size: 0x1
      // Offset: 0x48
      bool copyBackIndices;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      public:
      // Creating value type constructor for type: AllocToUpdate
      constexpr AllocToUpdate(uint id_ = {}, uint allocTime_ = {}, ::UnityEngine::UIElements::UIR::MeshHandle* meshHandle_ = {}, ::UnityEngine::UIElements::UIR::Alloc permAllocVerts_ = {}, ::UnityEngine::UIElements::UIR::Alloc permAllocIndices_ = {}, ::UnityEngine::UIElements::UIR::Page* permPage_ = {}, bool copyBackIndices_ = {}) noexcept : id{id_}, allocTime{allocTime_}, meshHandle{meshHandle_}, permAllocVerts{permAllocVerts_}, permAllocIndices{permAllocIndices_}, permPage{permPage_}, copyBackIndices{copyBackIndices_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public System.UInt32 id
      [[deprecated("Use field access instead!")]] uint& dyn_id();
      // Get instance field reference: public System.UInt32 allocTime
      [[deprecated("Use field access instead!")]] uint& dyn_allocTime();
      // Get instance field reference: public UnityEngine.UIElements.UIR.MeshHandle meshHandle
      [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::UIR::MeshHandle*& dyn_meshHandle();
      // Get instance field reference: public UnityEngine.UIElements.UIR.Alloc permAllocVerts
      [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::UIR::Alloc& dyn_permAllocVerts();
      // Get instance field reference: public UnityEngine.UIElements.UIR.Alloc permAllocIndices
      [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::UIR::Alloc& dyn_permAllocIndices();
      // Get instance field reference: public UnityEngine.UIElements.UIR.Page permPage
      [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::UIR::Page*& dyn_permPage();
      // Get instance field reference: public System.Boolean copyBackIndices
      [[deprecated("Use field access instead!")]] bool& dyn_copyBackIndices();
    }; // UnityEngine.UIElements.UIR.UIRenderDevice/AllocToUpdate
    #pragma pack(pop)
    static check_size<sizeof(UIRenderDevice::AllocToUpdate), 72 + sizeof(bool)> __UnityEngine_UIElements_UIR_UIRenderDevice_AllocToUpdateSizeCheck;
    static_assert(sizeof(UIRenderDevice::AllocToUpdate) == 0x49);
    // Size: 0x21
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.UIElements.UIR.UIRenderDevice/AllocToFree
    // [TokenAttribute] Offset: FFFFFFFF
    struct AllocToFree/*, public ::System::ValueType*/ {
      public:
      public:
      // public UnityEngine.UIElements.UIR.Alloc alloc
      // Size: 0x11
      // Offset: 0x0
      ::UnityEngine::UIElements::UIR::Alloc alloc;
      // Field size check
      static_assert(sizeof(::UnityEngine::UIElements::UIR::Alloc) == 0x11);
      // Padding between fields: alloc and: page
      char __padding0[0x7] = {};
      // public UnityEngine.UIElements.UIR.Page page
      // Size: 0x8
      // Offset: 0x18
      ::UnityEngine::UIElements::UIR::Page* page;
      // Field size check
      static_assert(sizeof(::UnityEngine::UIElements::UIR::Page*) == 0x8);
      // public System.Boolean vertices
      // Size: 0x1
      // Offset: 0x20
      bool vertices;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      public:
      // Creating value type constructor for type: AllocToFree
      constexpr AllocToFree(::UnityEngine::UIElements::UIR::Alloc alloc_ = {}, ::UnityEngine::UIElements::UIR::Page* page_ = {}, bool vertices_ = {}) noexcept : alloc{alloc_}, page{page_}, vertices{vertices_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public UnityEngine.UIElements.UIR.Alloc alloc
      [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::UIR::Alloc& dyn_alloc();
      // Get instance field reference: public UnityEngine.UIElements.UIR.Page page
      [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::UIR::Page*& dyn_page();
      // Get instance field reference: public System.Boolean vertices
      [[deprecated("Use field access instead!")]] bool& dyn_vertices();
    }; // UnityEngine.UIElements.UIR.UIRenderDevice/AllocToFree
    #pragma pack(pop)
    static check_size<sizeof(UIRenderDevice::AllocToFree), 32 + sizeof(bool)> __UnityEngine_UIElements_UIR_UIRenderDevice_AllocToFreeSizeCheck;
    static_assert(sizeof(UIRenderDevice::AllocToFree) == 0x21);
    // Size: 0x10
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.UIElements.UIR.UIRenderDevice/DeviceToFree
    // [TokenAttribute] Offset: FFFFFFFF
    struct DeviceToFree/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.UInt32 handle
      // Size: 0x4
      // Offset: 0x0
      uint handle;
      // Field size check
      static_assert(sizeof(uint) == 0x4);
      // Padding between fields: handle and: page
      char __padding0[0x4] = {};
      // public UnityEngine.UIElements.UIR.Page page
      // Size: 0x8
      // Offset: 0x8
      ::UnityEngine::UIElements::UIR::Page* page;
      // Field size check
      static_assert(sizeof(::UnityEngine::UIElements::UIR::Page*) == 0x8);
      public:
      // Creating value type constructor for type: DeviceToFree
      constexpr DeviceToFree(uint handle_ = {}, ::UnityEngine::UIElements::UIR::Page* page_ = {}) noexcept : handle{handle_}, page{page_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public System.UInt32 handle
      [[deprecated("Use field access instead!")]] uint& dyn_handle();
      // Get instance field reference: public UnityEngine.UIElements.UIR.Page page
      [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::UIR::Page*& dyn_page();
      // public System.Void Dispose()
      // Offset: 0x55DA460
      void Dispose();
    }; // UnityEngine.UIElements.UIR.UIRenderDevice/DeviceToFree
    #pragma pack(pop)
    static check_size<sizeof(UIRenderDevice::DeviceToFree), 8 + sizeof(::UnityEngine::UIElements::UIR::Page*)> __UnityEngine_UIElements_UIR_UIRenderDevice_DeviceToFreeSizeCheck;
    static_assert(sizeof(UIRenderDevice::DeviceToFree) == 0x10);
    // Size: 0x24
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.UIElements.UIR.UIRenderDevice/DrawStatistics
    // [TokenAttribute] Offset: FFFFFFFF
    struct DrawStatistics/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.Int32 currentFrameIndex
      // Size: 0x4
      // Offset: 0x0
      int currentFrameIndex;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.UInt32 totalIndices
      // Size: 0x4
      // Offset: 0x4
      uint totalIndices;
      // Field size check
      static_assert(sizeof(uint) == 0x4);
      // public System.UInt32 commandCount
      // Size: 0x4
      // Offset: 0x8
      uint commandCount;
      // Field size check
      static_assert(sizeof(uint) == 0x4);
      // public System.UInt32 drawCommandCount
      // Size: 0x4
      // Offset: 0xC
      uint drawCommandCount;
      // Field size check
      static_assert(sizeof(uint) == 0x4);
      // public System.UInt32 materialSetCount
      // Size: 0x4
      // Offset: 0x10
      uint materialSetCount;
      // Field size check
      static_assert(sizeof(uint) == 0x4);
      // public System.UInt32 drawRangeCount
      // Size: 0x4
      // Offset: 0x14
      uint drawRangeCount;
      // Field size check
      static_assert(sizeof(uint) == 0x4);
      // public System.UInt32 drawRangeCallCount
      // Size: 0x4
      // Offset: 0x18
      uint drawRangeCallCount;
      // Field size check
      static_assert(sizeof(uint) == 0x4);
      // public System.UInt32 immediateDraws
      // Size: 0x4
      // Offset: 0x1C
      uint immediateDraws;
      // Field size check
      static_assert(sizeof(uint) == 0x4);
      // public System.UInt32 stencilRefChanges
      // Size: 0x4
      // Offset: 0x20
      uint stencilRefChanges;
      // Field size check
      static_assert(sizeof(uint) == 0x4);
      public:
      // Creating value type constructor for type: DrawStatistics
      constexpr DrawStatistics(int currentFrameIndex_ = {}, uint totalIndices_ = {}, uint commandCount_ = {}, uint drawCommandCount_ = {}, uint materialSetCount_ = {}, uint drawRangeCount_ = {}, uint drawRangeCallCount_ = {}, uint immediateDraws_ = {}, uint stencilRefChanges_ = {}) noexcept : currentFrameIndex{currentFrameIndex_}, totalIndices{totalIndices_}, commandCount{commandCount_}, drawCommandCount{drawCommandCount_}, materialSetCount{materialSetCount_}, drawRangeCount{drawRangeCount_}, drawRangeCallCount{drawRangeCallCount_}, immediateDraws{immediateDraws_}, stencilRefChanges{stencilRefChanges_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public System.Int32 currentFrameIndex
      [[deprecated("Use field access instead!")]] int& dyn_currentFrameIndex();
      // Get instance field reference: public System.UInt32 totalIndices
      [[deprecated("Use field access instead!")]] uint& dyn_totalIndices();
      // Get instance field reference: public System.UInt32 commandCount
      [[deprecated("Use field access instead!")]] uint& dyn_commandCount();
      // Get instance field reference: public System.UInt32 drawCommandCount
      [[deprecated("Use field access instead!")]] uint& dyn_drawCommandCount();
      // Get instance field reference: public System.UInt32 materialSetCount
      [[deprecated("Use field access instead!")]] uint& dyn_materialSetCount();
      // Get instance field reference: public System.UInt32 drawRangeCount
      [[deprecated("Use field access instead!")]] uint& dyn_drawRangeCount();
      // Get instance field reference: public System.UInt32 drawRangeCallCount
      [[deprecated("Use field access instead!")]] uint& dyn_drawRangeCallCount();
      // Get instance field reference: public System.UInt32 immediateDraws
      [[deprecated("Use field access instead!")]] uint& dyn_immediateDraws();
      // Get instance field reference: public System.UInt32 stencilRefChanges
      [[deprecated("Use field access instead!")]] uint& dyn_stencilRefChanges();
    }; // UnityEngine.UIElements.UIR.UIRenderDevice/DrawStatistics
    #pragma pack(pop)
    static check_size<sizeof(UIRenderDevice::DrawStatistics), 32 + sizeof(uint)> __UnityEngine_UIElements_UIR_UIRenderDevice_DrawStatisticsSizeCheck;
    static_assert(sizeof(UIRenderDevice::DrawStatistics) == 0x24);
    public:
    // private readonly System.Boolean m_MockDevice
    // Size: 0x1
    // Offset: 0x10
    bool m_MockDevice;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_MockDevice and: m_DefaultStencilState
    char __padding0[0x7] = {};
    // private System.IntPtr m_DefaultStencilState
    // Size: 0x8
    // Offset: 0x18
    ::System::IntPtr m_DefaultStencilState;
    // Field size check
    static_assert(sizeof(::System::IntPtr) == 0x8);
    // private System.IntPtr m_VertexDecl
    // Size: 0x8
    // Offset: 0x20
    ::System::IntPtr m_VertexDecl;
    // Field size check
    static_assert(sizeof(::System::IntPtr) == 0x8);
    // private UnityEngine.UIElements.UIR.Page m_FirstPage
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::UIElements::UIR::Page* m_FirstPage;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UIR::Page*) == 0x8);
    // private System.UInt32 m_NextPageVertexCount
    // Size: 0x4
    // Offset: 0x30
    uint m_NextPageVertexCount;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 m_LargeMeshVertexCount
    // Size: 0x4
    // Offset: 0x34
    uint m_LargeMeshVertexCount;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.Single m_IndexToVertexCountRatio
    // Size: 0x4
    // Offset: 0x38
    float m_IndexToVertexCountRatio;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: m_IndexToVertexCountRatio and: m_DeferredFrees
    char __padding6[0x4] = {};
    // private System.Collections.Generic.List`1<System.Collections.Generic.List`1<UnityEngine.UIElements.UIR.UIRenderDevice/AllocToFree>> m_DeferredFrees
    // Size: 0x8
    // Offset: 0x40
    ::System::Collections::Generic::List_1<::System::Collections::Generic::List_1<::UnityEngine::UIElements::UIR::UIRenderDevice::AllocToFree>*>* m_DeferredFrees;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::System::Collections::Generic::List_1<::UnityEngine::UIElements::UIR::UIRenderDevice::AllocToFree>*>*) == 0x8);
    // private System.Collections.Generic.List`1<System.Collections.Generic.List`1<UnityEngine.UIElements.UIR.UIRenderDevice/AllocToUpdate>> m_Updates
    // Size: 0x8
    // Offset: 0x48
    ::System::Collections::Generic::List_1<::System::Collections::Generic::List_1<::UnityEngine::UIElements::UIR::UIRenderDevice::AllocToUpdate>*>* m_Updates;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::System::Collections::Generic::List_1<::UnityEngine::UIElements::UIR::UIRenderDevice::AllocToUpdate>*>*) == 0x8);
    // private System.UInt32[] m_Fences
    // Size: 0x8
    // Offset: 0x50
    ::ArrayW<uint> m_Fences;
    // Field size check
    static_assert(sizeof(::ArrayW<uint>) == 0x8);
    // private UnityEngine.MaterialPropertyBlock m_StandardMatProps
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::MaterialPropertyBlock* m_StandardMatProps;
    // Field size check
    static_assert(sizeof(::UnityEngine::MaterialPropertyBlock*) == 0x8);
    // private System.UInt32 m_FrameIndex
    // Size: 0x4
    // Offset: 0x60
    uint m_FrameIndex;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 m_NextUpdateID
    // Size: 0x4
    // Offset: 0x64
    uint m_NextUpdateID;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private UnityEngine.UIElements.UIR.UIRenderDevice/DrawStatistics m_DrawStats
    // Size: 0x24
    // Offset: 0x68
    ::UnityEngine::UIElements::UIR::UIRenderDevice::DrawStatistics m_DrawStats;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UIR::UIRenderDevice::DrawStatistics) == 0x24);
    // Padding between fields: m_DrawStats and: m_MeshHandles
    char __padding13[0x4] = {};
    // private readonly UnityEngine.UIElements.UIR.LinkedPool`1<UnityEngine.UIElements.UIR.MeshHandle> m_MeshHandles
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::UIElements::UIR::LinkedPool_1<::UnityEngine::UIElements::UIR::MeshHandle*>* m_MeshHandles;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UIR::LinkedPool_1<::UnityEngine::UIElements::UIR::MeshHandle*>*) == 0x8);
    // private readonly UnityEngine.UIElements.UIR.DrawParams m_DrawParams
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::UIElements::UIR::DrawParams* m_DrawParams;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UIR::DrawParams*) == 0x8);
    // private readonly UnityEngine.UIElements.UIR.TextureSlotManager m_TextureSlotManager
    // Size: 0x8
    // Offset: 0xA0
    ::UnityEngine::UIElements::UIR::TextureSlotManager* m_TextureSlotManager;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UIR::TextureSlotManager*) == 0x8);
    // private readonly System.UInt32 <maxVerticesPerPage>k__BackingField
    // Size: 0x4
    // Offset: 0xA8
    uint maxVerticesPerPage;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.Boolean <breakBatches>k__BackingField
    // Size: 0x1
    // Offset: 0xAC
    bool breakBatches;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <disposed>k__BackingField
    // Size: 0x1
    // Offset: 0xAD
    bool disposed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating interface conversion operator: operator ::System::IDisposable
    operator ::System::IDisposable() noexcept {
      return *reinterpret_cast<::System::IDisposable*>(this);
    }
    // Get static field: static private System.Collections.Generic.LinkedList`1<UnityEngine.UIElements.UIR.UIRenderDevice/DeviceToFree> m_DeviceFreeQueue
    static ::System::Collections::Generic::LinkedList_1<::UnityEngine::UIElements::UIR::UIRenderDevice::DeviceToFree>* _get_m_DeviceFreeQueue();
    // Set static field: static private System.Collections.Generic.LinkedList`1<UnityEngine.UIElements.UIR.UIRenderDevice/DeviceToFree> m_DeviceFreeQueue
    static void _set_m_DeviceFreeQueue(::System::Collections::Generic::LinkedList_1<::UnityEngine::UIElements::UIR::UIRenderDevice::DeviceToFree>* value);
    // Get static field: static private System.Int32 m_ActiveDeviceCount
