// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: UnityEngine.UIElements.UIR.BitmapAllocator32
#include "UnityEngine/UIElements/UIR/BitmapAllocator32.hpp"
// Including type: Unity.Collections.NativeArray`1
#include "Unity/Collections/NativeArray_1.hpp"
// Including type: UnityEngine.UIElements.UIR.Transform3x4
#include "UnityEngine/UIElements/UIR/Transform3x4.hpp"
// Including type: UnityEngine.Vector2Int
#include "UnityEngine/Vector2Int.hpp"
// Including type: UnityEngine.Matrix4x4
#include "UnityEngine/Matrix4x4.hpp"
// Including type: UnityEngine.UIElements.UIR.TextCoreSettings
#include "UnityEngine/UIElements/UIR/TextCoreSettings.hpp"
// Including type: UnityEngine.UIElements.UIR.BMPAlloc
#include "UnityEngine/UIElements/UIR/BMPAlloc.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UIElements::UIR
namespace UnityEngine::UIElements::UIR {
  // Forward declaring type: BaseShaderInfoStorage
  class BaseShaderInfoStorage;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: RectInt
  struct RectInt;
  // Forward declaring type: Texture
  class Texture;
  // Skipping declaration: Color because it is already included!
  // Forward declaring type: Color32
  struct Color32;
}
// Forward declaring namespace: Unity::Collections
namespace Unity::Collections {
  // Forward declaring type: NativeSlice`1<T>
  template<typename T>
  struct NativeSlice_1;
}
// Completed forward declares
// Type namespace: UnityEngine.UIElements.UIR
namespace UnityEngine::UIElements::UIR {
  // Forward declaring type: UIRVEShaderInfoAllocator
  struct UIRVEShaderInfoAllocator;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UIElements::UIR::UIRVEShaderInfoAllocator, "UnityEngine.UIElements.UIR", "UIRVEShaderInfoAllocator");
// Type namespace: UnityEngine.UIElements.UIR
namespace UnityEngine::UIElements::UIR {
  // WARNING Size may be invalid!
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: UnityEngine.UIElements.UIR.UIRVEShaderInfoAllocator
  // [TokenAttribute] Offset: FFFFFFFF
  struct UIRVEShaderInfoAllocator/*, public ::System::ValueType*/ {
    public:
    public:
    // private UnityEngine.UIElements.UIR.BaseShaderInfoStorage m_Storage
    // Size: 0x8
    // Offset: 0x0
    ::UnityEngine::UIElements::UIR::BaseShaderInfoStorage* m_Storage;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UIR::BaseShaderInfoStorage*) == 0x8);
    // private UnityEngine.UIElements.UIR.BitmapAllocator32 m_TransformAllocator
    // Size: 0x20
    // Offset: 0x8
    ::UnityEngine::UIElements::UIR::BitmapAllocator32 m_TransformAllocator;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UIR::BitmapAllocator32) == 0x20);
    // private UnityEngine.UIElements.UIR.BitmapAllocator32 m_ClipRectAllocator
    // Size: 0x20
    // Offset: 0x28
    ::UnityEngine::UIElements::UIR::BitmapAllocator32 m_ClipRectAllocator;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UIR::BitmapAllocator32) == 0x20);
    // private UnityEngine.UIElements.UIR.BitmapAllocator32 m_OpacityAllocator
    // Size: 0x20
    // Offset: 0x48
    ::UnityEngine::UIElements::UIR::BitmapAllocator32 m_OpacityAllocator;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UIR::BitmapAllocator32) == 0x20);
    // private UnityEngine.UIElements.UIR.BitmapAllocator32 m_ColorAllocator
    // Size: 0x20
    // Offset: 0x68
    ::UnityEngine::UIElements::UIR::BitmapAllocator32 m_ColorAllocator;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UIR::BitmapAllocator32) == 0x20);
    // private UnityEngine.UIElements.UIR.BitmapAllocator32 m_TextSettingsAllocator
    // Size: 0x20
    // Offset: 0x88
    ::UnityEngine::UIElements::UIR::BitmapAllocator32 m_TextSettingsAllocator;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::UIR::BitmapAllocator32) == 0x20);
    // private System.Boolean m_StorageReallyCreated
    // Size: 0x1
    // Offset: 0xA8
    bool m_StorageReallyCreated;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_VertexTexturingEnabled
    // Size: 0x1
    // Offset: 0xA9
    bool m_VertexTexturingEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private Unity.Collections.NativeArray`1<UnityEngine.UIElements.UIR.Transform3x4> m_Transforms
    // Size: 0xFFFFFFFF
    // Offset: 0xB0
    ::Unity::Collections::NativeArray_1<::UnityEngine::UIElements::UIR::Transform3x4> m_Transforms;
    // private Unity.Collections.NativeArray`1<UnityEngine.Vector4> m_ClipRects
    // Size: 0xFFFFFFFF
    // Offset: 0xC0
    ::Unity::Collections::NativeArray_1<::UnityEngine::Vector4> m_ClipRects;
    public:
    // Creating value type constructor for type: UIRVEShaderInfoAllocator
