// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: GorillaTag.GuidedRefs.BaseGuidedRefTargetMono
#include "GorillaTag/GuidedRefs/BaseGuidedRefTargetMono.hpp"
// Including type: GorillaLocomotion.Player/LiquidType
#include "GorillaLocomotion/Player_LiquidType.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GorillaLocomotion::Swimming
namespace GorillaLocomotion::Swimming {
  // Forward declaring type: WaterCurrent
  class WaterCurrent;
  // Forward declaring type: WaterParameters
  class WaterParameters;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: MeshCollider
  class MeshCollider;
  // Forward declaring type: Collider
  class Collider;
  // Skipping declaration: Object because it is already included!
  // Forward declaring type: Mesh
  class Mesh;
  // Forward declaring type: RaycastHit
  struct RaycastHit;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: VRRig
  class VRRig;
}
// Forward declaring namespace: GorillaTag::GuidedRefs
namespace GorillaTag::GuidedRefs {
  // Forward declaring type: GuidedRefTargetIdSO
  class GuidedRefTargetIdSO;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
}
// Completed forward declares
// Type namespace: GorillaLocomotion.Swimming
namespace GorillaLocomotion::Swimming {
  // Forward declaring type: WaterVolume
  class WaterVolume;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GorillaLocomotion::Swimming::WaterVolume);
DEFINE_IL2CPP_ARG_TYPE(::GorillaLocomotion::Swimming::WaterVolume*, "GorillaLocomotion.Swimming", "WaterVolume");
// Type namespace: GorillaLocomotion.Swimming
namespace GorillaLocomotion::Swimming {
  // Size: 0xD8
  #pragma pack(push, 1)
  // Autogenerated type: GorillaLocomotion.Swimming.WaterVolume
  // [TokenAttribute] Offset: FFFFFFFF
  // [RequireComponent] Offset: FFFFFFFF
  class WaterVolume : public ::GorillaTag::GuidedRefs::BaseGuidedRefTargetMono {
    public:
    // Writing base type padding for base size: 0x31 to desired offset: 0x38
    char ___base_padding[0x7] = {};
    // Nested type: ::GorillaLocomotion::Swimming::WaterVolume::SurfaceQuery
    struct SurfaceQuery;
    // Nested type: ::GorillaLocomotion::Swimming::WaterVolume::WaterVolumeEvent
    class WaterVolumeEvent;
    public:
    // public UnityEngine.Transform surfacePlane
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::Transform* surfacePlane;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.MeshCollider> surfaceColliders
    // Size: 0x8
    // Offset: 0x40
    ::System::Collections::Generic::List_1<::UnityEngine::MeshCollider*>* surfaceColliders;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::MeshCollider*>*) == 0x8);
    // public System.Collections.Generic.List`1<UnityEngine.Collider> volumeColliders
    // Size: 0x8
    // Offset: 0x48
    ::System::Collections::Generic::List_1<::UnityEngine::Collider*>* volumeColliders;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Collider*>*) == 0x8);
    // private GorillaLocomotion.Player/LiquidType liquidType
    // Size: 0x4
    // Offset: 0x50
    ::GorillaLocomotion::Player::LiquidType liquidType;
    // Field size check
    static_assert(sizeof(::GorillaLocomotion::Player::LiquidType) == 0x4);
    // Padding between fields: liquidType and: waterCurrent
    char __padding3[0x4] = {};
    // private GorillaLocomotion.Swimming.WaterCurrent waterCurrent
    // Size: 0x8
    // Offset: 0x58
    ::GorillaLocomotion::Swimming::WaterCurrent* waterCurrent;
    // Field size check
    static_assert(sizeof(::GorillaLocomotion::Swimming::WaterCurrent*) == 0x8);
    // private GorillaLocomotion.Swimming.WaterParameters waterParams
    // Size: 0x8
    // Offset: 0x60
    ::GorillaLocomotion::Swimming::WaterParameters* waterParams;
    // Field size check
    static_assert(sizeof(::GorillaLocomotion::Swimming::WaterParameters*) == 0x8);
    // public System.Boolean isStationary
    // Size: 0x1
    // Offset: 0x68
    bool isStationary;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isStationary and: sharedMeshTris
    char __padding6[0x7] = {};
    // private System.Int32[] sharedMeshTris
    // Size: 0x8
    // Offset: 0x70
    ::ArrayW<int> sharedMeshTris;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // private UnityEngine.Vector3[] sharedMeshVerts
    // Size: 0x8
    // Offset: 0x78
    ::ArrayW<::UnityEngine::Vector3> sharedMeshVerts;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector3>) == 0x8);
    // private GorillaLocomotion.Swimming.WaterVolume/WaterVolumeEvent ColliderEnteredVolume
    // Size: 0x8
    // Offset: 0x80
    ::GorillaLocomotion::Swimming::WaterVolume::WaterVolumeEvent* ColliderEnteredVolume;
    // Field size check
    static_assert(sizeof(::GorillaLocomotion::Swimming::WaterVolume::WaterVolumeEvent*) == 0x8);
    // private GorillaLocomotion.Swimming.WaterVolume/WaterVolumeEvent ColliderExitedVolume
    // Size: 0x8
    // Offset: 0x88
    ::GorillaLocomotion::Swimming::WaterVolume::WaterVolumeEvent* ColliderExitedVolume;
    // Field size check
    static_assert(sizeof(::GorillaLocomotion::Swimming::WaterVolume::WaterVolumeEvent*) == 0x8);
    // private GorillaLocomotion.Swimming.WaterVolume/WaterVolumeEvent ColliderEnteredWater
    // Size: 0x8
    // Offset: 0x90
    ::GorillaLocomotion::Swimming::WaterVolume::WaterVolumeEvent* ColliderEnteredWater;
    // Field size check
    static_assert(sizeof(::GorillaLocomotion::Swimming::WaterVolume::WaterVolumeEvent*) == 0x8);
    // private GorillaLocomotion.Swimming.WaterVolume/WaterVolumeEvent ColliderExitedWater
    // Size: 0x8
    // Offset: 0x98
    ::GorillaLocomotion::Swimming::WaterVolume::WaterVolumeEvent* ColliderExitedWater;
    // Field size check
    static_assert(sizeof(::GorillaLocomotion::Swimming::WaterVolume::WaterVolumeEvent*) == 0x8);
    // private VRRig playerVRRig
    // Size: 0x8
    // Offset: 0xA0
    ::GlobalNamespace::VRRig* playerVRRig;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::VRRig*) == 0x8);
    // private System.Single volumeMaxHeight
    // Size: 0x4
    // Offset: 0xA8
    float volumeMaxHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single volumeMinHeight
    // Size: 0x4
    // Offset: 0xAC
    float volumeMinHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean debugDrawSurfaceCast
    // Size: 0x1
    // Offset: 0xB0
    bool debugDrawSurfaceCast;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: debugDrawSurfaceCast and: triggerCollider
    char __padding16[0x7] = {};
    // private UnityEngine.Collider triggerCollider
    // Size: 0x8
    // Offset: 0xB8
    ::UnityEngine::Collider* triggerCollider;
    // Field size check
    static_assert(sizeof(::UnityEngine::Collider*) == 0x8);
    // private System.Collections.Generic.List`1<GorillaLocomotion.Swimming.WaterOverlappingCollider> persistentColliders
    // Size: 0x8
    // Offset: 0xC0
    ::System::Collections::Generic::List_1<::GorillaLocomotion::Swimming::WaterOverlappingCollider>* persistentColliders;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GorillaLocomotion::Swimming::WaterOverlappingCollider>*) == 0x8);
    // private GorillaTag.GuidedRefs.GuidedRefTargetIdSO _guidedRefTargetId
    // Size: 0x8
    // Offset: 0xC8
    ::GorillaTag::GuidedRefs::GuidedRefTargetIdSO* guidedRefTargetId;
    // Field size check
    static_assert(sizeof(::GorillaTag::GuidedRefs::GuidedRefTargetIdSO*) == 0x8);
    // private UnityEngine.Object _guidedRefTargetObject
    // Size: 0x8
    // Offset: 0xD0
    ::UnityEngine::Object* guidedRefTargetObject;
    // Field size check
    static_assert(sizeof(::UnityEngine::Object*) == 0x8);
    public:
    // static field const value: static public System.String WaterSplashRPC
    static constexpr const char* WaterSplashRPC = "PlaySplashEffect";
    // Get static field: static public System.String WaterSplashRPC
    static ::StringW _get_WaterSplashRPC();
    // Set static field: static public System.String WaterSplashRPC
    static void _set_WaterSplashRPC(::StringW value);
    // Get static field: static public System.Single[] splashRPCSendTimes
    static ::ArrayW<float> _get_splashRPCSendTimes();
    // Set static field: static public System.Single[] splashRPCSendTimes
    static void _set_splashRPCSendTimes(::ArrayW<float> value);
    // Get static field: static private System.Collections.Generic.Dictionary`2<UnityEngine.Collider,GorillaLocomotion.Swimming.WaterVolume> sharedColliderRegistry
