// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Oculus::Interaction::GrabAPI
namespace Oculus::Interaction::GrabAPI {
  // Forward declaring type: GrabbingRule
  struct GrabbingRule;
}
// Forward declaring namespace: Oculus::Interaction
namespace Oculus::Interaction {
  // Forward declaring type: IInteractor
  class IInteractor;
  // Forward declaring type: MaterialPropertyBlockEditor
  class MaterialPropertyBlockEditor;
  // Forward declaring type: HandVisual
  class HandVisual;
  // Skipping declaration: GlowType because it is already included!
}
// Forward declaring namespace: Oculus::Interaction::HandGrab
namespace Oculus::Interaction::HandGrab {
  // Forward declaring type: IHandGrabInteractor
  class IHandGrabInteractor;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Skipping declaration: Object because it is already included!
  // Forward declaring type: SkinnedMeshRenderer
  class SkinnedMeshRenderer;
}
// Forward declaring namespace: Oculus::Interaction::Input
namespace Oculus::Interaction::Input {
  // Forward declaring type: HandFinger
  struct HandFinger;
}
// Completed forward declares
// Type namespace: Oculus.Interaction
namespace Oculus::Interaction {
  // Forward declaring type: HandGrabGlow
  class HandGrabGlow;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Oculus::Interaction::HandGrabGlow);
DEFINE_IL2CPP_ARG_TYPE(::Oculus::Interaction::HandGrabGlow*, "Oculus.Interaction", "HandGrabGlow");
// Type namespace: Oculus.Interaction
namespace Oculus::Interaction {
  // Size: 0xC9
  #pragma pack(push, 1)
  // Autogenerated type: Oculus.Interaction.HandGrabGlow
  // [TokenAttribute] Offset: FFFFFFFF
  class HandGrabGlow : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::Oculus::Interaction::HandGrabGlow::GlowType
    struct GlowType;
    // Nested type: ::Oculus::Interaction::HandGrabGlow::GlowState
    struct GlowState;
    // Nested type: ::Oculus::Interaction::HandGrabGlow::GrabState
    struct GrabState;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: Oculus.Interaction.HandGrabGlow/GlowType
    // [TokenAttribute] Offset: FFFFFFFF
    struct GlowType/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: GlowType
      constexpr GlowType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public Oculus.Interaction.HandGrabGlow/GlowType Fill
      static constexpr const int Fill = 27;
      // Get static field: static public Oculus.Interaction.HandGrabGlow/GlowType Fill
      static ::Oculus::Interaction::HandGrabGlow::GlowType _get_Fill();
      // Set static field: static public Oculus.Interaction.HandGrabGlow/GlowType Fill
      static void _set_Fill(::Oculus::Interaction::HandGrabGlow::GlowType value);
      // static field const value: static public Oculus.Interaction.HandGrabGlow/GlowType Outline
      static constexpr const int Outline = 28;
      // Get static field: static public Oculus.Interaction.HandGrabGlow/GlowType Outline
      static ::Oculus::Interaction::HandGrabGlow::GlowType _get_Outline();
      // Set static field: static public Oculus.Interaction.HandGrabGlow/GlowType Outline
      static void _set_Outline(::Oculus::Interaction::HandGrabGlow::GlowType value);
      // static field const value: static public Oculus.Interaction.HandGrabGlow/GlowType Both
      static constexpr const int Both = 29;
      // Get static field: static public Oculus.Interaction.HandGrabGlow/GlowType Both
      static ::Oculus::Interaction::HandGrabGlow::GlowType _get_Both();
      // Set static field: static public Oculus.Interaction.HandGrabGlow/GlowType Both
      static void _set_Both(::Oculus::Interaction::HandGrabGlow::GlowType value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // Oculus.Interaction.HandGrabGlow/GlowType
    #pragma pack(pop)
    static check_size<sizeof(HandGrabGlow::GlowType), 0 + sizeof(int)> __Oculus_Interaction_HandGrabGlow_GlowTypeSizeCheck;
    static_assert(sizeof(HandGrabGlow::GlowType) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: Oculus.Interaction.HandGrabGlow/GlowState
    // [TokenAttribute] Offset: FFFFFFFF
    struct GlowState/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: GlowState
      constexpr GlowState(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public Oculus.Interaction.HandGrabGlow/GlowState None
      static constexpr const int None = 0;
      // Get static field: static public Oculus.Interaction.HandGrabGlow/GlowState None
      static ::Oculus::Interaction::HandGrabGlow::GlowState _get_None();
      // Set static field: static public Oculus.Interaction.HandGrabGlow/GlowState None
      static void _set_None(::Oculus::Interaction::HandGrabGlow::GlowState value);
      // static field const value: static public Oculus.Interaction.HandGrabGlow/GlowState Hover
      static constexpr const int Hover = 1;
      // Get static field: static public Oculus.Interaction.HandGrabGlow/GlowState Hover
      static ::Oculus::Interaction::HandGrabGlow::GlowState _get_Hover();
      // Set static field: static public Oculus.Interaction.HandGrabGlow/GlowState Hover
      static void _set_Hover(::Oculus::Interaction::HandGrabGlow::GlowState value);
      // static field const value: static public Oculus.Interaction.HandGrabGlow/GlowState Selected
      static constexpr const int Selected = 2;
      // Get static field: static public Oculus.Interaction.HandGrabGlow/GlowState Selected
      static ::Oculus::Interaction::HandGrabGlow::GlowState _get_Selected();
      // Set static field: static public Oculus.Interaction.HandGrabGlow/GlowState Selected
      static void _set_Selected(::Oculus::Interaction::HandGrabGlow::GlowState value);
      // static field const value: static public Oculus.Interaction.HandGrabGlow/GlowState SelectedGlowOut
      static constexpr const int SelectedGlowOut = 3;
      // Get static field: static public Oculus.Interaction.HandGrabGlow/GlowState SelectedGlowOut
      static ::Oculus::Interaction::HandGrabGlow::GlowState _get_SelectedGlowOut();
      // Set static field: static public Oculus.Interaction.HandGrabGlow/GlowState SelectedGlowOut
      static void _set_SelectedGlowOut(::Oculus::Interaction::HandGrabGlow::GlowState value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // Oculus.Interaction.HandGrabGlow/GlowState
    #pragma pack(pop)
    static check_size<sizeof(HandGrabGlow::GlowState), 0 + sizeof(int)> __Oculus_Interaction_HandGrabGlow_GlowStateSizeCheck;
    static_assert(sizeof(HandGrabGlow::GlowState) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: Oculus.Interaction.HandGrabGlow/GrabState
    // [TokenAttribute] Offset: FFFFFFFF
    struct GrabState/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: GrabState
      constexpr GrabState(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public Oculus.Interaction.HandGrabGlow/GrabState None
      static constexpr const int None = 0;
      // Get static field: static public Oculus.Interaction.HandGrabGlow/GrabState None
      static ::Oculus::Interaction::HandGrabGlow::GrabState _get_None();
      // Set static field: static public Oculus.Interaction.HandGrabGlow/GrabState None
      static void _set_None(::Oculus::Interaction::HandGrabGlow::GrabState value);
      // static field const value: static public Oculus.Interaction.HandGrabGlow/GrabState Pinch
      static constexpr const int Pinch = 1;
      // Get static field: static public Oculus.Interaction.HandGrabGlow/GrabState Pinch
      static ::Oculus::Interaction::HandGrabGlow::GrabState _get_Pinch();
      // Set static field: static public Oculus.Interaction.HandGrabGlow/GrabState Pinch
      static void _set_Pinch(::Oculus::Interaction::HandGrabGlow::GrabState value);
      // static field const value: static public Oculus.Interaction.HandGrabGlow/GrabState Palm
      static constexpr const int Palm = 2;
      // Get static field: static public Oculus.Interaction.HandGrabGlow/GrabState Palm
      static ::Oculus::Interaction::HandGrabGlow::GrabState _get_Palm();
      // Set static field: static public Oculus.Interaction.HandGrabGlow/GrabState Palm
      static void _set_Palm(::Oculus::Interaction::HandGrabGlow::GrabState value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // Oculus.Interaction.HandGrabGlow/GrabState
    #pragma pack(pop)
    static check_size<sizeof(HandGrabGlow::GrabState), 0 + sizeof(int)> __Oculus_Interaction_HandGrabGlow_GrabStateSizeCheck;
    static_assert(sizeof(HandGrabGlow::GrabState) == 0x4);
    public:
    // private UnityEngine.Object _handGrabInteractor
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::Object* handGrabInteractor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Object*) == 0x8);
    // private UnityEngine.SkinnedMeshRenderer _handRenderer
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::SkinnedMeshRenderer* handRenderer;
    // Field size check
    static_assert(sizeof(::UnityEngine::SkinnedMeshRenderer*) == 0x8);
    // private Oculus.Interaction.MaterialPropertyBlockEditor _materialEditor
    // Size: 0x8
    // Offset: 0x30
    ::Oculus::Interaction::MaterialPropertyBlockEditor* materialEditor;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::MaterialPropertyBlockEditor*) == 0x8);
    // private Oculus.Interaction.HandVisual _handVisual
    // Size: 0x8
    // Offset: 0x38
    ::Oculus::Interaction::HandVisual* handVisual;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::HandVisual*) == 0x8);
    // private UnityEngine.Color _glowColorGrabing
    // Size: 0x10
    // Offset: 0x40
    ::UnityEngine::Color glowColorGrabing;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color _glowColorHover
    // Size: 0x10
    // Offset: 0x50
    ::UnityEngine::Color glowColorHover;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private System.Single _colorChangeSpeed
    // Size: 0x4
    // Offset: 0x60
    float colorChangeSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _glowFadeStartTime
    // Size: 0x4
    // Offset: 0x64
    float glowFadeStartTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _glowStrengthChangeSpeed
    // Size: 0x4
    // Offset: 0x68
    float glowStrengthChangeSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean _fadeOut
    // Size: 0x1
    // Offset: 0x6C
    bool fadeOut;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: fadeOut and: gradientLength
    char __padding9[0x3] = {};
    // private System.Single _gradientLength
    // Size: 0x4
    // Offset: 0x70
    float gradientLength;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private Oculus.Interaction.HandGrabGlow/GlowType _glowType
    // Size: 0x4
    // Offset: 0x74
    ::Oculus::Interaction::HandGrabGlow::GlowType glowType;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::HandGrabGlow::GlowType) == 0x4);
    // private Oculus.Interaction.HandGrabGlow/GlowState _state
    // Size: 0x4
    // Offset: 0x78
    ::Oculus::Interaction::HandGrabGlow::GlowState state;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::HandGrabGlow::GlowState) == 0x4);
    // private System.Single _accumulatedSelectedTime
    // Size: 0x4
    // Offset: 0x7C
    float accumulatedSelectedTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private Oculus.Interaction.HandGrabGlow/GrabState _grabState
    // Size: 0x4
    // Offset: 0x80
    ::Oculus::Interaction::HandGrabGlow::GrabState grabState;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::HandGrabGlow::GrabState) == 0x4);
    // private System.Single _glowFadeValue
    // Size: 0x4
    // Offset: 0x84
    float glowFadeValue;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Color _currentColor
    // Size: 0x10
    // Offset: 0x88
    ::UnityEngine::Color currentColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private Oculus.Interaction.HandGrab.IHandGrabInteractor HandGrabInteractor
    // Size: 0x8
    // Offset: 0x98
    ::Oculus::Interaction::HandGrab::IHandGrabInteractor* HandGrabInteractor;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::HandGrab::IHandGrabInteractor*) == 0x8);
    // private Oculus.Interaction.IInteractor Interactor
    // Size: 0x8
    // Offset: 0xA0
    ::Oculus::Interaction::IInteractor* Interactor;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::IInteractor*) == 0x8);
    // private System.Single[] _glowStregth
    // Size: 0x8
    // Offset: 0xA8
    ::ArrayW<float> glowStregth;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    // private readonly System.Int32 _generateGlowID
    // Size: 0x4
    // Offset: 0xB0
    int generateGlowID;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private readonly System.Int32 _glowColorID
    // Size: 0x4
    // Offset: 0xB4
    int glowColorID;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private readonly System.Int32 _glowTypeID
    // Size: 0x4
    // Offset: 0xB8
    int glowTypeID;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private readonly System.Int32 _glowParameterID
    // Size: 0x4
    // Offset: 0xBC
    int glowParameterID;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private readonly System.Int32[] _fingersGlowIDs
    // Size: 0x8
    // Offset: 0xC0
    ::ArrayW<int> fingersGlowIDs;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // protected System.Boolean _started
    // Size: 0x1
    // Offset: 0xC8
    bool started;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get instance field reference: private UnityEngine.Object _handGrabInteractor
    [[deprecated("Use field access instead!")]] ::UnityEngine::Object*& dyn__handGrabInteractor();
    // Get instance field reference: private UnityEngine.SkinnedMeshRenderer _handRenderer
    [[deprecated("Use field access instead!")]] ::UnityEngine::SkinnedMeshRenderer*& dyn__handRenderer();
    // Get instance field reference: private Oculus.Interaction.MaterialPropertyBlockEditor _materialEditor
    [[deprecated("Use field access instead!")]] ::Oculus::Interaction::MaterialPropertyBlockEditor*& dyn__materialEditor();
    // Get instance field reference: private Oculus.Interaction.HandVisual _handVisual
    [[deprecated("Use field access instead!")]] ::Oculus::Interaction::HandVisual*& dyn__handVisual();
    // Get instance field reference: private UnityEngine.Color _glowColorGrabing
