// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: Oculus.Interaction.IInteractor
#include "Oculus/Interaction/IInteractor.hpp"
// Including type: System.UInt64
#include "System/UInt64.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Oculus::Interaction
namespace Oculus::Interaction {
  // Skipping declaration: <>c because it is already included!
  // Forward declaring type: Interactable`2<TInteractor, TInteractable>
  template<typename TInteractor, typename TInteractable>
  class Interactable_2;
  // Forward declaring type: IActiveState
  class IActiveState;
  // Forward declaring type: IGameObjectFilter
  class IGameObjectFilter;
  // Forward declaring type: ISelector
  class ISelector;
  // Forward declaring type: MultiAction`1<T>
  template<typename T>
  class MultiAction_1;
  // Forward declaring type: UniqueIdentifier
  class UniqueIdentifier;
  // Forward declaring type: MAction`1<T>
  template<typename T>
  class MAction_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Skipping declaration: Object because it is already included!
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: IComparer`1<T>
  template<typename T>
  class IComparer_1;
  // Forward declaring type: Queue`1<T>
  template<typename T>
  class Queue_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Func`1<TResult>
  template<typename TResult>
  class Func_1;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Converter`2<TInput, TOutput>
  template<typename TInput, typename TOutput>
  class Converter_2;
}
// Completed forward declares
// Type namespace: Oculus.Interaction
namespace Oculus::Interaction {
  // Forward declaring type: Interactor`2<TInteractor, TInteractable>
  template<typename TInteractor, typename TInteractable>
  class Interactor_2;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE_GENERIC_CLASS(::Oculus::Interaction::Interactor_2, "Oculus.Interaction", "Interactor`2");
// Type namespace: Oculus.Interaction
namespace Oculus::Interaction {
  // WARNING Size may be invalid!
  // Autogenerated type: Oculus.Interaction.Interactor`2
  // [TokenAttribute] Offset: FFFFFFFF
  template<typename TInteractor, typename TInteractable>
  class Interactor_2 : public ::UnityEngine::MonoBehaviour/*, public ::Oculus::Interaction::IInteractor*/ {
    public:
    // Nested type: ::Oculus::Interaction::Interactor_2::$$c<TInteractor, TInteractable>
    class $$c;
    // WARNING Size may be invalid!
    // Autogenerated type: Oculus.Interaction.Interactor`2/<>c
    // [TokenAttribute] Offset: FFFFFFFF
    // [CompilerGeneratedAttribute] Offset: FFFFFFFF
    class $$c : public ::il2cpp_utils::il2cpp_type_check::NestedType, public ::Il2CppObject {
      public:
      using declaring_type = Interactor_2<TInteractor, TInteractable>*;
      static constexpr std::string_view NESTED_NAME = "<>c";
      static constexpr bool IS_VALUE_TYPE = false;
      // Autogenerated static field getter
      // Get static field: static public readonly Oculus.Interaction.Interactor`2/<>c<TInteractor,TInteractable> <>9
      static typename ::Oculus::Interaction::Interactor_2<TInteractor, TInteractable>::$$c* _get_$$9() {
        static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::Interactor_2::$$c::_get_$$9");
        return THROW_UNLESS((il2cpp_utils::GetFieldValue<typename ::Oculus::Interaction::Interactor_2<TInteractor, TInteractable>::$$c*>(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename Interactor_2<TInteractor, TInteractable>::$$c*>::get(), "<>9")));
      }
      // Autogenerated static field setter
      // Set static field: static public readonly Oculus.Interaction.Interactor`2/<>c<TInteractor,TInteractable> <>9
      static void _set_$$9(typename ::Oculus::Interaction::Interactor_2<TInteractor, TInteractable>::$$c* value) {
        static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::Interactor_2::$$c::_set_$$9");
        THROW_UNLESS((il2cpp_utils::SetFieldValue(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename Interactor_2<TInteractor, TInteractable>::$$c*>::get(), "<>9", value)));
      }
      // Autogenerated static field getter
      // Get static field: static public System.Converter`2<UnityEngine.Object,Oculus.Interaction.IGameObjectFilter> <>9__100_0
      static ::System::Converter_2<::UnityEngine::Object*, ::Oculus::Interaction::IGameObjectFilter*>* _get_$$9__100_0() {
        static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::Interactor_2::$$c::_get_$$9__100_0");
        return THROW_UNLESS((il2cpp_utils::GetFieldValue<::System::Converter_2<::UnityEngine::Object*, ::Oculus::Interaction::IGameObjectFilter*>*>(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename Interactor_2<TInteractor, TInteractable>::$$c*>::get(), "<>9__100_0")));
      }
      // Autogenerated static field setter
      // Set static field: static public System.Converter`2<UnityEngine.Object,Oculus.Interaction.IGameObjectFilter> <>9__100_0
      static void _set_$$9__100_0(::System::Converter_2<::UnityEngine::Object*, ::Oculus::Interaction::IGameObjectFilter*>* value) {
        static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::Interactor_2::$$c::_set_$$9__100_0");
        THROW_UNLESS((il2cpp_utils::SetFieldValue(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename Interactor_2<TInteractor, TInteractable>::$$c*>::get(), "<>9__100_0", value)));
      }
      // Autogenerated static field getter
      // Get static field: static public System.Converter`2<Oculus.Interaction.IGameObjectFilter,UnityEngine.Object> <>9__141_0
      static ::System::Converter_2<::Oculus::Interaction::IGameObjectFilter*, ::UnityEngine::Object*>* _get_$$9__141_0() {
        static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::Interactor_2::$$c::_get_$$9__141_0");
        return THROW_UNLESS((il2cpp_utils::GetFieldValue<::System::Converter_2<::Oculus::Interaction::IGameObjectFilter*, ::UnityEngine::Object*>*>(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename Interactor_2<TInteractor, TInteractable>::$$c*>::get(), "<>9__141_0")));
      }
      // Autogenerated static field setter
      // Set static field: static public System.Converter`2<Oculus.Interaction.IGameObjectFilter,UnityEngine.Object> <>9__141_0
      static void _set_$$9__141_0(::System::Converter_2<::Oculus::Interaction::IGameObjectFilter*, ::UnityEngine::Object*>* value) {
        static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::Interactor_2::$$c::_set_$$9__141_0");
        THROW_UNLESS((il2cpp_utils::SetFieldValue(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename Interactor_2<TInteractor, TInteractable>::$$c*>::get(), "<>9__141_0", value)));
      }
      // Autogenerated static field getter
      // Get static field: static public System.Action`1<Oculus.Interaction.InteractorStateChangeArgs> <>9__144_0
      static ::System::Action_1<::Oculus::Interaction::InteractorStateChangeArgs>* _get_$$9__144_0() {
        static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::Interactor_2::$$c::_get_$$9__144_0");
        return THROW_UNLESS((il2cpp_utils::GetFieldValue<::System::Action_1<::Oculus::Interaction::InteractorStateChangeArgs>*>(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename Interactor_2<TInteractor, TInteractable>::$$c*>::get(), "<>9__144_0")));
      }
      // Autogenerated static field setter
      // Set static field: static public System.Action`1<Oculus.Interaction.InteractorStateChangeArgs> <>9__144_0
      static void _set_$$9__144_0(::System::Action_1<::Oculus::Interaction::InteractorStateChangeArgs>* value) {
        static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::Interactor_2::$$c::_set_$$9__144_0");
        THROW_UNLESS((il2cpp_utils::SetFieldValue(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename Interactor_2<TInteractor, TInteractable>::$$c*>::get(), "<>9__144_0", value)));
      }
      // Autogenerated static field getter
      // Get static field: static public System.Action <>9__144_1
      static ::System::Action* _get_$$9__144_1() {
        static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::Interactor_2::$$c::_get_$$9__144_1");
        return THROW_UNLESS((il2cpp_utils::GetFieldValue<::System::Action*>(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename Interactor_2<TInteractor, TInteractable>::$$c*>::get(), "<>9__144_1")));
      }
      // Autogenerated static field setter
      // Set static field: static public System.Action <>9__144_1
      static void _set_$$9__144_1(::System::Action* value) {
        static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::Interactor_2::$$c::_set_$$9__144_1");
        THROW_UNLESS((il2cpp_utils::SetFieldValue(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename Interactor_2<TInteractor, TInteractable>::$$c*>::get(), "<>9__144_1", value)));
      }
      // Autogenerated static field getter
      // Get static field: static public System.Action <>9__144_2
      static ::System::Action* _get_$$9__144_2() {
        static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::Interactor_2::$$c::_get_$$9__144_2");
        return THROW_UNLESS((il2cpp_utils::GetFieldValue<::System::Action*>(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename Interactor_2<TInteractor, TInteractable>::$$c*>::get(), "<>9__144_2")));
      }
      // Autogenerated static field setter
      // Set static field: static public System.Action <>9__144_2
      static void _set_$$9__144_2(::System::Action* value) {
        static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::Interactor_2::$$c::_set_$$9__144_2");
        THROW_UNLESS((il2cpp_utils::SetFieldValue(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename Interactor_2<TInteractor, TInteractable>::$$c*>::get(), "<>9__144_2", value)));
      }
      // Autogenerated static field getter
      // Get static field: static public System.Action <>9__144_3
      static ::System::Action* _get_$$9__144_3() {
        static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::Interactor_2::$$c::_get_$$9__144_3");
        return THROW_UNLESS((il2cpp_utils::GetFieldValue<::System::Action*>(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename Interactor_2<TInteractor, TInteractable>::$$c*>::get(), "<>9__144_3")));
      }
      // Autogenerated static field setter
      // Set static field: static public System.Action <>9__144_3
      static void _set_$$9__144_3(::System::Action* value) {
        static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::Interactor_2::$$c::_set_$$9__144_3");
        THROW_UNLESS((il2cpp_utils::SetFieldValue(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename Interactor_2<TInteractor, TInteractable>::$$c*>::get(), "<>9__144_3", value)));
      }
      // static private System.Void .cctor()
      // Offset: 0xFFFFFFFFFFFFFFFF
      static void _cctor() {
        static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::Interactor_2::$$c::.cctor");
        static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(::il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename Interactor_2<TInteractor, TInteractable>::$$c*>::get(), ".cctor", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{})));
        ::il2cpp_utils::RunMethodRethrow<void, false>(static_cast<Il2CppObject*>(nullptr), ___internal__method);
      }
      // public System.Void .ctor()
      // Offset: 0xFFFFFFFFFFFFFFFF
      template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
      static typename Interactor_2<TInteractor, TInteractable>::$$c* New_ctor() {
        static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::Interactor_2::$$c::.ctor");
        return THROW_UNLESS((::il2cpp_utils::New<typename Interactor_2<TInteractor, TInteractable>::$$c*, creationType>()));
      }
      // Oculus.Interaction.IGameObjectFilter <Awake>b__100_0(UnityEngine.Object mono)
      // Offset: 0xFFFFFFFFFFFFFFFF
      ::Oculus::Interaction::IGameObjectFilter* $Awake$b__100_0(::UnityEngine::Object* mono) {
        static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::Interactor_2::$$c::<Awake>b__100_0");
        static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(this, "<Awake>b__100_0", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractType(mono)})));
        return ::il2cpp_utils::RunMethodRethrow<::Oculus::Interaction::IGameObjectFilter*, false>(this, ___internal__method, mono);
      }
      // UnityEngine.Object <InjectOptionalInteractableFilters>b__141_0(Oculus.Interaction.IGameObjectFilter interactableFilter)
      // Offset: 0xFFFFFFFFFFFFFFFF
      ::UnityEngine::Object* $InjectOptionalInteractableFilters$b__141_0(::Oculus::Interaction::IGameObjectFilter* interactableFilter) {
        static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::Interactor_2::$$c::<InjectOptionalInteractableFilters>b__141_0");
        static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(this, "<InjectOptionalInteractableFilters>b__141_0", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractType(interactableFilter)})));
        return ::il2cpp_utils::RunMethodRethrow<::UnityEngine::Object*, false>(this, ___internal__method, interactableFilter);
      }
      // System.Void <.ctor>b__144_0(Oculus.Interaction.InteractorStateChangeArgs <p0>)
      // Offset: 0xFFFFFFFFFFFFFFFF
      void $_ctor$b__144_0(::Oculus::Interaction::InteractorStateChangeArgs $p0$) {
        static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::Interactor_2::$$c::<.ctor>b__144_0");
        static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(this, "<.ctor>b__144_0", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractType($p0$)})));
        ::il2cpp_utils::RunMethodRethrow<void, false>(this, ___internal__method, $p0$);
      }
      // System.Void <.ctor>b__144_1()
      // Offset: 0xFFFFFFFFFFFFFFFF
      void $_ctor$b__144_1() {
        static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::Interactor_2::$$c::<.ctor>b__144_1");
        static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(this, "<.ctor>b__144_1", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{})));
        ::il2cpp_utils::RunMethodRethrow<void, false>(this, ___internal__method);
      }
      // System.Void <.ctor>b__144_2()
      // Offset: 0xFFFFFFFFFFFFFFFF
      void $_ctor$b__144_2() {
        static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::Interactor_2::$$c::<.ctor>b__144_2");
        static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(this, "<.ctor>b__144_2", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{})));
        ::il2cpp_utils::RunMethodRethrow<void, false>(this, ___internal__method);
      }
      // System.Void <.ctor>b__144_3()
      // Offset: 0xFFFFFFFFFFFFFFFF
      void $_ctor$b__144_3() {
        static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::Interactor_2::$$c::<.ctor>b__144_3");
        static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(this, "<.ctor>b__144_3", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{})));
        ::il2cpp_utils::RunMethodRethrow<void, false>(this, ___internal__method);
      }
    }; // Oculus.Interaction.Interactor`2/<>c
    // Could not write size check! Type: Oculus.Interaction.Interactor`2/<>c is generic, or has no fields that are valid for size checks!
    public:
    // protected System.UInt64 _nativeId
    // Size: 0x8
    // Offset: 0x0
    uint64_t nativeId;
    // Field size check
    static_assert(sizeof(uint64_t) == 0x8);
    // private UnityEngine.Object _activeState
    // Size: 0x8
    // Offset: 0x0
    ::UnityEngine::Object* activeState;
    // Field size check
    static_assert(sizeof(::UnityEngine::Object*) == 0x8);
    // private Oculus.Interaction.IActiveState ActiveState
    // Size: 0x8
    // Offset: 0x0
    ::Oculus::Interaction::IActiveState* ActiveState;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::IActiveState*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.Object> _interactableFilters
    // Size: 0x8
    // Offset: 0x0
    ::System::Collections::Generic::List_1<::UnityEngine::Object*>* interactableFilters;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Object*>*) == 0x8);
    // private System.Collections.Generic.List`1<Oculus.Interaction.IGameObjectFilter> InteractableFilters
    // Size: 0x8
    // Offset: 0x0
    ::System::Collections::Generic::List_1<::Oculus::Interaction::IGameObjectFilter*>* InteractableFilters;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Oculus::Interaction::IGameObjectFilter*>*) == 0x8);
    // private UnityEngine.Object _candidateTiebreaker
    // Size: 0x8
    // Offset: 0x0
    ::UnityEngine::Object* candidateTiebreaker;
    // Field size check
    static_assert(sizeof(::UnityEngine::Object*) == 0x8);
    // private System.Collections.Generic.IComparer`1<TInteractable> CandidateTiebreaker
    // Size: 0x8
    // Offset: 0x0
    ::System::Collections::Generic::IComparer_1<TInteractable>* CandidateTiebreaker;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::IComparer_1<TInteractable>*) == 0x8);
    // private System.Func`1<TInteractable> _computeCandidateOverride
    // Size: 0x8
    // Offset: 0x0
    ::System::Func_1<TInteractable>* computeCandidateOverride;
    // Field size check
    static_assert(sizeof(::System::Func_1<TInteractable>*) == 0x8);
    // private System.Boolean _clearComputeCandidateOverrideOnSelect
    // Size: 0x1
    // Offset: 0x0
    bool clearComputeCandidateOverrideOnSelect;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Func`1<System.Boolean> _computeShouldSelectOverride
    // Size: 0x8
    // Offset: 0x0
    ::System::Func_1<bool>* computeShouldSelectOverride;
    // Field size check
    static_assert(sizeof(::System::Func_1<bool>*) == 0x8);
    // private System.Boolean _clearComputeShouldSelectOverrideOnSelect
    // Size: 0x1
    // Offset: 0x0
    bool clearComputeShouldSelectOverrideOnSelect;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Func`1<System.Boolean> _computeShouldUnselectOverride
    // Size: 0x8
    // Offset: 0x0
    ::System::Func_1<bool>* computeShouldUnselectOverride;
    // Field size check
    static_assert(sizeof(::System::Func_1<bool>*) == 0x8);
    // private System.Boolean _clearComputeShouldUnselectOverrideOnUnselect
    // Size: 0x1
    // Offset: 0x0
    bool clearComputeShouldUnselectOverrideOnUnselect;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private Oculus.Interaction.InteractorState _state
    // Size: 0x4
    // Offset: 0x0
    ::Oculus::Interaction::InteractorState state;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::InteractorState) == 0x4);
    // private System.Action`1<Oculus.Interaction.InteractorStateChangeArgs> WhenStateChanged
    // Size: 0x8
    // Offset: 0x0
    ::System::Action_1<::Oculus::Interaction::InteractorStateChangeArgs>* WhenStateChanged;
    // Field size check
    static_assert(sizeof(::System::Action_1<::Oculus::Interaction::InteractorStateChangeArgs>*) == 0x8);
    // private System.Action WhenPreprocessed
    // Size: 0x8
    // Offset: 0x0
    ::System::Action* WhenPreprocessed;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private System.Action WhenProcessed
    // Size: 0x8
    // Offset: 0x0
    ::System::Action* WhenProcessed;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private System.Action WhenPostprocessed
    // Size: 0x8
    // Offset: 0x0
    ::System::Action* WhenPostprocessed;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private Oculus.Interaction.ISelector _selector
    // Size: 0x8
    // Offset: 0x0
    ::Oculus::Interaction::ISelector* selector;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::ISelector*) == 0x8);
    // private System.Int32 _maxIterationsPerFrame
    // Size: 0x4
    // Offset: 0x0
    int maxIterationsPerFrame;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Collections.Generic.Queue`1<System.Boolean> _selectorQueue
    // Size: 0x8
    // Offset: 0x0
    ::System::Collections::Generic::Queue_1<bool>* selectorQueue;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Queue_1<bool>*) == 0x8);
    // protected TInteractable _candidate
    // Size: 0xFFFFFFFF
    // Offset: 0x0
    TInteractable candidate;
    // protected TInteractable _interactable
    // Size: 0xFFFFFFFF
    // Offset: 0x0
    TInteractable interactable;
    // protected TInteractable _selectedInteractable
    // Size: 0xFFFFFFFF
    // Offset: 0x0
    TInteractable selectedInteractable;
    // private Oculus.Interaction.MultiAction`1<TInteractable> _whenInteractableSet
    // Size: 0x8
    // Offset: 0x0
    ::Oculus::Interaction::MultiAction_1<TInteractable>* whenInteractableSet;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::MultiAction_1<TInteractable>*) == 0x8);
    // private Oculus.Interaction.MultiAction`1<TInteractable> _whenInteractableUnset
    // Size: 0x8
    // Offset: 0x0
    ::Oculus::Interaction::MultiAction_1<TInteractable>* whenInteractableUnset;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::MultiAction_1<TInteractable>*) == 0x8);
    // private Oculus.Interaction.MultiAction`1<TInteractable> _whenInteractableSelected
    // Size: 0x8
    // Offset: 0x0
    ::Oculus::Interaction::MultiAction_1<TInteractable>* whenInteractableSelected;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::MultiAction_1<TInteractable>*) == 0x8);
    // private Oculus.Interaction.MultiAction`1<TInteractable> _whenInteractableUnselected
    // Size: 0x8
    // Offset: 0x0
    ::Oculus::Interaction::MultiAction_1<TInteractable>* whenInteractableUnselected;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::MultiAction_1<TInteractable>*) == 0x8);
    // private Oculus.Interaction.UniqueIdentifier _identifier
    // Size: 0x8
    // Offset: 0x0
    ::Oculus::Interaction::UniqueIdentifier* identifier;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::UniqueIdentifier*) == 0x8);
    // private UnityEngine.Object _data
    // Size: 0x8
    // Offset: 0x0
    ::UnityEngine::Object* data;
    // Field size check
    static_assert(sizeof(::UnityEngine::Object*) == 0x8);
    // private System.Object <Data>k__BackingField
    // Size: 0x8
    // Offset: 0x0
    ::Il2CppObject* Data;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // protected System.Boolean _started
    // Size: 0x1
    // Offset: 0x0
    bool started;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <IsRootDriver>k__BackingField
    // Size: 0x1
    // Offset: 0x0
    bool IsRootDriver;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating interface conversion operator: operator ::Oculus::Interaction::IInteractor
    operator ::Oculus::Interaction::IInteractor() noexcept {
      return *reinterpret_cast<::Oculus::Interaction::IInteractor*>(this);
    }
    // Autogenerated static field getter
    // Get static field: static private System.UInt64 DefaultNativeId
    static uint64_t _get_DefaultNativeId() {
      static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::Interactor_2::_get_DefaultNativeId");
      return THROW_UNLESS((il2cpp_utils::GetFieldValue<uint64_t>(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<Interactor_2<TInteractor, TInteractable>*>::get(), "DefaultNativeId")));
    }
    // Autogenerated static field setter
    // Set static field: static private System.UInt64 DefaultNativeId
    static void _set_DefaultNativeId(uint64_t value) {
