// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Skipping declaration: Object because it is already included!
  // Forward declaring type: Renderer
  class Renderer;
  // Forward declaring type: Material
  class Material;
}
// Forward declaring namespace: Oculus::Interaction
namespace Oculus::Interaction {
  // Forward declaring type: IInteractorView
  class IInteractorView;
  // Forward declaring type: InteractorStateChangeArgs
  struct InteractorStateChangeArgs;
}
// Completed forward declares
// Type namespace: Oculus.Interaction
namespace Oculus::Interaction {
  // Forward declaring type: InteractorDebugVisual
  class InteractorDebugVisual;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Oculus::Interaction::InteractorDebugVisual);
DEFINE_IL2CPP_ARG_TYPE(::Oculus::Interaction::InteractorDebugVisual*, "Oculus.Interaction", "InteractorDebugVisual");
// Type namespace: Oculus.Interaction
namespace Oculus::Interaction {
  // Size: 0x81
  #pragma pack(push, 1)
  // Autogenerated type: Oculus.Interaction.InteractorDebugVisual
  // [TokenAttribute] Offset: FFFFFFFF
  class InteractorDebugVisual : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private UnityEngine.Object _interactorView
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::Object* interactorView;
    // Field size check
    static_assert(sizeof(::UnityEngine::Object*) == 0x8);
    // private UnityEngine.Renderer _renderer
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::Renderer* renderer;
    // Field size check
    static_assert(sizeof(::UnityEngine::Renderer*) == 0x8);
    // private UnityEngine.Color _normalColor
    // Size: 0x10
    // Offset: 0x30
    ::UnityEngine::Color normalColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color _hoverColor
    // Size: 0x10
    // Offset: 0x40
    ::UnityEngine::Color hoverColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color _selectColor
    // Size: 0x10
    // Offset: 0x50
    ::UnityEngine::Color selectColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color _disabledColor
    // Size: 0x10
    // Offset: 0x60
    ::UnityEngine::Color disabledColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private Oculus.Interaction.IInteractorView InteractorView
    // Size: 0x8
    // Offset: 0x70
    ::Oculus::Interaction::IInteractorView* InteractorView;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::IInteractorView*) == 0x8);
    // private UnityEngine.Material _material
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::Material* material;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // protected System.Boolean _started
    // Size: 0x1
    // Offset: 0x80
    bool started;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get instance field reference: private UnityEngine.Object _interactorView
    [[deprecated("Use field access instead!")]] ::UnityEngine::Object*& dyn__interactorView();
    // Get instance field reference: private UnityEngine.Renderer _renderer
    [[deprecated("Use field access instead!")]] ::UnityEngine::Renderer*& dyn__renderer();
    // Get instance field reference: private UnityEngine.Color _normalColor
    [[deprecated("Use field access instead!")]] ::UnityEngine::Color& dyn__normalColor();
    // Get instance field reference: private UnityEngine.Color _hoverColor
    [[deprecated("Use field access instead!")]] ::UnityEngine::Color& dyn__hoverColor();
    // Get instance field reference: private UnityEngine.Color _selectColor
    [[deprecated("Use field access instead!")]] ::UnityEngine::Color& dyn__selectColor();
    // Get instance field reference: private UnityEngine.Color _disabledColor
    [[deprecated("Use field access instead!")]] ::UnityEngine::Color& dyn__disabledColor();
    // Get instance field reference: private Oculus.Interaction.IInteractorView InteractorView
    [[deprecated("Use field access instead!")]] ::Oculus::Interaction::IInteractorView*& dyn_InteractorView();
    // Get instance field reference: private UnityEngine.Material _material
    [[deprecated("Use field access instead!")]] ::UnityEngine::Material*& dyn__material();
    // Get instance field reference: protected System.Boolean _started
    [[deprecated("Use field access instead!")]] bool& dyn__started();
    // public UnityEngine.Color get_NormalColor()
    // Offset: 0x47C8EEC
    ::UnityEngine::Color get_NormalColor();
    // public System.Void set_NormalColor(UnityEngine.Color value)
    // Offset: 0x47C8EF8
    void set_NormalColor(::UnityEngine::Color value);
    // public UnityEngine.Color get_HoverColor()
    // Offset: 0x47C8F04
    ::UnityEngine::Color get_HoverColor();
    // public System.Void set_HoverColor(UnityEngine.Color value)
    // Offset: 0x47C8F10
    void set_HoverColor(::UnityEngine::Color value);
    // public UnityEngine.Color get_SelectColor()
    // Offset: 0x47C8F1C
    ::UnityEngine::Color get_SelectColor();
    // public System.Void set_SelectColor(UnityEngine.Color value)
    // Offset: 0x47C8F28
    void set_SelectColor(::UnityEngine::Color value);
    // public UnityEngine.Color get_DisabledColor()
    // Offset: 0x47C8F34
    ::UnityEngine::Color get_DisabledColor();
    // public System.Void set_DisabledColor(UnityEngine.Color value)
    // Offset: 0x47C8F40
    void set_DisabledColor(::UnityEngine::Color value);
    // protected System.Void Awake()
    // Offset: 0x47C8F4C
    void Awake();
    // protected System.Void Start()
    // Offset: 0x47C8FB4
    void Start();
    // protected System.Void OnEnable()
    // Offset: 0x47C9010
    void OnEnable();
    // protected System.Void OnDisable()
    // Offset: 0x47C9260
    void OnDisable();
    // private System.Void UpdateVisual()
    // Offset: 0x47C9118
    void UpdateVisual();
    // private System.Void UpdateVisualState(Oculus.Interaction.InteractorStateChangeArgs args)
    // Offset: 0x47C9360
    void UpdateVisualState(::Oculus::Interaction::InteractorStateChangeArgs args);
    // private System.Void OnDestroy()
    // Offset: 0x47C9364
    void OnDestroy();
    // public System.Void InjectAllInteractorDebugVisual(Oculus.Interaction.IInteractorView interactorView, UnityEngine.Renderer renderer)
    // Offset: 0x47C93C0
    void InjectAllInteractorDebugVisual(::Oculus::Interaction::IInteractorView* interactorView, ::UnityEngine::Renderer* renderer);
    // public System.Void InjectInteractorView(Oculus.Interaction.IInteractorView interactorView)
    // Offset: 0x47C93EC
    void InjectInteractorView(::Oculus::Interaction::IInteractorView* interactorView);
    // public System.Void InjectRenderer(UnityEngine.Renderer renderer)
    // Offset: 0x47C94BC
    void InjectRenderer(::UnityEngine::Renderer* renderer);
    // public System.Void .ctor()
    // Offset: 0x47C94C4
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static InteractorDebugVisual* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::InteractorDebugVisual::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<InteractorDebugVisual*, creationType>()));
    }
  }; // Oculus.Interaction.InteractorDebugVisual
  #pragma pack(pop)
  static check_size<sizeof(InteractorDebugVisual), 128 + sizeof(bool)> __Oculus_Interaction_InteractorDebugVisualSizeCheck;
  static_assert(sizeof(InteractorDebugVisual) == 0x81);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Oculus::Interaction::InteractorDebugVisual::get_NormalColor
// Il2CppName: get_NormalColor
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::Color (Oculus::Interaction::InteractorDebugVisual::*)()>(&Oculus::Interaction::InteractorDebugVisual::get_NormalColor)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Oculus::Interaction::InteractorDebugVisual*), "get_NormalColor", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Oculus::Interaction::InteractorDebugVisual::set_NormalColor
// Il2CppName: set_NormalColor
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Oculus::Interaction::InteractorDebugVisual::*)(::UnityEngine::Color)>(&Oculus::Interaction::InteractorDebugVisual::set_NormalColor)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("UnityEngine", "Color")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Oculus::Interaction::InteractorDebugVisual*), "set_NormalColor", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: Oculus::Interaction::InteractorDebugVisual::get_HoverColor
// Il2CppName: get_HoverColor
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::Color (Oculus::Interaction::InteractorDebugVisual::*)()>(&Oculus::Interaction::InteractorDebugVisual::get_HoverColor)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Oculus::Interaction::InteractorDebugVisual*), "get_HoverColor", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Oculus::Interaction::InteractorDebugVisual::set_HoverColor
// Il2CppName: set_HoverColor
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Oculus::Interaction::InteractorDebugVisual::*)(::UnityEngine::Color)>(&Oculus::Interaction::InteractorDebugVisual::set_HoverColor)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("UnityEngine", "Color")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Oculus::Interaction::InteractorDebugVisual*), "set_HoverColor", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: Oculus::Interaction::InteractorDebugVisual::get_SelectColor
// Il2CppName: get_SelectColor
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::Color (Oculus::Interaction::InteractorDebugVisual::*)()>(&Oculus::Interaction::InteractorDebugVisual::get_SelectColor)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Oculus::Interaction::InteractorDebugVisual*), "get_SelectColor", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Oculus::Interaction::InteractorDebugVisual::set_SelectColor
// Il2CppName: set_SelectColor
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Oculus::Interaction::InteractorDebugVisual::*)(::UnityEngine::Color)>(&Oculus::Interaction::InteractorDebugVisual::set_SelectColor)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("UnityEngine", "Color")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Oculus::Interaction::InteractorDebugVisual*), "set_SelectColor", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: Oculus::Interaction::InteractorDebugVisual::get_DisabledColor
// Il2CppName: get_DisabledColor
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::Color (Oculus::Interaction::InteractorDebugVisual::*)()>(&Oculus::Interaction::InteractorDebugVisual::get_DisabledColor)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Oculus::Interaction::InteractorDebugVisual*), "get_DisabledColor", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Oculus::Interaction::InteractorDebugVisual::set_DisabledColor
// Il2CppName: set_DisabledColor
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Oculus::Interaction::InteractorDebugVisual::*)(::UnityEngine::Color)>(&Oculus::Interaction::InteractorDebugVisual::set_DisabledColor)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("UnityEngine", "Color")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Oculus::Interaction::InteractorDebugVisual*), "set_DisabledColor", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: Oculus::Interaction::InteractorDebugVisual::Awake
// Il2CppName: Awake
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Oculus::Interaction::InteractorDebugVisual::*)()>(&Oculus::Interaction::InteractorDebugVisual::Awake)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Oculus::Interaction::InteractorDebugVisual*), "Awake", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Oculus::Interaction::InteractorDebugVisual::Start
// Il2CppName: Start
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Oculus::Interaction::InteractorDebugVisual::*)()>(&Oculus::Interaction::InteractorDebugVisual::Start)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Oculus::Interaction::InteractorDebugVisual*), "Start", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Oculus::Interaction::InteractorDebugVisual::OnEnable
// Il2CppName: OnEnable
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Oculus::Interaction::InteractorDebugVisual::*)()>(&Oculus::Interaction::InteractorDebugVisual::OnEnable)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Oculus::Interaction::InteractorDebugVisual*), "OnEnable", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Oculus::Interaction::InteractorDebugVisual::OnDisable
// Il2CppName: OnDisable
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Oculus::Interaction::InteractorDebugVisual::*)()>(&Oculus::Interaction::InteractorDebugVisual::OnDisable)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Oculus::Interaction::InteractorDebugVisual*), "OnDisable", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Oculus::Interaction::InteractorDebugVisual::UpdateVisual
// Il2CppName: UpdateVisual
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Oculus::Interaction::InteractorDebugVisual::*)()>(&Oculus::Interaction::InteractorDebugVisual::UpdateVisual)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Oculus::Interaction::InteractorDebugVisual*), "UpdateVisual", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Oculus::Interaction::InteractorDebugVisual::UpdateVisualState
// Il2CppName: UpdateVisualState
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Oculus::Interaction::InteractorDebugVisual::*)(::Oculus::Interaction::InteractorStateChangeArgs)>(&Oculus::Interaction::InteractorDebugVisual::UpdateVisualState)> {
  static const MethodInfo* get() {
    static auto* args = &::il2cpp_utils::GetClassFromName("Oculus.Interaction", "InteractorStateChangeArgs")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Oculus::Interaction::InteractorDebugVisual*), "UpdateVisualState", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{args});
  }
};
// Writing MetadataGetter for method: Oculus::Interaction::InteractorDebugVisual::OnDestroy
// Il2CppName: OnDestroy
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Oculus::Interaction::InteractorDebugVisual::*)()>(&Oculus::Interaction::InteractorDebugVisual::OnDestroy)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Oculus::Interaction::InteractorDebugVisual*), "OnDestroy", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Oculus::Interaction::InteractorDebugVisual::InjectAllInteractorDebugVisual
// Il2CppName: InjectAllInteractorDebugVisual
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Oculus::Interaction::InteractorDebugVisual::*)(::Oculus::Interaction::IInteractorView*, ::UnityEngine::Renderer*)>(&Oculus::Interaction::InteractorDebugVisual::InjectAllInteractorDebugVisual)> {
  static const MethodInfo* get() {
    static auto* interactorView = &::il2cpp_utils::GetClassFromName("Oculus.Interaction", "IInteractorView")->byval_arg;
    static auto* renderer = &::il2cpp_utils::GetClassFromName("UnityEngine", "Renderer")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Oculus::Interaction::InteractorDebugVisual*), "InjectAllInteractorDebugVisual", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{interactorView, renderer});
  }
};
// Writing MetadataGetter for method: Oculus::Interaction::InteractorDebugVisual::InjectInteractorView
// Il2CppName: InjectInteractorView
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Oculus::Interaction::InteractorDebugVisual::*)(::Oculus::Interaction::IInteractorView*)>(&Oculus::Interaction::InteractorDebugVisual::InjectInteractorView)> {
  static const MethodInfo* get() {
    static auto* interactorView = &::il2cpp_utils::GetClassFromName("Oculus.Interaction", "IInteractorView")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Oculus::Interaction::InteractorDebugVisual*), "InjectInteractorView", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{interactorView});
  }
};
// Writing MetadataGetter for method: Oculus::Interaction::InteractorDebugVisual::InjectRenderer
// Il2CppName: InjectRenderer
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Oculus::Interaction::InteractorDebugVisual::*)(::UnityEngine::Renderer*)>(&Oculus::Interaction::InteractorDebugVisual::InjectRenderer)> {
  static const MethodInfo* get() {
    static auto* renderer = &::il2cpp_utils::GetClassFromName("UnityEngine", "Renderer")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Oculus::Interaction::InteractorDebugVisual*), "InjectRenderer", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{renderer});
  }
};
// Writing MetadataGetter for method: Oculus::Interaction::InteractorDebugVisual::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
