// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: Oculus.Interaction.IInteractableView
#include "Oculus/Interaction/IInteractableView.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Oculus::Interaction
namespace Oculus::Interaction {
  // Forward declaring type: IInteractable
  class IInteractable;
  // Forward declaring type: IInteractorView
  class IInteractorView;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: IEnumerable`1<T>
  template<typename T>
  class IEnumerable_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Skipping declaration: Object because it is already included!
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Completed forward declares
// Type namespace: Oculus.Interaction
namespace Oculus::Interaction {
  // Forward declaring type: InteractableGroupView
  class InteractableGroupView;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Oculus::Interaction::InteractableGroupView);
DEFINE_IL2CPP_ARG_TYPE(::Oculus::Interaction::InteractableGroupView*, "Oculus.Interaction", "InteractableGroupView");
// Type namespace: Oculus.Interaction
namespace Oculus::Interaction {
  // Size: 0x6D
  #pragma pack(push, 1)
  // Autogenerated type: Oculus.Interaction.InteractableGroupView
  // [TokenAttribute] Offset: FFFFFFFF
  class InteractableGroupView : public ::UnityEngine::MonoBehaviour/*, public ::Oculus::Interaction::IInteractableView*/ {
    public:
    // Nested type: ::Oculus::Interaction::InteractableGroupView::$$c
    class $$c;
    public:
    // private System.Collections.Generic.List`1<UnityEngine.Object> _interactables
    // Size: 0x8
    // Offset: 0x20
    ::System::Collections::Generic::List_1<::UnityEngine::Object*>* interactables;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Object*>*) == 0x8);
    // private System.Collections.Generic.List`1<Oculus.Interaction.IInteractable> Interactables
    // Size: 0x8
    // Offset: 0x28
    ::System::Collections::Generic::List_1<::Oculus::Interaction::IInteractable*>* Interactables;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Oculus::Interaction::IInteractable*>*) == 0x8);
    // private UnityEngine.Object _data
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Object* data;
    // Field size check
    static_assert(sizeof(::UnityEngine::Object*) == 0x8);
    // private System.Object <Data>k__BackingField
    // Size: 0x8
    // Offset: 0x38
    ::Il2CppObject* Data;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Action`1<Oculus.Interaction.IInteractorView> WhenInteractorViewAdded
    // Size: 0x8
    // Offset: 0x40
    ::System::Action_1<::Oculus::Interaction::IInteractorView*>* WhenInteractorViewAdded;
    // Field size check
    static_assert(sizeof(::System::Action_1<::Oculus::Interaction::IInteractorView*>*) == 0x8);
    // private System.Action`1<Oculus.Interaction.IInteractorView> WhenInteractorViewRemoved
    // Size: 0x8
    // Offset: 0x48
    ::System::Action_1<::Oculus::Interaction::IInteractorView*>* WhenInteractorViewRemoved;
    // Field size check
    static_assert(sizeof(::System::Action_1<::Oculus::Interaction::IInteractorView*>*) == 0x8);
    // private System.Action`1<Oculus.Interaction.IInteractorView> WhenSelectingInteractorViewAdded
    // Size: 0x8
    // Offset: 0x50
    ::System::Action_1<::Oculus::Interaction::IInteractorView*>* WhenSelectingInteractorViewAdded;
    // Field size check
    static_assert(sizeof(::System::Action_1<::Oculus::Interaction::IInteractorView*>*) == 0x8);
    // private System.Action`1<Oculus.Interaction.IInteractorView> WhenSelectingInteractorViewRemoved
    // Size: 0x8
    // Offset: 0x58
    ::System::Action_1<::Oculus::Interaction::IInteractorView*>* WhenSelectingInteractorViewRemoved;
    // Field size check
    static_assert(sizeof(::System::Action_1<::Oculus::Interaction::IInteractorView*>*) == 0x8);
    // private System.Action`1<Oculus.Interaction.InteractableStateChangeArgs> WhenStateChanged
    // Size: 0x8
    // Offset: 0x60
    ::System::Action_1<::Oculus::Interaction::InteractableStateChangeArgs>* WhenStateChanged;
    // Field size check
    static_assert(sizeof(::System::Action_1<::Oculus::Interaction::InteractableStateChangeArgs>*) == 0x8);
    // private Oculus.Interaction.InteractableState _state
    // Size: 0x4
    // Offset: 0x68
    ::Oculus::Interaction::InteractableState state;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::InteractableState) == 0x4);
    // protected System.Boolean _started
    // Size: 0x1
    // Offset: 0x6C
    bool started;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating interface conversion operator: operator ::Oculus::Interaction::IInteractableView
    operator ::Oculus::Interaction::IInteractableView() noexcept {
      return *reinterpret_cast<::Oculus::Interaction::IInteractableView*>(this);
    }
    // Get instance field reference: private System.Collections.Generic.List`1<UnityEngine.Object> _interactables
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::UnityEngine::Object*>*& dyn__interactables();
    // Get instance field reference: private System.Collections.Generic.List`1<Oculus.Interaction.IInteractable> Interactables
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::Oculus::Interaction::IInteractable*>*& dyn_Interactables();
    // Get instance field reference: private UnityEngine.Object _data
