// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: Oculus.Interaction.IInteractor
#include "Oculus/Interaction/IInteractor.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Oculus::Interaction
namespace Oculus::Interaction {
  // Forward declaring type: IActiveState
  class IActiveState;
  // Forward declaring type: ICandidateComparer
  class ICandidateComparer;
  // Forward declaring type: UniqueIdentifier
  class UniqueIdentifier;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: IReadOnlyList`1<T>
  template<typename T>
  class IReadOnlyList_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Skipping declaration: Object because it is already included!
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Action
  class Action;
}
// Completed forward declares
// Type namespace: Oculus.Interaction
namespace Oculus::Interaction {
  // Forward declaring type: InteractorGroup
  class InteractorGroup;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Oculus::Interaction::InteractorGroup);
DEFINE_IL2CPP_ARG_TYPE(::Oculus::Interaction::InteractorGroup*, "Oculus.Interaction", "InteractorGroup");
// Type namespace: Oculus.Interaction
namespace Oculus::Interaction {
  // Size: 0x89
  #pragma pack(push, 1)
  // Autogenerated type: Oculus.Interaction.InteractorGroup
  // [TokenAttribute] Offset: FFFFFFFF
  class InteractorGroup : public ::UnityEngine::MonoBehaviour/*, public ::Oculus::Interaction::IInteractor*/ {
    public:
    // Nested type: ::Oculus::Interaction::InteractorGroup::InteractorPredicate
    class InteractorPredicate;
    // Nested type: ::Oculus::Interaction::InteractorGroup::$$c
    class $$c;
    public:
    // protected System.Collections.Generic.List`1<UnityEngine.Object> _interactors
    // Size: 0x8
    // Offset: 0x20
    ::System::Collections::Generic::List_1<::UnityEngine::Object*>* interactors;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Object*>*) == 0x8);
    // public System.Collections.Generic.IReadOnlyList`1<Oculus.Interaction.IInteractor> Interactors
    // Size: 0x8
    // Offset: 0x28
    ::System::Collections::Generic::IReadOnlyList_1<::Oculus::Interaction::IInteractor*>* Interactors;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::IReadOnlyList_1<::Oculus::Interaction::IInteractor*>*) == 0x8);
    // private UnityEngine.Object _activeState
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Object* activeState;
    // Field size check
    static_assert(sizeof(::UnityEngine::Object*) == 0x8);
    // private Oculus.Interaction.IActiveState ActiveState
    // Size: 0x8
    // Offset: 0x38
    ::Oculus::Interaction::IActiveState* ActiveState;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::IActiveState*) == 0x8);
    // protected UnityEngine.Object _candidateComparer
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::Object* candidateComparer;
    // Field size check
    static_assert(sizeof(::UnityEngine::Object*) == 0x8);
    // protected Oculus.Interaction.ICandidateComparer CandidateComparer
    // Size: 0x8
    // Offset: 0x48
    ::Oculus::Interaction::ICandidateComparer* CandidateComparer;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::ICandidateComparer*) == 0x8);
    // private System.Int32 _maxIterationsPerFrame
    // Size: 0x4
    // Offset: 0x50
    int maxIterationsPerFrame;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean <IsRootDriver>k__BackingField
    // Size: 0x1
    // Offset: 0x54
    bool IsRootDriver;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: IsRootDriver and: WhenStateChanged
    char __padding7[0x3] = {};
    // private System.Action`1<Oculus.Interaction.InteractorStateChangeArgs> WhenStateChanged
    // Size: 0x8
    // Offset: 0x58
    ::System::Action_1<::Oculus::Interaction::InteractorStateChangeArgs>* WhenStateChanged;
    // Field size check
    static_assert(sizeof(::System::Action_1<::Oculus::Interaction::InteractorStateChangeArgs>*) == 0x8);
    // private System.Action WhenPreprocessed
    // Size: 0x8
    // Offset: 0x60
    ::System::Action* WhenPreprocessed;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private System.Action WhenProcessed
    // Size: 0x8
    // Offset: 0x68
    ::System::Action* WhenProcessed;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private System.Action WhenPostprocessed
    // Size: 0x8
    // Offset: 0x70
    ::System::Action* WhenPostprocessed;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private Oculus.Interaction.InteractorState _state
    // Size: 0x4
    // Offset: 0x78
    ::Oculus::Interaction::InteractorState state;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::InteractorState) == 0x4);
    // Padding between fields: state and: identifier
    char __padding12[0x4] = {};
    // private Oculus.Interaction.UniqueIdentifier _identifier
    // Size: 0x8
    // Offset: 0x80
    ::Oculus::Interaction::UniqueIdentifier* identifier;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::UniqueIdentifier*) == 0x8);
    // protected System.Boolean _started
    // Size: 0x1
    // Offset: 0x88
    bool started;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating interface conversion operator: operator ::Oculus::Interaction::IInteractor
    operator ::Oculus::Interaction::IInteractor() noexcept {
      return *reinterpret_cast<::Oculus::Interaction::IInteractor*>(this);
    }
    // Get static field: static protected readonly Oculus.Interaction.InteractorGroup/InteractorPredicate TruePredicate
    static ::Oculus::Interaction::InteractorGroup::InteractorPredicate* _get_TruePredicate();
    // Set static field: static protected readonly Oculus.Interaction.InteractorGroup/InteractorPredicate TruePredicate
    static void _set_TruePredicate(::Oculus::Interaction::InteractorGroup::InteractorPredicate* value);
    // Get static field: static protected readonly Oculus.Interaction.InteractorGroup/InteractorPredicate HasCandidatePredicate
