// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: Oculus.Interaction.IInteractable
#include "Oculus/Interaction/IInteractable.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Oculus::Interaction
namespace Oculus::Interaction {
  // Skipping declaration: <>c because it is already included!
  // Forward declaring type: Interactor`2<TInteractor, TInteractable>
  template<typename TInteractor, typename TInteractable>
  class Interactor_2;
  // Forward declaring type: IGameObjectFilter
  class IGameObjectFilter;
  // Forward declaring type: IInteractorView
  class IInteractorView;
  // Forward declaring type: MultiAction`1<T>
  template<typename T>
  class MultiAction_1;
  // Forward declaring type: InteractableRegistry`2<TInteractor, TInteractable>
  template<typename TInteractor, typename TInteractable>
  class InteractableRegistry_2;
  // Forward declaring type: MAction`1<T>
  template<typename T>
  class MAction_1;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: IEnumerable`1<T>
  template<typename T>
  class IEnumerable_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Skipping declaration: Object because it is already included!
}
// Forward declaring namespace: Oculus::Interaction::Collections
namespace Oculus::Interaction::Collections {
  // Forward declaring type: EnumerableHashSet`1<T>
  template<typename T>
  class EnumerableHashSet_1;
  // Forward declaring type: IEnumerableHashSet`1<T>
  template<typename T>
  class IEnumerableHashSet_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Converter`2<TInput, TOutput>
  template<typename TInput, typename TOutput>
  class Converter_2;
}
// Completed forward declares
// Type namespace: Oculus.Interaction
namespace Oculus::Interaction {
  // Forward declaring type: Interactable`2<TInteractor, TInteractable>
  template<typename TInteractor, typename TInteractable>
  class Interactable_2;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE_GENERIC_CLASS(::Oculus::Interaction::Interactable_2, "Oculus.Interaction", "Interactable`2");
// Type namespace: Oculus.Interaction
namespace Oculus::Interaction {
  // WARNING Size may be invalid!
  // Autogenerated type: Oculus.Interaction.Interactable`2
  // [TokenAttribute] Offset: FFFFFFFF
  template<typename TInteractor, typename TInteractable>
  class Interactable_2 : public ::UnityEngine::MonoBehaviour/*, public ::Oculus::Interaction::IInteractable*/ {
    public:
    // Nested type: ::Oculus::Interaction::Interactable_2::$$c<TInteractor, TInteractable>
    class $$c;
    // WARNING Size may be invalid!
    // Autogenerated type: Oculus.Interaction.Interactable`2/<>c
    // [TokenAttribute] Offset: FFFFFFFF
    // [CompilerGeneratedAttribute] Offset: FFFFFFFF
    class $$c : public ::il2cpp_utils::il2cpp_type_check::NestedType, public ::Il2CppObject {
      public:
      using declaring_type = Interactable_2<TInteractor, TInteractable>*;
      static constexpr std::string_view NESTED_NAME = "<>c";
      static constexpr bool IS_VALUE_TYPE = false;
      // Autogenerated static field getter
      // Get static field: static public readonly Oculus.Interaction.Interactable`2/<>c<TInteractor,TInteractable> <>9
      static typename ::Oculus::Interaction::Interactable_2<TInteractor, TInteractable>::$$c* _get_$$9() {
        static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::Interactable_2::$$c::_get_$$9");
        return THROW_UNLESS((il2cpp_utils::GetFieldValue<typename ::Oculus::Interaction::Interactable_2<TInteractor, TInteractable>::$$c*>(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename Interactable_2<TInteractor, TInteractable>::$$c*>::get(), "<>9")));
      }
      // Autogenerated static field setter
      // Set static field: static public readonly Oculus.Interaction.Interactable`2/<>c<TInteractor,TInteractable> <>9
      static void _set_$$9(typename ::Oculus::Interaction::Interactable_2<TInteractor, TInteractable>::$$c* value) {
        static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::Interactable_2::$$c::_set_$$9");
        THROW_UNLESS((il2cpp_utils::SetFieldValue(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename Interactable_2<TInteractor, TInteractable>::$$c*>::get(), "<>9", value)));
      }
      // Autogenerated static field getter
      // Get static field: static public System.Converter`2<UnityEngine.Object,Oculus.Interaction.IGameObjectFilter> <>9__75_0
      static ::System::Converter_2<::UnityEngine::Object*, ::Oculus::Interaction::IGameObjectFilter*>* _get_$$9__75_0() {
        static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::Interactable_2::$$c::_get_$$9__75_0");
        return THROW_UNLESS((il2cpp_utils::GetFieldValue<::System::Converter_2<::UnityEngine::Object*, ::Oculus::Interaction::IGameObjectFilter*>*>(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename Interactable_2<TInteractor, TInteractable>::$$c*>::get(), "<>9__75_0")));
      }
      // Autogenerated static field setter
      // Set static field: static public System.Converter`2<UnityEngine.Object,Oculus.Interaction.IGameObjectFilter> <>9__75_0
      static void _set_$$9__75_0(::System::Converter_2<::UnityEngine::Object*, ::Oculus::Interaction::IGameObjectFilter*>* value) {
        static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::Interactable_2::$$c::_set_$$9__75_0");
        THROW_UNLESS((il2cpp_utils::SetFieldValue(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename Interactable_2<TInteractor, TInteractable>::$$c*>::get(), "<>9__75_0", value)));
      }
      // Autogenerated static field getter
      // Get static field: static public System.Converter`2<Oculus.Interaction.IGameObjectFilter,UnityEngine.Object> <>9__80_0
      static ::System::Converter_2<::Oculus::Interaction::IGameObjectFilter*, ::UnityEngine::Object*>* _get_$$9__80_0() {
        static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::Interactable_2::$$c::_get_$$9__80_0");
        return THROW_UNLESS((il2cpp_utils::GetFieldValue<::System::Converter_2<::Oculus::Interaction::IGameObjectFilter*, ::UnityEngine::Object*>*>(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename Interactable_2<TInteractor, TInteractable>::$$c*>::get(), "<>9__80_0")));
      }
      // Autogenerated static field setter
      // Set static field: static public System.Converter`2<Oculus.Interaction.IGameObjectFilter,UnityEngine.Object> <>9__80_0
      static void _set_$$9__80_0(::System::Converter_2<::Oculus::Interaction::IGameObjectFilter*, ::UnityEngine::Object*>* value) {
        static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::Interactable_2::$$c::_set_$$9__80_0");
        THROW_UNLESS((il2cpp_utils::SetFieldValue(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename Interactable_2<TInteractor, TInteractable>::$$c*>::get(), "<>9__80_0", value)));
      }
      // Autogenerated static field getter
      // Get static field: static public System.Action`1<Oculus.Interaction.InteractableStateChangeArgs> <>9__82_0
      static ::System::Action_1<::Oculus::Interaction::InteractableStateChangeArgs>* _get_$$9__82_0() {
        static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::Interactable_2::$$c::_get_$$9__82_0");
        return THROW_UNLESS((il2cpp_utils::GetFieldValue<::System::Action_1<::Oculus::Interaction::InteractableStateChangeArgs>*>(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename Interactable_2<TInteractor, TInteractable>::$$c*>::get(), "<>9__82_0")));
      }
      // Autogenerated static field setter
      // Set static field: static public System.Action`1<Oculus.Interaction.InteractableStateChangeArgs> <>9__82_0
      static void _set_$$9__82_0(::System::Action_1<::Oculus::Interaction::InteractableStateChangeArgs>* value) {
        static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::Interactable_2::$$c::_set_$$9__82_0");
        THROW_UNLESS((il2cpp_utils::SetFieldValue(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename Interactable_2<TInteractor, TInteractable>::$$c*>::get(), "<>9__82_0", value)));
      }
      // Autogenerated static field getter
      // Get static field: static public System.Action`1<Oculus.Interaction.IInteractorView> <>9__82_1
      static ::System::Action_1<::Oculus::Interaction::IInteractorView*>* _get_$$9__82_1() {
        static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::Interactable_2::$$c::_get_$$9__82_1");
        return THROW_UNLESS((il2cpp_utils::GetFieldValue<::System::Action_1<::Oculus::Interaction::IInteractorView*>*>(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename Interactable_2<TInteractor, TInteractable>::$$c*>::get(), "<>9__82_1")));
      }
      // Autogenerated static field setter
      // Set static field: static public System.Action`1<Oculus.Interaction.IInteractorView> <>9__82_1
      static void _set_$$9__82_1(::System::Action_1<::Oculus::Interaction::IInteractorView*>* value) {
        static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::Interactable_2::$$c::_set_$$9__82_1");
        THROW_UNLESS((il2cpp_utils::SetFieldValue(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename Interactable_2<TInteractor, TInteractable>::$$c*>::get(), "<>9__82_1", value)));
      }
      // Autogenerated static field getter
      // Get static field: static public System.Action`1<Oculus.Interaction.IInteractorView> <>9__82_2
      static ::System::Action_1<::Oculus::Interaction::IInteractorView*>* _get_$$9__82_2() {
        static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::Interactable_2::$$c::_get_$$9__82_2");
        return THROW_UNLESS((il2cpp_utils::GetFieldValue<::System::Action_1<::Oculus::Interaction::IInteractorView*>*>(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename Interactable_2<TInteractor, TInteractable>::$$c*>::get(), "<>9__82_2")));
      }
      // Autogenerated static field setter
      // Set static field: static public System.Action`1<Oculus.Interaction.IInteractorView> <>9__82_2
      static void _set_$$9__82_2(::System::Action_1<::Oculus::Interaction::IInteractorView*>* value) {
        static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::Interactable_2::$$c::_set_$$9__82_2");
        THROW_UNLESS((il2cpp_utils::SetFieldValue(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename Interactable_2<TInteractor, TInteractable>::$$c*>::get(), "<>9__82_2", value)));
      }
      // Autogenerated static field getter
      // Get static field: static public System.Action`1<Oculus.Interaction.IInteractorView> <>9__82_3
      static ::System::Action_1<::Oculus::Interaction::IInteractorView*>* _get_$$9__82_3() {
        static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::Interactable_2::$$c::_get_$$9__82_3");
        return THROW_UNLESS((il2cpp_utils::GetFieldValue<::System::Action_1<::Oculus::Interaction::IInteractorView*>*>(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename Interactable_2<TInteractor, TInteractable>::$$c*>::get(), "<>9__82_3")));
      }
      // Autogenerated static field setter
      // Set static field: static public System.Action`1<Oculus.Interaction.IInteractorView> <>9__82_3
      static void _set_$$9__82_3(::System::Action_1<::Oculus::Interaction::IInteractorView*>* value) {
        static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::Interactable_2::$$c::_set_$$9__82_3");
        THROW_UNLESS((il2cpp_utils::SetFieldValue(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename Interactable_2<TInteractor, TInteractable>::$$c*>::get(), "<>9__82_3", value)));
      }
      // Autogenerated static field getter
      // Get static field: static public System.Action`1<Oculus.Interaction.IInteractorView> <>9__82_4
      static ::System::Action_1<::Oculus::Interaction::IInteractorView*>* _get_$$9__82_4() {
        static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::Interactable_2::$$c::_get_$$9__82_4");
        return THROW_UNLESS((il2cpp_utils::GetFieldValue<::System::Action_1<::Oculus::Interaction::IInteractorView*>*>(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename Interactable_2<TInteractor, TInteractable>::$$c*>::get(), "<>9__82_4")));
      }
      // Autogenerated static field setter
      // Set static field: static public System.Action`1<Oculus.Interaction.IInteractorView> <>9__82_4
      static void _set_$$9__82_4(::System::Action_1<::Oculus::Interaction::IInteractorView*>* value) {
        static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::Interactable_2::$$c::_set_$$9__82_4");
        THROW_UNLESS((il2cpp_utils::SetFieldValue(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename Interactable_2<TInteractor, TInteractable>::$$c*>::get(), "<>9__82_4", value)));
      }
      // static private System.Void .cctor()
      // Offset: 0xFFFFFFFFFFFFFFFF
      static void _cctor() {
        static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::Interactable_2::$$c::.cctor");
        static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(::il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename Interactable_2<TInteractor, TInteractable>::$$c*>::get(), ".cctor", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{})));
        ::il2cpp_utils::RunMethodRethrow<void, false>(static_cast<Il2CppObject*>(nullptr), ___internal__method);
      }
      // public System.Void .ctor()
      // Offset: 0xFFFFFFFFFFFFFFFF
      template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
      static typename Interactable_2<TInteractor, TInteractable>::$$c* New_ctor() {
        static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::Interactable_2::$$c::.ctor");
        return THROW_UNLESS((::il2cpp_utils::New<typename Interactable_2<TInteractor, TInteractable>::$$c*, creationType>()));
      }
      // Oculus.Interaction.IGameObjectFilter <Awake>b__75_0(UnityEngine.Object mono)
      // Offset: 0xFFFFFFFFFFFFFFFF
      ::Oculus::Interaction::IGameObjectFilter* $Awake$b__75_0(::UnityEngine::Object* mono) {
        static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::Interactable_2::$$c::<Awake>b__75_0");
        static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(this, "<Awake>b__75_0", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractType(mono)})));
        return ::il2cpp_utils::RunMethodRethrow<::Oculus::Interaction::IGameObjectFilter*, false>(this, ___internal__method, mono);
      }
      // UnityEngine.Object <InjectOptionalInteractorFilters>b__80_0(Oculus.Interaction.IGameObjectFilter interactorFilter)
      // Offset: 0xFFFFFFFFFFFFFFFF
      ::UnityEngine::Object* $InjectOptionalInteractorFilters$b__80_0(::Oculus::Interaction::IGameObjectFilter* interactorFilter) {
        static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::Interactable_2::$$c::<InjectOptionalInteractorFilters>b__80_0");
        static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(this, "<InjectOptionalInteractorFilters>b__80_0", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractType(interactorFilter)})));
        return ::il2cpp_utils::RunMethodRethrow<::UnityEngine::Object*, false>(this, ___internal__method, interactorFilter);
      }
      // System.Void <.ctor>b__82_0(Oculus.Interaction.InteractableStateChangeArgs <p0>)
      // Offset: 0xFFFFFFFFFFFFFFFF
      void $_ctor$b__82_0(::Oculus::Interaction::InteractableStateChangeArgs $p0$) {
        static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::Interactable_2::$$c::<.ctor>b__82_0");
        static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(this, "<.ctor>b__82_0", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractType($p0$)})));
        ::il2cpp_utils::RunMethodRethrow<void, false>(this, ___internal__method, $p0$);
      }
      // System.Void <.ctor>b__82_1(Oculus.Interaction.IInteractorView <p0>)
      // Offset: 0xFFFFFFFFFFFFFFFF
      void $_ctor$b__82_1(::Oculus::Interaction::IInteractorView* $p0$) {
        static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::Interactable_2::$$c::<.ctor>b__82_1");
        static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(this, "<.ctor>b__82_1", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractType($p0$)})));
        ::il2cpp_utils::RunMethodRethrow<void, false>(this, ___internal__method, $p0$);
      }
      // System.Void <.ctor>b__82_2(Oculus.Interaction.IInteractorView <p0>)
      // Offset: 0xFFFFFFFFFFFFFFFF
      void $_ctor$b__82_2(::Oculus::Interaction::IInteractorView* $p0$) {
        static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::Interactable_2::$$c::<.ctor>b__82_2");
        static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(this, "<.ctor>b__82_2", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractType($p0$)})));
        ::il2cpp_utils::RunMethodRethrow<void, false>(this, ___internal__method, $p0$);
      }
      // System.Void <.ctor>b__82_3(Oculus.Interaction.IInteractorView <p0>)
      // Offset: 0xFFFFFFFFFFFFFFFF
      void $_ctor$b__82_3(::Oculus::Interaction::IInteractorView* $p0$) {
        static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::Interactable_2::$$c::<.ctor>b__82_3");
        static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(this, "<.ctor>b__82_3", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractType($p0$)})));
        ::il2cpp_utils::RunMethodRethrow<void, false>(this, ___internal__method, $p0$);
      }
      // System.Void <.ctor>b__82_4(Oculus.Interaction.IInteractorView <p0>)
      // Offset: 0xFFFFFFFFFFFFFFFF
      void $_ctor$b__82_4(::Oculus::Interaction::IInteractorView* $p0$) {
        static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::Interactable_2::$$c::<.ctor>b__82_4");
        static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(this, "<.ctor>b__82_4", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractType($p0$)})));
        ::il2cpp_utils::RunMethodRethrow<void, false>(this, ___internal__method, $p0$);
      }
    }; // Oculus.Interaction.Interactable`2/<>c
    // Could not write size check! Type: Oculus.Interaction.Interactable`2/<>c is generic, or has no fields that are valid for size checks!
    public:
    // private System.Collections.Generic.List`1<UnityEngine.Object> _interactorFilters
    // Size: 0x8
    // Offset: 0x0
    ::System::Collections::Generic::List_1<::UnityEngine::Object*>* interactorFilters;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Object*>*) == 0x8);
    // private System.Collections.Generic.List`1<Oculus.Interaction.IGameObjectFilter> InteractorFilters
    // Size: 0x8
    // Offset: 0x0
    ::System::Collections::Generic::List_1<::Oculus::Interaction::IGameObjectFilter*>* InteractorFilters;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Oculus::Interaction::IGameObjectFilter*>*) == 0x8);
    // private System.Int32 _maxInteractors
    // Size: 0x4
    // Offset: 0x0
    int maxInteractors;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _maxSelectingInteractors
    // Size: 0x4
    // Offset: 0x0
    int maxSelectingInteractors;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.Object _data
    // Size: 0x8
    // Offset: 0x0
    ::UnityEngine::Object* data;
    // Field size check
    static_assert(sizeof(::UnityEngine::Object*) == 0x8);
    // private System.Object <Data>k__BackingField
    // Size: 0x8
    // Offset: 0x0
    ::Il2CppObject* Data;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // protected System.Boolean _started
    // Size: 0x1
    // Offset: 0x0
    bool started;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private Oculus.Interaction.Collections.EnumerableHashSet`1<TInteractor> _interactors
    // Size: 0x8
    // Offset: 0x0
    ::Oculus::Interaction::Collections::EnumerableHashSet_1<TInteractor>* interactors;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::Collections::EnumerableHashSet_1<TInteractor>*) == 0x8);
    // private Oculus.Interaction.Collections.EnumerableHashSet`1<TInteractor> _selectingInteractors
    // Size: 0x8
    // Offset: 0x0
    ::Oculus::Interaction::Collections::EnumerableHashSet_1<TInteractor>* selectingInteractors;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::Collections::EnumerableHashSet_1<TInteractor>*) == 0x8);
    // private Oculus.Interaction.InteractableState _state
    // Size: 0x4
    // Offset: 0x0
    ::Oculus::Interaction::InteractableState state;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::InteractableState) == 0x4);
    // private System.Action`1<Oculus.Interaction.InteractableStateChangeArgs> WhenStateChanged
    // Size: 0x8
    // Offset: 0x0
    ::System::Action_1<::Oculus::Interaction::InteractableStateChangeArgs>* WhenStateChanged;
    // Field size check
    static_assert(sizeof(::System::Action_1<::Oculus::Interaction::InteractableStateChangeArgs>*) == 0x8);
    // private System.Action`1<Oculus.Interaction.IInteractorView> WhenInteractorViewAdded
    // Size: 0x8
    // Offset: 0x0
    ::System::Action_1<::Oculus::Interaction::IInteractorView*>* WhenInteractorViewAdded;
    // Field size check
    static_assert(sizeof(::System::Action_1<::Oculus::Interaction::IInteractorView*>*) == 0x8);
    // private System.Action`1<Oculus.Interaction.IInteractorView> WhenInteractorViewRemoved
    // Size: 0x8
    // Offset: 0x0
    ::System::Action_1<::Oculus::Interaction::IInteractorView*>* WhenInteractorViewRemoved;
    // Field size check
    static_assert(sizeof(::System::Action_1<::Oculus::Interaction::IInteractorView*>*) == 0x8);
    // private System.Action`1<Oculus.Interaction.IInteractorView> WhenSelectingInteractorViewAdded
    // Size: 0x8
    // Offset: 0x0
    ::System::Action_1<::Oculus::Interaction::IInteractorView*>* WhenSelectingInteractorViewAdded;
    // Field size check
    static_assert(sizeof(::System::Action_1<::Oculus::Interaction::IInteractorView*>*) == 0x8);
    // private System.Action`1<Oculus.Interaction.IInteractorView> WhenSelectingInteractorViewRemoved
    // Size: 0x8
    // Offset: 0x0
    ::System::Action_1<::Oculus::Interaction::IInteractorView*>* WhenSelectingInteractorViewRemoved;
    // Field size check
    static_assert(sizeof(::System::Action_1<::Oculus::Interaction::IInteractorView*>*) == 0x8);
    // private Oculus.Interaction.MultiAction`1<TInteractor> _whenInteractorAdded
    // Size: 0x8
    // Offset: 0x0
    ::Oculus::Interaction::MultiAction_1<TInteractor>* whenInteractorAdded;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::MultiAction_1<TInteractor>*) == 0x8);
    // private Oculus.Interaction.MultiAction`1<TInteractor> _whenInteractorRemoved
    // Size: 0x8
    // Offset: 0x0
    ::Oculus::Interaction::MultiAction_1<TInteractor>* whenInteractorRemoved;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::MultiAction_1<TInteractor>*) == 0x8);
    // private Oculus.Interaction.MultiAction`1<TInteractor> _whenSelectingInteractorAdded
    // Size: 0x8
    // Offset: 0x0
    ::Oculus::Interaction::MultiAction_1<TInteractor>* whenSelectingInteractorAdded;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::MultiAction_1<TInteractor>*) == 0x8);
    // private Oculus.Interaction.MultiAction`1<TInteractor> _whenSelectingInteractorRemoved
    // Size: 0x8
    // Offset: 0x0
    ::Oculus::Interaction::MultiAction_1<TInteractor>* whenSelectingInteractorRemoved;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::MultiAction_1<TInteractor>*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::Oculus::Interaction::IInteractable
    operator ::Oculus::Interaction::IInteractable() noexcept {
      return *reinterpret_cast<::Oculus::Interaction::IInteractable*>(this);
    }
    // Autogenerated static field getter
    // Get static field: static private Oculus.Interaction.InteractableRegistry`2<TInteractor,TInteractable> _registry
    static ::Oculus::Interaction::InteractableRegistry_2<TInteractor, TInteractable>* _get__registry() {
      static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::Interactable_2::_get__registry");
      return THROW_UNLESS((il2cpp_utils::GetFieldValue<::Oculus::Interaction::InteractableRegistry_2<TInteractor, TInteractable>*>(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<Interactable_2<TInteractor, TInteractable>*>::get(), "_registry")));
    }
