// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Oculus.Interaction.OneGrabTranslateTransformer
#include "Oculus/Interaction/OneGrabTranslateTransformer.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Oculus::Interaction
namespace Oculus::Interaction {
  // Forward declaring type: FloatConstraint
  class FloatConstraint;
}
// Completed forward declares
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Oculus::Interaction::OneGrabTranslateTransformer::OneGrabTranslateConstraints);
DEFINE_IL2CPP_ARG_TYPE(::Oculus::Interaction::OneGrabTranslateTransformer::OneGrabTranslateConstraints*, "Oculus.Interaction", "OneGrabTranslateTransformer/OneGrabTranslateConstraints");
// Type namespace: Oculus.Interaction
namespace Oculus::Interaction {
  // Size: 0x48
  #pragma pack(push, 1)
  // Autogenerated type: Oculus.Interaction.OneGrabTranslateTransformer/OneGrabTranslateConstraints
  // [TokenAttribute] Offset: FFFFFFFF
  class OneGrabTranslateTransformer::OneGrabTranslateConstraints : public ::Il2CppObject {
    public:
    public:
    // public System.Boolean ConstraintsAreRelative
    // Size: 0x1
    // Offset: 0x10
    bool ConstraintsAreRelative;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: ConstraintsAreRelative and: MinX
    char __padding0[0x7] = {};
    // public Oculus.Interaction.FloatConstraint MinX
    // Size: 0x8
    // Offset: 0x18
    ::Oculus::Interaction::FloatConstraint* MinX;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::FloatConstraint*) == 0x8);
    // public Oculus.Interaction.FloatConstraint MaxX
    // Size: 0x8
    // Offset: 0x20
    ::Oculus::Interaction::FloatConstraint* MaxX;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::FloatConstraint*) == 0x8);
    // public Oculus.Interaction.FloatConstraint MinY
    // Size: 0x8
    // Offset: 0x28
    ::Oculus::Interaction::FloatConstraint* MinY;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::FloatConstraint*) == 0x8);
    // public Oculus.Interaction.FloatConstraint MaxY
    // Size: 0x8
    // Offset: 0x30
    ::Oculus::Interaction::FloatConstraint* MaxY;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::FloatConstraint*) == 0x8);
    // public Oculus.Interaction.FloatConstraint MinZ
    // Size: 0x8
    // Offset: 0x38
    ::Oculus::Interaction::FloatConstraint* MinZ;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::FloatConstraint*) == 0x8);
    // public Oculus.Interaction.FloatConstraint MaxZ
    // Size: 0x8
    // Offset: 0x40
    ::Oculus::Interaction::FloatConstraint* MaxZ;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::FloatConstraint*) == 0x8);
    public:
    // Get instance field reference: public System.Boolean ConstraintsAreRelative
    [[deprecated("Use field access instead!")]] bool& dyn_ConstraintsAreRelative();
    // Get instance field reference: public Oculus.Interaction.FloatConstraint MinX
    [[deprecated("Use field access instead!")]] ::Oculus::Interaction::FloatConstraint*& dyn_MinX();
    // Get instance field reference: public Oculus.Interaction.FloatConstraint MaxX
    [[deprecated("Use field access instead!")]] ::Oculus::Interaction::FloatConstraint*& dyn_MaxX();
    // Get instance field reference: public Oculus.Interaction.FloatConstraint MinY
    [[deprecated("Use field access instead!")]] ::Oculus::Interaction::FloatConstraint*& dyn_MinY();
    // Get instance field reference: public Oculus.Interaction.FloatConstraint MaxY
    [[deprecated("Use field access instead!")]] ::Oculus::Interaction::FloatConstraint*& dyn_MaxY();
    // Get instance field reference: public Oculus.Interaction.FloatConstraint MinZ
    [[deprecated("Use field access instead!")]] ::Oculus::Interaction::FloatConstraint*& dyn_MinZ();
    // Get instance field reference: public Oculus.Interaction.FloatConstraint MaxZ
    [[deprecated("Use field access instead!")]] ::Oculus::Interaction::FloatConstraint*& dyn_MaxZ();
    // public System.Void .ctor()
    // Offset: 0x47A54E8
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static OneGrabTranslateTransformer::OneGrabTranslateConstraints* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::OneGrabTranslateTransformer::OneGrabTranslateConstraints::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<OneGrabTranslateTransformer::OneGrabTranslateConstraints*, creationType>()));
    }
  }; // Oculus.Interaction.OneGrabTranslateTransformer/OneGrabTranslateConstraints
  #pragma pack(pop)
  static check_size<sizeof(OneGrabTranslateTransformer::OneGrabTranslateConstraints), 64 + sizeof(::Oculus::Interaction::FloatConstraint*)> __Oculus_Interaction_OneGrabTranslateTransformer_OneGrabTranslateConstraintsSizeCheck;
  static_assert(sizeof(OneGrabTranslateTransformer::OneGrabTranslateConstraints) == 0x48);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Oculus::Interaction::OneGrabTranslateTransformer::OneGrabTranslateConstraints::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
