// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.EventSystems.PointerInputModule
#include "UnityEngine/EventSystems/PointerInputModule.hpp"
// Including type: Oculus.Interaction.PointerEvent
#include "Oculus/Interaction/PointerEvent.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Oculus::Interaction
namespace Oculus::Interaction {
  // Forward declaring type: IPointableCanvas
  class IPointableCanvas;
  // Forward declaring type: PointableCanvasEventArgs
  class PointableCanvasEventArgs;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Camera
  class Camera;
  // Forward declaring type: Canvas
  class Canvas;
  // Skipping declaration: Vector2 because it is already included!
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: ICollection`1<T>
  template<typename T>
  class ICollection_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: UnityEngine::EventSystems
namespace UnityEngine::EventSystems {
  // Skipping declaration: PointerEventData because it is already included!
}
// Completed forward declares
// Type namespace: Oculus.Interaction
namespace Oculus::Interaction {
  // Forward declaring type: PointableCanvasModule
  class PointableCanvasModule;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Oculus::Interaction::PointableCanvasModule);
DEFINE_IL2CPP_ARG_TYPE(::Oculus::Interaction::PointableCanvasModule*, "Oculus.Interaction", "PointableCanvasModule");
// Type namespace: Oculus.Interaction
namespace Oculus::Interaction {
  // Size: 0xA1
  #pragma pack(push, 1)
  // Autogenerated type: Oculus.Interaction.PointableCanvasModule
  // [TokenAttribute] Offset: FFFFFFFF
  class PointableCanvasModule : public ::UnityEngine::EventSystems::PointerInputModule {
    public:
    // Nested type: ::Oculus::Interaction::PointableCanvasModule::Pointer
    class Pointer;
    // Nested type: ::Oculus::Interaction::PointableCanvasModule::$$c__DisplayClass24_0
    class $$c__DisplayClass24_0;
    public:
    // private System.Boolean _useInitialPressPositionForDrag
    // Size: 0x1
    // Offset: 0x68
    bool useInitialPressPositionForDrag;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: useInitialPressPositionForDrag and: pointerEventCamera
    char __padding0[0x7] = {};
    // private UnityEngine.Camera _pointerEventCamera
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::Camera* pointerEventCamera;
    // Field size check
    static_assert(sizeof(::UnityEngine::Camera*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.Int32,Oculus.Interaction.PointableCanvasModule/Pointer> _pointerMap
    // Size: 0x8
    // Offset: 0x78
    ::System::Collections::Generic::Dictionary_2<int, ::Oculus::Interaction::PointableCanvasModule::Pointer*>* pointerMap;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<int, ::Oculus::Interaction::PointableCanvasModule::Pointer*>*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.EventSystems.RaycastResult> _raycastResultCache
    // Size: 0x8
    // Offset: 0x80
    ::System::Collections::Generic::List_1<::UnityEngine::EventSystems::RaycastResult>* raycastResultCache;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::EventSystems::RaycastResult>*) == 0x8);
    // private System.Collections.Generic.List`1<Oculus.Interaction.PointableCanvasModule/Pointer> _pointersForDeletion
    // Size: 0x8
    // Offset: 0x88
    ::System::Collections::Generic::List_1<::Oculus::Interaction::PointableCanvasModule::Pointer*>* pointersForDeletion;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Oculus::Interaction::PointableCanvasModule::Pointer*>*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<Oculus.Interaction.IPointableCanvas,System.Action`1<Oculus.Interaction.PointerEvent>> _pointerCanvasActionMap
    // Size: 0x8
    // Offset: 0x90
    ::System::Collections::Generic::Dictionary_2<::Oculus::Interaction::IPointableCanvas*, ::System::Action_1<::Oculus::Interaction::PointerEvent>*>* pointerCanvasActionMap;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::Oculus::Interaction::IPointableCanvas*, ::System::Action_1<::Oculus::Interaction::PointerEvent>*>*) == 0x8);
    // private Oculus.Interaction.PointableCanvasModule/Pointer[] _pointersToProcessScratch
    // Size: 0x8
    // Offset: 0x98
    ::ArrayW<::Oculus::Interaction::PointableCanvasModule::Pointer*> pointersToProcessScratch;
    // Field size check
    static_assert(sizeof(::ArrayW<::Oculus::Interaction::PointableCanvasModule::Pointer*>) == 0x8);
    // protected System.Boolean _started
    // Size: 0x1
    // Offset: 0xA0
    bool started;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get static field: static private System.Action`1<Oculus.Interaction.PointableCanvasEventArgs> WhenSelected
    static ::System::Action_1<::Oculus::Interaction::PointableCanvasEventArgs*>* _get_WhenSelected();
    // Set static field: static private System.Action`1<Oculus.Interaction.PointableCanvasEventArgs> WhenSelected
    static void _set_WhenSelected(::System::Action_1<::Oculus::Interaction::PointableCanvasEventArgs*>* value);
    // Get static field: static private System.Action`1<Oculus.Interaction.PointableCanvasEventArgs> WhenUnselected
    static ::System::Action_1<::Oculus::Interaction::PointableCanvasEventArgs*>* _get_WhenUnselected();
    // Set static field: static private System.Action`1<Oculus.Interaction.PointableCanvasEventArgs> WhenUnselected
