// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Oculus.Interaction.Input.Handedness
#include "Oculus/Interaction/Input/Handedness.hpp"
// Including type: Oculus.Interaction.HandSphere
#include "Oculus/Interaction/HandSphere.hpp"
// Including type: UnityEngine.Pose
#include "UnityEngine/Pose.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Oculus::Interaction
namespace Oculus::Interaction {
  // Forward declaring type: IHandSphereMap
  class IHandSphereMap;
  // Forward declaring type: ColliderGroup
  class ColliderGroup;
}
// Forward declaring namespace: Oculus::Interaction::Input
namespace Oculus::Interaction::Input {
  // Forward declaring type: ShadowHand
  class ShadowHand;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Skipping declaration: Vector3 because it is already included!
}
// Completed forward declares
// Type namespace: Oculus.Interaction
namespace Oculus::Interaction {
  // Forward declaring type: TouchShadowHand
  class TouchShadowHand;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Oculus::Interaction::TouchShadowHand);
DEFINE_IL2CPP_ARG_TYPE(::Oculus::Interaction::TouchShadowHand*, "Oculus.Interaction", "TouchShadowHand");
// Type namespace: Oculus.Interaction
namespace Oculus::Interaction {
  // Size: 0x48
  #pragma pack(push, 1)
  // Autogenerated type: Oculus.Interaction.TouchShadowHand
  // [TokenAttribute] Offset: FFFFFFFF
  class TouchShadowHand : public ::Il2CppObject {
    public:
    // Nested type: ::Oculus::Interaction::TouchShadowHand::GrabTouchInfo
    class GrabTouchInfo;
    public:
    // private Oculus.Interaction.Input.ShadowHand _shadowHand
    // Size: 0x8
    // Offset: 0x10
    ::Oculus::Interaction::Input::ShadowHand* shadowHand;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::Input::ShadowHand*) == 0x8);
    // private Oculus.Interaction.IHandSphereMap _handSphereMap
    // Size: 0x8
    // Offset: 0x18
    ::Oculus::Interaction::IHandSphereMap* handSphereMap;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::IHandSphereMap*) == 0x8);
    // private Oculus.Interaction.Input.Handedness _handedness
    // Size: 0x4
    // Offset: 0x20
    ::Oculus::Interaction::Input::Handedness handedness;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::Input::Handedness) == 0x4);
    // Padding between fields: handedness and: spheres
    char __padding2[0x4] = {};
    // private System.Collections.Generic.List`1<Oculus.Interaction.HandSphere> _spheres
    // Size: 0x8
    // Offset: 0x28
    ::System::Collections::Generic::List_1<::Oculus::Interaction::HandSphere>* spheres;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Oculus::Interaction::HandSphere>*) == 0x8);
    // private System.Int32 _totalIterations
    // Size: 0x4
    // Offset: 0x30
    int totalIterations;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _pushoutIterations
    // Size: 0x4
    // Offset: 0x34
    int pushoutIterations;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 Iterations
    // Size: 0x4
    // Offset: 0x38
    int Iterations;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: Iterations and: sphereHit
    char __padding6[0x4] = {};
    // private System.Collections.Generic.List`1<System.Int32> _sphereHit
    // Size: 0x8
    // Offset: 0x40
    ::System::Collections::Generic::List_1<int>* sphereHit;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<int>*) == 0x8);
    public:
    // Get instance field reference: private Oculus.Interaction.Input.ShadowHand _shadowHand
    [[deprecated("Use field access instead!")]] ::Oculus::Interaction::Input::ShadowHand*& dyn__shadowHand();
    // Get instance field reference: private Oculus.Interaction.IHandSphereMap _handSphereMap
    [[deprecated("Use field access instead!")]] ::Oculus::Interaction::IHandSphereMap*& dyn__handSphereMap();
    // Get instance field reference: private Oculus.Interaction.Input.Handedness _handedness
    [[deprecated("Use field access instead!")]] ::Oculus::Interaction::Input::Handedness& dyn__handedness();
    // Get instance field reference: private System.Collections.Generic.List`1<Oculus.Interaction.HandSphere> _spheres
