// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Oculus.Interaction.TouchHandGrabInteractor
#include "Oculus/Interaction/TouchHandGrabInteractor.hpp"
// Including type: Oculus.Interaction.Input.HandJointId
#include "Oculus/Interaction/Input/HandJointId.hpp"
// Including type: UnityEngine.Pose
#include "UnityEngine/Pose.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Oculus::Interaction::TouchHandGrabInteractor::FingerStatus);
DEFINE_IL2CPP_ARG_TYPE(::Oculus::Interaction::TouchHandGrabInteractor::FingerStatus*, "Oculus.Interaction", "TouchHandGrabInteractor/FingerStatus");
// Type namespace: Oculus.Interaction
namespace Oculus::Interaction {
  // Size: 0x30
  #pragma pack(push, 1)
  // Autogenerated type: Oculus.Interaction.TouchHandGrabInteractor/FingerStatus
  // [TokenAttribute] Offset: FFFFFFFF
  class TouchHandGrabInteractor::FingerStatus : public ::Il2CppObject {
    public:
    public:
    // public System.Boolean Locked
    // Size: 0x1
    // Offset: 0x10
    bool Locked;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean Selecting
    // Size: 0x1
    // Offset: 0x11
    bool Selecting;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: Selecting and: Joints
    char __padding1[0x6] = {};
    // public Oculus.Interaction.Input.HandJointId[] Joints
    // Size: 0x8
    // Offset: 0x18
    ::ArrayW<::Oculus::Interaction::Input::HandJointId> Joints;
    // Field size check
    static_assert(sizeof(::ArrayW<::Oculus::Interaction::Input::HandJointId>) == 0x8);
    // public UnityEngine.Pose[] LocalJoints
    // Size: 0x8
    // Offset: 0x20
    ::ArrayW<::UnityEngine::Pose> LocalJoints;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Pose>) == 0x8);
    // public System.Single CurlValueAtLock
    // Size: 0x4
    // Offset: 0x28
    float CurlValueAtLock;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single Timer
    // Size: 0x4
    // Offset: 0x2C
    float Timer;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Get instance field reference: public System.Boolean Locked
    [[deprecated("Use field access instead!")]] bool& dyn_Locked();
    // Get instance field reference: public System.Boolean Selecting
    [[deprecated("Use field access instead!")]] bool& dyn_Selecting();
    // Get instance field reference: public Oculus.Interaction.Input.HandJointId[] Joints
    [[deprecated("Use field access instead!")]] ::ArrayW<::Oculus::Interaction::Input::HandJointId>& dyn_Joints();
    // Get instance field reference: public UnityEngine.Pose[] LocalJoints
    [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::Pose>& dyn_LocalJoints();
    // Get instance field reference: public System.Single CurlValueAtLock
    [[deprecated("Use field access instead!")]] float& dyn_CurlValueAtLock();
    // Get instance field reference: public System.Single Timer
    [[deprecated("Use field access instead!")]] float& dyn_Timer();
    // public System.Void .ctor()
    // Offset: 0x47BD84C
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static TouchHandGrabInteractor::FingerStatus* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::TouchHandGrabInteractor::FingerStatus::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<TouchHandGrabInteractor::FingerStatus*, creationType>()));
    }
  }; // Oculus.Interaction.TouchHandGrabInteractor/FingerStatus
  #pragma pack(pop)
  static check_size<sizeof(TouchHandGrabInteractor::FingerStatus), 44 + sizeof(float)> __Oculus_Interaction_TouchHandGrabInteractor_FingerStatusSizeCheck;
  static_assert(sizeof(TouchHandGrabInteractor::FingerStatus) == 0x30);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Oculus::Interaction::TouchHandGrabInteractor::FingerStatus::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
