// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.Rendering.VertexAttributeDescriptor
#include "UnityEngine/Rendering/VertexAttributeDescriptor.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: Unity.Collections.NativeArray`1
#include "Unity/Collections/NativeArray_1.hpp"
// Including type: Oculus.Interaction.TubePoint
#include "Oculus/Interaction/TubePoint.hpp"
// Including type: UnityEngine.Color32
#include "UnityEngine/Color32.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Mesh
  class Mesh;
  // Forward declaring type: MeshFilter
  class MeshFilter;
  // Forward declaring type: MeshRenderer
  class MeshRenderer;
  // Forward declaring type: Gradient
  class Gradient;
  // Forward declaring type: Space
  struct Space;
  // Forward declaring type: Pose
  struct Pose;
  // Skipping declaration: Quaternion because it is already included!
}
// Forward declaring namespace: Oculus::Interaction
namespace Oculus::Interaction {
}
// Completed forward declares
// Type namespace: Oculus.Interaction
namespace Oculus::Interaction {
  // Forward declaring type: TubeRenderer
  class TubeRenderer;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Oculus::Interaction::TubeRenderer);
DEFINE_IL2CPP_ARG_TYPE(::Oculus::Interaction::TubeRenderer*, "Oculus.Interaction", "TubeRenderer");
// Type namespace: Oculus.Interaction
namespace Oculus::Interaction {
  // WARNING Size may be invalid!
  // Autogenerated type: Oculus.Interaction.TubeRenderer
  // [TokenAttribute] Offset: FFFFFFFF
  class TubeRenderer : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::Oculus::Interaction::TubeRenderer::VertexLayout
    struct VertexLayout;
    // Nested type: ::Oculus::Interaction::TubeRenderer::$$c__DisplayClass73_0
    struct $$c__DisplayClass73_0;
    // Size: 0x18
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: Oculus.Interaction.TubeRenderer/VertexLayout
    // [TokenAttribute] Offset: FFFFFFFF
    struct VertexLayout/*, public ::System::ValueType*/ {
      public:
      public:
      // public UnityEngine.Vector3 pos
      // Size: 0xC
      // Offset: 0x0
      ::UnityEngine::Vector3 pos;
      // Field size check
      static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
      // public UnityEngine.Color32 color
      // Size: 0x4
      // Offset: 0xC
      ::UnityEngine::Color32 color;
      // Field size check
      static_assert(sizeof(::UnityEngine::Color32) == 0x4);
      // public UnityEngine.Vector2 uv
      // Size: 0x8
      // Offset: 0x10
      ::UnityEngine::Vector2 uv;
      // Field size check
      static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
      public:
      // Creating value type constructor for type: VertexLayout
      constexpr VertexLayout(::UnityEngine::Vector3 pos_ = {}, ::UnityEngine::Color32 color_ = {}, ::UnityEngine::Vector2 uv_ = {}) noexcept : pos{pos_}, color{color_}, uv{uv_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public UnityEngine.Vector3 pos
      [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_pos();
      // Get instance field reference: public UnityEngine.Color32 color
      [[deprecated("Use field access instead!")]] ::UnityEngine::Color32& dyn_color();
      // Get instance field reference: public UnityEngine.Vector2 uv
      [[deprecated("Use field access instead!")]] ::UnityEngine::Vector2& dyn_uv();
    }; // Oculus.Interaction.TubeRenderer/VertexLayout
    #pragma pack(pop)
    static check_size<sizeof(TubeRenderer::VertexLayout), 16 + sizeof(::UnityEngine::Vector2)> __Oculus_Interaction_TubeRenderer_VertexLayoutSizeCheck;
    static_assert(sizeof(TubeRenderer::VertexLayout) == 0x18);
    public:
    // private UnityEngine.MeshFilter _filter
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::MeshFilter* filter;
    // Field size check
    static_assert(sizeof(::UnityEngine::MeshFilter*) == 0x8);
    // private UnityEngine.MeshRenderer _renderer
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::MeshRenderer* renderer;
    // Field size check
    static_assert(sizeof(::UnityEngine::MeshRenderer*) == 0x8);
    // private System.Int32 _divisions
    // Size: 0x4
    // Offset: 0x30
    int divisions;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _bevel
    // Size: 0x4
    // Offset: 0x34
    int bevel;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _renderQueue
    // Size: 0x4
    // Offset: 0x38
    int renderQueue;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.Vector2 _renderOffset
    // Size: 0x8
    // Offset: 0x3C
    ::UnityEngine::Vector2 renderOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private System.Single _radius
    // Size: 0x4
    // Offset: 0x44
    float radius;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Gradient _gradient
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::Gradient* gradient;
    // Field size check
    static_assert(sizeof(::UnityEngine::Gradient*) == 0x8);
    // private UnityEngine.Color _tint
    // Size: 0x10
    // Offset: 0x50
    ::UnityEngine::Color tint;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private System.Single _progressFade
    // Size: 0x4
    // Offset: 0x60
    float progressFade;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _startFadeThresold
    // Size: 0x4
    // Offset: 0x64
    float startFadeThresold;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _endFadeThresold
    // Size: 0x4
    // Offset: 0x68
    float endFadeThresold;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean _invertThreshold
    // Size: 0x1
    // Offset: 0x6C
    bool invertThreshold;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Single _feather
    // Size: 0x4
    // Offset: 0x70
    float feather;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean _mirrorTexture
    // Size: 0x1
    // Offset: 0x74
    bool mirrorTexture;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Single <Progress>k__BackingField
    // Size: 0x4
    // Offset: 0x78
    float Progress;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Rendering.VertexAttributeDescriptor[] _dataLayout
    // Size: 0x8
    // Offset: 0x80
    ::ArrayW<::UnityEngine::Rendering::VertexAttributeDescriptor> dataLayout;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Rendering::VertexAttributeDescriptor>) == 0x8);
    // private Unity.Collections.NativeArray`1<Oculus.Interaction.TubeRenderer/VertexLayout> _vertsData
    // Size: 0xFFFFFFFF
    // Offset: 0x88
    ::Unity::Collections::NativeArray_1<::Oculus::Interaction::TubeRenderer::VertexLayout> vertsData;
    // private Oculus.Interaction.TubeRenderer/VertexLayout _layout
    // Size: 0x18
    // Offset: 0x98
    ::Oculus::Interaction::TubeRenderer::VertexLayout layout;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::TubeRenderer::VertexLayout) == 0x18);
    // private UnityEngine.Mesh _mesh
    // Size: 0x8
    // Offset: 0xB0
    ::UnityEngine::Mesh* mesh;
    // Field size check
    static_assert(sizeof(::UnityEngine::Mesh*) == 0x8);
    // private System.Int32[] _tris
    // Size: 0x8
    // Offset: 0xB8
    ::ArrayW<int> tris;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // private System.Int32 _initializedSteps
    // Size: 0x4
    // Offset: 0xC0
    int initializedSteps;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _vertsCount
    // Size: 0x4
    // Offset: 0xC4
    int vertsCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single _totalLength
    // Size: 0x4
    // Offset: 0xC8
    float totalLength;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Get static field: static private readonly System.Int32 _fadeLimitsShaderID
    static int _get__fadeLimitsShaderID();
    // Set static field: static private readonly System.Int32 _fadeLimitsShaderID
    static void _set__fadeLimitsShaderID(int value);
    // Get static field: static private readonly System.Int32 _fadeSignShaderID
    static int _get__fadeSignShaderID();
    // Set static field: static private readonly System.Int32 _fadeSignShaderID
    static void _set__fadeSignShaderID(int value);
    // Get static field: static private readonly System.Int32 _offsetFactorShaderPropertyID
    static int _get__offsetFactorShaderPropertyID();
    // Set static field: static private readonly System.Int32 _offsetFactorShaderPropertyID
    static void _set__offsetFactorShaderPropertyID(int value);
