// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.UIElements.PointerManipulator
#include "UnityEngine/UIElements/PointerManipulator.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UIElements::Internal
namespace UnityEngine::UIElements::Internal {
  // Forward declaring type: MultiColumnCollectionHeader
  class MultiColumnCollectionHeader;
  // Forward declaring type: MultiColumnHeaderColumnMoveLocationPreview
  class MultiColumnHeaderColumnMoveLocationPreview;
}
// Forward declaring namespace: UnityEngine::UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: VisualElement
  class VisualElement;
  // Forward declaring type: Column
  class Column;
  // Forward declaring type: ColumnLayout
  class ColumnLayout;
  // Forward declaring type: MouseDownEvent
  class MouseDownEvent;
  // Forward declaring type: MouseMoveEvent
  class MouseMoveEvent;
  // Forward declaring type: MouseUpEvent
  class MouseUpEvent;
  // Forward declaring type: MouseCaptureOutEvent
  class MouseCaptureOutEvent;
  // Forward declaring type: PointerDownEvent
  class PointerDownEvent;
  // Forward declaring type: PointerMoveEvent
  class PointerMoveEvent;
  // Forward declaring type: PointerUpEvent
  class PointerUpEvent;
  // Forward declaring type: PointerCancelEvent
  class PointerCancelEvent;
  // Forward declaring type: PointerCaptureOutEvent
  class PointerCaptureOutEvent;
  // Forward declaring type: EventBase
  class EventBase;
  // Forward declaring type: KeyDownEvent
  class KeyDownEvent;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Vector2
  struct Vector2;
}
// Completed forward declares
// Type namespace: UnityEngine.UIElements.Internal
namespace UnityEngine::UIElements::Internal {
  // Forward declaring type: ColumnMover
  class ColumnMover;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::UIElements::Internal::ColumnMover);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UIElements::Internal::ColumnMover*, "UnityEngine.UIElements.Internal", "ColumnMover");
// Type namespace: UnityEngine.UIElements.Internal
namespace UnityEngine::UIElements::Internal {
  // Size: 0x90
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.UIElements.Internal.ColumnMover
  // [TokenAttribute] Offset: FFFFFFFF
  class ColumnMover : public ::UnityEngine::UIElements::PointerManipulator {
    public:
    public:
    // private System.Single m_StartPos
    // Size: 0x4
    // Offset: 0x30
    float m_StartPos;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_LastPos
    // Size: 0x4
    // Offset: 0x34
    float m_LastPos;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_Active
    // Size: 0x1
    // Offset: 0x38
    bool m_Active;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_Moving
    // Size: 0x1
    // Offset: 0x39
    bool m_Moving;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_Cancelled
    // Size: 0x1
    // Offset: 0x3A
    bool m_Cancelled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_Cancelled and: m_Header
    char __padding4[0x5] = {};
    // private UnityEngine.UIElements.Internal.MultiColumnCollectionHeader m_Header
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::UIElements::Internal::MultiColumnCollectionHeader* m_Header;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::Internal::MultiColumnCollectionHeader*) == 0x8);
    // private UnityEngine.UIElements.VisualElement m_PreviewElement
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::UIElements::VisualElement* m_PreviewElement;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::VisualElement*) == 0x8);
    // private UnityEngine.UIElements.Internal.MultiColumnHeaderColumnMoveLocationPreview m_LocationPreviewElement
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::UIElements::Internal::MultiColumnHeaderColumnMoveLocationPreview* m_LocationPreviewElement;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::Internal::MultiColumnHeaderColumnMoveLocationPreview*) == 0x8);
    // private UnityEngine.UIElements.Column m_ColumnToMove
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::UIElements::Column* m_ColumnToMove;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::Column*) == 0x8);
    // private System.Single m_ColumnToMovePos
    // Size: 0x4
    // Offset: 0x60
    float m_ColumnToMovePos;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_ColumnToMoveWidth
    // Size: 0x4
    // Offset: 0x64
    float m_ColumnToMoveWidth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.UIElements.Column m_DestinationColumn
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::UIElements::Column* m_DestinationColumn;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::Column*) == 0x8);
    // private System.Boolean m_MoveBeforeDestination
    // Size: 0x1
    // Offset: 0x70
    bool m_MoveBeforeDestination;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_MoveBeforeDestination and: columnLayout
    char __padding12[0x7] = {};
    // private UnityEngine.UIElements.ColumnLayout <columnLayout>k__BackingField
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::UIElements::ColumnLayout* columnLayout;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::ColumnLayout*) == 0x8);
    // private System.Action`1<UnityEngine.UIElements.Internal.ColumnMover> activeChanged
    // Size: 0x8
    // Offset: 0x80
    ::System::Action_1<::UnityEngine::UIElements::Internal::ColumnMover*>* activeChanged;
    // Field size check
    static_assert(sizeof(::System::Action_1<::UnityEngine::UIElements::Internal::ColumnMover*>*) == 0x8);
    // private System.Action`1<UnityEngine.UIElements.Internal.ColumnMover> movingChanged
    // Size: 0x8
    // Offset: 0x88
    ::System::Action_1<::UnityEngine::UIElements::Internal::ColumnMover*>* movingChanged;
    // Field size check
    static_assert(sizeof(::System::Action_1<::UnityEngine::UIElements::Internal::ColumnMover*>*) == 0x8);
    public:
    // Get instance field reference: private System.Single m_StartPos
    [[deprecated("Use field access instead!")]] float& dyn_m_StartPos();
    // Get instance field reference: private System.Single m_LastPos
    [[deprecated("Use field access instead!")]] float& dyn_m_LastPos();
    // Get instance field reference: private System.Boolean m_Active
    [[deprecated("Use field access instead!")]] bool& dyn_m_Active();
    // Get instance field reference: private System.Boolean m_Moving
    [[deprecated("Use field access instead!")]] bool& dyn_m_Moving();
    // Get instance field reference: private System.Boolean m_Cancelled
    [[deprecated("Use field access instead!")]] bool& dyn_m_Cancelled();
