// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.UIElements.VisualElement
#include "UnityEngine/UIElements/VisualElement.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UIElements::Internal
namespace UnityEngine::UIElements::Internal {
  // Forward declaring type: MultiColumnHeaderColumnSortIndicator
  class MultiColumnHeaderColumnSortIndicator;
  // Forward declaring type: ColumnMover
  class ColumnMover;
}
// Forward declaring namespace: UnityEngine::UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: IVisualElementScheduledItem
  class IVisualElementScheduledItem;
  // Forward declaring type: Clickable
  class Clickable;
  // Forward declaring type: Column
  class Column;
  // Forward declaring type: ColumnDataType
  struct ColumnDataType;
}
// Completed forward declares
// Type namespace: UnityEngine.UIElements.Internal
namespace UnityEngine::UIElements::Internal {
  // Forward declaring type: MultiColumnHeaderColumn
  class MultiColumnHeaderColumn;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::UIElements::Internal::MultiColumnHeaderColumn);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UIElements::Internal::MultiColumnHeaderColumn*, "UnityEngine.UIElements.Internal", "MultiColumnHeaderColumn");
// Type namespace: UnityEngine.UIElements.Internal
namespace UnityEngine::UIElements::Internal {
  // WARNING Size may be invalid!
  // Autogenerated type: UnityEngine.UIElements.Internal.MultiColumnHeaderColumn
  // [TokenAttribute] Offset: FFFFFFFF
  class MultiColumnHeaderColumn : public ::UnityEngine::UIElements::VisualElement {
    public:
    public:
    // private UnityEngine.UIElements.VisualElement m_ContentContainer
    // Size: 0x8
    // Offset: 0x3C0
    ::UnityEngine::UIElements::VisualElement* m_ContentContainer;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::VisualElement*) == 0x8);
    // private UnityEngine.UIElements.VisualElement m_Content
    // Size: 0x8
    // Offset: 0x3C8
    ::UnityEngine::UIElements::VisualElement* m_Content;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::VisualElement*) == 0x8);
    // private UnityEngine.UIElements.Internal.MultiColumnHeaderColumnSortIndicator m_SortIndicatorContainer
    // Size: 0x8
    // Offset: 0x3D0
    ::UnityEngine::UIElements::Internal::MultiColumnHeaderColumnSortIndicator* m_SortIndicatorContainer;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::Internal::MultiColumnHeaderColumnSortIndicator*) == 0x8);
    // private UnityEngine.UIElements.IVisualElementScheduledItem m_ScheduledHeaderTemplateUpdate
    // Size: 0x8
    // Offset: 0x3D8
    ::UnityEngine::UIElements::IVisualElementScheduledItem* m_ScheduledHeaderTemplateUpdate;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::IVisualElementScheduledItem*) == 0x8);
    // private UnityEngine.UIElements.Clickable <clickable>k__BackingField
    // Size: 0x8
    // Offset: 0x3E0
    ::UnityEngine::UIElements::Clickable* clickable;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::Clickable*) == 0x8);
    // private UnityEngine.UIElements.Internal.ColumnMover <mover>k__BackingField
    // Size: 0x8
    // Offset: 0x3E8
    ::UnityEngine::UIElements::Internal::ColumnMover* mover;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::Internal::ColumnMover*) == 0x8);
    // private UnityEngine.UIElements.Column <column>k__BackingField
    // Size: 0x8
    // Offset: 0x3F0
    ::UnityEngine::UIElements::Column* column;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::Column*) == 0x8);
    public:
    // Get static field: static public readonly System.String ussClassName
    static ::StringW _get_ussClassName();
    // Set static field: static public readonly System.String ussClassName
    static void _set_ussClassName(::StringW value);
    // Get static field: static public readonly System.String sortableUssClassName
    static ::StringW _get_sortableUssClassName();
    // Set static field: static public readonly System.String sortableUssClassName
    static void _set_sortableUssClassName(::StringW value);
    // Get static field: static public readonly System.String sortedAscendingUssClassName
    static ::StringW _get_sortedAscendingUssClassName();
    // Set static field: static public readonly System.String sortedAscendingUssClassName
    static void _set_sortedAscendingUssClassName(::StringW value);
    // Get static field: static public readonly System.String sortedDescendingUssClassName
