// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.UIElements.VisualElement
#include "UnityEngine/UIElements/VisualElement.hpp"
// Including type: System.IDisposable
#include "System/IDisposable.hpp"
// Including type: UnityEngine.UIElements.SortDirection
#include "UnityEngine/UIElements/SortDirection.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UIElements::Internal
namespace UnityEngine::UIElements::Internal {
  // Forward declaring type: ColumnMover
  class ColumnMover;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: IEnumerable`1<T>
  template<typename T>
  class IEnumerable_1;
}
// Forward declaring namespace: UnityEngine::UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: SortColumnDescription
  class SortColumnDescription;
  // Forward declaring type: Column
  class Column;
  // Forward declaring type: ColumnLayout
  class ColumnLayout;
  // Forward declaring type: SortColumnDescriptions
  class SortColumnDescriptions;
  // Forward declaring type: Columns
  class Columns;
  // Forward declaring type: ContextualMenuPopulateEvent
  class ContextualMenuPopulateEvent;
  // Forward declaring type: ColumnDataType
  struct ColumnDataType;
  // Forward declaring type: GeometryChangedEvent
  class GeometryChangedEvent;
  // Forward declaring type: EventBase
  class EventBase;
  // Forward declaring type: DropdownMenuAction
  class DropdownMenuAction;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
  // Forward declaring type: Action
  class Action;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: EventModifiers
  struct EventModifiers;
}
// Completed forward declares
// Type namespace: UnityEngine.UIElements.Internal
namespace UnityEngine::UIElements::Internal {
  // Forward declaring type: MultiColumnCollectionHeader
  class MultiColumnCollectionHeader;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::UIElements::Internal::MultiColumnCollectionHeader);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::UIElements::Internal::MultiColumnCollectionHeader*, "UnityEngine.UIElements.Internal", "MultiColumnCollectionHeader");
// Type namespace: UnityEngine.UIElements.Internal
namespace UnityEngine::UIElements::Internal {
  // WARNING Size may be invalid!
  // Autogenerated type: UnityEngine.UIElements.Internal.MultiColumnCollectionHeader
  // [TokenAttribute] Offset: FFFFFFFF
  class MultiColumnCollectionHeader : public ::UnityEngine::UIElements::VisualElement/*, public ::System::IDisposable*/ {
    public:
    // Nested type: ::UnityEngine::UIElements::Internal::MultiColumnCollectionHeader::ViewState
    class ViewState;
    // Nested type: ::UnityEngine::UIElements::Internal::MultiColumnCollectionHeader::ColumnData
    class ColumnData;
    // Nested type: ::UnityEngine::UIElements::Internal::MultiColumnCollectionHeader::SortedColumnState
    struct SortedColumnState;
    // Nested type: ::UnityEngine::UIElements::Internal::MultiColumnCollectionHeader::$$c__DisplayClass59_0
    class $$c__DisplayClass59_0;
    // Nested type: ::UnityEngine::UIElements::Internal::MultiColumnCollectionHeader::$$c__DisplayClass65_0
    class $$c__DisplayClass65_0;
    // Size: 0xC
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.UIElements.Internal.MultiColumnCollectionHeader/SortedColumnState
    // [TokenAttribute] Offset: FFFFFFFF
    struct SortedColumnState/*, public ::System::ValueType*/ {
      public:
      public:
      // public UnityEngine.UIElements.SortColumnDescription columnDesc
      // Size: 0x8
      // Offset: 0x0
      ::UnityEngine::UIElements::SortColumnDescription* columnDesc;
      // Field size check
      static_assert(sizeof(::UnityEngine::UIElements::SortColumnDescription*) == 0x8);
      // public UnityEngine.UIElements.SortDirection direction
      // Size: 0x4
      // Offset: 0x8
      ::UnityEngine::UIElements::SortDirection direction;
      // Field size check
      static_assert(sizeof(::UnityEngine::UIElements::SortDirection) == 0x4);
      public:
      // Creating value type constructor for type: SortedColumnState
      constexpr SortedColumnState(::UnityEngine::UIElements::SortColumnDescription* columnDesc_ = {}, ::UnityEngine::UIElements::SortDirection direction_ = {}) noexcept : columnDesc{columnDesc_}, direction{direction_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public UnityEngine.UIElements.SortColumnDescription columnDesc
      [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::SortColumnDescription*& dyn_columnDesc();
      // Get instance field reference: public UnityEngine.UIElements.SortDirection direction
      [[deprecated("Use field access instead!")]] ::UnityEngine::UIElements::SortDirection& dyn_direction();
      // public System.Void .ctor(UnityEngine.UIElements.SortColumnDescription desc, UnityEngine.UIElements.SortDirection dir)
      // Offset: 0x560C0B4
      // ABORTED: conflicts with another method.  SortedColumnState(::UnityEngine::UIElements::SortColumnDescription* desc, ::UnityEngine::UIElements::SortDirection dir);
    }; // UnityEngine.UIElements.Internal.MultiColumnCollectionHeader/SortedColumnState
    #pragma pack(pop)
    static check_size<sizeof(MultiColumnCollectionHeader::SortedColumnState), 8 + sizeof(::UnityEngine::UIElements::SortDirection)> __UnityEngine_UIElements_Internal_MultiColumnCollectionHeader_SortedColumnStateSizeCheck;
    static_assert(sizeof(MultiColumnCollectionHeader::SortedColumnState) == 0xC);
    public:
    // private System.Boolean m_SortingEnabled
    // Size: 0x1
    // Offset: 0x3C0
    bool m_SortingEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Collections.Generic.List`1<UnityEngine.UIElements.SortColumnDescription> m_SortedColumns
    // Size: 0x8
    // Offset: 0x3C8
    ::System::Collections::Generic::List_1<::UnityEngine::UIElements::SortColumnDescription*>* m_SortedColumns;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::UIElements::SortColumnDescription*>*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.UIElements.Internal.MultiColumnCollectionHeader/SortedColumnState> m_OldSortedColumnStates
    // Size: 0x8
    // Offset: 0x3D0
    ::System::Collections::Generic::List_1<::UnityEngine::UIElements::Internal::MultiColumnCollectionHeader::SortedColumnState>* m_OldSortedColumnStates;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::UIElements::Internal::MultiColumnCollectionHeader::SortedColumnState>*) == 0x8);
    // private System.Boolean m_SortingUpdatesTemporarilyDisabled
    // Size: 0x1
    // Offset: 0x3D8
    bool m_SortingUpdatesTemporarilyDisabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private UnityEngine.UIElements.Internal.MultiColumnCollectionHeader/ViewState m_ViewState
    // Size: 0x8
    // Offset: 0x3E0
    ::UnityEngine::UIElements::Internal::MultiColumnCollectionHeader::ViewState* m_ViewState;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::Internal::MultiColumnCollectionHeader::ViewState*) == 0x8);
    // private System.Boolean m_ApplyingViewState
    // Size: 0x1
    // Offset: 0x3E8
    bool m_ApplyingViewState;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_DoLayoutScheduled
    // Size: 0x1
    // Offset: 0x3E9
    bool m_DoLayoutScheduled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private readonly System.Collections.Generic.Dictionary`2<UnityEngine.UIElements.Column,UnityEngine.UIElements.Internal.MultiColumnCollectionHeader/ColumnData> <columnDataMap>k__BackingField
    // Size: 0x8
    // Offset: 0x3F0
    ::System::Collections::Generic::Dictionary_2<::UnityEngine::UIElements::Column*, ::UnityEngine::UIElements::Internal::MultiColumnCollectionHeader::ColumnData*>* columnDataMap;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::UnityEngine::UIElements::Column*, ::UnityEngine::UIElements::Internal::MultiColumnCollectionHeader::ColumnData*>*) == 0x8);
    // private readonly UnityEngine.UIElements.ColumnLayout <columnLayout>k__BackingField
    // Size: 0x8
    // Offset: 0x3F8
    ::UnityEngine::UIElements::ColumnLayout* columnLayout;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::ColumnLayout*) == 0x8);
    // private readonly UnityEngine.UIElements.VisualElement <columnContainer>k__BackingField
    // Size: 0x8
    // Offset: 0x400
    ::UnityEngine::UIElements::VisualElement* columnContainer;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::VisualElement*) == 0x8);
    // private readonly UnityEngine.UIElements.VisualElement <resizeHandleContainer>k__BackingField
    // Size: 0x8
    // Offset: 0x408
    ::UnityEngine::UIElements::VisualElement* resizeHandleContainer;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::VisualElement*) == 0x8);
    // private readonly UnityEngine.UIElements.SortColumnDescriptions <sortDescriptions>k__BackingField
    // Size: 0x8
    // Offset: 0x410
    ::UnityEngine::UIElements::SortColumnDescriptions* sortDescriptions;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::SortColumnDescriptions*) == 0x8);
    // private readonly UnityEngine.UIElements.Columns <columns>k__BackingField
    // Size: 0x8
    // Offset: 0x418
    ::UnityEngine::UIElements::Columns* columns;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::Columns*) == 0x8);
    // private System.Action`2<System.Int32,System.Single> columnResized
    // Size: 0x8
    // Offset: 0x420
    ::System::Action_2<int, float>* columnResized;
    // Field size check
    static_assert(sizeof(::System::Action_2<int, float>*) == 0x8);
    // private System.Action columnSortingChanged
    // Size: 0x8
    // Offset: 0x428
    ::System::Action* columnSortingChanged;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private System.Action`2<UnityEngine.UIElements.ContextualMenuPopulateEvent,UnityEngine.UIElements.Column> contextMenuPopulateEvent
    // Size: 0x8
    // Offset: 0x430
    ::System::Action_2<::UnityEngine::UIElements::ContextualMenuPopulateEvent*, ::UnityEngine::UIElements::Column*>* contextMenuPopulateEvent;
    // Field size check
    static_assert(sizeof(::System::Action_2<::UnityEngine::UIElements::ContextualMenuPopulateEvent*, ::UnityEngine::UIElements::Column*>*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::System::IDisposable
    operator ::System::IDisposable() noexcept {
      return *reinterpret_cast<::System::IDisposable*>(this);
    }
    // Get static field: static public readonly System.String ussClassName
    static ::StringW _get_ussClassName();
    // Set static field: static public readonly System.String ussClassName
    static void _set_ussClassName(::StringW value);
    // Get static field: static public readonly System.String columnContainerUssClassName
    static ::StringW _get_columnContainerUssClassName();
