// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: Fusion.INetworkStruct
#include "Fusion/INetworkStruct.hpp"
// Completed includes
// Type namespace: Fusion.CodeGen
namespace Fusion::CodeGen {
  // Forward declaring type: FixedStorage@207
  struct FixedStorage@207;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::Fusion::CodeGen::FixedStorage@207, "Fusion.CodeGen", "FixedStorage@207");
// Type namespace: Fusion.CodeGen
namespace Fusion::CodeGen {
  // Size: 0x33C
  #pragma pack(push, 1)
  // WARNING Layout: Explicit may not be correctly taken into account!
  // Autogenerated type: Fusion.CodeGen.FixedStorage@207
  // [TokenAttribute] Offset: FFFFFFFF
  // [NetworkStructWeavedAttribute] Offset: FFFFFFFF
  struct FixedStorage@207/*, public ::System::ValueType, public ::Fusion::INetworkStruct*/ {
    public:
    // Nested type: ::Fusion::CodeGen::FixedStorage@207::$Data$e__FixedBuffer
    struct $Data$e__FixedBuffer;
    // Size: 0x4
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: Fusion.CodeGen.FixedStorage@207/<Data>e__FixedBuffer
    // [TokenAttribute] Offset: FFFFFFFF
    // [UnsafeValueTypeAttribute] Offset: FFFFFFFF
    // [CompilerGeneratedAttribute] Offset: FFFFFFFF
    struct $Data$e__FixedBuffer/*, public ::System::ValueType*/ {
      public:
      public:
      // private System.Int32 FixedElementField
      // Size: 0x4
      // Offset: 0x0
      int FixedElementField;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: $Data$e__FixedBuffer
      constexpr $Data$e__FixedBuffer(int FixedElementField_ = {}) noexcept : FixedElementField{FixedElementField_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return FixedElementField;
      }
      // Get instance field reference: private System.Int32 FixedElementField
      [[deprecated("Use field access instead!")]] int& dyn_FixedElementField();
    }; // Fusion.CodeGen.FixedStorage@207/<Data>e__FixedBuffer
    #pragma pack(pop)
    static check_size<sizeof(FixedStorage@207::$Data$e__FixedBuffer), 0 + sizeof(int)> __Fusion_CodeGen_FixedStorage@207_$Data$e__FixedBufferSizeCheck;
    static_assert(sizeof(FixedStorage@207::$Data$e__FixedBuffer) == 0x4);
    public:
    // public Fusion.CodeGen.FixedStorage@207/<Data>e__FixedBuffer Data
    // Size: 0x4
    // Offset: 0x0
    ::Fusion::CodeGen::FixedStorage@207::$Data$e__FixedBuffer Data;
    // Field size check
    static_assert(sizeof(::Fusion::CodeGen::FixedStorage@207::$Data$e__FixedBuffer) == 0x4);
    // private System.Int32 _1
    // Size: 0x4
    // Offset: 0x4
    int _1;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _2
    // Size: 0x4
    // Offset: 0x8
    int _2;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _3
    // Size: 0x4
    // Offset: 0xC
    int _3;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _4
    // Size: 0x4
    // Offset: 0x10
    int _4;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _5
    // Size: 0x4
    // Offset: 0x14
    int _5;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _6
    // Size: 0x4
    // Offset: 0x18
    int _6;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _7
    // Size: 0x4
    // Offset: 0x1C
    int _7;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _8
    // Size: 0x4
    // Offset: 0x20
    int _8;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _9
    // Size: 0x4
    // Offset: 0x24
    int _9;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _10
    // Size: 0x4
    // Offset: 0x28
    int _10;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _11
    // Size: 0x4
    // Offset: 0x2C
    int _11;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _12
    // Size: 0x4
    // Offset: 0x30
    int _12;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _13
    // Size: 0x4
    // Offset: 0x34
    int _13;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _14
    // Size: 0x4
    // Offset: 0x38
    int _14;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _15
    // Size: 0x4
    // Offset: 0x3C
    int _15;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _16
    // Size: 0x4
    // Offset: 0x40
    int _16;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _17
    // Size: 0x4
    // Offset: 0x44
    int _17;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _18
    // Size: 0x4
    // Offset: 0x48
    int _18;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _19
    // Size: 0x4
    // Offset: 0x4C
    int _19;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _20
    // Size: 0x4
    // Offset: 0x50
    int _20;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _21
    // Size: 0x4
    // Offset: 0x54
    int _21;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _22
    // Size: 0x4
    // Offset: 0x58
    int _22;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _23
    // Size: 0x4
    // Offset: 0x5C
    int _23;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _24
    // Size: 0x4
    // Offset: 0x60
    int _24;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _25
    // Size: 0x4
    // Offset: 0x64
    int _25;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _26
    // Size: 0x4
    // Offset: 0x68
    int _26;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _27
    // Size: 0x4
    // Offset: 0x6C
    int _27;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _28
    // Size: 0x4
    // Offset: 0x70
    int _28;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _29
    // Size: 0x4
    // Offset: 0x74
    int _29;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _30
    // Size: 0x4
    // Offset: 0x78
    int _30;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _31
    // Size: 0x4
    // Offset: 0x7C
    int _31;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _32
    // Size: 0x4
    // Offset: 0x80
    int _32;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _33
    // Size: 0x4
    // Offset: 0x84
    int _33;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _34
    // Size: 0x4
    // Offset: 0x88
    int _34;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _35
    // Size: 0x4
    // Offset: 0x8C
    int _35;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _36
    // Size: 0x4
    // Offset: 0x90
    int _36;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _37
    // Size: 0x4
    // Offset: 0x94
    int _37;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _38
    // Size: 0x4
    // Offset: 0x98
    int _38;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _39
    // Size: 0x4
    // Offset: 0x9C
    int _39;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _40
    // Size: 0x4
    // Offset: 0xA0
    int _40;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _41
    // Size: 0x4
    // Offset: 0xA4
    int _41;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _42
    // Size: 0x4
    // Offset: 0xA8
    int _42;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _43
    // Size: 0x4
    // Offset: 0xAC
    int _43;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _44
    // Size: 0x4
    // Offset: 0xB0
    int _44;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _45
    // Size: 0x4
    // Offset: 0xB4
    int _45;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _46
    // Size: 0x4
    // Offset: 0xB8
    int _46;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _47
    // Size: 0x4
    // Offset: 0xBC
    int _47;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _48
    // Size: 0x4
    // Offset: 0xC0
    int _48;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _49
    // Size: 0x4
    // Offset: 0xC4
    int _49;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _50
    // Size: 0x4
    // Offset: 0xC8
    int _50;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _51
    // Size: 0x4
    // Offset: 0xCC
    int _51;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _52
    // Size: 0x4
    // Offset: 0xD0
    int _52;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _53
    // Size: 0x4
    // Offset: 0xD4
    int _53;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _54
    // Size: 0x4
    // Offset: 0xD8
    int _54;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _55
    // Size: 0x4
    // Offset: 0xDC
    int _55;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _56
    // Size: 0x4
    // Offset: 0xE0
    int _56;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _57
    // Size: 0x4
    // Offset: 0xE4
    int _57;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _58
    // Size: 0x4
    // Offset: 0xE8
    int _58;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _59
    // Size: 0x4
    // Offset: 0xEC
    int _59;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _60
    // Size: 0x4
    // Offset: 0xF0
    int _60;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _61
    // Size: 0x4
    // Offset: 0xF4
    int _61;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _62
    // Size: 0x4
    // Offset: 0xF8
    int _62;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _63
    // Size: 0x4
    // Offset: 0xFC
    int _63;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _64
    // Size: 0x4
    // Offset: 0x100
    int _64;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _65
    // Size: 0x4
    // Offset: 0x104
    int _65;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _66
    // Size: 0x4
    // Offset: 0x108
    int _66;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _67
    // Size: 0x4
    // Offset: 0x10C
    int _67;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _68
    // Size: 0x4
    // Offset: 0x110
    int _68;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _69
    // Size: 0x4
    // Offset: 0x114
    int _69;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _70
    // Size: 0x4
    // Offset: 0x118
    int _70;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _71
    // Size: 0x4
    // Offset: 0x11C
    int _71;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _72
    // Size: 0x4
    // Offset: 0x120
    int _72;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _73
    // Size: 0x4
    // Offset: 0x124
    int _73;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _74
    // Size: 0x4
    // Offset: 0x128
    int _74;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _75
    // Size: 0x4
    // Offset: 0x12C
    int _75;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _76
    // Size: 0x4
    // Offset: 0x130
    int _76;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _77
    // Size: 0x4
    // Offset: 0x134
    int _77;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _78
    // Size: 0x4
    // Offset: 0x138
    int _78;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _79
    // Size: 0x4
    // Offset: 0x13C
    int _79;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _80
    // Size: 0x4
    // Offset: 0x140
    int _80;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _81
    // Size: 0x4
    // Offset: 0x144
    int _81;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _82
    // Size: 0x4
    // Offset: 0x148
    int _82;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _83
    // Size: 0x4
    // Offset: 0x14C
    int _83;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _84
    // Size: 0x4
    // Offset: 0x150
    int _84;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _85
    // Size: 0x4
    // Offset: 0x154
    int _85;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _86
    // Size: 0x4
    // Offset: 0x158
    int _86;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _87
    // Size: 0x4
    // Offset: 0x15C
    int _87;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _88
    // Size: 0x4
    // Offset: 0x160
    int _88;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _89
    // Size: 0x4
    // Offset: 0x164
    int _89;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _90
    // Size: 0x4
    // Offset: 0x168
    int _90;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _91
    // Size: 0x4
    // Offset: 0x16C
    int _91;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _92
    // Size: 0x4
    // Offset: 0x170
    int _92;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _93
    // Size: 0x4
    // Offset: 0x174
    int _93;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _94
    // Size: 0x4
    // Offset: 0x178
    int _94;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _95
    // Size: 0x4
    // Offset: 0x17C
    int _95;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _96
    // Size: 0x4
    // Offset: 0x180
    int _96;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _97
    // Size: 0x4
    // Offset: 0x184
    int _97;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _98
    // Size: 0x4
    // Offset: 0x188
    int _98;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _99
    // Size: 0x4
    // Offset: 0x18C
    int _99;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _100
    // Size: 0x4
    // Offset: 0x190
    int _100;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _101
    // Size: 0x4
    // Offset: 0x194
    int _101;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _102
    // Size: 0x4
    // Offset: 0x198
    int _102;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _103
    // Size: 0x4
    // Offset: 0x19C
    int _103;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _104
    // Size: 0x4
    // Offset: 0x1A0
    int _104;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _105
    // Size: 0x4
    // Offset: 0x1A4
    int _105;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _106
    // Size: 0x4
    // Offset: 0x1A8
    int _106;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _107
    // Size: 0x4
    // Offset: 0x1AC
    int _107;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _108
    // Size: 0x4
    // Offset: 0x1B0
    int _108;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _109
    // Size: 0x4
    // Offset: 0x1B4
    int _109;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _110
    // Size: 0x4
    // Offset: 0x1B8
    int _110;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _111
    // Size: 0x4
    // Offset: 0x1BC
    int _111;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _112
    // Size: 0x4
    // Offset: 0x1C0
    int _112;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _113
    // Size: 0x4
    // Offset: 0x1C4
    int _113;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _114
    // Size: 0x4
    // Offset: 0x1C8
    int _114;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _115
    // Size: 0x4
    // Offset: 0x1CC
    int _115;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _116
    // Size: 0x4
    // Offset: 0x1D0
    int _116;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _117
    // Size: 0x4
    // Offset: 0x1D4
    int _117;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _118
    // Size: 0x4
    // Offset: 0x1D8
    int _118;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _119
    // Size: 0x4
    // Offset: 0x1DC
    int _119;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _120
    // Size: 0x4
    // Offset: 0x1E0
    int _120;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _121
    // Size: 0x4
    // Offset: 0x1E4
    int _121;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _122
    // Size: 0x4
    // Offset: 0x1E8
    int _122;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _123
    // Size: 0x4
    // Offset: 0x1EC
    int _123;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _124
    // Size: 0x4
    // Offset: 0x1F0
    int _124;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _125
    // Size: 0x4
    // Offset: 0x1F4
    int _125;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _126
    // Size: 0x4
    // Offset: 0x1F8
    int _126;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _127
    // Size: 0x4
    // Offset: 0x1FC
    int _127;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _128
    // Size: 0x4
    // Offset: 0x200
    int _128;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _129
    // Size: 0x4
    // Offset: 0x204
    int _129;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _130
    // Size: 0x4
    // Offset: 0x208
    int _130;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _131
    // Size: 0x4
    // Offset: 0x20C
    int _131;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _132
    // Size: 0x4
    // Offset: 0x210
    int _132;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _133
    // Size: 0x4
    // Offset: 0x214
    int _133;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _134
    // Size: 0x4
    // Offset: 0x218
    int _134;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _135
    // Size: 0x4
    // Offset: 0x21C
    int _135;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _136
    // Size: 0x4
    // Offset: 0x220
    int _136;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _137
    // Size: 0x4
    // Offset: 0x224
    int _137;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _138
    // Size: 0x4
    // Offset: 0x228
    int _138;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _139
    // Size: 0x4
    // Offset: 0x22C
    int _139;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _140
    // Size: 0x4
    // Offset: 0x230
    int _140;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _141
    // Size: 0x4
    // Offset: 0x234
    int _141;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _142
    // Size: 0x4
    // Offset: 0x238
    int _142;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _143
    // Size: 0x4
    // Offset: 0x23C
    int _143;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _144
    // Size: 0x4
    // Offset: 0x240
    int _144;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _145
    // Size: 0x4
    // Offset: 0x244
    int _145;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _146
    // Size: 0x4
    // Offset: 0x248
    int _146;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _147
    // Size: 0x4
    // Offset: 0x24C
    int _147;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _148
    // Size: 0x4
    // Offset: 0x250
    int _148;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _149
    // Size: 0x4
    // Offset: 0x254
    int _149;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _150
    // Size: 0x4
    // Offset: 0x258
    int _150;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _151
    // Size: 0x4
    // Offset: 0x25C
    int _151;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _152
    // Size: 0x4
    // Offset: 0x260
    int _152;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _153
    // Size: 0x4
    // Offset: 0x264
    int _153;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _154
    // Size: 0x4
    // Offset: 0x268
    int _154;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _155
    // Size: 0x4
    // Offset: 0x26C
    int _155;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _156
    // Size: 0x4
    // Offset: 0x270
    int _156;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _157
    // Size: 0x4
    // Offset: 0x274
    int _157;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _158
    // Size: 0x4
    // Offset: 0x278
    int _158;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _159
    // Size: 0x4
    // Offset: 0x27C
    int _159;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _160
    // Size: 0x4
    // Offset: 0x280
    int _160;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _161
    // Size: 0x4
    // Offset: 0x284
    int _161;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _162
    // Size: 0x4
    // Offset: 0x288
    int _162;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _163
    // Size: 0x4
    // Offset: 0x28C
    int _163;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _164
    // Size: 0x4
    // Offset: 0x290
    int _164;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _165
    // Size: 0x4
    // Offset: 0x294
    int _165;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _166
    // Size: 0x4
    // Offset: 0x298
    int _166;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _167
    // Size: 0x4
    // Offset: 0x29C
    int _167;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _168
    // Size: 0x4
    // Offset: 0x2A0
    int _168;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _169
    // Size: 0x4
    // Offset: 0x2A4
    int _169;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _170
    // Size: 0x4
    // Offset: 0x2A8
    int _170;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _171
    // Size: 0x4
    // Offset: 0x2AC
    int _171;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _172
    // Size: 0x4
    // Offset: 0x2B0
    int _172;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _173
    // Size: 0x4
    // Offset: 0x2B4
    int _173;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _174
    // Size: 0x4
    // Offset: 0x2B8
    int _174;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _175
    // Size: 0x4
    // Offset: 0x2BC
    int _175;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _176
    // Size: 0x4
    // Offset: 0x2C0
    int _176;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _177
    // Size: 0x4
    // Offset: 0x2C4
    int _177;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _178
    // Size: 0x4
    // Offset: 0x2C8
    int _178;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _179
    // Size: 0x4
    // Offset: 0x2CC
    int _179;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _180
    // Size: 0x4
    // Offset: 0x2D0
    int _180;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _181
    // Size: 0x4
    // Offset: 0x2D4
    int _181;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _182
    // Size: 0x4
    // Offset: 0x2D8
    int _182;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _183
    // Size: 0x4
    // Offset: 0x2DC
    int _183;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _184
    // Size: 0x4
    // Offset: 0x2E0
    int _184;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _185
    // Size: 0x4
    // Offset: 0x2E4
    int _185;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _186
    // Size: 0x4
    // Offset: 0x2E8
    int _186;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _187
    // Size: 0x4
    // Offset: 0x2EC
    int _187;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _188
    // Size: 0x4
    // Offset: 0x2F0
    int _188;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _189
    // Size: 0x4
    // Offset: 0x2F4
    int _189;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _190
    // Size: 0x4
    // Offset: 0x2F8
    int _190;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _191
    // Size: 0x4
    // Offset: 0x2FC
    int _191;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _192
    // Size: 0x4
    // Offset: 0x300
    int _192;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _193
    // Size: 0x4
    // Offset: 0x304
    int _193;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _194
    // Size: 0x4
    // Offset: 0x308
    int _194;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _195
    // Size: 0x4
    // Offset: 0x30C
    int _195;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _196
    // Size: 0x4
    // Offset: 0x310
    int _196;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _197
    // Size: 0x4
    // Offset: 0x314
    int _197;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _198
    // Size: 0x4
    // Offset: 0x318
    int _198;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _199
    // Size: 0x4
    // Offset: 0x31C
    int _199;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _200
    // Size: 0x4
    // Offset: 0x320
    int _200;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _201
    // Size: 0x4
    // Offset: 0x324
    int _201;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _202
    // Size: 0x4
    // Offset: 0x328
    int _202;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _203
    // Size: 0x4
    // Offset: 0x32C
    int _203;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _204
    // Size: 0x4
    // Offset: 0x330
    int _204;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _205
    // Size: 0x4
    // Offset: 0x334
    int _205;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _206
    // Size: 0x4
    // Offset: 0x338
    int _206;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Creating value type constructor for type: FixedStorage@207
