// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.EventSystems.UIBehaviour
#include "UnityEngine/EventSystems/UIBehaviour.hpp"
// Including type: UnityEngine.EventSystems.RaycastResult
#include "UnityEngine/EventSystems/RaycastResult.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::EventSystems
namespace UnityEngine::EventSystems {
  // Forward declaring type: PointerEventData
  class PointerEventData;
  // Forward declaring type: BaseInputModule
  class BaseInputModule;
  // Forward declaring type: BaseEventData
  class BaseEventData;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Comparison`1<T>
  template<typename T>
  class Comparison_1;
}
// Forward declaring namespace: UnityEngine::UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: BaseRuntimePanel
  class BaseRuntimePanel;
}
// Completed forward declares
// Type namespace: UnityEngine.EventSystems
namespace UnityEngine::EventSystems {
  // Forward declaring type: EventSystem
  class EventSystem;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::EventSystems::EventSystem);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::EventSystems::EventSystem*, "UnityEngine.EventSystems", "EventSystem");
// Type namespace: UnityEngine.EventSystems
namespace UnityEngine::EventSystems {
  // Size: 0x5A
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.EventSystems.EventSystem
  // [TokenAttribute] Offset: FFFFFFFF
  // [DisallowMultipleComponent] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: FFFFFFFF
  class EventSystem : public ::UnityEngine::EventSystems::UIBehaviour {
    public:
    // Nested type: ::UnityEngine::EventSystems::EventSystem::UIToolkitOverrideConfig
    struct UIToolkitOverrideConfig;
    // Nested type: ::UnityEngine::EventSystems::EventSystem::$$c__DisplayClass56_0
    class $$c__DisplayClass56_0;
    // Size: 0xA
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.EventSystems.EventSystem/UIToolkitOverrideConfig
    // [TokenAttribute] Offset: FFFFFFFF
    struct UIToolkitOverrideConfig/*, public ::System::ValueType*/ {
      public:
      public:
      // public UnityEngine.EventSystems.EventSystem activeEventSystem
      // Size: 0x8
      // Offset: 0x0
      ::UnityEngine::EventSystems::EventSystem* activeEventSystem;
      // Field size check
      static_assert(sizeof(::UnityEngine::EventSystems::EventSystem*) == 0x8);
      // public System.Boolean sendEvents
      // Size: 0x1
      // Offset: 0x8
      bool sendEvents;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // public System.Boolean createPanelGameObjectsOnStart
      // Size: 0x1
      // Offset: 0x9
      bool createPanelGameObjectsOnStart;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      public:
      // Creating value type constructor for type: UIToolkitOverrideConfig
      constexpr UIToolkitOverrideConfig(::UnityEngine::EventSystems::EventSystem* activeEventSystem_ = {}, bool sendEvents_ = {}, bool createPanelGameObjectsOnStart_ = {}) noexcept : activeEventSystem{activeEventSystem_}, sendEvents{sendEvents_}, createPanelGameObjectsOnStart{createPanelGameObjectsOnStart_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public UnityEngine.EventSystems.EventSystem activeEventSystem
      [[deprecated("Use field access instead!")]] ::UnityEngine::EventSystems::EventSystem*& dyn_activeEventSystem();
      // Get instance field reference: public System.Boolean sendEvents
      [[deprecated("Use field access instead!")]] bool& dyn_sendEvents();
      // Get instance field reference: public System.Boolean createPanelGameObjectsOnStart
      [[deprecated("Use field access instead!")]] bool& dyn_createPanelGameObjectsOnStart();
    }; // UnityEngine.EventSystems.EventSystem/UIToolkitOverrideConfig
    #pragma pack(pop)
    static check_size<sizeof(EventSystem::UIToolkitOverrideConfig), 9 + sizeof(bool)> __UnityEngine_EventSystems_EventSystem_UIToolkitOverrideConfigSizeCheck;
    static_assert(sizeof(EventSystem::UIToolkitOverrideConfig) == 0xA);
    public:
    // private System.Collections.Generic.List`1<UnityEngine.EventSystems.BaseInputModule> m_SystemInputModules
    // Size: 0x8
    // Offset: 0x20
    ::System::Collections::Generic::List_1<::UnityEngine::EventSystems::BaseInputModule*>* m_SystemInputModules;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::EventSystems::BaseInputModule*>*) == 0x8);
    // private UnityEngine.EventSystems.BaseInputModule m_CurrentInputModule
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::EventSystems::BaseInputModule* m_CurrentInputModule;
    // Field size check
    static_assert(sizeof(::UnityEngine::EventSystems::BaseInputModule*) == 0x8);
    // private UnityEngine.GameObject m_FirstSelected
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::GameObject* m_FirstSelected;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Boolean m_sendNavigationEvents
    // Size: 0x1
    // Offset: 0x38
    bool m_sendNavigationEvents;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_sendNavigationEvents and: m_DragThreshold
    char __padding3[0x3] = {};
    // private System.Int32 m_DragThreshold
    // Size: 0x4
    // Offset: 0x3C
    int m_DragThreshold;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.GameObject m_CurrentSelected
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::GameObject* m_CurrentSelected;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Boolean m_HasFocus
    // Size: 0x1
    // Offset: 0x48
    bool m_HasFocus;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_SelectionGuard
    // Size: 0x1
    // Offset: 0x49
    bool m_SelectionGuard;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_SelectionGuard and: m_DummyData
    char __padding7[0x6] = {};
    // private UnityEngine.EventSystems.BaseEventData m_DummyData
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::EventSystems::BaseEventData* m_DummyData;
    // Field size check
    static_assert(sizeof(::UnityEngine::EventSystems::BaseEventData*) == 0x8);
    // private System.Boolean m_Started
    // Size: 0x1
    // Offset: 0x58
    bool m_Started;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_IsTrackingUIToolkitPanels
    // Size: 0x1
    // Offset: 0x59
    bool m_IsTrackingUIToolkitPanels;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get static field: static private System.Collections.Generic.List`1<UnityEngine.EventSystems.EventSystem> m_EventSystems
    static ::System::Collections::Generic::List_1<::UnityEngine::EventSystems::EventSystem*>* _get_m_EventSystems();
    // Set static field: static private System.Collections.Generic.List`1<UnityEngine.EventSystems.EventSystem> m_EventSystems
    static void _set_m_EventSystems(::System::Collections::Generic::List_1<::UnityEngine::EventSystems::EventSystem*>* value);
    // Get static field: static private readonly System.Comparison`1<UnityEngine.EventSystems.RaycastResult> s_RaycastComparer
    static ::System::Comparison_1<::UnityEngine::EventSystems::RaycastResult>* _get_s_RaycastComparer();
    // Set static field: static private readonly System.Comparison`1<UnityEngine.EventSystems.RaycastResult> s_RaycastComparer
