// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.EventSystems.BaseEventData
#include "UnityEngine/EventSystems/BaseEventData.hpp"
// Including type: UnityEngine.EventSystems.RaycastResult
#include "UnityEngine/EventSystems/RaycastResult.hpp"
// Including type: UnityEngine.PenStatus
#include "UnityEngine/PenStatus.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::EventSystems
namespace UnityEngine::EventSystems {
  // Skipping declaration: InputButton because it is already included!
  // Forward declaring type: EventSystem
  class EventSystem;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Camera
  class Camera;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: UnityEngine.EventSystems
namespace UnityEngine::EventSystems {
  // Forward declaring type: PointerEventData
  class PointerEventData;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::EventSystems::PointerEventData);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::EventSystems::PointerEventData*, "UnityEngine.EventSystems", "PointerEventData");
// Type namespace: UnityEngine.EventSystems
namespace UnityEngine::EventSystems {
  // Size: 0x17E
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.EventSystems.PointerEventData
  // [TokenAttribute] Offset: FFFFFFFF
  class PointerEventData : public ::UnityEngine::EventSystems::BaseEventData {
    public:
    // Nested type: ::UnityEngine::EventSystems::PointerEventData::InputButton
    struct InputButton;
    // Nested type: ::UnityEngine::EventSystems::PointerEventData::FramePressState
    struct FramePressState;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.EventSystems.PointerEventData/InputButton
    // [TokenAttribute] Offset: FFFFFFFF
    struct InputButton/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: InputButton
      constexpr InputButton(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.EventSystems.PointerEventData/InputButton Left
      static constexpr const int Left = 0;
      // Get static field: static public UnityEngine.EventSystems.PointerEventData/InputButton Left
      static ::UnityEngine::EventSystems::PointerEventData::InputButton _get_Left();
      // Set static field: static public UnityEngine.EventSystems.PointerEventData/InputButton Left
      static void _set_Left(::UnityEngine::EventSystems::PointerEventData::InputButton value);
      // static field const value: static public UnityEngine.EventSystems.PointerEventData/InputButton Right
      static constexpr const int Right = 1;
      // Get static field: static public UnityEngine.EventSystems.PointerEventData/InputButton Right
      static ::UnityEngine::EventSystems::PointerEventData::InputButton _get_Right();
      // Set static field: static public UnityEngine.EventSystems.PointerEventData/InputButton Right
      static void _set_Right(::UnityEngine::EventSystems::PointerEventData::InputButton value);
      // static field const value: static public UnityEngine.EventSystems.PointerEventData/InputButton Middle
      static constexpr const int Middle = 2;
      // Get static field: static public UnityEngine.EventSystems.PointerEventData/InputButton Middle
      static ::UnityEngine::EventSystems::PointerEventData::InputButton _get_Middle();
      // Set static field: static public UnityEngine.EventSystems.PointerEventData/InputButton Middle
      static void _set_Middle(::UnityEngine::EventSystems::PointerEventData::InputButton value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.EventSystems.PointerEventData/InputButton
    #pragma pack(pop)
    static check_size<sizeof(PointerEventData::InputButton), 0 + sizeof(int)> __UnityEngine_EventSystems_PointerEventData_InputButtonSizeCheck;
    static_assert(sizeof(PointerEventData::InputButton) == 0x4);
    public:
    // private UnityEngine.GameObject <pointerEnter>k__BackingField
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::GameObject* pointerEnter;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject m_PointerPress
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::GameObject* m_PointerPress;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject <lastPress>k__BackingField
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::GameObject* lastPress;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject <rawPointerPress>k__BackingField
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::GameObject* rawPointerPress;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject <pointerDrag>k__BackingField
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::GameObject* pointerDrag;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject <pointerClick>k__BackingField
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::GameObject* pointerClick;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.EventSystems.RaycastResult <pointerCurrentRaycast>k__BackingField
    // Size: 0x50
    // Offset: 0x50
    ::UnityEngine::EventSystems::RaycastResult pointerCurrentRaycast;
    // Field size check
    static_assert(sizeof(::UnityEngine::EventSystems::RaycastResult) == 0x50);
    // private UnityEngine.EventSystems.RaycastResult <pointerPressRaycast>k__BackingField
    // Size: 0x50
    // Offset: 0xA0
    ::UnityEngine::EventSystems::RaycastResult pointerPressRaycast;
    // Field size check
    static_assert(sizeof(::UnityEngine::EventSystems::RaycastResult) == 0x50);
    // public System.Collections.Generic.List`1<UnityEngine.GameObject> hovered
    // Size: 0x8
    // Offset: 0xF0
    ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>* hovered;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*) == 0x8);
    // private System.Boolean <eligibleForClick>k__BackingField
    // Size: 0x1
    // Offset: 0xF8
    bool eligibleForClick;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: eligibleForClick and: displayIndex
    char __padding9[0x3] = {};
    // private System.Int32 <displayIndex>k__BackingField
    // Size: 0x4
    // Offset: 0xFC
    int displayIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 <pointerId>k__BackingField
    // Size: 0x4
    // Offset: 0x100
    int pointerId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.Vector2 <position>k__BackingField
    // Size: 0x8
    // Offset: 0x104
    ::UnityEngine::Vector2 position;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private UnityEngine.Vector2 <delta>k__BackingField
    // Size: 0x8
    // Offset: 0x10C
    ::UnityEngine::Vector2 delta;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private UnityEngine.Vector2 <pressPosition>k__BackingField
    // Size: 0x8
    // Offset: 0x114
    ::UnityEngine::Vector2 pressPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private UnityEngine.Vector3 <worldPosition>k__BackingField
    // Size: 0xC
    // Offset: 0x11C
    ::UnityEngine::Vector3 worldPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 <worldNormal>k__BackingField
    // Size: 0xC
    // Offset: 0x128
    ::UnityEngine::Vector3 worldNormal;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Single <clickTime>k__BackingField
    // Size: 0x4
    // Offset: 0x134
    float clickTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 <clickCount>k__BackingField
    // Size: 0x4
    // Offset: 0x138
    int clickCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.Vector2 <scrollDelta>k__BackingField
    // Size: 0x8
    // Offset: 0x13C
    ::UnityEngine::Vector2 scrollDelta;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private System.Boolean <useDragThreshold>k__BackingField
    // Size: 0x1
    // Offset: 0x144
    bool useDragThreshold;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <dragging>k__BackingField
    // Size: 0x1
    // Offset: 0x145
    bool dragging;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: dragging and: button
    char __padding21[0x2] = {};
    // private UnityEngine.EventSystems.PointerEventData/InputButton <button>k__BackingField
    // Size: 0x4
    // Offset: 0x148
    ::UnityEngine::EventSystems::PointerEventData::InputButton button;
    // Field size check
    static_assert(sizeof(::UnityEngine::EventSystems::PointerEventData::InputButton) == 0x4);
    // private System.Single <pressure>k__BackingField
    // Size: 0x4
    // Offset: 0x14C
    float pressure;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <tangentialPressure>k__BackingField
    // Size: 0x4
    // Offset: 0x150
    float tangentialPressure;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <altitudeAngle>k__BackingField
    // Size: 0x4
    // Offset: 0x154
    float altitudeAngle;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <azimuthAngle>k__BackingField
    // Size: 0x4
    // Offset: 0x158
    float azimuthAngle;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <twist>k__BackingField
    // Size: 0x4
    // Offset: 0x15C
    float twist;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector2 <tilt>k__BackingField
    // Size: 0x8
    // Offset: 0x160
    ::UnityEngine::Vector2 tilt;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private UnityEngine.PenStatus <penStatus>k__BackingField
    // Size: 0x4
    // Offset: 0x168
    ::UnityEngine::PenStatus penStatus;
    // Field size check
    static_assert(sizeof(::UnityEngine::PenStatus) == 0x4);
    // private UnityEngine.Vector2 <radius>k__BackingField
    // Size: 0x8
    // Offset: 0x16C
    ::UnityEngine::Vector2 radius;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private UnityEngine.Vector2 <radiusVariance>k__BackingField
    // Size: 0x8
    // Offset: 0x174
    ::UnityEngine::Vector2 radiusVariance;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private System.Boolean <fullyExited>k__BackingField
    // Size: 0x1
    // Offset: 0x17C
    bool fullyExited;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <reentered>k__BackingField
    // Size: 0x1
    // Offset: 0x17D
    bool reentered;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get instance field reference: private UnityEngine.GameObject <pointerEnter>k__BackingField
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_$pointerEnter$k__BackingField();
    // Get instance field reference: private UnityEngine.GameObject m_PointerPress
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_m_PointerPress();
    // Get instance field reference: private UnityEngine.GameObject <lastPress>k__BackingField
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_$lastPress$k__BackingField();
    // Get instance field reference: private UnityEngine.GameObject <rawPointerPress>k__BackingField
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_$rawPointerPress$k__BackingField();
