// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Pathfinding.VersionedMonoBehaviour
#include "Pathfinding/VersionedMonoBehaviour.hpp"
// Including type: Pathfinding.RVO.RVOLayer
#include "Pathfinding/RVO/RVOLayer.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Pathfinding::RVO
namespace Pathfinding::RVO {
  // Forward declaring type: IAgent
  class IAgent;
  // Forward declaring type: Simulator
  class Simulator;
  // Forward declaring type: MovementPlane
  struct MovementPlane;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: LayerMask
  struct LayerMask;
  // Skipping declaration: Vector3 because it is already included!
  // Forward declaring type: Vector2
  struct Vector2;
}
// Forward declaring namespace: Pathfinding
namespace Pathfinding {
  // Forward declaring type: IAstarAI
  class IAstarAI;
}
// Completed forward declares
// Type namespace: Pathfinding.RVO
namespace Pathfinding::RVO {
  // Forward declaring type: RVOController
  class RVOController;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Pathfinding::RVO::RVOController);
DEFINE_IL2CPP_ARG_TYPE(::Pathfinding::RVO::RVOController*, "Pathfinding.RVO", "RVOController");
// Type namespace: Pathfinding.RVO
namespace Pathfinding::RVO {
  // Size: 0x79
  #pragma pack(push, 1)
  // Autogenerated type: Pathfinding.RVO.RVOController
  // [TokenAttribute] Offset: FFFFFFFF
  // [HelpURLAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: FFFFFFFF
  class RVOController : public ::Pathfinding::VersionedMonoBehaviour {
    public:
    public:
    // System.Single radiusBackingField
    // Size: 0x4
    // Offset: 0x24
    float radiusBackingField;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single heightBackingField
    // Size: 0x4
    // Offset: 0x28
    float heightBackingField;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single centerBackingField
    // Size: 0x4
    // Offset: 0x2C
    float centerBackingField;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean locked
    // Size: 0x1
    // Offset: 0x30
    bool locked;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean lockWhenNotMoving
    // Size: 0x1
    // Offset: 0x31
    bool lockWhenNotMoving;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: lockWhenNotMoving and: agentTimeHorizon
    char __padding4[0x2] = {};
    // public System.Single agentTimeHorizon
    // Size: 0x4
    // Offset: 0x34
    float agentTimeHorizon;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single obstacleTimeHorizon
    // Size: 0x4
    // Offset: 0x38
    float obstacleTimeHorizon;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Int32 maxNeighbours
    // Size: 0x4
    // Offset: 0x3C
    int maxNeighbours;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public Pathfinding.RVO.RVOLayer layer
    // Size: 0x4
    // Offset: 0x40
    ::Pathfinding::RVO::RVOLayer layer;
    // Field size check
    static_assert(sizeof(::Pathfinding::RVO::RVOLayer) == 0x4);
    // public Pathfinding.RVO.RVOLayer collidesWith
    // Size: 0x4
    // Offset: 0x44
    ::Pathfinding::RVO::RVOLayer collidesWith;
    // Field size check
    static_assert(sizeof(::Pathfinding::RVO::RVOLayer) == 0x4);
    // public System.Single wallAvoidForce
    // Size: 0x4
    // Offset: 0x48
    float wallAvoidForce;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single wallAvoidFalloff
    // Size: 0x4
    // Offset: 0x4C
    float wallAvoidFalloff;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single priority
    // Size: 0x4
    // Offset: 0x50
    float priority;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: priority and: rvoAgent
    char __padding12[0x4] = {};
    // private Pathfinding.RVO.IAgent <rvoAgent>k__BackingField
    // Size: 0x8
    // Offset: 0x58
    ::Pathfinding::RVO::IAgent* rvoAgent;
    // Field size check
    static_assert(sizeof(::Pathfinding::RVO::IAgent*) == 0x8);
    // private Pathfinding.RVO.Simulator <simulator>k__BackingField
    // Size: 0x8
    // Offset: 0x60
    ::Pathfinding::RVO::Simulator* simulator;
    // Field size check
    static_assert(sizeof(::Pathfinding::RVO::Simulator*) == 0x8);
    // protected UnityEngine.Transform tr
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::Transform* tr;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private Pathfinding.IAstarAI aiBackingField
    // Size: 0x8
    // Offset: 0x70
    ::Pathfinding::IAstarAI* aiBackingField;
    // Field size check
    static_assert(sizeof(::Pathfinding::IAstarAI*) == 0x8);
    // public System.Boolean debug
    // Size: 0x1
    // Offset: 0x78
    bool debug;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get instance field reference: System.Single radiusBackingField
    [[deprecated("Use field access instead!")]] float& dyn_radiusBackingField();
    // Get instance field reference: private System.Single heightBackingField
    [[deprecated("Use field access instead!")]] float& dyn_heightBackingField();
    // Get instance field reference: private System.Single centerBackingField
    [[deprecated("Use field access instead!")]] float& dyn_centerBackingField();
    // Get instance field reference: public System.Boolean locked
    [[deprecated("Use field access instead!")]] bool& dyn_locked();
    // Get instance field reference: public System.Boolean lockWhenNotMoving
    [[deprecated("Use field access instead!")]] bool& dyn_lockWhenNotMoving();
    // Get instance field reference: public System.Single agentTimeHorizon
