// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Pathfinding.RVO.MovementPlane
#include "Pathfinding/RVO/MovementPlane.hpp"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Pathfinding::RVO
namespace Pathfinding::RVO {
  // Forward declaring type: ObstacleVertex
  class ObstacleVertex;
  // Forward declaring type: RVOQuadtree
  class RVOQuadtree;
  // Forward declaring type: IAgent
  class IAgent;
  // Forward declaring type: RVOLayer
  struct RVOLayer;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: Pathfinding::RVO::Sampled
namespace Pathfinding::RVO::Sampled {
  // Forward declaring type: Agent
  class Agent;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Matrix4x4
  struct Matrix4x4;
  // Forward declaring type: Vector2
  struct Vector2;
}
// Completed forward declares
// Type namespace: Pathfinding.RVO
namespace Pathfinding::RVO {
  // Forward declaring type: Simulator
  class Simulator;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Pathfinding::RVO::Simulator);
DEFINE_IL2CPP_ARG_TYPE(::Pathfinding::RVO::Simulator*, "Pathfinding.RVO", "Simulator");
// Type namespace: Pathfinding.RVO
namespace Pathfinding::RVO {
  // Size: 0x58
  #pragma pack(push, 1)
  // Autogenerated type: Pathfinding.RVO.Simulator
  // [TokenAttribute] Offset: FFFFFFFF
  class Simulator : public ::Il2CppObject {
    public:
    // Nested type: ::Pathfinding::RVO::Simulator::WorkerContext
    class WorkerContext;
    // Nested type: ::Pathfinding::RVO::Simulator::Worker
    class Worker;
    public:
    // private readonly System.Boolean doubleBuffering
    // Size: 0x1
    // Offset: 0x10
    bool doubleBuffering;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: doubleBuffering and: desiredDeltaTime
    char __padding0[0x3] = {};
    // private System.Single desiredDeltaTime
    // Size: 0x4
    // Offset: 0x14
    float desiredDeltaTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private readonly Pathfinding.RVO.Simulator/Worker[] workers
    // Size: 0x8
    // Offset: 0x18
    ::ArrayW<::Pathfinding::RVO::Simulator::Worker*> workers;
    // Field size check
    static_assert(sizeof(::ArrayW<::Pathfinding::RVO::Simulator::Worker*>) == 0x8);
    // private System.Collections.Generic.List`1<Pathfinding.RVO.Sampled.Agent> agents
    // Size: 0x8
    // Offset: 0x20
    ::System::Collections::Generic::List_1<::Pathfinding::RVO::Sampled::Agent*>* agents;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Pathfinding::RVO::Sampled::Agent*>*) == 0x8);
    // public System.Collections.Generic.List`1<Pathfinding.RVO.ObstacleVertex> obstacles
    // Size: 0x8
    // Offset: 0x28
    ::System::Collections::Generic::List_1<::Pathfinding::RVO::ObstacleVertex*>* obstacles;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Pathfinding::RVO::ObstacleVertex*>*) == 0x8);
    // private Pathfinding.RVO.RVOQuadtree <Quadtree>k__BackingField
    // Size: 0x8
    // Offset: 0x30
    ::Pathfinding::RVO::RVOQuadtree* Quadtree;
    // Field size check
    static_assert(sizeof(::Pathfinding::RVO::RVOQuadtree*) == 0x8);
    // private System.Single deltaTime
    // Size: 0x4
    // Offset: 0x38
    float deltaTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single lastStep
    // Size: 0x4
    // Offset: 0x3C
    float lastStep;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean doUpdateObstacles
    // Size: 0x1
    // Offset: 0x40
    bool doUpdateObstacles;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean doCleanObstacles
    // Size: 0x1
    // Offset: 0x41
    bool doCleanObstacles;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: doCleanObstacles and: symmetryBreakingBias
    char __padding9[0x2] = {};
    // public System.Single symmetryBreakingBias
    // Size: 0x4
    // Offset: 0x44
    float symmetryBreakingBias;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public readonly Pathfinding.RVO.MovementPlane movementPlane
    // Size: 0x4
    // Offset: 0x48
    ::Pathfinding::RVO::MovementPlane movementPlane;
    // Field size check
    static_assert(sizeof(::Pathfinding::RVO::MovementPlane) == 0x4);
    // Padding between fields: movementPlane and: coroutineWorkerContext
    char __padding11[0x4] = {};
    // private Pathfinding.RVO.Simulator/WorkerContext coroutineWorkerContext
    // Size: 0x8
    // Offset: 0x50
    ::Pathfinding::RVO::Simulator::WorkerContext* coroutineWorkerContext;
    // Field size check
    static_assert(sizeof(::Pathfinding::RVO::Simulator::WorkerContext*) == 0x8);
    public:
    // Get instance field reference: private readonly System.Boolean doubleBuffering
    [[deprecated("Use field access instead!")]] bool& dyn_doubleBuffering();
    // Get instance field reference: private System.Single desiredDeltaTime
    [[deprecated("Use field access instead!")]] float& dyn_desiredDeltaTime();
    // Get instance field reference: private readonly Pathfinding.RVO.Simulator/Worker[] workers
    [[deprecated("Use field access instead!")]] ::ArrayW<::Pathfinding::RVO::Simulator::Worker*>& dyn_workers();
    // Get instance field reference: private System.Collections.Generic.List`1<Pathfinding.RVO.Sampled.Agent> agents
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::Pathfinding::RVO::Sampled::Agent*>*& dyn_agents();
