// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Pathfinding::Serialization
namespace Pathfinding::Serialization {
  // Forward declaring type: GraphMeta
  class GraphMeta;
  // Forward declaring type: SerializeSettings
  class SerializeSettings;
}
// Forward declaring namespace: Pathfinding
namespace Pathfinding {
  // Forward declaring type: AstarData
  class AstarData;
  // Forward declaring type: NavGraph
  class NavGraph;
  // Forward declaring type: GraphNode
  class GraphNode;
}
// Forward declaring namespace: Pathfinding::Ionic::Zip
namespace Pathfinding::Ionic::Zip {
  // Forward declaring type: ZipFile
  class ZipFile;
  // Forward declaring type: ZipEntry
  class ZipEntry;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: MemoryStream
  class MemoryStream;
  // Forward declaring type: BinaryReader
  class BinaryReader;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: UTF8Encoding
  class UTF8Encoding;
  // Forward declaring type: StringBuilder
  class StringBuilder;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
  // Forward declaring type: Version
  class Version;
  // Forward declaring type: Type
  class Type;
}
// Completed forward declares
// Type namespace: Pathfinding.Serialization
namespace Pathfinding::Serialization {
  // Forward declaring type: AstarSerializer
  class AstarSerializer;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Pathfinding::Serialization::AstarSerializer);
DEFINE_IL2CPP_ARG_TYPE(::Pathfinding::Serialization::AstarSerializer*, "Pathfinding.Serialization", "AstarSerializer");
// Type namespace: Pathfinding.Serialization
namespace Pathfinding::Serialization {
  // Size: 0x60
  #pragma pack(push, 1)
  // Autogenerated type: Pathfinding.Serialization.AstarSerializer
  // [TokenAttribute] Offset: FFFFFFFF
  class AstarSerializer : public ::Il2CppObject {
    public:
    // Nested type: ::Pathfinding::Serialization::AstarSerializer::$$c__DisplayClass30_0
    class $$c__DisplayClass30_0;
    // Nested type: ::Pathfinding::Serialization::AstarSerializer::$$c__DisplayClass31_0
    class $$c__DisplayClass31_0;
    // Nested type: ::Pathfinding::Serialization::AstarSerializer::$$c__DisplayClass33_0
    class $$c__DisplayClass33_0;
    // Nested type: ::Pathfinding::Serialization::AstarSerializer::$$c__DisplayClass44_0
    class $$c__DisplayClass44_0;
    // Nested type: ::Pathfinding::Serialization::AstarSerializer::$$c__DisplayClass45_0
    class $$c__DisplayClass45_0;
    // Nested type: ::Pathfinding::Serialization::AstarSerializer::$$c__DisplayClass46_0
    class $$c__DisplayClass46_0;
    public:
    // private Pathfinding.AstarData data
    // Size: 0x8
    // Offset: 0x10
    ::Pathfinding::AstarData* data;
    // Field size check
    static_assert(sizeof(::Pathfinding::AstarData*) == 0x8);
    // private Pathfinding.Ionic.Zip.ZipFile zip
    // Size: 0x8
    // Offset: 0x18
    ::Pathfinding::Ionic::Zip::ZipFile* zip;
    // Field size check
    static_assert(sizeof(::Pathfinding::Ionic::Zip::ZipFile*) == 0x8);
    // private System.IO.MemoryStream zipStream
    // Size: 0x8
    // Offset: 0x20
    ::System::IO::MemoryStream* zipStream;
    // Field size check
    static_assert(sizeof(::System::IO::MemoryStream*) == 0x8);
    // private Pathfinding.Serialization.GraphMeta meta
    // Size: 0x8
    // Offset: 0x28
    ::Pathfinding::Serialization::GraphMeta* meta;
    // Field size check
    static_assert(sizeof(::Pathfinding::Serialization::GraphMeta*) == 0x8);
    // private Pathfinding.Serialization.SerializeSettings settings
    // Size: 0x8
    // Offset: 0x30
    ::Pathfinding::Serialization::SerializeSettings* settings;
    // Field size check
    static_assert(sizeof(::Pathfinding::Serialization::SerializeSettings*) == 0x8);
    // private UnityEngine.GameObject contextRoot
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::GameObject* contextRoot;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private Pathfinding.NavGraph[] graphs
    // Size: 0x8
    // Offset: 0x40
    ::ArrayW<::Pathfinding::NavGraph*> graphs;
    // Field size check
    static_assert(sizeof(::ArrayW<::Pathfinding::NavGraph*>) == 0x8);
    // private System.Collections.Generic.Dictionary`2<Pathfinding.NavGraph,System.Int32> graphIndexInZip
    // Size: 0x8
    // Offset: 0x48
    ::System::Collections::Generic::Dictionary_2<::Pathfinding::NavGraph*, int>* graphIndexInZip;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::Pathfinding::NavGraph*, int>*) == 0x8);
    // private System.Int32 graphIndexOffset
    // Size: 0x4
    // Offset: 0x50
    int graphIndexOffset;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.UInt32 checksum
    // Size: 0x4
    // Offset: 0x54
    uint checksum;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.Text.UTF8Encoding encoding
    // Size: 0x8
    // Offset: 0x58
    ::System::Text::UTF8Encoding* encoding;
    // Field size check
    static_assert(sizeof(::System::Text::UTF8Encoding*) == 0x8);
    public:
    // static field const value: static private System.String binaryExt
    static constexpr const char* binaryExt = ".binary";
    // Get static field: static private System.String binaryExt
    static ::StringW _get_binaryExt();
    // Set static field: static private System.String binaryExt
    static void _set_binaryExt(::StringW value);
    // static field const value: static private System.String jsonExt
    static constexpr const char* jsonExt = ".json";
    // Get static field: static private System.String jsonExt
    static ::StringW _get_jsonExt();
    // Set static field: static private System.String jsonExt
    static void _set_jsonExt(::StringW value);
    // Get static field: static private System.Text.StringBuilder _stringBuilder
    static ::System::Text::StringBuilder* _get__stringBuilder();
