// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: UnityEngine.Animations.Rigging.IAnimationJobData
#include "UnityEngine/Animations/Rigging/IAnimationJobData.hpp"
// Including type: UnityEngine.Animations.Rigging.IMultiAimConstraintData
#include "UnityEngine/Animations/Rigging/IMultiAimConstraintData.hpp"
// Including type: UnityEngine.Animations.Rigging.WeightedTransformArray
#include "UnityEngine/Animations/Rigging/WeightedTransformArray.hpp"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
// Including type: UnityEngine.Animations.Rigging.Vector3Bool
#include "UnityEngine/Animations/Rigging/Vector3Bool.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::Animations::Rigging
namespace UnityEngine::Animations::Rigging {
  // Skipping declaration: Axis because it is already included!
  // Skipping declaration: WorldUpType because it is already included!
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Vector2
  struct Vector2;
  // Forward declaring type: Transform
  class Transform;
}
// Completed forward declares
// Type namespace: UnityEngine.Animations.Rigging
namespace UnityEngine::Animations::Rigging {
  // Forward declaring type: MultiAimConstraintData
  struct MultiAimConstraintData;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::Animations::Rigging::MultiAimConstraintData, "UnityEngine.Animations.Rigging", "MultiAimConstraintData");
// Type namespace: UnityEngine.Animations.Rigging
namespace UnityEngine::Animations::Rigging {
  // Size: 0xC0
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: UnityEngine.Animations.Rigging.MultiAimConstraintData
  // [TokenAttribute] Offset: FFFFFFFF
  struct MultiAimConstraintData/*, public ::System::ValueType, public ::UnityEngine::Animations::Rigging::IAnimationJobData, public ::UnityEngine::Animations::Rigging::IMultiAimConstraintData*/ {
    public:
    // Nested type: ::UnityEngine::Animations::Rigging::MultiAimConstraintData::Axis
    struct Axis;
    // Nested type: ::UnityEngine::Animations::Rigging::MultiAimConstraintData::WorldUpType
    struct WorldUpType;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.Animations.Rigging.MultiAimConstraintData/Axis
    // [TokenAttribute] Offset: FFFFFFFF
    struct Axis/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: Axis
      constexpr Axis(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.Animations.Rigging.MultiAimConstraintData/Axis X
      static constexpr const int X = 0;
      // Get static field: static public UnityEngine.Animations.Rigging.MultiAimConstraintData/Axis X
      static ::UnityEngine::Animations::Rigging::MultiAimConstraintData::Axis _get_X();
      // Set static field: static public UnityEngine.Animations.Rigging.MultiAimConstraintData/Axis X
      static void _set_X(::UnityEngine::Animations::Rigging::MultiAimConstraintData::Axis value);
      // static field const value: static public UnityEngine.Animations.Rigging.MultiAimConstraintData/Axis X_NEG
      static constexpr const int X_NEG = 1;
      // Get static field: static public UnityEngine.Animations.Rigging.MultiAimConstraintData/Axis X_NEG
      static ::UnityEngine::Animations::Rigging::MultiAimConstraintData::Axis _get_X_NEG();
      // Set static field: static public UnityEngine.Animations.Rigging.MultiAimConstraintData/Axis X_NEG
      static void _set_X_NEG(::UnityEngine::Animations::Rigging::MultiAimConstraintData::Axis value);
      // static field const value: static public UnityEngine.Animations.Rigging.MultiAimConstraintData/Axis Y
      static constexpr const int Y = 2;
      // Get static field: static public UnityEngine.Animations.Rigging.MultiAimConstraintData/Axis Y
      static ::UnityEngine::Animations::Rigging::MultiAimConstraintData::Axis _get_Y();
      // Set static field: static public UnityEngine.Animations.Rigging.MultiAimConstraintData/Axis Y
      static void _set_Y(::UnityEngine::Animations::Rigging::MultiAimConstraintData::Axis value);
      // static field const value: static public UnityEngine.Animations.Rigging.MultiAimConstraintData/Axis Y_NEG
      static constexpr const int Y_NEG = 3;
      // Get static field: static public UnityEngine.Animations.Rigging.MultiAimConstraintData/Axis Y_NEG
      static ::UnityEngine::Animations::Rigging::MultiAimConstraintData::Axis _get_Y_NEG();
      // Set static field: static public UnityEngine.Animations.Rigging.MultiAimConstraintData/Axis Y_NEG
      static void _set_Y_NEG(::UnityEngine::Animations::Rigging::MultiAimConstraintData::Axis value);
      // static field const value: static public UnityEngine.Animations.Rigging.MultiAimConstraintData/Axis Z
      static constexpr const int Z = 4;
      // Get static field: static public UnityEngine.Animations.Rigging.MultiAimConstraintData/Axis Z
      static ::UnityEngine::Animations::Rigging::MultiAimConstraintData::Axis _get_Z();
      // Set static field: static public UnityEngine.Animations.Rigging.MultiAimConstraintData/Axis Z
      static void _set_Z(::UnityEngine::Animations::Rigging::MultiAimConstraintData::Axis value);
      // static field const value: static public UnityEngine.Animations.Rigging.MultiAimConstraintData/Axis Z_NEG
      static constexpr const int Z_NEG = 5;
      // Get static field: static public UnityEngine.Animations.Rigging.MultiAimConstraintData/Axis Z_NEG
      static ::UnityEngine::Animations::Rigging::MultiAimConstraintData::Axis _get_Z_NEG();
      // Set static field: static public UnityEngine.Animations.Rigging.MultiAimConstraintData/Axis Z_NEG
      static void _set_Z_NEG(::UnityEngine::Animations::Rigging::MultiAimConstraintData::Axis value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.Animations.Rigging.MultiAimConstraintData/Axis
    #pragma pack(pop)
    static check_size<sizeof(MultiAimConstraintData::Axis), 0 + sizeof(int)> __UnityEngine_Animations_Rigging_MultiAimConstraintData_AxisSizeCheck;
    static_assert(sizeof(MultiAimConstraintData::Axis) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.Animations.Rigging.MultiAimConstraintData/WorldUpType
    // [TokenAttribute] Offset: FFFFFFFF
    struct WorldUpType/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: WorldUpType
      constexpr WorldUpType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.Animations.Rigging.MultiAimConstraintData/WorldUpType None
      static constexpr const int None = 0;
      // Get static field: static public UnityEngine.Animations.Rigging.MultiAimConstraintData/WorldUpType None
      static ::UnityEngine::Animations::Rigging::MultiAimConstraintData::WorldUpType _get_None();
      // Set static field: static public UnityEngine.Animations.Rigging.MultiAimConstraintData/WorldUpType None
      static void _set_None(::UnityEngine::Animations::Rigging::MultiAimConstraintData::WorldUpType value);
      // static field const value: static public UnityEngine.Animations.Rigging.MultiAimConstraintData/WorldUpType SceneUp
      static constexpr const int SceneUp = 1;
      // Get static field: static public UnityEngine.Animations.Rigging.MultiAimConstraintData/WorldUpType SceneUp
      static ::UnityEngine::Animations::Rigging::MultiAimConstraintData::WorldUpType _get_SceneUp();
      // Set static field: static public UnityEngine.Animations.Rigging.MultiAimConstraintData/WorldUpType SceneUp
      static void _set_SceneUp(::UnityEngine::Animations::Rigging::MultiAimConstraintData::WorldUpType value);
      // static field const value: static public UnityEngine.Animations.Rigging.MultiAimConstraintData/WorldUpType ObjectUp
      static constexpr const int ObjectUp = 2;
      // Get static field: static public UnityEngine.Animations.Rigging.MultiAimConstraintData/WorldUpType ObjectUp
      static ::UnityEngine::Animations::Rigging::MultiAimConstraintData::WorldUpType _get_ObjectUp();
      // Set static field: static public UnityEngine.Animations.Rigging.MultiAimConstraintData/WorldUpType ObjectUp
      static void _set_ObjectUp(::UnityEngine::Animations::Rigging::MultiAimConstraintData::WorldUpType value);
      // static field const value: static public UnityEngine.Animations.Rigging.MultiAimConstraintData/WorldUpType ObjectRotationUp
      static constexpr const int ObjectRotationUp = 3;
      // Get static field: static public UnityEngine.Animations.Rigging.MultiAimConstraintData/WorldUpType ObjectRotationUp
      static ::UnityEngine::Animations::Rigging::MultiAimConstraintData::WorldUpType _get_ObjectRotationUp();
      // Set static field: static public UnityEngine.Animations.Rigging.MultiAimConstraintData/WorldUpType ObjectRotationUp
      static void _set_ObjectRotationUp(::UnityEngine::Animations::Rigging::MultiAimConstraintData::WorldUpType value);
      // static field const value: static public UnityEngine.Animations.Rigging.MultiAimConstraintData/WorldUpType Vector
      static constexpr const int Vector = 4;
      // Get static field: static public UnityEngine.Animations.Rigging.MultiAimConstraintData/WorldUpType Vector
      static ::UnityEngine::Animations::Rigging::MultiAimConstraintData::WorldUpType _get_Vector();
      // Set static field: static public UnityEngine.Animations.Rigging.MultiAimConstraintData/WorldUpType Vector
      static void _set_Vector(::UnityEngine::Animations::Rigging::MultiAimConstraintData::WorldUpType value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.Animations.Rigging.MultiAimConstraintData/WorldUpType
    #pragma pack(pop)
    static check_size<sizeof(MultiAimConstraintData::WorldUpType), 0 + sizeof(int)> __UnityEngine_Animations_Rigging_MultiAimConstraintData_WorldUpTypeSizeCheck;
    static_assert(sizeof(MultiAimConstraintData::WorldUpType) == 0x4);
    public:
    // private UnityEngine.Transform m_ConstrainedObject
    // Size: 0x8
    // Offset: 0x0
    ::UnityEngine::Transform* m_ConstrainedObject;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Animations.Rigging.WeightedTransformArray m_SourceObjects
    // Size: 0x84
    // Offset: 0x8
    ::UnityEngine::Animations::Rigging::WeightedTransformArray m_SourceObjects;
    // Field size check
    static_assert(sizeof(::UnityEngine::Animations::Rigging::WeightedTransformArray) == 0x84);
    // Padding between fields: m_SourceObjects and: m_Offset
    char __padding1[0x4] = {};
    // private UnityEngine.Vector3 m_Offset
    // Size: 0xC
    // Offset: 0x90
    ::UnityEngine::Vector3 m_Offset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Single m_MinLimit
    // Size: 0x4
    // Offset: 0x9C
    float m_MinLimit;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_MaxLimit
    // Size: 0x4
    // Offset: 0xA0
    float m_MaxLimit;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Animations.Rigging.MultiAimConstraintData/Axis m_AimAxis
    // Size: 0x4
    // Offset: 0xA4
    ::UnityEngine::Animations::Rigging::MultiAimConstraintData::Axis m_AimAxis;
    // Field size check
    static_assert(sizeof(::UnityEngine::Animations::Rigging::MultiAimConstraintData::Axis) == 0x4);
    // private UnityEngine.Animations.Rigging.MultiAimConstraintData/Axis m_UpAxis
    // Size: 0x4
    // Offset: 0xA8
    ::UnityEngine::Animations::Rigging::MultiAimConstraintData::Axis m_UpAxis;
    // Field size check
    static_assert(sizeof(::UnityEngine::Animations::Rigging::MultiAimConstraintData::Axis) == 0x4);
    // private UnityEngine.Animations.Rigging.MultiAimConstraintData/WorldUpType m_WorldUpType
    // Size: 0x4
    // Offset: 0xAC
    ::UnityEngine::Animations::Rigging::MultiAimConstraintData::WorldUpType m_WorldUpType;
    // Field size check
    static_assert(sizeof(::UnityEngine::Animations::Rigging::MultiAimConstraintData::WorldUpType) == 0x4);
    // private UnityEngine.Transform m_WorldUpObject
    // Size: 0x8
    // Offset: 0xB0
    ::UnityEngine::Transform* m_WorldUpObject;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Animations.Rigging.MultiAimConstraintData/Axis m_WorldUpAxis
    // Size: 0x4
    // Offset: 0xB8
    ::UnityEngine::Animations::Rigging::MultiAimConstraintData::Axis m_WorldUpAxis;
    // Field size check
    static_assert(sizeof(::UnityEngine::Animations::Rigging::MultiAimConstraintData::Axis) == 0x4);
    // private System.Boolean m_MaintainOffset
    // Size: 0x1
    // Offset: 0xBC
    bool m_MaintainOffset;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private UnityEngine.Animations.Rigging.Vector3Bool m_ConstrainedAxes
    // Size: 0x3
    // Offset: 0xBD
    ::UnityEngine::Animations::Rigging::Vector3Bool m_ConstrainedAxes;
    // Field size check
    static_assert(sizeof(::UnityEngine::Animations::Rigging::Vector3Bool) == 0x3);
    public:
    // Creating value type constructor for type: MultiAimConstraintData
    constexpr MultiAimConstraintData(::UnityEngine::Transform* m_ConstrainedObject_ = {}, ::UnityEngine::Animations::Rigging::WeightedTransformArray m_SourceObjects_ = {}, ::UnityEngine::Vector3 m_Offset_ = {}, float m_MinLimit_ = {}, float m_MaxLimit_ = {}, ::UnityEngine::Animations::Rigging::MultiAimConstraintData::Axis m_AimAxis_ = {}, ::UnityEngine::Animations::Rigging::MultiAimConstraintData::Axis m_UpAxis_ = {}, ::UnityEngine::Animations::Rigging::MultiAimConstraintData::WorldUpType m_WorldUpType_ = {}, ::UnityEngine::Transform* m_WorldUpObject_ = {}, ::UnityEngine::Animations::Rigging::MultiAimConstraintData::Axis m_WorldUpAxis_ = {}, bool m_MaintainOffset_ = {}, ::UnityEngine::Animations::Rigging::Vector3Bool m_ConstrainedAxes_ = {}) noexcept : m_ConstrainedObject{m_ConstrainedObject_}, m_SourceObjects{m_SourceObjects_}, m_Offset{m_Offset_}, m_MinLimit{m_MinLimit_}, m_MaxLimit{m_MaxLimit_}, m_AimAxis{m_AimAxis_}, m_UpAxis{m_UpAxis_}, m_WorldUpType{m_WorldUpType_}, m_WorldUpObject{m_WorldUpObject_}, m_WorldUpAxis{m_WorldUpAxis_}, m_MaintainOffset{m_MaintainOffset_}, m_ConstrainedAxes{m_ConstrainedAxes_} {}
    // Creating interface conversion operator: operator ::System::ValueType
    operator ::System::ValueType() noexcept {
      return *reinterpret_cast<::System::ValueType*>(this);
    }
    // Creating interface conversion operator: operator ::UnityEngine::Animations::Rigging::IAnimationJobData
    operator ::UnityEngine::Animations::Rigging::IAnimationJobData() noexcept {
      return *reinterpret_cast<::UnityEngine::Animations::Rigging::IAnimationJobData*>(this);
    }
    // Creating interface conversion operator: operator ::UnityEngine::Animations::Rigging::IMultiAimConstraintData
    operator ::UnityEngine::Animations::Rigging::IMultiAimConstraintData() noexcept {
      return *reinterpret_cast<::UnityEngine::Animations::Rigging::IMultiAimConstraintData*>(this);
    }
    // static field const value: static System.Single k_MinAngularLimit
    static constexpr const float k_MinAngularLimit = -180;
    // Get static field: static System.Single k_MinAngularLimit
    static float _get_k_MinAngularLimit();
    // Set static field: static System.Single k_MinAngularLimit
    static void _set_k_MinAngularLimit(float value);
    // static field const value: static System.Single k_MaxAngularLimit
    static constexpr const float k_MaxAngularLimit = 180;
    // Get static field: static System.Single k_MaxAngularLimit
    static float _get_k_MaxAngularLimit();
    // Set static field: static System.Single k_MaxAngularLimit
    static void _set_k_MaxAngularLimit(float value);
    // Get instance field reference: private UnityEngine.Transform m_ConstrainedObject
    [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_m_ConstrainedObject();
    // Get instance field reference: private UnityEngine.Animations.Rigging.WeightedTransformArray m_SourceObjects
    [[deprecated("Use field access instead!")]] ::UnityEngine::Animations::Rigging::WeightedTransformArray& dyn_m_SourceObjects();
    // Get instance field reference: private UnityEngine.Vector3 m_Offset
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_m_Offset();
    // Get instance field reference: private System.Single m_MinLimit
    [[deprecated("Use field access instead!")]] float& dyn_m_MinLimit();
    // Get instance field reference: private System.Single m_MaxLimit
    [[deprecated("Use field access instead!")]] float& dyn_m_MaxLimit();
    // Get instance field reference: private UnityEngine.Animations.Rigging.MultiAimConstraintData/Axis m_AimAxis
    [[deprecated("Use field access instead!")]] ::UnityEngine::Animations::Rigging::MultiAimConstraintData::Axis& dyn_m_AimAxis();
    // Get instance field reference: private UnityEngine.Animations.Rigging.MultiAimConstraintData/Axis m_UpAxis
    [[deprecated("Use field access instead!")]] ::UnityEngine::Animations::Rigging::MultiAimConstraintData::Axis& dyn_m_UpAxis();
    // Get instance field reference: private UnityEngine.Animations.Rigging.MultiAimConstraintData/WorldUpType m_WorldUpType
    [[deprecated("Use field access instead!")]] ::UnityEngine::Animations::Rigging::MultiAimConstraintData::WorldUpType& dyn_m_WorldUpType();
    // Get instance field reference: private UnityEngine.Transform m_WorldUpObject
    [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_m_WorldUpObject();
    // Get instance field reference: private UnityEngine.Animations.Rigging.MultiAimConstraintData/Axis m_WorldUpAxis
    [[deprecated("Use field access instead!")]] ::UnityEngine::Animations::Rigging::MultiAimConstraintData::Axis& dyn_m_WorldUpAxis();
    // Get instance field reference: private System.Boolean m_MaintainOffset
    [[deprecated("Use field access instead!")]] bool& dyn_m_MaintainOffset();
    // Get instance field reference: private UnityEngine.Animations.Rigging.Vector3Bool m_ConstrainedAxes
    [[deprecated("Use field access instead!")]] ::UnityEngine::Animations::Rigging::Vector3Bool& dyn_m_ConstrainedAxes();
    // public UnityEngine.Transform get_constrainedObject()
    // Offset: 0x507408C
    ::UnityEngine::Transform* get_constrainedObject();
    // public System.Void set_constrainedObject(UnityEngine.Transform value)
    // Offset: 0x5074094
    void set_constrainedObject(::UnityEngine::Transform* value);
    // public UnityEngine.Animations.Rigging.WeightedTransformArray get_sourceObjects()
    // Offset: 0x507409C
    ::UnityEngine::Animations::Rigging::WeightedTransformArray get_sourceObjects();
    // public System.Void set_sourceObjects(UnityEngine.Animations.Rigging.WeightedTransformArray value)
    // Offset: 0x50740AC
    void set_sourceObjects(::UnityEngine::Animations::Rigging::WeightedTransformArray value);
    // public System.Boolean get_maintainOffset()
    // Offset: 0x50740D0
    bool get_maintainOffset();
    // public System.Void set_maintainOffset(System.Boolean value)
    // Offset: 0x50740D8
    void set_maintainOffset(bool value);
    // public UnityEngine.Vector3 get_offset()
    // Offset: 0x50740E4
    ::UnityEngine::Vector3 get_offset();
    // public System.Void set_offset(UnityEngine.Vector3 value)
    // Offset: 0x50740F0
    void set_offset(::UnityEngine::Vector3 value);
    // public UnityEngine.Vector2 get_limits()
    // Offset: 0x50740FC
    ::UnityEngine::Vector2 get_limits();
    // public System.Void set_limits(UnityEngine.Vector2 value)
    // Offset: 0x5074104
    void set_limits(::UnityEngine::Vector2 value);
    // public UnityEngine.Animations.Rigging.MultiAimConstraintData/Axis get_aimAxis()
    // Offset: 0x5074134
    ::UnityEngine::Animations::Rigging::MultiAimConstraintData::Axis get_aimAxis();
    // public System.Void set_aimAxis(UnityEngine.Animations.Rigging.MultiAimConstraintData/Axis value)
    // Offset: 0x507413C
    void set_aimAxis(::UnityEngine::Animations::Rigging::MultiAimConstraintData::Axis value);
    // public UnityEngine.Animations.Rigging.MultiAimConstraintData/Axis get_upAxis()
    // Offset: 0x5074144
    ::UnityEngine::Animations::Rigging::MultiAimConstraintData::Axis get_upAxis();
    // public System.Void set_upAxis(UnityEngine.Animations.Rigging.MultiAimConstraintData/Axis value)
    // Offset: 0x507414C
    void set_upAxis(::UnityEngine::Animations::Rigging::MultiAimConstraintData::Axis value);
    // public UnityEngine.Animations.Rigging.MultiAimConstraintData/WorldUpType get_worldUpType()
    // Offset: 0x5074154
    ::UnityEngine::Animations::Rigging::MultiAimConstraintData::WorldUpType get_worldUpType();
    // public System.Void set_worldUpType(UnityEngine.Animations.Rigging.MultiAimConstraintData/WorldUpType value)
    // Offset: 0x507415C
    void set_worldUpType(::UnityEngine::Animations::Rigging::MultiAimConstraintData::WorldUpType value);
    // public UnityEngine.Animations.Rigging.MultiAimConstraintData/Axis get_worldUpAxis()
    // Offset: 0x5074164
    ::UnityEngine::Animations::Rigging::MultiAimConstraintData::Axis get_worldUpAxis();
    // public System.Void set_worldUpAxis(UnityEngine.Animations.Rigging.MultiAimConstraintData/Axis value)
    // Offset: 0x507416C
    void set_worldUpAxis(::UnityEngine::Animations::Rigging::MultiAimConstraintData::Axis value);
    // public UnityEngine.Transform get_worldUpObject()
    // Offset: 0x5074174
    ::UnityEngine::Transform* get_worldUpObject();
    // public System.Void set_worldUpObject(UnityEngine.Transform value)
    // Offset: 0x507417C
    void set_worldUpObject(::UnityEngine::Transform* value);
    // public System.Boolean get_constrainedXAxis()
    // Offset: 0x5074184
    bool get_constrainedXAxis();
    // public System.Void set_constrainedXAxis(System.Boolean value)
    // Offset: 0x507418C
    void set_constrainedXAxis(bool value);
    // public System.Boolean get_constrainedYAxis()
    // Offset: 0x5074198
    bool get_constrainedYAxis();
    // public System.Void set_constrainedYAxis(System.Boolean value)
    // Offset: 0x50741A0
    void set_constrainedYAxis(bool value);
    // public System.Boolean get_constrainedZAxis()
    // Offset: 0x50741AC
    bool get_constrainedZAxis();
    // public System.Void set_constrainedZAxis(System.Boolean value)
    // Offset: 0x50741B4
    void set_constrainedZAxis(bool value);
    // private UnityEngine.Vector3 UnityEngine.Animations.Rigging.IMultiAimConstraintData.get_aimAxis()
    // Offset: 0x50741C0
    ::UnityEngine::Vector3 UnityEngine_Animations_Rigging_IMultiAimConstraintData_get_aimAxis();
    // private UnityEngine.Vector3 UnityEngine.Animations.Rigging.IMultiAimConstraintData.get_upAxis()
    // Offset: 0x5074380
    ::UnityEngine::Vector3 UnityEngine_Animations_Rigging_IMultiAimConstraintData_get_upAxis();
    // private System.Int32 UnityEngine.Animations.Rigging.IMultiAimConstraintData.get_worldUpType()
    // Offset: 0x5074388
    int UnityEngine_Animations_Rigging_IMultiAimConstraintData_get_worldUpType();
    // private UnityEngine.Vector3 UnityEngine.Animations.Rigging.IMultiAimConstraintData.get_worldUpAxis()
    // Offset: 0x5074390
    ::UnityEngine::Vector3 UnityEngine_Animations_Rigging_IMultiAimConstraintData_get_worldUpAxis();
    // private System.String UnityEngine.Animations.Rigging.IMultiAimConstraintData.get_offsetVector3Property()
    // Offset: 0x5074398
    ::StringW UnityEngine_Animations_Rigging_IMultiAimConstraintData_get_offsetVector3Property();
    // private System.String UnityEngine.Animations.Rigging.IMultiAimConstraintData.get_minLimitFloatProperty()
    // Offset: 0x50743D8
    ::StringW UnityEngine_Animations_Rigging_IMultiAimConstraintData_get_minLimitFloatProperty();
    // private System.String UnityEngine.Animations.Rigging.IMultiAimConstraintData.get_maxLimitFloatProperty()
    // Offset: 0x5074418
    ::StringW UnityEngine_Animations_Rigging_IMultiAimConstraintData_get_maxLimitFloatProperty();
    // private System.String UnityEngine.Animations.Rigging.IMultiAimConstraintData.get_sourceObjectsProperty()
    // Offset: 0x5074458
    ::StringW UnityEngine_Animations_Rigging_IMultiAimConstraintData_get_sourceObjectsProperty();
    // private System.Boolean UnityEngine.Animations.Rigging.IAnimationJobData.IsValid()
    // Offset: 0x5074498
    bool UnityEngine_Animations_Rigging_IAnimationJobData_IsValid();
    // private System.Void UnityEngine.Animations.Rigging.IAnimationJobData.SetDefaultValues()
    // Offset: 0x507481C
    void UnityEngine_Animations_Rigging_IAnimationJobData_SetDefaultValues();
    // static private UnityEngine.Vector3 Convert(UnityEngine.Animations.Rigging.MultiAimConstraintData/Axis axis)
    // Offset: 0x50741C8
    static ::UnityEngine::Vector3 Convert(::UnityEngine::Animations::Rigging::MultiAimConstraintData::Axis axis);
  }; // UnityEngine.Animations.Rigging.MultiAimConstraintData
  #pragma pack(pop)
  static check_size<sizeof(MultiAimConstraintData), 189 + sizeof(::UnityEngine::Animations::Rigging::Vector3Bool)> __UnityEngine_Animations_Rigging_MultiAimConstraintDataSizeCheck;
  static_assert(sizeof(MultiAimConstraintData) == 0xC0);
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::Animations::Rigging::MultiAimConstraintData::WorldUpType, "UnityEngine.Animations.Rigging", "MultiAimConstraintData/WorldUpType");
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::Animations::Rigging::MultiAimConstraintData::Axis, "UnityEngine.Animations.Rigging", "MultiAimConstraintData/Axis");
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: UnityEngine::Animations::Rigging::MultiAimConstraintData::get_constrainedObject
// Il2CppName: get_constrainedObject
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::Transform* (UnityEngine::Animations::Rigging::MultiAimConstraintData::*)()>(&UnityEngine::Animations::Rigging::MultiAimConstraintData::get_constrainedObject)> {
