// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: GorillaNetworking.CosmeticsController
#include "GorillaNetworking/CosmeticsController.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GorillaNetworking::CosmeticsController::IAPRequestBody);
DEFINE_IL2CPP_ARG_TYPE(::GorillaNetworking::CosmeticsController::IAPRequestBody*, "GorillaNetworking", "CosmeticsController/IAPRequestBody");
// Type namespace: GorillaNetworking
namespace GorillaNetworking {
  // Size: 0x48
  #pragma pack(push, 1)
  // Autogenerated type: GorillaNetworking.CosmeticsController/IAPRequestBody
  // [TokenAttribute] Offset: FFFFFFFF
  class CosmeticsController::IAPRequestBody : public ::Il2CppObject {
    public:
    public:
    // public System.String accessToken
    // Size: 0x8
    // Offset: 0x10
    ::StringW accessToken;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String userID
    // Size: 0x8
    // Offset: 0x18
    ::StringW userID;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String nonce
    // Size: 0x8
    // Offset: 0x20
    ::StringW nonce;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String platform
    // Size: 0x8
    // Offset: 0x28
    ::StringW platform;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String sku
    // Size: 0x8
    // Offset: 0x30
    ::StringW sku;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String playFabId
    // Size: 0x8
    // Offset: 0x38
    ::StringW playFabId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Boolean[] debugParameters
    // Size: 0x8
    // Offset: 0x40
    ::ArrayW<bool> debugParameters;
    // Field size check
    static_assert(sizeof(::ArrayW<bool>) == 0x8);
    public:
    // Get instance field reference: public System.String accessToken
    [[deprecated("Use field access instead!")]] ::StringW& dyn_accessToken();
    // Get instance field reference: public System.String userID
    [[deprecated("Use field access instead!")]] ::StringW& dyn_userID();
    // Get instance field reference: public System.String nonce
    [[deprecated("Use field access instead!")]] ::StringW& dyn_nonce();
    // Get instance field reference: public System.String platform
    [[deprecated("Use field access instead!")]] ::StringW& dyn_platform();
    // Get instance field reference: public System.String sku
    [[deprecated("Use field access instead!")]] ::StringW& dyn_sku();
    // Get instance field reference: public System.String playFabId
    [[deprecated("Use field access instead!")]] ::StringW& dyn_playFabId();
    // Get instance field reference: public System.Boolean[] debugParameters
    [[deprecated("Use field access instead!")]] ::ArrayW<bool>& dyn_debugParameters();
    // public System.Void .ctor()
    // Offset: 0x283B990
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static CosmeticsController::IAPRequestBody* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::GorillaNetworking::CosmeticsController::IAPRequestBody::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<CosmeticsController::IAPRequestBody*, creationType>()));
    }
  }; // GorillaNetworking.CosmeticsController/IAPRequestBody
  #pragma pack(pop)
  static check_size<sizeof(CosmeticsController::IAPRequestBody), 64 + sizeof(::ArrayW<bool>)> __GorillaNetworking_CosmeticsController_IAPRequestBodySizeCheck;
  static_assert(sizeof(CosmeticsController::IAPRequestBody) == 0x48);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: GorillaNetworking::CosmeticsController::IAPRequestBody::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
