// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: GorillaTag.CosmeticSystem.CosmeticInfoV2
#include "GorillaTag/CosmeticSystem/CosmeticInfoV2.hpp"
// Including type: System.DateTime
#include "System/DateTime.hpp"
// Including type: BodyDockPositions
#include "GlobalNamespace/BodyDockPositions.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GorillaNetworking
namespace GorillaNetworking {
  // Skipping declaration: CosmeticCategory because it is already included!
  // Skipping declaration: CosmeticItem because it is already included!
  // Skipping declaration: CosmeticSlots because it is already included!
  // Skipping declaration: ATMStages because it is already included!
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {

  // Forward declaring type: GTAssetRef`1<TObject>
  template<typename TObject>
  class GTAssetRef_1;
}
// Forward declaring namespace: GorillaTag::CosmeticSystem
namespace GorillaTag::CosmeticSystem {
  // Forward declaring type: AllCosmeticsArraySO
  class AllCosmeticsArraySO;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: String
  class String;
}
// Forward declaring namespace: PlayFab::ClientModels
namespace PlayFab::ClientModels {
  // Forward declaring type: CatalogItem
  class CatalogItem;
  // Forward declaring type: UserDataRecord
  class UserDataRecord;
  // Forward declaring type: GetUserInventoryResult
  class GetUserInventoryResult;
  // Forward declaring type: PurchaseItemResult
  class PurchaseItemResult;
  // Forward declaring type: GetUserDataResult
  class GetUserDataResult;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Text
  class Text;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Forward declaring namespace: Oculus::Platform
namespace Oculus::Platform {
  // Forward declaring type: Message
  class Message;
  // Forward declaring type: Message`1<T>
  template<typename T>
  class Message_1;
}
// Forward declaring namespace: PlayFab::Json
namespace PlayFab::Json {
  // Forward declaring type: JsonObject
  class JsonObject;
}
// Forward declaring namespace: PlayFab
namespace PlayFab {
  // Forward declaring type: PlayFabError
  class PlayFabError;
}
// Forward declaring namespace: Oculus::Platform::Models
namespace Oculus::Platform::Models {
  // Forward declaring type: Purchase
  class Purchase;
}
// Forward declaring namespace: PlayFab::CloudScriptModels
namespace PlayFab::CloudScriptModels {
  // Forward declaring type: ExecuteFunctionResult
  class ExecuteFunctionResult;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Sprite
  class Sprite;
}
// Completed forward declares
// Type namespace: GorillaNetworking
namespace GorillaNetworking {
  // Forward declaring type: CosmeticsController
  class CosmeticsController;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GorillaNetworking::CosmeticsController);
DEFINE_IL2CPP_ARG_TYPE(::GorillaNetworking::CosmeticsController*, "GorillaNetworking", "CosmeticsController");
// Type namespace: GorillaNetworking
namespace GorillaNetworking {
  // Size: 0x4E8
  #pragma pack(push, 1)
  // Autogenerated type: GorillaNetworking.CosmeticsController
  // [TokenAttribute] Offset: FFFFFFFF
  class CosmeticsController : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::GorillaNetworking::CosmeticsController::SuccessCallback
    class SuccessCallback;
    // Nested type: ::GorillaNetworking::CosmeticsController::ErrorCallback
    class ErrorCallback;
    // Nested type: ::GorillaNetworking::CosmeticsController::PurchaseItemStages
    struct PurchaseItemStages;
    // Nested type: ::GorillaNetworking::CosmeticsController::ATMStages
    struct ATMStages;
    // Nested type: ::GorillaNetworking::CosmeticsController::CosmeticCategory
    struct CosmeticCategory;
    // Nested type: ::GorillaNetworking::CosmeticsController::CosmeticSlots
    struct CosmeticSlots;
    // Nested type: ::GorillaNetworking::CosmeticsController::CosmeticSet
    class CosmeticSet;
    // Nested type: ::GorillaNetworking::CosmeticsController::CosmeticItem
    struct CosmeticItem;
    // Nested type: ::GorillaNetworking::CosmeticsController::IAPRequestBody
    class IAPRequestBody;
    // Nested type: ::GorillaNetworking::CosmeticsController::EWearingCosmeticSet
    struct EWearingCosmeticSet;
    // Nested type: ::GorillaNetworking::CosmeticsController::$$c
    class $$c;
    // Nested type: ::GorillaNetworking::CosmeticsController::$$c__DisplayClass184_0
    class $$c__DisplayClass184_0;
    // Nested type: ::GorillaNetworking::CosmeticsController::$$c__DisplayClass185_0
    class $$c__DisplayClass185_0;
    // Nested type: ::GorillaNetworking::CosmeticsController::$$c__DisplayClass204_0
    class $$c__DisplayClass204_0;
    // Nested type: ::GorillaNetworking::CosmeticsController::$$c__DisplayClass204_1
    class $$c__DisplayClass204_1;
    // Nested type: ::GorillaNetworking::CosmeticsController::$$c__DisplayClass204_2
    class $$c__DisplayClass204_2;
    // Nested type: ::GorillaNetworking::CosmeticsController::$$c__DisplayClass204_3
    class $$c__DisplayClass204_3;
    // Nested type: ::GorillaNetworking::CosmeticsController::$$c__DisplayClass204_4
    class $$c__DisplayClass204_4;
    // Nested type: ::GorillaNetworking::CosmeticsController::$$c__DisplayClass204_5
    class $$c__DisplayClass204_5;
    // Nested type: ::GorillaNetworking::CosmeticsController::$$c__DisplayClass214_0
    class $$c__DisplayClass214_0;
    // Nested type: ::GorillaNetworking::CosmeticsController::$$c__DisplayClass216_0
    class $$c__DisplayClass216_0;
    // Nested type: ::GorillaNetworking::CosmeticsController::$$c__DisplayClass231_0
    class $$c__DisplayClass231_0;
    // Nested type: ::GorillaNetworking::CosmeticsController::$CheckCanGetDaily$d__202
    class $CheckCanGetDaily$d__202;
    // Nested type: ::GorillaNetworking::CosmeticsController::$CheckIfMyCosmeticsUpdated$d__185
    class $CheckIfMyCosmeticsUpdated$d__185;
    // Nested type: ::GorillaNetworking::CosmeticsController::$CheckIfQuitPurchase$d__212
    class $CheckIfQuitPurchase$d__212;
    // Nested type: ::GorillaNetworking::CosmeticsController::$GetMyDaily$d__203
    class $GetMyDaily$d__203;
    // Nested type: ::GorillaNetworking::CosmeticsController::$SendPostRequest$d__223
    class $SendPostRequest$d__223;
    // Nested type: ::GorillaNetworking::CosmeticsController::$V2_allCosmeticsInfoAssetRefSO_LoadCoroutine$d__20
    class $V2_allCosmeticsInfoAssetRefSO_LoadCoroutine$d__20;
    // Nested type: ::GorillaNetworking::CosmeticsController::$WaitForNextCosmeticsAttempt$d__230
    class $WaitForNextCosmeticsAttempt$d__230;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: GorillaNetworking.CosmeticsController/PurchaseItemStages
    // [TokenAttribute] Offset: FFFFFFFF
    struct PurchaseItemStages/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: PurchaseItemStages
      constexpr PurchaseItemStages(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public GorillaNetworking.CosmeticsController/PurchaseItemStages Start
      static constexpr const int Start = 0;
      // Get static field: static public GorillaNetworking.CosmeticsController/PurchaseItemStages Start
      static ::GorillaNetworking::CosmeticsController::PurchaseItemStages _get_Start();
      // Set static field: static public GorillaNetworking.CosmeticsController/PurchaseItemStages Start
      static void _set_Start(::GorillaNetworking::CosmeticsController::PurchaseItemStages value);
      // static field const value: static public GorillaNetworking.CosmeticsController/PurchaseItemStages CheckoutButtonPressed
      static constexpr const int CheckoutButtonPressed = 1;
      // Get static field: static public GorillaNetworking.CosmeticsController/PurchaseItemStages CheckoutButtonPressed
      static ::GorillaNetworking::CosmeticsController::PurchaseItemStages _get_CheckoutButtonPressed();
      // Set static field: static public GorillaNetworking.CosmeticsController/PurchaseItemStages CheckoutButtonPressed
      static void _set_CheckoutButtonPressed(::GorillaNetworking::CosmeticsController::PurchaseItemStages value);
      // static field const value: static public GorillaNetworking.CosmeticsController/PurchaseItemStages ItemSelected
      static constexpr const int ItemSelected = 2;
      // Get static field: static public GorillaNetworking.CosmeticsController/PurchaseItemStages ItemSelected
      static ::GorillaNetworking::CosmeticsController::PurchaseItemStages _get_ItemSelected();
      // Set static field: static public GorillaNetworking.CosmeticsController/PurchaseItemStages ItemSelected
      static void _set_ItemSelected(::GorillaNetworking::CosmeticsController::PurchaseItemStages value);
      // static field const value: static public GorillaNetworking.CosmeticsController/PurchaseItemStages ItemOwned
      static constexpr const int ItemOwned = 3;
      // Get static field: static public GorillaNetworking.CosmeticsController/PurchaseItemStages ItemOwned
      static ::GorillaNetworking::CosmeticsController::PurchaseItemStages _get_ItemOwned();
      // Set static field: static public GorillaNetworking.CosmeticsController/PurchaseItemStages ItemOwned
      static void _set_ItemOwned(::GorillaNetworking::CosmeticsController::PurchaseItemStages value);
      // static field const value: static public GorillaNetworking.CosmeticsController/PurchaseItemStages FinalPurchaseAcknowledgement
      static constexpr const int FinalPurchaseAcknowledgement = 4;
      // Get static field: static public GorillaNetworking.CosmeticsController/PurchaseItemStages FinalPurchaseAcknowledgement
      static ::GorillaNetworking::CosmeticsController::PurchaseItemStages _get_FinalPurchaseAcknowledgement();
      // Set static field: static public GorillaNetworking.CosmeticsController/PurchaseItemStages FinalPurchaseAcknowledgement
      static void _set_FinalPurchaseAcknowledgement(::GorillaNetworking::CosmeticsController::PurchaseItemStages value);
      // static field const value: static public GorillaNetworking.CosmeticsController/PurchaseItemStages Buying
      static constexpr const int Buying = 5;
      // Get static field: static public GorillaNetworking.CosmeticsController/PurchaseItemStages Buying
      static ::GorillaNetworking::CosmeticsController::PurchaseItemStages _get_Buying();
      // Set static field: static public GorillaNetworking.CosmeticsController/PurchaseItemStages Buying
      static void _set_Buying(::GorillaNetworking::CosmeticsController::PurchaseItemStages value);
      // static field const value: static public GorillaNetworking.CosmeticsController/PurchaseItemStages Success
      static constexpr const int Success = 6;
      // Get static field: static public GorillaNetworking.CosmeticsController/PurchaseItemStages Success
      static ::GorillaNetworking::CosmeticsController::PurchaseItemStages _get_Success();
      // Set static field: static public GorillaNetworking.CosmeticsController/PurchaseItemStages Success
      static void _set_Success(::GorillaNetworking::CosmeticsController::PurchaseItemStages value);
      // static field const value: static public GorillaNetworking.CosmeticsController/PurchaseItemStages Failure
      static constexpr const int Failure = 7;
      // Get static field: static public GorillaNetworking.CosmeticsController/PurchaseItemStages Failure
      static ::GorillaNetworking::CosmeticsController::PurchaseItemStages _get_Failure();
      // Set static field: static public GorillaNetworking.CosmeticsController/PurchaseItemStages Failure
      static void _set_Failure(::GorillaNetworking::CosmeticsController::PurchaseItemStages value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // GorillaNetworking.CosmeticsController/PurchaseItemStages
    #pragma pack(pop)
    static check_size<sizeof(CosmeticsController::PurchaseItemStages), 0 + sizeof(int)> __GorillaNetworking_CosmeticsController_PurchaseItemStagesSizeCheck;
    static_assert(sizeof(CosmeticsController::PurchaseItemStages) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: GorillaNetworking.CosmeticsController/ATMStages
    // [TokenAttribute] Offset: FFFFFFFF
    struct ATMStages/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: ATMStages
      constexpr ATMStages(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public GorillaNetworking.CosmeticsController/ATMStages Unavailable
      static constexpr const int Unavailable = 0;
      // Get static field: static public GorillaNetworking.CosmeticsController/ATMStages Unavailable
      static ::GorillaNetworking::CosmeticsController::ATMStages _get_Unavailable();
      // Set static field: static public GorillaNetworking.CosmeticsController/ATMStages Unavailable
      static void _set_Unavailable(::GorillaNetworking::CosmeticsController::ATMStages value);
      // static field const value: static public GorillaNetworking.CosmeticsController/ATMStages Begin
      static constexpr const int Begin = 1;
      // Get static field: static public GorillaNetworking.CosmeticsController/ATMStages Begin
      static ::GorillaNetworking::CosmeticsController::ATMStages _get_Begin();
      // Set static field: static public GorillaNetworking.CosmeticsController/ATMStages Begin
      static void _set_Begin(::GorillaNetworking::CosmeticsController::ATMStages value);
      // static field const value: static public GorillaNetworking.CosmeticsController/ATMStages Menu
      static constexpr const int Menu = 2;
      // Get static field: static public GorillaNetworking.CosmeticsController/ATMStages Menu
      static ::GorillaNetworking::CosmeticsController::ATMStages _get_Menu();
      // Set static field: static public GorillaNetworking.CosmeticsController/ATMStages Menu
      static void _set_Menu(::GorillaNetworking::CosmeticsController::ATMStages value);
      // static field const value: static public GorillaNetworking.CosmeticsController/ATMStages Balance
      static constexpr const int Balance = 3;
      // Get static field: static public GorillaNetworking.CosmeticsController/ATMStages Balance
      static ::GorillaNetworking::CosmeticsController::ATMStages _get_Balance();
      // Set static field: static public GorillaNetworking.CosmeticsController/ATMStages Balance
      static void _set_Balance(::GorillaNetworking::CosmeticsController::ATMStages value);
      // static field const value: static public GorillaNetworking.CosmeticsController/ATMStages Choose
      static constexpr const int Choose = 4;
      // Get static field: static public GorillaNetworking.CosmeticsController/ATMStages Choose
      static ::GorillaNetworking::CosmeticsController::ATMStages _get_Choose();
      // Set static field: static public GorillaNetworking.CosmeticsController/ATMStages Choose
      static void _set_Choose(::GorillaNetworking::CosmeticsController::ATMStages value);
      // static field const value: static public GorillaNetworking.CosmeticsController/ATMStages Confirm
      static constexpr const int Confirm = 5;
      // Get static field: static public GorillaNetworking.CosmeticsController/ATMStages Confirm
      static ::GorillaNetworking::CosmeticsController::ATMStages _get_Confirm();
      // Set static field: static public GorillaNetworking.CosmeticsController/ATMStages Confirm
      static void _set_Confirm(::GorillaNetworking::CosmeticsController::ATMStages value);
      // static field const value: static public GorillaNetworking.CosmeticsController/ATMStages Purchasing
      static constexpr const int Purchasing = 6;
      // Get static field: static public GorillaNetworking.CosmeticsController/ATMStages Purchasing
      static ::GorillaNetworking::CosmeticsController::ATMStages _get_Purchasing();
      // Set static field: static public GorillaNetworking.CosmeticsController/ATMStages Purchasing
      static void _set_Purchasing(::GorillaNetworking::CosmeticsController::ATMStages value);
      // static field const value: static public GorillaNetworking.CosmeticsController/ATMStages Success
      static constexpr const int Success = 7;
      // Get static field: static public GorillaNetworking.CosmeticsController/ATMStages Success
      static ::GorillaNetworking::CosmeticsController::ATMStages _get_Success();
      // Set static field: static public GorillaNetworking.CosmeticsController/ATMStages Success
      static void _set_Success(::GorillaNetworking::CosmeticsController::ATMStages value);
      // static field const value: static public GorillaNetworking.CosmeticsController/ATMStages Failure
      static constexpr const int Failure = 8;
      // Get static field: static public GorillaNetworking.CosmeticsController/ATMStages Failure
      static ::GorillaNetworking::CosmeticsController::ATMStages _get_Failure();
      // Set static field: static public GorillaNetworking.CosmeticsController/ATMStages Failure
      static void _set_Failure(::GorillaNetworking::CosmeticsController::ATMStages value);
      // static field const value: static public GorillaNetworking.CosmeticsController/ATMStages SafeAccount
      static constexpr const int SafeAccount = 9;
      // Get static field: static public GorillaNetworking.CosmeticsController/ATMStages SafeAccount
      static ::GorillaNetworking::CosmeticsController::ATMStages _get_SafeAccount();
      // Set static field: static public GorillaNetworking.CosmeticsController/ATMStages SafeAccount
      static void _set_SafeAccount(::GorillaNetworking::CosmeticsController::ATMStages value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // GorillaNetworking.CosmeticsController/ATMStages
    #pragma pack(pop)
    static check_size<sizeof(CosmeticsController::ATMStages), 0 + sizeof(int)> __GorillaNetworking_CosmeticsController_ATMStagesSizeCheck;
    static_assert(sizeof(CosmeticsController::ATMStages) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: GorillaNetworking.CosmeticsController/CosmeticCategory
    // [TokenAttribute] Offset: FFFFFFFF
    struct CosmeticCategory/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: CosmeticCategory
      constexpr CosmeticCategory(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public GorillaNetworking.CosmeticsController/CosmeticCategory None
      static constexpr const int None = 0;
      // Get static field: static public GorillaNetworking.CosmeticsController/CosmeticCategory None
      static ::GorillaNetworking::CosmeticsController::CosmeticCategory _get_None();
      // Set static field: static public GorillaNetworking.CosmeticsController/CosmeticCategory None
      static void _set_None(::GorillaNetworking::CosmeticsController::CosmeticCategory value);
      // static field const value: static public GorillaNetworking.CosmeticsController/CosmeticCategory Hat
      static constexpr const int Hat = 1;
      // Get static field: static public GorillaNetworking.CosmeticsController/CosmeticCategory Hat
      static ::GorillaNetworking::CosmeticsController::CosmeticCategory _get_Hat();
      // Set static field: static public GorillaNetworking.CosmeticsController/CosmeticCategory Hat
      static void _set_Hat(::GorillaNetworking::CosmeticsController::CosmeticCategory value);
      // static field const value: static public GorillaNetworking.CosmeticsController/CosmeticCategory Badge
      static constexpr const int Badge = 2;
      // Get static field: static public GorillaNetworking.CosmeticsController/CosmeticCategory Badge
      static ::GorillaNetworking::CosmeticsController::CosmeticCategory _get_Badge();
      // Set static field: static public GorillaNetworking.CosmeticsController/CosmeticCategory Badge
      static void _set_Badge(::GorillaNetworking::CosmeticsController::CosmeticCategory value);
      // static field const value: static public GorillaNetworking.CosmeticsController/CosmeticCategory Face
      static constexpr const int Face = 3;
      // Get static field: static public GorillaNetworking.CosmeticsController/CosmeticCategory Face
      static ::GorillaNetworking::CosmeticsController::CosmeticCategory _get_Face();
      // Set static field: static public GorillaNetworking.CosmeticsController/CosmeticCategory Face
      static void _set_Face(::GorillaNetworking::CosmeticsController::CosmeticCategory value);
      // static field const value: static public GorillaNetworking.CosmeticsController/CosmeticCategory Paw
      static constexpr const int Paw = 4;
      // Get static field: static public GorillaNetworking.CosmeticsController/CosmeticCategory Paw
      static ::GorillaNetworking::CosmeticsController::CosmeticCategory _get_Paw();
      // Set static field: static public GorillaNetworking.CosmeticsController/CosmeticCategory Paw
      static void _set_Paw(::GorillaNetworking::CosmeticsController::CosmeticCategory value);
      // static field const value: static public GorillaNetworking.CosmeticsController/CosmeticCategory Chest
      static constexpr const int Chest = 5;
      // Get static field: static public GorillaNetworking.CosmeticsController/CosmeticCategory Chest
      static ::GorillaNetworking::CosmeticsController::CosmeticCategory _get_Chest();
      // Set static field: static public GorillaNetworking.CosmeticsController/CosmeticCategory Chest
      static void _set_Chest(::GorillaNetworking::CosmeticsController::CosmeticCategory value);
      // static field const value: static public GorillaNetworking.CosmeticsController/CosmeticCategory Fur
      static constexpr const int Fur = 6;
      // Get static field: static public GorillaNetworking.CosmeticsController/CosmeticCategory Fur
      static ::GorillaNetworking::CosmeticsController::CosmeticCategory _get_Fur();
      // Set static field: static public GorillaNetworking.CosmeticsController/CosmeticCategory Fur
      static void _set_Fur(::GorillaNetworking::CosmeticsController::CosmeticCategory value);
      // static field const value: static public GorillaNetworking.CosmeticsController/CosmeticCategory Shirt
      static constexpr const int Shirt = 7;
      // Get static field: static public GorillaNetworking.CosmeticsController/CosmeticCategory Shirt
      static ::GorillaNetworking::CosmeticsController::CosmeticCategory _get_Shirt();
      // Set static field: static public GorillaNetworking.CosmeticsController/CosmeticCategory Shirt
      static void _set_Shirt(::GorillaNetworking::CosmeticsController::CosmeticCategory value);
      // static field const value: static public GorillaNetworking.CosmeticsController/CosmeticCategory Back
      static constexpr const int Back = 8;
      // Get static field: static public GorillaNetworking.CosmeticsController/CosmeticCategory Back
      static ::GorillaNetworking::CosmeticsController::CosmeticCategory _get_Back();
      // Set static field: static public GorillaNetworking.CosmeticsController/CosmeticCategory Back
      static void _set_Back(::GorillaNetworking::CosmeticsController::CosmeticCategory value);
      // static field const value: static public GorillaNetworking.CosmeticsController/CosmeticCategory Arms
      static constexpr const int Arms = 9;
      // Get static field: static public GorillaNetworking.CosmeticsController/CosmeticCategory Arms
      static ::GorillaNetworking::CosmeticsController::CosmeticCategory _get_Arms();
      // Set static field: static public GorillaNetworking.CosmeticsController/CosmeticCategory Arms
      static void _set_Arms(::GorillaNetworking::CosmeticsController::CosmeticCategory value);
      // static field const value: static public GorillaNetworking.CosmeticsController/CosmeticCategory Pants
      static constexpr const int Pants = 10;
      // Get static field: static public GorillaNetworking.CosmeticsController/CosmeticCategory Pants
      static ::GorillaNetworking::CosmeticsController::CosmeticCategory _get_Pants();
      // Set static field: static public GorillaNetworking.CosmeticsController/CosmeticCategory Pants
      static void _set_Pants(::GorillaNetworking::CosmeticsController::CosmeticCategory value);
      // static field const value: static public GorillaNetworking.CosmeticsController/CosmeticCategory TagEffect
      static constexpr const int TagEffect = 11;
      // Get static field: static public GorillaNetworking.CosmeticsController/CosmeticCategory TagEffect
      static ::GorillaNetworking::CosmeticsController::CosmeticCategory _get_TagEffect();
      // Set static field: static public GorillaNetworking.CosmeticsController/CosmeticCategory TagEffect
      static void _set_TagEffect(::GorillaNetworking::CosmeticsController::CosmeticCategory value);
      // static field const value: static public GorillaNetworking.CosmeticsController/CosmeticCategory Count
      static constexpr const int Count = 12;
      // Get static field: static public GorillaNetworking.CosmeticsController/CosmeticCategory Count
      static ::GorillaNetworking::CosmeticsController::CosmeticCategory _get_Count();
      // Set static field: static public GorillaNetworking.CosmeticsController/CosmeticCategory Count
      static void _set_Count(::GorillaNetworking::CosmeticsController::CosmeticCategory value);
      // static field const value: static public GorillaNetworking.CosmeticsController/CosmeticCategory Set
      static constexpr const int Set = 13;
      // Get static field: static public GorillaNetworking.CosmeticsController/CosmeticCategory Set
      static ::GorillaNetworking::CosmeticsController::CosmeticCategory _get_Set();
      // Set static field: static public GorillaNetworking.CosmeticsController/CosmeticCategory Set
      static void _set_Set(::GorillaNetworking::CosmeticsController::CosmeticCategory value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // GorillaNetworking.CosmeticsController/CosmeticCategory
    #pragma pack(pop)
    static check_size<sizeof(CosmeticsController::CosmeticCategory), 0 + sizeof(int)> __GorillaNetworking_CosmeticsController_CosmeticCategorySizeCheck;
    static_assert(sizeof(CosmeticsController::CosmeticCategory) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: GorillaNetworking.CosmeticsController/CosmeticSlots
    // [TokenAttribute] Offset: FFFFFFFF
    struct CosmeticSlots/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: CosmeticSlots
      constexpr CosmeticSlots(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public GorillaNetworking.CosmeticsController/CosmeticSlots Hat
      static constexpr const int Hat = 0;
      // Get static field: static public GorillaNetworking.CosmeticsController/CosmeticSlots Hat
      static ::GorillaNetworking::CosmeticsController::CosmeticSlots _get_Hat();
      // Set static field: static public GorillaNetworking.CosmeticsController/CosmeticSlots Hat
      static void _set_Hat(::GorillaNetworking::CosmeticsController::CosmeticSlots value);
      // static field const value: static public GorillaNetworking.CosmeticsController/CosmeticSlots Badge
      static constexpr const int Badge = 1;
      // Get static field: static public GorillaNetworking.CosmeticsController/CosmeticSlots Badge
      static ::GorillaNetworking::CosmeticsController::CosmeticSlots _get_Badge();
      // Set static field: static public GorillaNetworking.CosmeticsController/CosmeticSlots Badge
      static void _set_Badge(::GorillaNetworking::CosmeticsController::CosmeticSlots value);
      // static field const value: static public GorillaNetworking.CosmeticsController/CosmeticSlots Face
      static constexpr const int Face = 2;
      // Get static field: static public GorillaNetworking.CosmeticsController/CosmeticSlots Face
      static ::GorillaNetworking::CosmeticsController::CosmeticSlots _get_Face();
      // Set static field: static public GorillaNetworking.CosmeticsController/CosmeticSlots Face
      static void _set_Face(::GorillaNetworking::CosmeticsController::CosmeticSlots value);
      // static field const value: static public GorillaNetworking.CosmeticsController/CosmeticSlots ArmLeft
      static constexpr const int ArmLeft = 3;
      // Get static field: static public GorillaNetworking.CosmeticsController/CosmeticSlots ArmLeft
      static ::GorillaNetworking::CosmeticsController::CosmeticSlots _get_ArmLeft();
      // Set static field: static public GorillaNetworking.CosmeticsController/CosmeticSlots ArmLeft
      static void _set_ArmLeft(::GorillaNetworking::CosmeticsController::CosmeticSlots value);
      // static field const value: static public GorillaNetworking.CosmeticsController/CosmeticSlots ArmRight
      static constexpr const int ArmRight = 4;
      // Get static field: static public GorillaNetworking.CosmeticsController/CosmeticSlots ArmRight
      static ::GorillaNetworking::CosmeticsController::CosmeticSlots _get_ArmRight();
      // Set static field: static public GorillaNetworking.CosmeticsController/CosmeticSlots ArmRight
      static void _set_ArmRight(::GorillaNetworking::CosmeticsController::CosmeticSlots value);
      // static field const value: static public GorillaNetworking.CosmeticsController/CosmeticSlots BackLeft
      static constexpr const int BackLeft = 5;
      // Get static field: static public GorillaNetworking.CosmeticsController/CosmeticSlots BackLeft
      static ::GorillaNetworking::CosmeticsController::CosmeticSlots _get_BackLeft();
      // Set static field: static public GorillaNetworking.CosmeticsController/CosmeticSlots BackLeft
      static void _set_BackLeft(::GorillaNetworking::CosmeticsController::CosmeticSlots value);
      // static field const value: static public GorillaNetworking.CosmeticsController/CosmeticSlots BackRight
      static constexpr const int BackRight = 6;
      // Get static field: static public GorillaNetworking.CosmeticsController/CosmeticSlots BackRight
      static ::GorillaNetworking::CosmeticsController::CosmeticSlots _get_BackRight();
      // Set static field: static public GorillaNetworking.CosmeticsController/CosmeticSlots BackRight
      static void _set_BackRight(::GorillaNetworking::CosmeticsController::CosmeticSlots value);
      // static field const value: static public GorillaNetworking.CosmeticsController/CosmeticSlots HandLeft
      static constexpr const int HandLeft = 7;
      // Get static field: static public GorillaNetworking.CosmeticsController/CosmeticSlots HandLeft
      static ::GorillaNetworking::CosmeticsController::CosmeticSlots _get_HandLeft();
      // Set static field: static public GorillaNetworking.CosmeticsController/CosmeticSlots HandLeft
      static void _set_HandLeft(::GorillaNetworking::CosmeticsController::CosmeticSlots value);
      // static field const value: static public GorillaNetworking.CosmeticsController/CosmeticSlots HandRight
      static constexpr const int HandRight = 8;
      // Get static field: static public GorillaNetworking.CosmeticsController/CosmeticSlots HandRight
      static ::GorillaNetworking::CosmeticsController::CosmeticSlots _get_HandRight();
      // Set static field: static public GorillaNetworking.CosmeticsController/CosmeticSlots HandRight
      static void _set_HandRight(::GorillaNetworking::CosmeticsController::CosmeticSlots value);
      // static field const value: static public GorillaNetworking.CosmeticsController/CosmeticSlots Chest
      static constexpr const int Chest = 9;
      // Get static field: static public GorillaNetworking.CosmeticsController/CosmeticSlots Chest
      static ::GorillaNetworking::CosmeticsController::CosmeticSlots _get_Chest();
      // Set static field: static public GorillaNetworking.CosmeticsController/CosmeticSlots Chest
      static void _set_Chest(::GorillaNetworking::CosmeticsController::CosmeticSlots value);
      // static field const value: static public GorillaNetworking.CosmeticsController/CosmeticSlots Fur
      static constexpr const int Fur = 10;
      // Get static field: static public GorillaNetworking.CosmeticsController/CosmeticSlots Fur
      static ::GorillaNetworking::CosmeticsController::CosmeticSlots _get_Fur();
      // Set static field: static public GorillaNetworking.CosmeticsController/CosmeticSlots Fur
      static void _set_Fur(::GorillaNetworking::CosmeticsController::CosmeticSlots value);
      // static field const value: static public GorillaNetworking.CosmeticsController/CosmeticSlots Shirt
      static constexpr const int Shirt = 11;
      // Get static field: static public GorillaNetworking.CosmeticsController/CosmeticSlots Shirt
      static ::GorillaNetworking::CosmeticsController::CosmeticSlots _get_Shirt();
      // Set static field: static public GorillaNetworking.CosmeticsController/CosmeticSlots Shirt
      static void _set_Shirt(::GorillaNetworking::CosmeticsController::CosmeticSlots value);
      // static field const value: static public GorillaNetworking.CosmeticsController/CosmeticSlots Pants
      static constexpr const int Pants = 12;
      // Get static field: static public GorillaNetworking.CosmeticsController/CosmeticSlots Pants
      static ::GorillaNetworking::CosmeticsController::CosmeticSlots _get_Pants();
      // Set static field: static public GorillaNetworking.CosmeticsController/CosmeticSlots Pants
      static void _set_Pants(::GorillaNetworking::CosmeticsController::CosmeticSlots value);
      // static field const value: static public GorillaNetworking.CosmeticsController/CosmeticSlots Back
      static constexpr const int Back = 13;
      // Get static field: static public GorillaNetworking.CosmeticsController/CosmeticSlots Back
      static ::GorillaNetworking::CosmeticsController::CosmeticSlots _get_Back();
      // Set static field: static public GorillaNetworking.CosmeticsController/CosmeticSlots Back
      static void _set_Back(::GorillaNetworking::CosmeticsController::CosmeticSlots value);
      // static field const value: static public GorillaNetworking.CosmeticsController/CosmeticSlots Arms
      static constexpr const int Arms = 14;
      // Get static field: static public GorillaNetworking.CosmeticsController/CosmeticSlots Arms
      static ::GorillaNetworking::CosmeticsController::CosmeticSlots _get_Arms();
      // Set static field: static public GorillaNetworking.CosmeticsController/CosmeticSlots Arms
      static void _set_Arms(::GorillaNetworking::CosmeticsController::CosmeticSlots value);
      // static field const value: static public GorillaNetworking.CosmeticsController/CosmeticSlots TagEffect
      static constexpr const int TagEffect = 15;
      // Get static field: static public GorillaNetworking.CosmeticsController/CosmeticSlots TagEffect
      static ::GorillaNetworking::CosmeticsController::CosmeticSlots _get_TagEffect();
      // Set static field: static public GorillaNetworking.CosmeticsController/CosmeticSlots TagEffect
      static void _set_TagEffect(::GorillaNetworking::CosmeticsController::CosmeticSlots value);
      // static field const value: static public GorillaNetworking.CosmeticsController/CosmeticSlots Count
      static constexpr const int Count = 16;
      // Get static field: static public GorillaNetworking.CosmeticsController/CosmeticSlots Count
      static ::GorillaNetworking::CosmeticsController::CosmeticSlots _get_Count();
      // Set static field: static public GorillaNetworking.CosmeticsController/CosmeticSlots Count
      static void _set_Count(::GorillaNetworking::CosmeticsController::CosmeticSlots value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // GorillaNetworking.CosmeticsController/CosmeticSlots
    #pragma pack(pop)
    static check_size<sizeof(CosmeticsController::CosmeticSlots), 0 + sizeof(int)> __GorillaNetworking_CosmeticsController_CosmeticSlotsSizeCheck;
    static_assert(sizeof(CosmeticsController::CosmeticSlots) == 0x4);
    // Size: 0x79
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: GorillaNetworking.CosmeticsController/CosmeticItem
    // [TokenAttribute] Offset: FFFFFFFF
    struct CosmeticItem/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.String itemName
      // Size: 0x8
      // Offset: 0x0
      ::StringW itemName;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      // public GorillaNetworking.CosmeticsController/CosmeticCategory itemCategory
      // Size: 0x4
      // Offset: 0x8
      ::GorillaNetworking::CosmeticsController::CosmeticCategory itemCategory;
      // Field size check
      static_assert(sizeof(::GorillaNetworking::CosmeticsController::CosmeticCategory) == 0x4);
      // public System.Boolean isHoldable
      // Size: 0x1
      // Offset: 0xC
      bool isHoldable;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // Padding between fields: isHoldable and: itemPicture
      char __padding2[0x3] = {};
      // public UnityEngine.Sprite itemPicture
      // Size: 0x8
      // Offset: 0x10
      ::UnityEngine::Sprite* itemPicture;
      // Field size check
      static_assert(sizeof(::UnityEngine::Sprite*) == 0x8);
      // public System.String displayName
      // Size: 0x8
      // Offset: 0x18
      ::StringW displayName;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      // public System.String itemPictureResourceString
      // Size: 0x8
      // Offset: 0x20
      ::StringW itemPictureResourceString;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      // public System.String overrideDisplayName
      // Size: 0x8
      // Offset: 0x28
      ::StringW overrideDisplayName;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      // public System.Int32 cost
      // Size: 0x4
      // Offset: 0x30
      int cost;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Padding between fields: cost and: bundledItems
      char __padding7[0x4] = {};
      // public System.String[] bundledItems
      // Size: 0x8
      // Offset: 0x38
      ::ArrayW<::StringW> bundledItems;
      // Field size check
      static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
      // public System.Boolean canTryOn
      // Size: 0x1
      // Offset: 0x40
      bool canTryOn;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // public System.Boolean bothHandsHoldable
      // Size: 0x1
      // Offset: 0x41
      bool bothHandsHoldable;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // public System.Boolean bLoadsFromResources
      // Size: 0x1
      // Offset: 0x42
      bool bLoadsFromResources;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // public System.Boolean bUsesMeshAtlas
      // Size: 0x1
      // Offset: 0x43
      bool bUsesMeshAtlas;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // public UnityEngine.Vector3 rotationOffset
      // Size: 0xC
      // Offset: 0x44
      ::UnityEngine::Vector3 rotationOffset;
      // Field size check
      static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
      // public UnityEngine.Vector3 positionOffset
      // Size: 0xC
      // Offset: 0x50
      ::UnityEngine::Vector3 positionOffset;
      // Field size check
      static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
      // Padding between fields: positionOffset and: meshAtlasResourceString
      char __padding14[0x4] = {};
      // public System.String meshAtlasResourceString
      // Size: 0x8
      // Offset: 0x60
      ::StringW meshAtlasResourceString;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      // public System.String meshResourceString
      // Size: 0x8
      // Offset: 0x68
      ::StringW meshResourceString;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      // public System.String materialResourceString
      // Size: 0x8
      // Offset: 0x70
      ::StringW materialResourceString;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      // public System.Boolean isNullItem
      // Size: 0x1
      // Offset: 0x78
      bool isNullItem;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      public:
      // Creating value type constructor for type: CosmeticItem
      constexpr CosmeticItem(::StringW itemName_ = {}, ::GorillaNetworking::CosmeticsController::CosmeticCategory itemCategory_ = {}, bool isHoldable_ = {}, ::UnityEngine::Sprite* itemPicture_ = {}, ::StringW displayName_ = {}, ::StringW itemPictureResourceString_ = {}, ::StringW overrideDisplayName_ = {}, int cost_ = {}, ::ArrayW<::StringW> bundledItems_ = ::ArrayW<::StringW>(static_cast<void*>(nullptr)), bool canTryOn_ = {}, bool bothHandsHoldable_ = {}, bool bLoadsFromResources_ = {}, bool bUsesMeshAtlas_ = {}, ::UnityEngine::Vector3 rotationOffset_ = {}, ::UnityEngine::Vector3 positionOffset_ = {}, ::StringW meshAtlasResourceString_ = {}, ::StringW meshResourceString_ = {}, ::StringW materialResourceString_ = {}, bool isNullItem_ = {}) noexcept : itemName{itemName_}, itemCategory{itemCategory_}, isHoldable{isHoldable_}, itemPicture{itemPicture_}, displayName{displayName_}, itemPictureResourceString{itemPictureResourceString_}, overrideDisplayName{overrideDisplayName_}, cost{cost_}, bundledItems{bundledItems_}, canTryOn{canTryOn_}, bothHandsHoldable{bothHandsHoldable_}, bLoadsFromResources{bLoadsFromResources_}, bUsesMeshAtlas{bUsesMeshAtlas_}, rotationOffset{rotationOffset_}, positionOffset{positionOffset_}, meshAtlasResourceString{meshAtlasResourceString_}, meshResourceString{meshResourceString_}, materialResourceString{materialResourceString_}, isNullItem{isNullItem_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public System.String itemName
      [[deprecated("Use field access instead!")]] ::StringW& dyn_itemName();
      // Get instance field reference: public GorillaNetworking.CosmeticsController/CosmeticCategory itemCategory
      [[deprecated("Use field access instead!")]] ::GorillaNetworking::CosmeticsController::CosmeticCategory& dyn_itemCategory();
      // Get instance field reference: public System.Boolean isHoldable
      [[deprecated("Use field access instead!")]] bool& dyn_isHoldable();
      // Get instance field reference: public UnityEngine.Sprite itemPicture
      [[deprecated("Use field access instead!")]] ::UnityEngine::Sprite*& dyn_itemPicture();
      // Get instance field reference: public System.String displayName
      [[deprecated("Use field access instead!")]] ::StringW& dyn_displayName();
      // Get instance field reference: public System.String itemPictureResourceString
      [[deprecated("Use field access instead!")]] ::StringW& dyn_itemPictureResourceString();
      // Get instance field reference: public System.String overrideDisplayName
      [[deprecated("Use field access instead!")]] ::StringW& dyn_overrideDisplayName();
      // Get instance field reference: public System.Int32 cost
      [[deprecated("Use field access instead!")]] int& dyn_cost();
      // Get instance field reference: public System.String[] bundledItems
      [[deprecated("Use field access instead!")]] ::ArrayW<::StringW>& dyn_bundledItems();
      // Get instance field reference: public System.Boolean canTryOn
      [[deprecated("Use field access instead!")]] bool& dyn_canTryOn();
      // Get instance field reference: public System.Boolean bothHandsHoldable
      [[deprecated("Use field access instead!")]] bool& dyn_bothHandsHoldable();
      // Get instance field reference: public System.Boolean bLoadsFromResources
      [[deprecated("Use field access instead!")]] bool& dyn_bLoadsFromResources();
      // Get instance field reference: public System.Boolean bUsesMeshAtlas
      [[deprecated("Use field access instead!")]] bool& dyn_bUsesMeshAtlas();
      // Get instance field reference: public UnityEngine.Vector3 rotationOffset
      [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_rotationOffset();
      // Get instance field reference: public UnityEngine.Vector3 positionOffset
      [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_positionOffset();
      // Get instance field reference: public System.String meshAtlasResourceString
      [[deprecated("Use field access instead!")]] ::StringW& dyn_meshAtlasResourceString();
      // Get instance field reference: public System.String meshResourceString
      [[deprecated("Use field access instead!")]] ::StringW& dyn_meshResourceString();
      // Get instance field reference: public System.String materialResourceString
      [[deprecated("Use field access instead!")]] ::StringW& dyn_materialResourceString();
      // Get instance field reference: public System.Boolean isNullItem
      [[deprecated("Use field access instead!")]] bool& dyn_isNullItem();
    }; // GorillaNetworking.CosmeticsController/CosmeticItem
    #pragma pack(pop)
    static check_size<sizeof(CosmeticsController::CosmeticItem), 120 + sizeof(bool)> __GorillaNetworking_CosmeticsController_CosmeticItemSizeCheck;
    static_assert(sizeof(CosmeticsController::CosmeticItem) == 0x79);
    public:
    // public GorillaTag.GTAssetRef`1<GorillaTag.CosmeticSystem.AllCosmeticsArraySO> v2_allCosmeticsInfoAssetRef
    // Size: 0x8
    // Offset: 0x20
    ::GorillaTag::GTAssetRef_1<::GorillaTag::CosmeticSystem::AllCosmeticsArraySO*>* v2_allCosmeticsInfoAssetRef;
    // Field size check
    static_assert(sizeof(::GorillaTag::GTAssetRef_1<::GorillaTag::CosmeticSystem::AllCosmeticsArraySO*>*) == 0x8);
    // private GorillaTag.CosmeticSystem.CosmeticInfoV2[] <v2_allCosmetics>k__BackingField
    // Size: 0x8
    // Offset: 0x28
    ::ArrayW<::GorillaTag::CosmeticSystem::CosmeticInfoV2> v2_allCosmetics;
    // Field size check
    static_assert(sizeof(::ArrayW<::GorillaTag::CosmeticSystem::CosmeticInfoV2>) == 0x8);
    // private readonly System.Collections.Generic.Dictionary`2<System.String,GorillaTag.CosmeticSystem.CosmeticInfoV2> _allCosmeticsDictV2
    // Size: 0x8
    // Offset: 0x30
    ::System::Collections::Generic::Dictionary_2<::StringW, ::GorillaTag::CosmeticSystem::CosmeticInfoV2>* allCosmeticsDictV2;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, ::GorillaTag::CosmeticSystem::CosmeticInfoV2>*) == 0x8);
    // public System.Action V2_allCosmeticsInfoAssetRef_OnPostLoad
    // Size: 0x8
    // Offset: 0x38
    ::System::Action* V2_allCosmeticsInfoAssetRef_OnPostLoad;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private System.Boolean <v2_allCosmeticsInfoAssetRef_isLoaded>k__BackingField
    // Size: 0x1
    // Offset: 0x40
    bool v2_allCosmeticsInfoAssetRef_isLoaded;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <v2_isGetCosmeticsPlayCatalogDataWaitingForCallback>k__BackingField
    // Size: 0x1
    // Offset: 0x41
    bool v2_isGetCosmeticsPlayCatalogDataWaitingForCallback;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <v2_isCosmeticPlayFabCatalogDataLoaded>k__BackingField
    // Size: 0x1
    // Offset: 0x42
    bool v2_isCosmeticPlayFabCatalogDataLoaded;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: v2_isCosmeticPlayFabCatalogDataLoaded and: V2_OnGetCosmeticsPlayFabCatalogData_PostSuccess
    char __padding6[0x5] = {};
    // public System.Action V2_OnGetCosmeticsPlayFabCatalogData_PostSuccess
    // Size: 0x8
    // Offset: 0x48
    ::System::Action* V2_OnGetCosmeticsPlayFabCatalogData_PostSuccess;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private System.Collections.Generic.List`1<GorillaNetworking.CosmeticsController/CosmeticItem> _allCosmetics
    // Size: 0x8
    // Offset: 0x50
    ::System::Collections::Generic::List_1<::GorillaNetworking::CosmeticsController::CosmeticItem>* allCosmetics;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GorillaNetworking::CosmeticsController::CosmeticItem>*) == 0x8);
    // private System.Boolean <allCosmeticsDict_isInitialized>k__BackingField
    // Size: 0x1
    // Offset: 0x58
    bool allCosmeticsDict_isInitialized;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: allCosmeticsDict_isInitialized and: allCosmeticsDict
    char __padding9[0x7] = {};
    // public System.Collections.Generic.Dictionary`2<System.String,GorillaNetworking.CosmeticsController/CosmeticItem> _allCosmeticsDict
    // Size: 0x8
    // Offset: 0x60
    ::System::Collections::Generic::Dictionary_2<::StringW, ::GorillaNetworking::CosmeticsController::CosmeticItem>* allCosmeticsDict;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, ::GorillaNetworking::CosmeticsController::CosmeticItem>*) == 0x8);
    // private System.Boolean <allCosmeticsItemIDsfromDisplayNamesDict_isInitialized>k__BackingField
    // Size: 0x1
    // Offset: 0x68
    bool allCosmeticsItemIDsfromDisplayNamesDict_isInitialized;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: allCosmeticsItemIDsfromDisplayNamesDict_isInitialized and: allCosmeticsItemIDsfromDisplayNamesDict
    char __padding11[0x7] = {};
    // public System.Collections.Generic.Dictionary`2<System.String,System.String> _allCosmeticsItemIDsfromDisplayNamesDict
    // Size: 0x8
    // Offset: 0x70
    ::System::Collections::Generic::Dictionary_2<::StringW, ::StringW>* allCosmeticsItemIDsfromDisplayNamesDict;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, ::StringW>*) == 0x8);
    // public GorillaNetworking.CosmeticsController/CosmeticItem nullItem
    // Size: 0x79
    // Offset: 0x78
    ::GorillaNetworking::CosmeticsController::CosmeticItem nullItem;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::CosmeticsController::CosmeticItem) == 0x79);
    // Padding between fields: nullItem and: catalog
    char __padding13[0x7] = {};
    // public System.String catalog
    // Size: 0x8
    // Offset: 0xF8
    ::StringW catalog;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String[] tempStringArray
    // Size: 0x8
    // Offset: 0x100
    ::ArrayW<::StringW> tempStringArray;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // private GorillaNetworking.CosmeticsController/CosmeticItem tempItem
    // Size: 0x79
    // Offset: 0x108
    ::GorillaNetworking::CosmeticsController::CosmeticItem tempItem;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::CosmeticsController::CosmeticItem) == 0x79);
    // Padding between fields: tempItem and: anchorOverrides
    char __padding16[0x7] = {};
    // private VRRigAnchorOverrides anchorOverrides
    // Size: 0x8
    // Offset: 0x188
    ::GlobalNamespace::VRRigAnchorOverrides* anchorOverrides;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::VRRigAnchorOverrides*) == 0x8);
    // public System.Collections.Generic.List`1<PlayFab.ClientModels.CatalogItem> catalogItems
    // Size: 0x8
    // Offset: 0x190
    ::System::Collections::Generic::List_1<::PlayFab::ClientModels::CatalogItem*>* catalogItems;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::PlayFab::ClientModels::CatalogItem*>*) == 0x8);
    // public System.Boolean tryTwice
    // Size: 0x1
    // Offset: 0x198
    bool tryTwice;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: tryTwice and: tryOnSet
    char __padding19[0x7] = {};
    // public GorillaNetworking.CosmeticsController/CosmeticSet tryOnSet
    // Size: 0x8
    // Offset: 0x1A0
    ::GorillaNetworking::CosmeticsController::CosmeticSet* tryOnSet;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::CosmeticsController::CosmeticSet*) == 0x8);
    // public FittingRoomButton[] fittingRoomButtons
    // Size: 0x8
    // Offset: 0x1A8
    ::ArrayW<::GlobalNamespace::FittingRoomButton*> fittingRoomButtons;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::FittingRoomButton*>) == 0x8);
    // public CosmeticStand[] cosmeticStands
    // Size: 0x8
    // Offset: 0x1B0
    ::ArrayW<::GlobalNamespace::CosmeticStand*> cosmeticStands;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::CosmeticStand*>) == 0x8);
    // public System.Collections.Generic.List`1<GorillaNetworking.CosmeticsController/CosmeticItem> currentCart
    // Size: 0x8
    // Offset: 0x1B8
    ::System::Collections::Generic::List_1<::GorillaNetworking::CosmeticsController::CosmeticItem>* currentCart;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GorillaNetworking::CosmeticsController::CosmeticItem>*) == 0x8);
    // public GorillaNetworking.CosmeticsController/PurchaseItemStages currentPurchaseItemStage
    // Size: 0x4
    // Offset: 0x1C0
    ::GorillaNetworking::CosmeticsController::PurchaseItemStages currentPurchaseItemStage;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::CosmeticsController::PurchaseItemStages) == 0x4);
    // Padding between fields: currentPurchaseItemStage and: checkoutCartButtons
    char __padding24[0x4] = {};
    // public CheckoutCartButton[] checkoutCartButtons
    // Size: 0x8
    // Offset: 0x1C8
    ::ArrayW<::GlobalNamespace::CheckoutCartButton*> checkoutCartButtons;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::CheckoutCartButton*>) == 0x8);
    // public PurchaseItemButton leftPurchaseButton
    // Size: 0x8
    // Offset: 0x1D0
    ::GlobalNamespace::PurchaseItemButton* leftPurchaseButton;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::PurchaseItemButton*) == 0x8);
    // public PurchaseItemButton rightPurchaseButton
    // Size: 0x8
    // Offset: 0x1D8
    ::GlobalNamespace::PurchaseItemButton* rightPurchaseButton;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::PurchaseItemButton*) == 0x8);
    // public UnityEngine.UI.Text purchaseText
    // Size: 0x8
    // Offset: 0x1E0
    ::UnityEngine::UI::Text* purchaseText;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // public GorillaNetworking.CosmeticsController/CosmeticItem itemToBuy
    // Size: 0x79
    // Offset: 0x1E8
    ::GorillaNetworking::CosmeticsController::CosmeticItem itemToBuy;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::CosmeticsController::CosmeticItem) == 0x79);
    // Padding between fields: itemToBuy and: checkoutHeadModel
    char __padding29[0x7] = {};
    // public HeadModel checkoutHeadModel
    // Size: 0x8
    // Offset: 0x268
    ::GlobalNamespace::HeadModel* checkoutHeadModel;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::HeadModel*) == 0x8);
    // private System.Collections.Generic.List`1<System.String> playerIDList
    // Size: 0x8
    // Offset: 0x270
    ::System::Collections::Generic::List_1<::StringW>* playerIDList;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::StringW>*) == 0x8);
    // private System.Boolean foundCosmetic
    // Size: 0x1
    // Offset: 0x278
    bool foundCosmetic;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: foundCosmetic and: attempts
    char __padding32[0x3] = {};
    // private System.Int32 attempts
    // Size: 0x4
    // Offset: 0x27C
    int attempts;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.String finalLine
    // Size: 0x8
