// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: Photon.Realtime.IMatchmakingCallbacks
#include "Photon/Realtime/IMatchmakingCallbacks.hpp"
// Including type: System.DateTime
#include "System/DateTime.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::XR::Interaction::Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Forward declaring type: GorillaSnapTurn
  class GorillaSnapTurn;
}
// Forward declaring namespace: GorillaNetworking
namespace GorillaNetworking {
  // Forward declaring type: GorillaText
  class GorillaText;
  // Forward declaring type: PhotonNetworkController
  class PhotonNetworkController;
  // Forward declaring type: GorillaNetworkJoinTrigger
  class GorillaNetworkJoinTrigger;
  // Forward declaring type: CreditsView
  class CreditsView;
  // Skipping declaration: ComputerState because it is already included!
  // Forward declaring type: GorillaKeyboardBindings
  struct GorillaKeyboardBindings;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: MeshRenderer
  class MeshRenderer;
  // Forward declaring type: TextAsset
  class TextAsset;
  // Forward declaring type: WaitForSeconds
  class WaitForSeconds;
  // Forward declaring type: Coroutine
  class Coroutine;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Text
  class Text;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: WatchableStringSO
  class WatchableStringSO;
  // Forward declaring type: GorillaFriendCollider
  class GorillaFriendCollider;
  // Forward declaring type: ModeSelectButton
  class ModeSelectButton;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Stack`1<T>
  template<typename T>
  class Stack_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: PlayFab::CloudScriptModels
namespace PlayFab::CloudScriptModels {
  // Forward declaring type: ExecuteFunctionResult
  class ExecuteFunctionResult;
}
// Forward declaring namespace: PlayFab
namespace PlayFab {
  // Forward declaring type: PlayFabError
  class PlayFabError;
}
// Forward declaring namespace: PlayFab::ClientModels
namespace PlayFab::ClientModels {
  // Forward declaring type: GetTimeResult
  class GetTimeResult;
}
// Forward declaring namespace: Photon::Realtime
namespace Photon::Realtime {
  // Forward declaring type: FriendInfo
  class FriendInfo;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: GorillaNetworking
namespace GorillaNetworking {
  // Forward declaring type: GorillaComputer
  class GorillaComputer;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GorillaNetworking::GorillaComputer);
DEFINE_IL2CPP_ARG_TYPE(::GorillaNetworking::GorillaComputer*, "GorillaNetworking", "GorillaComputer");
// Type namespace: GorillaNetworking
namespace GorillaNetworking {
  // Size: 0x2B0
  #pragma pack(push, 1)
  // Autogenerated type: GorillaNetworking.GorillaComputer
  // [TokenAttribute] Offset: FFFFFFFF
  class GorillaComputer : public ::UnityEngine::MonoBehaviour/*, public ::Photon::Realtime::IMatchmakingCallbacks*/ {
    public:
    // Nested type: ::GorillaNetworking::GorillaComputer::ComputerState
    struct ComputerState;
    // Nested type: ::GorillaNetworking::GorillaComputer::NameCheckResult
    struct NameCheckResult;
    // Nested type: ::GorillaNetworking::GorillaComputer::StateOrderItem
    class StateOrderItem;
    // Nested type: ::GorillaNetworking::GorillaComputer::$$LoadingScreen$g__LoadingScreenLocal|150_0$d
    class $$LoadingScreen$g__LoadingScreenLocal|150_0$d;
    // Nested type: ::GorillaNetworking::GorillaComputer::$$Start$g__Start_Local|98_0$d
    class $$Start$g__Start_Local|98_0$d;
    // Nested type: ::GorillaNetworking::GorillaComputer::$$c
    class $$c;
    // Nested type: ::GorillaNetworking::GorillaComputer::$$c__DisplayClass124_0
    class $$c__DisplayClass124_0;
    // Nested type: ::GorillaNetworking::GorillaComputer::$$c__DisplayClass183_0
    class $$c__DisplayClass183_0;
    // Nested type: ::GorillaNetworking::GorillaComputer::$DisconnectAfterDelay$d__138
    struct $DisconnectAfterDelay$d__138;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: GorillaNetworking.GorillaComputer/ComputerState
    // [TokenAttribute] Offset: FFFFFFFF
    struct ComputerState/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: ComputerState
      constexpr ComputerState(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public GorillaNetworking.GorillaComputer/ComputerState Startup
      static constexpr const int Startup = 0;
      // Get static field: static public GorillaNetworking.GorillaComputer/ComputerState Startup
      static ::GorillaNetworking::GorillaComputer::ComputerState _get_Startup();
      // Set static field: static public GorillaNetworking.GorillaComputer/ComputerState Startup
      static void _set_Startup(::GorillaNetworking::GorillaComputer::ComputerState value);
      // static field const value: static public GorillaNetworking.GorillaComputer/ComputerState Color
      static constexpr const int Color = 1;
      // Get static field: static public GorillaNetworking.GorillaComputer/ComputerState Color
      static ::GorillaNetworking::GorillaComputer::ComputerState _get_Color();
      // Set static field: static public GorillaNetworking.GorillaComputer/ComputerState Color
      static void _set_Color(::GorillaNetworking::GorillaComputer::ComputerState value);
      // static field const value: static public GorillaNetworking.GorillaComputer/ComputerState Name
      static constexpr const int Name = 2;
      // Get static field: static public GorillaNetworking.GorillaComputer/ComputerState Name
      static ::GorillaNetworking::GorillaComputer::ComputerState _get_Name();
      // Set static field: static public GorillaNetworking.GorillaComputer/ComputerState Name
      static void _set_Name(::GorillaNetworking::GorillaComputer::ComputerState value);
      // static field const value: static public GorillaNetworking.GorillaComputer/ComputerState Turn
      static constexpr const int Turn = 3;
      // Get static field: static public GorillaNetworking.GorillaComputer/ComputerState Turn
      static ::GorillaNetworking::GorillaComputer::ComputerState _get_Turn();
      // Set static field: static public GorillaNetworking.GorillaComputer/ComputerState Turn
      static void _set_Turn(::GorillaNetworking::GorillaComputer::ComputerState value);
      // static field const value: static public GorillaNetworking.GorillaComputer/ComputerState Mic
      static constexpr const int Mic = 4;
      // Get static field: static public GorillaNetworking.GorillaComputer/ComputerState Mic
      static ::GorillaNetworking::GorillaComputer::ComputerState _get_Mic();
      // Set static field: static public GorillaNetworking.GorillaComputer/ComputerState Mic
      static void _set_Mic(::GorillaNetworking::GorillaComputer::ComputerState value);
      // static field const value: static public GorillaNetworking.GorillaComputer/ComputerState Room
      static constexpr const int Room = 5;
      // Get static field: static public GorillaNetworking.GorillaComputer/ComputerState Room
      static ::GorillaNetworking::GorillaComputer::ComputerState _get_Room();
      // Set static field: static public GorillaNetworking.GorillaComputer/ComputerState Room
      static void _set_Room(::GorillaNetworking::GorillaComputer::ComputerState value);
      // static field const value: static public GorillaNetworking.GorillaComputer/ComputerState Queue
      static constexpr const int Queue = 6;
      // Get static field: static public GorillaNetworking.GorillaComputer/ComputerState Queue
      static ::GorillaNetworking::GorillaComputer::ComputerState _get_Queue();
      // Set static field: static public GorillaNetworking.GorillaComputer/ComputerState Queue
      static void _set_Queue(::GorillaNetworking::GorillaComputer::ComputerState value);
      // static field const value: static public GorillaNetworking.GorillaComputer/ComputerState Group
      static constexpr const int Group = 7;
      // Get static field: static public GorillaNetworking.GorillaComputer/ComputerState Group
      static ::GorillaNetworking::GorillaComputer::ComputerState _get_Group();
      // Set static field: static public GorillaNetworking.GorillaComputer/ComputerState Group
      static void _set_Group(::GorillaNetworking::GorillaComputer::ComputerState value);
      // static field const value: static public GorillaNetworking.GorillaComputer/ComputerState Voice
      static constexpr const int Voice = 8;
      // Get static field: static public GorillaNetworking.GorillaComputer/ComputerState Voice
      static ::GorillaNetworking::GorillaComputer::ComputerState _get_Voice();
      // Set static field: static public GorillaNetworking.GorillaComputer/ComputerState Voice
      static void _set_Voice(::GorillaNetworking::GorillaComputer::ComputerState value);
      // static field const value: static public GorillaNetworking.GorillaComputer/ComputerState AutoMute
      static constexpr const int AutoMute = 9;
      // Get static field: static public GorillaNetworking.GorillaComputer/ComputerState AutoMute
      static ::GorillaNetworking::GorillaComputer::ComputerState _get_AutoMute();
      // Set static field: static public GorillaNetworking.GorillaComputer/ComputerState AutoMute
      static void _set_AutoMute(::GorillaNetworking::GorillaComputer::ComputerState value);
      // static field const value: static public GorillaNetworking.GorillaComputer/ComputerState Credits
      static constexpr const int Credits = 10;
      // Get static field: static public GorillaNetworking.GorillaComputer/ComputerState Credits
      static ::GorillaNetworking::GorillaComputer::ComputerState _get_Credits();
      // Set static field: static public GorillaNetworking.GorillaComputer/ComputerState Credits
      static void _set_Credits(::GorillaNetworking::GorillaComputer::ComputerState value);
      // static field const value: static public GorillaNetworking.GorillaComputer/ComputerState Visuals
      static constexpr const int Visuals = 11;
      // Get static field: static public GorillaNetworking.GorillaComputer/ComputerState Visuals
      static ::GorillaNetworking::GorillaComputer::ComputerState _get_Visuals();
      // Set static field: static public GorillaNetworking.GorillaComputer/ComputerState Visuals
      static void _set_Visuals(::GorillaNetworking::GorillaComputer::ComputerState value);
      // static field const value: static public GorillaNetworking.GorillaComputer/ComputerState Time
      static constexpr const int Time = 12;
      // Get static field: static public GorillaNetworking.GorillaComputer/ComputerState Time
      static ::GorillaNetworking::GorillaComputer::ComputerState _get_Time();
      // Set static field: static public GorillaNetworking.GorillaComputer/ComputerState Time
      static void _set_Time(::GorillaNetworking::GorillaComputer::ComputerState value);
      // static field const value: static public GorillaNetworking.GorillaComputer/ComputerState NameWarning
      static constexpr const int NameWarning = 13;
      // Get static field: static public GorillaNetworking.GorillaComputer/ComputerState NameWarning
      static ::GorillaNetworking::GorillaComputer::ComputerState _get_NameWarning();
      // Set static field: static public GorillaNetworking.GorillaComputer/ComputerState NameWarning
      static void _set_NameWarning(::GorillaNetworking::GorillaComputer::ComputerState value);
      // static field const value: static public GorillaNetworking.GorillaComputer/ComputerState Loading
      static constexpr const int Loading = 14;
      // Get static field: static public GorillaNetworking.GorillaComputer/ComputerState Loading
      static ::GorillaNetworking::GorillaComputer::ComputerState _get_Loading();
      // Set static field: static public GorillaNetworking.GorillaComputer/ComputerState Loading
      static void _set_Loading(::GorillaNetworking::GorillaComputer::ComputerState value);
      // static field const value: static public GorillaNetworking.GorillaComputer/ComputerState Support
      static constexpr const int Support = 15;
      // Get static field: static public GorillaNetworking.GorillaComputer/ComputerState Support
      static ::GorillaNetworking::GorillaComputer::ComputerState _get_Support();
      // Set static field: static public GorillaNetworking.GorillaComputer/ComputerState Support
      static void _set_Support(::GorillaNetworking::GorillaComputer::ComputerState value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // GorillaNetworking.GorillaComputer/ComputerState
    #pragma pack(pop)
    static check_size<sizeof(GorillaComputer::ComputerState), 0 + sizeof(int)> __GorillaNetworking_GorillaComputer_ComputerStateSizeCheck;
    static_assert(sizeof(GorillaComputer::ComputerState) == 0x4);
    public:
    // public System.Boolean tryGetTimeAgain
    // Size: 0x1
    // Offset: 0x20
    bool tryGetTimeAgain;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: tryGetTimeAgain and: unpressedMaterial
    char __padding0[0x7] = {};
    // public UnityEngine.Material unpressedMaterial
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::Material* unpressedMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // public UnityEngine.Material pressedMaterial
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Material* pressedMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // public System.String currentTextField
    // Size: 0x8
    // Offset: 0x38
    ::StringW currentTextField;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Single buttonFadeTime
    // Size: 0x4
    // Offset: 0x40
    float buttonFadeTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: buttonFadeTime and: offlineTextInitialString
    char __padding4[0x4] = {};
    // public System.String offlineTextInitialString
    // Size: 0x8
    // Offset: 0x48
    ::StringW offlineTextInitialString;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public GorillaNetworking.GorillaText screenText
    // Size: 0x8
    // Offset: 0x50
    ::GorillaNetworking::GorillaText* screenText;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::GorillaText*) == 0x8);
    // public GorillaNetworking.GorillaText functionSelectText
    // Size: 0x8
    // Offset: 0x58
    ::GorillaNetworking::GorillaText* functionSelectText;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::GorillaText*) == 0x8);
    // public GorillaNetworking.GorillaText wallScreenText
    // Size: 0x8
    // Offset: 0x60
    ::GorillaNetworking::GorillaText* wallScreenText;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::GorillaText*) == 0x8);
    // public UnityEngine.UI.Text offlineVRRigNametagText
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::UI::Text* offlineVRRigNametagText;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // public System.String versionMismatch
    // Size: 0x8
    // Offset: 0x70
    ::StringW versionMismatch;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String unableToConnect
    // Size: 0x8
    // Offset: 0x78
    ::StringW unableToConnect;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public UnityEngine.Material wrongVersionMaterial
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::Material* wrongVersionMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // public UnityEngine.MeshRenderer wallScreenRenderer
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::MeshRenderer* wallScreenRenderer;
    // Field size check
    static_assert(sizeof(::UnityEngine::MeshRenderer*) == 0x8);
    // public UnityEngine.MeshRenderer computerScreenRenderer
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::MeshRenderer* computerScreenRenderer;
    // Field size check
    static_assert(sizeof(::UnityEngine::MeshRenderer*) == 0x8);
    // public System.Int64 startupMillis
    // Size: 0x8
    // Offset: 0x98
    int64_t startupMillis;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // public System.DateTime startupTime
    // Size: 0x8
    // Offset: 0xA0
    ::System::DateTime startupTime;
    // Field size check
    static_assert(sizeof(::System::DateTime) == 0x8);
    // public WatchableStringSO currentGameMode
    // Size: 0x8
    // Offset: 0xA8
    ::GlobalNamespace::WatchableStringSO* currentGameMode;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::WatchableStringSO*) == 0x8);
    // public WatchableStringSO currentGameModeText
    // Size: 0x8
    // Offset: 0xB0
    ::GlobalNamespace::WatchableStringSO* currentGameModeText;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::WatchableStringSO*) == 0x8);
    // public System.Int32 includeUpdatedServerSynchTest
    // Size: 0x4
    // Offset: 0xB8
    int includeUpdatedServerSynchTest;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: includeUpdatedServerSynchTest and: networkController
    char __padding19[0x4] = {};
    // public GorillaNetworking.PhotonNetworkController networkController
    // Size: 0x8
    // Offset: 0xC0
    ::GorillaNetworking::PhotonNetworkController* networkController;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::PhotonNetworkController*) == 0x8);
    // public System.Single updateCooldown
    // Size: 0x4
    // Offset: 0xC8
    float updateCooldown;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single lastUpdateTime
    // Size: 0x4
    // Offset: 0xCC
    float lastUpdateTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean isConnectedToMaster
    // Size: 0x1
    // Offset: 0xD0
    bool isConnectedToMaster;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean internetFailure
    // Size: 0x1
    // Offset: 0xD1
    bool internetFailure;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: internetFailure and: allowedMapsToJoin
    char __padding24[0x6] = {};
    // public System.String[] allowedMapsToJoin
    // Size: 0x8
    // Offset: 0xD8
    ::ArrayW<::StringW> allowedMapsToJoin;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // public System.Boolean stateUpdated
    // Size: 0x1
    // Offset: 0xE0
    bool stateUpdated;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean screenChanged
    // Size: 0x1
    // Offset: 0xE1
    bool screenChanged;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean initialized
    // Size: 0x1
    // Offset: 0xE2
    bool initialized;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: initialized and: OrderList
    char __padding28[0x5] = {};
    // public System.Collections.Generic.List`1<GorillaNetworking.GorillaComputer/StateOrderItem> OrderList
    // Size: 0x8
    // Offset: 0xE8
    ::System::Collections::Generic::List_1<::GorillaNetworking::GorillaComputer::StateOrderItem*>* OrderList;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GorillaNetworking::GorillaComputer::StateOrderItem*>*) == 0x8);
    // public System.String Pointer
    // Size: 0x8
    // Offset: 0xF0
    ::StringW Pointer;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Int32 highestCharacterCount
    // Size: 0x4
    // Offset: 0xF8
    int highestCharacterCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: highestCharacterCount and: FunctionNames
    char __padding31[0x4] = {};
    // public System.Collections.Generic.List`1<System.String> FunctionNames
    // Size: 0x8
    // Offset: 0x100
    ::System::Collections::Generic::List_1<::StringW>* FunctionNames;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::StringW>*) == 0x8);
    // public System.Int32 FunctionsCount
    // Size: 0x4
    // Offset: 0x108
    int FunctionsCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: FunctionsCount and: roomToJoin
    char __padding33[0x4] = {};
    // public System.String roomToJoin
    // Size: 0x8
    // Offset: 0x110
    ::StringW roomToJoin;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Boolean roomFull
    // Size: 0x1
    // Offset: 0x118
    bool roomFull;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean roomNotAllowed
    // Size: 0x1
    // Offset: 0x119
    bool roomNotAllowed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: roomNotAllowed and: pttType
    char __padding36[0x6] = {};
    // public System.String pttType
    // Size: 0x8
    // Offset: 0x120
    ::StringW pttType;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String autoMuteType
    // Size: 0x8
    // Offset: 0x128
    ::StringW autoMuteType;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String currentQueue
    // Size: 0x8
    // Offset: 0x130
    ::StringW currentQueue;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Boolean allowedInCompetitive
    // Size: 0x1
    // Offset: 0x138
    bool allowedInCompetitive;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: allowedInCompetitive and: groupMapJoin
    char __padding40[0x7] = {};
    // public System.String groupMapJoin
    // Size: 0x8
    // Offset: 0x140
    ::StringW groupMapJoin;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Int32 groupMapJoinIndex
    // Size: 0x4
    // Offset: 0x148
    int groupMapJoinIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: groupMapJoinIndex and: friendJoinCollider
    char __padding42[0x4] = {};
    // public GorillaFriendCollider friendJoinCollider
    // Size: 0x8
    // Offset: 0x150
    ::GlobalNamespace::GorillaFriendCollider* friendJoinCollider;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::GorillaFriendCollider*) == 0x8);
    // public GorillaNetworking.GorillaNetworkJoinTrigger caveMapTrigger
    // Size: 0x8
    // Offset: 0x158
    ::GorillaNetworking::GorillaNetworkJoinTrigger* caveMapTrigger;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::GorillaNetworkJoinTrigger*) == 0x8);
    // public GorillaNetworking.GorillaNetworkJoinTrigger forestMapTrigger
    // Size: 0x8
    // Offset: 0x160
    ::GorillaNetworking::GorillaNetworkJoinTrigger* forestMapTrigger;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::GorillaNetworkJoinTrigger*) == 0x8);
    // public GorillaNetworking.GorillaNetworkJoinTrigger canyonMapTrigger
    // Size: 0x8
    // Offset: 0x168
    ::GorillaNetworking::GorillaNetworkJoinTrigger* canyonMapTrigger;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::GorillaNetworkJoinTrigger*) == 0x8);
    // public GorillaNetworking.GorillaNetworkJoinTrigger cityMapTrigger
    // Size: 0x8
    // Offset: 0x170
    ::GorillaNetworking::GorillaNetworkJoinTrigger* cityMapTrigger;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::GorillaNetworkJoinTrigger*) == 0x8);
    // public GorillaNetworking.GorillaNetworkJoinTrigger mountainMapTrigger
    // Size: 0x8
    // Offset: 0x178
    ::GorillaNetworking::GorillaNetworkJoinTrigger* mountainMapTrigger;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::GorillaNetworkJoinTrigger*) == 0x8);
    // public GorillaNetworking.GorillaNetworkJoinTrigger skyjungleMapTrigger
    // Size: 0x8
    // Offset: 0x180
    ::GorillaNetworking::GorillaNetworkJoinTrigger* skyjungleMapTrigger;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::GorillaNetworkJoinTrigger*) == 0x8);
    // public GorillaNetworking.GorillaNetworkJoinTrigger basementMapTrigger
    // Size: 0x8
    // Offset: 0x188
    ::GorillaNetworking::GorillaNetworkJoinTrigger* basementMapTrigger;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::GorillaNetworkJoinTrigger*) == 0x8);
    // public GorillaNetworking.GorillaNetworkJoinTrigger beachMapTrigger
    // Size: 0x8
    // Offset: 0x190
    ::GorillaNetworking::GorillaNetworkJoinTrigger* beachMapTrigger;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::GorillaNetworkJoinTrigger*) == 0x8);
    // public GorillaNetworking.GorillaNetworkJoinTrigger rotatingMapTrigger
    // Size: 0x8
    // Offset: 0x198
    ::GorillaNetworking::GorillaNetworkJoinTrigger* rotatingMapTrigger;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::GorillaNetworkJoinTrigger*) == 0x8);
    // public GorillaNetworking.GorillaNetworkJoinTrigger metroMapTrigger
    // Size: 0x8
    // Offset: 0x1A0
    ::GorillaNetworking::GorillaNetworkJoinTrigger* metroMapTrigger;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::GorillaNetworkJoinTrigger*) == 0x8);
    // public System.String voiceChatOn
    // Size: 0x8
    // Offset: 0x1A8
    ::StringW voiceChatOn;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public ModeSelectButton[] modeSelectButtons
    // Size: 0x8
    // Offset: 0x1B0
    ::ArrayW<::GlobalNamespace::ModeSelectButton*> modeSelectButtons;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::ModeSelectButton*>) == 0x8);
    // public System.String version
    // Size: 0x8
    // Offset: 0x1B8
    ::StringW version;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String buildDate
    // Size: 0x8
    // Offset: 0x1C0
    ::StringW buildDate;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String buildCode
    // Size: 0x8
    // Offset: 0x1C8
    ::StringW buildCode;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Boolean disableParticles
    // Size: 0x1
    // Offset: 0x1D0
    bool disableParticles;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: disableParticles and: instrumentVolume
    char __padding59[0x3] = {};
    // public System.Single instrumentVolume
    // Size: 0x4
    // Offset: 0x1D4
    float instrumentVolume;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public GorillaNetworking.CreditsView creditsView
    // Size: 0x8
    // Offset: 0x1D8
    ::GorillaNetworking::CreditsView* creditsView;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::CreditsView*) == 0x8);
    // public System.Boolean leftHanded
    // Size: 0x1
    // Offset: 0x1E0
    bool leftHanded;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: leftHanded and: savedName
    char __padding62[0x7] = {};
    // public System.String savedName
    // Size: 0x8
    // Offset: 0x1E8
    ::StringW savedName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String currentName
    // Size: 0x8
    // Offset: 0x1F0
    ::StringW currentName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public UnityEngine.TextAsset exactOneWeekFile
    // Size: 0x8
    // Offset: 0x1F8
    ::UnityEngine::TextAsset* exactOneWeekFile;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextAsset*) == 0x8);
    // public UnityEngine.TextAsset anywhereOneWeekFile
    // Size: 0x8
    // Offset: 0x200
    ::UnityEngine::TextAsset* anywhereOneWeekFile;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextAsset*) == 0x8);
    // public UnityEngine.TextAsset anywhereTwoWeekFile
    // Size: 0x8
    // Offset: 0x208
    ::UnityEngine::TextAsset* anywhereTwoWeekFile;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextAsset*) == 0x8);
    // private System.Collections.Generic.Stack`1<GorillaNetworking.GorillaComputer/ComputerState> stateStack
    // Size: 0x8
    // Offset: 0x210
    ::System::Collections::Generic::Stack_1<::GorillaNetworking::GorillaComputer::ComputerState>* stateStack;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Stack_1<::GorillaNetworking::GorillaComputer::ComputerState>*) == 0x8);
    // private GorillaNetworking.GorillaComputer/ComputerState currentComputerState
    // Size: 0x4
    // Offset: 0x218
    ::GorillaNetworking::GorillaComputer::ComputerState currentComputerState;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::GorillaComputer::ComputerState) == 0x4);
    // private GorillaNetworking.GorillaComputer/ComputerState previousComputerState
    // Size: 0x4
    // Offset: 0x21C
    ::GorillaNetworking::GorillaComputer::ComputerState previousComputerState;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::GorillaComputer::ComputerState) == 0x4);
    // private System.Int32 currentStateIndex
    // Size: 0x4
    // Offset: 0x220
    int currentStateIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 usersBanned
    // Size: 0x4
    // Offset: 0x224
    int usersBanned;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single redValue
    // Size: 0x4
    // Offset: 0x228
    float redValue;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: redValue and: redText
    char __padding73[0x4] = {};
    // private System.String redText
    // Size: 0x8
    // Offset: 0x230
    ::StringW redText;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Single blueValue
    // Size: 0x4
    // Offset: 0x238
    float blueValue;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: blueValue and: blueText
    char __padding75[0x4] = {};
    // private System.String blueText
    // Size: 0x8
    // Offset: 0x240
    ::StringW blueText;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Single greenValue
    // Size: 0x4
    // Offset: 0x248
    float greenValue;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: greenValue and: greenText
    char __padding77[0x4] = {};
    // private System.String greenText
    // Size: 0x8
    // Offset: 0x250
    ::StringW greenText;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Int32 colorCursorLine
    // Size: 0x4
    // Offset: 0x258
    int colorCursorLine;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 turnValue
    // Size: 0x4
    // Offset: 0x25C
    int turnValue;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.String turnType
    // Size: 0x8
    // Offset: 0x260
    ::StringW turnType;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private UnityEngine.XR.Interaction.Toolkit.GorillaSnapTurn gorillaTurn
    // Size: 0x8
    // Offset: 0x268
    ::UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn* gorillaTurn;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::GorillaSnapTurn*) == 0x8);
    // private System.String warningConfirmationInputString
    // Size: 0x8
    // Offset: 0x270
    ::StringW warningConfirmationInputString;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean displaySupport
    // Size: 0x1
    // Offset: 0x278
    bool displaySupport;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: displaySupport and: exactOneWeek
    char __padding84[0x7] = {};
    // private System.String[] exactOneWeek
    // Size: 0x8
    // Offset: 0x280
    ::ArrayW<::StringW> exactOneWeek;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // private System.String[] anywhereOneWeek
    // Size: 0x8
    // Offset: 0x288
    ::ArrayW<::StringW> anywhereOneWeek;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // private System.String[] anywhereTwoWeek
    // Size: 0x8
    // Offset: 0x290
    ::ArrayW<::StringW> anywhereTwoWeek;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // private UnityEngine.WaitForSeconds waitOneSecond
    // Size: 0x8
    // Offset: 0x298
    ::UnityEngine::WaitForSeconds* waitOneSecond;
    // Field size check
    static_assert(sizeof(::UnityEngine::WaitForSeconds*) == 0x8);
    // private UnityEngine.Coroutine LoadingRoutine
    // Size: 0x8
    // Offset: 0x2A0
    ::UnityEngine::Coroutine* LoadingRoutine;
    // Field size check
    static_assert(sizeof(::UnityEngine::Coroutine*) == 0x8);
    // public System.Action OnServerTimeUpdated
    // Size: 0x8
    // Offset: 0x2A8
    ::System::Action* OnServerTimeUpdated;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::Photon::Realtime::IMatchmakingCallbacks
    operator ::Photon::Realtime::IMatchmakingCallbacks() noexcept {
      return *reinterpret_cast<::Photon::Realtime::IMatchmakingCallbacks*>(this);
    }
    // Get static field: static public GorillaNetworking.GorillaComputer instance
    static ::GorillaNetworking::GorillaComputer* _get_instance();
    // Set static field: static public GorillaNetworking.GorillaComputer instance
    static void _set_instance(::GorillaNetworking::GorillaComputer* value);
    // Get static field: static public System.Boolean hasInstance
    static bool _get_hasInstance();
    // Set static field: static public System.Boolean hasInstance
    static void _set_hasInstance(bool value);
