// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: GorillaNetworking.JoinType
#include "GorillaNetworking/JoinType.hpp"
// Including type: GTZone
#include "GlobalNamespace/GTZone.hpp"
// Including type: System.Nullable`1
#include "System/Nullable_1.hpp"
// Including type: System.DateTime
#include "System/DateTime.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GorillaNetworking
namespace GorillaNetworking {
  // Forward declaring type: PlayFabAuthenticator
  class PlayFabAuthenticator;
  // Forward declaring type: GorillaNetworkJoinTrigger
  class GorillaNetworkJoinTrigger;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: SkinnedMeshRenderer
  class SkinnedMeshRenderer;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: GorillaGeoHideShowTrigger
  class GorillaGeoHideShowTrigger;
}
// Forward declaring namespace: Fusion
namespace Fusion {
  // Forward declaring type: NetworkObject
  class NetworkObject;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Forward declaring namespace: System::Threading::Tasks
namespace System::Threading::Tasks {
  // Forward declaring type: Task
  class Task;
}
// Completed forward declares
// Type namespace: GorillaNetworking
namespace GorillaNetworking {
  // Forward declaring type: PhotonNetworkController
  class PhotonNetworkController;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GorillaNetworking::PhotonNetworkController);
DEFINE_IL2CPP_ARG_TYPE(::GorillaNetworking::PhotonNetworkController*, "GorillaNetworking", "PhotonNetworkController");
// Type namespace: GorillaNetworking
namespace GorillaNetworking {
  // WARNING Size may be invalid!
  // Autogenerated type: GorillaNetworking.PhotonNetworkController
  // [TokenAttribute] Offset: FFFFFFFF
  class PhotonNetworkController : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::GorillaNetworking::PhotonNetworkController::$AttemptToJoinPublicRoomAsync$d__65
    struct $AttemptToJoinPublicRoomAsync$d__65;
    // Nested type: ::GorillaNetworking::PhotonNetworkController::$AttemptToJoinSpecificRoomAsync$d__68
    struct $AttemptToJoinSpecificRoomAsync$d__68;
    // Nested type: ::GorillaNetworking::PhotonNetworkController::$DisableOnStart$d__60
    class $DisableOnStart$d__60;
    // Nested type: ::GorillaNetworking::PhotonNetworkController::$SendPartyFollowCommands$d__66
    struct $SendPartyFollowCommands$d__66;
    public:
    // public System.Int32 incrementCounter
    // Size: 0x4
    // Offset: 0x20
    int incrementCounter;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public GorillaNetworking.PlayFabAuthenticator playFabAuthenticator
    // Size: 0x8
    // Offset: 0x28
    ::GorillaNetworking::PlayFabAuthenticator* playFabAuthenticator;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::PlayFabAuthenticator*) == 0x8);
    // public System.String[] serverRegions
    // Size: 0x8
    // Offset: 0x30
    ::ArrayW<::StringW> serverRegions;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // public System.Boolean isPrivate
    // Size: 0x1
    // Offset: 0x38
    bool isPrivate;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.String customRoomID
    // Size: 0x8
    // Offset: 0x40
    ::StringW customRoomID;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public UnityEngine.GameObject playerOffset
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::GameObject* playerOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.SkinnedMeshRenderer[] offlineVRRig
    // Size: 0x8
    // Offset: 0x50
    ::ArrayW<::UnityEngine::SkinnedMeshRenderer*> offlineVRRig;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::SkinnedMeshRenderer*>) == 0x8);
    // public System.Boolean attemptingToConnect
    // Size: 0x1
    // Offset: 0x58
    bool attemptingToConnect;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Int32 currentRegionIndex
    // Size: 0x4
    // Offset: 0x5C
    int currentRegionIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.String currentGameType
    // Size: 0x8
    // Offset: 0x60
    ::StringW currentGameType;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Boolean roomCosmeticsInitialized
    // Size: 0x1
    // Offset: 0x68
    bool roomCosmeticsInitialized;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public UnityEngine.GameObject photonVoiceObjectPrefab
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::GameObject* photonVoiceObjectPrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public System.Collections.Generic.Dictionary`2<System.String,System.Boolean> playerCosmeticsLookup
    // Size: 0x8
    // Offset: 0x78
    ::System::Collections::Generic::Dictionary_2<::StringW, bool>* playerCosmeticsLookup;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, bool>*) == 0x8);
    // private System.Boolean pastFirstConnection
    // Size: 0x1
    // Offset: 0x80
    bool pastFirstConnection;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Single lastHeadRightHandDistance
    // Size: 0x4
    // Offset: 0x84
    float lastHeadRightHandDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single lastHeadLeftHandDistance
    // Size: 0x4
    // Offset: 0x88
    float lastHeadLeftHandDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single pauseTime
    // Size: 0x4
    // Offset: 0x8C
    float pauseTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single disconnectTime
    // Size: 0x4
    // Offset: 0x90
    float disconnectTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean disableAFKKick
    // Size: 0x1
    // Offset: 0x94
    bool disableAFKKick;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Single headRightHandDistance
    // Size: 0x4
    // Offset: 0x98
    float headRightHandDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single headLeftHandDistance
    // Size: 0x4
    // Offset: 0x9C
    float headLeftHandDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Quaternion headQuat
    // Size: 0x10
    // Offset: 0xA0
    ::UnityEngine::Quaternion headQuat;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.Quaternion lastHeadQuat
    // Size: 0x10
    // Offset: 0xB0
    ::UnityEngine::Quaternion lastHeadQuat;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // public UnityEngine.GameObject[] disableOnStartup
    // Size: 0x8
    // Offset: 0xC0
    ::ArrayW<::UnityEngine::GameObject*> disableOnStartup;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // public UnityEngine.GameObject[] enableOnStartup
    // Size: 0x8
    // Offset: 0xC8
    ::ArrayW<::UnityEngine::GameObject*> enableOnStartup;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // public System.Boolean updatedName
    // Size: 0x1
    // Offset: 0xD0
    bool updatedName;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Int32[] playersInRegion
    // Size: 0x8
    // Offset: 0xD8
    ::ArrayW<int> playersInRegion;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // private System.Int32[] pingInRegion
    // Size: 0x8
    // Offset: 0xE0
    ::ArrayW<int> pingInRegion;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // public System.Collections.Generic.List`1<System.String> friendIDList
    // Size: 0x8
    // Offset: 0xE8
    ::System::Collections::Generic::List_1<::StringW>* friendIDList;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::StringW>*) == 0x8);
    // private GorillaNetworking.JoinType currentJoinType
    // Size: 0x4
    // Offset: 0xF0
    ::GorillaNetworking::JoinType currentJoinType;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::JoinType) == 0x4);
    // private System.String friendToFollow
    // Size: 0x8
    // Offset: 0xF8
    ::StringW friendToFollow;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String keyToFollow
    // Size: 0x8
    // Offset: 0x100
    ::StringW keyToFollow;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String shuffler
    // Size: 0x8
    // Offset: 0x108
    ::StringW shuffler;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String keyStr
    // Size: 0x8
    // Offset: 0x110
    ::StringW keyStr;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String platformTag
    // Size: 0x8
    // Offset: 0x118
    ::StringW platformTag;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String startLevel
    // Size: 0x8
    // Offset: 0x120
    ::StringW startLevel;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private GTZone startZone
    // Size: 0x4
    // Offset: 0x128
    ::GlobalNamespace::GTZone startZone;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::GTZone) == 0x4);
    // private GorillaGeoHideShowTrigger startGeoTrigger
    // Size: 0x8
    // Offset: 0x130
    ::GlobalNamespace::GorillaGeoHideShowTrigger* startGeoTrigger;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::GorillaGeoHideShowTrigger*) == 0x8);
    // public GorillaNetworking.GorillaNetworkJoinTrigger privateTrigger
    // Size: 0x8
    // Offset: 0x138
    ::GorillaNetworking::GorillaNetworkJoinTrigger* privateTrigger;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::GorillaNetworkJoinTrigger*) == 0x8);
    // System.String initialGameMode
    // Size: 0x8
    // Offset: 0x140
    ::StringW initialGameMode;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public GorillaNetworking.GorillaNetworkJoinTrigger currentJoinTrigger
    // Size: 0x8
    // Offset: 0x148
    ::GorillaNetworking::GorillaNetworkJoinTrigger* currentJoinTrigger;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::GorillaNetworkJoinTrigger*) == 0x8);
    // public System.String autoJoinRoom
    // Size: 0x8
    // Offset: 0x150
    ::StringW autoJoinRoom;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean deferredJoin
    // Size: 0x1
    // Offset: 0x158
    bool deferredJoin;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Single partyJoinDeferredUntilTimestamp
    // Size: 0x4
    // Offset: 0x15C
    float partyJoinDeferredUntilTimestamp;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Nullable`1<System.DateTime> timeWhenApplicationPaused
    // Size: 0xFFFFFFFF
    // Offset: 0x160
    ::System::Nullable_1<::System::DateTime> timeWhenApplicationPaused;
    // private Fusion.NetworkObject testPlayerPrefab
    // Size: 0x8
    // Offset: 0x170
    ::Fusion::NetworkObject* testPlayerPrefab;
    // Field size check
    static_assert(sizeof(::Fusion::NetworkObject*) == 0x8);
    // private System.Collections.Generic.List`1<GorillaNetworking.GorillaNetworkJoinTrigger> allJoinTriggers
    // Size: 0x8
    // Offset: 0x178
    ::System::Collections::Generic::List_1<::GorillaNetworking::GorillaNetworkJoinTrigger*>* allJoinTriggers;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GorillaNetworking::GorillaNetworkJoinTrigger*>*) == 0x8);
    public:
    // Get static field: static public GorillaNetworking.PhotonNetworkController Instance
    static ::GorillaNetworking::PhotonNetworkController* _get_Instance();
    // Set static field: static public GorillaNetworking.PhotonNetworkController Instance
    static void _set_Instance(::GorillaNetworking::PhotonNetworkController* value);
    // Get instance field reference: public System.Int32 incrementCounter
    [[deprecated("Use field access instead!")]] int& dyn_incrementCounter();
    // Get instance field reference: public GorillaNetworking.PlayFabAuthenticator playFabAuthenticator
