// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: GorillaNetworking.PlayFabAuthenticator
#include "GorillaNetworking/PlayFabAuthenticator.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GorillaNetworking::PlayFabAuthenticator::PlayfabAuthResponseData);
DEFINE_IL2CPP_ARG_TYPE(::GorillaNetworking::PlayFabAuthenticator::PlayfabAuthResponseData*, "GorillaNetworking", "PlayFabAuthenticator/PlayfabAuthResponseData");
// Type namespace: GorillaNetworking
namespace GorillaNetworking {
  // Size: 0x38
  #pragma pack(push, 1)
  // Autogenerated type: GorillaNetworking.PlayFabAuthenticator/PlayfabAuthResponseData
  // [TokenAttribute] Offset: FFFFFFFF
  class PlayFabAuthenticator::PlayfabAuthResponseData : public ::Il2CppObject {
    public:
    public:
    // public System.String SessionTicket
    // Size: 0x8
    // Offset: 0x10
    ::StringW SessionTicket;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String EntityToken
    // Size: 0x8
    // Offset: 0x18
    ::StringW EntityToken;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String PlayFabId
    // Size: 0x8
    // Offset: 0x20
    ::StringW PlayFabId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String EntityId
    // Size: 0x8
    // Offset: 0x28
    ::StringW EntityId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String EntityType
    // Size: 0x8
    // Offset: 0x30
    ::StringW EntityType;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Get instance field reference: public System.String SessionTicket
    [[deprecated("Use field access instead!")]] ::StringW& dyn_SessionTicket();
    // Get instance field reference: public System.String EntityToken
    [[deprecated("Use field access instead!")]] ::StringW& dyn_EntityToken();
    // Get instance field reference: public System.String PlayFabId
    [[deprecated("Use field access instead!")]] ::StringW& dyn_PlayFabId();
    // Get instance field reference: public System.String EntityId
    [[deprecated("Use field access instead!")]] ::StringW& dyn_EntityId();
    // Get instance field reference: public System.String EntityType
    [[deprecated("Use field access instead!")]] ::StringW& dyn_EntityType();
    // public System.Void .ctor()
    // Offset: 0x285E1C0
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static PlayFabAuthenticator::PlayfabAuthResponseData* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::GorillaNetworking::PlayFabAuthenticator::PlayfabAuthResponseData::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<PlayFabAuthenticator::PlayfabAuthResponseData*, creationType>()));
    }
  }; // GorillaNetworking.PlayFabAuthenticator/PlayfabAuthResponseData
  #pragma pack(pop)
  static check_size<sizeof(PlayFabAuthenticator::PlayfabAuthResponseData), 48 + sizeof(::StringW)> __GorillaNetworking_PlayFabAuthenticator_PlayfabAuthResponseDataSizeCheck;
  static_assert(sizeof(PlayFabAuthenticator::PlayfabAuthResponseData) == 0x38);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: GorillaNetworking::PlayFabAuthenticator::PlayfabAuthResponseData::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
