// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: Oculus.Platform.AccountAgeCategory
#include "Oculus/Platform/AccountAgeCategory.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Text
  class Text;
}
// Forward declaring namespace: GorillaNetworking
namespace GorillaNetworking {
  // Forward declaring type: GorillaComputer
  class GorillaComputer;
  // Skipping declaration: SafetyType because it is already included!
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: String
  class String;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Forward declaring namespace: Oculus::Platform
namespace Oculus::Platform {
  // Forward declaring type: Message
  class Message;
}
// Forward declaring namespace: PlayFab::ClientModels
namespace PlayFab::ClientModels {
  // Forward declaring type: LoginResult
  class LoginResult;
  // Forward declaring type: GetPlayerProfileResult
  class GetPlayerProfileResult;
}
// Forward declaring namespace: PlayFab
namespace PlayFab {
  // Forward declaring type: PlayFabError
  class PlayFabError;
}
// Completed forward declares
// Type namespace: GorillaNetworking
namespace GorillaNetworking {
  // Forward declaring type: PlayFabAuthenticator
  class PlayFabAuthenticator;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GorillaNetworking::PlayFabAuthenticator);
DEFINE_IL2CPP_ARG_TYPE(::GorillaNetworking::PlayFabAuthenticator*, "GorillaNetworking", "PlayFabAuthenticator");
// Type namespace: GorillaNetworking
namespace GorillaNetworking {
  // Size: 0xD1
  #pragma pack(push, 1)
  // Autogenerated type: GorillaNetworking.PlayFabAuthenticator
  // [TokenAttribute] Offset: FFFFFFFF
  class PlayFabAuthenticator : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::GorillaNetworking::PlayFabAuthenticator::SafetyType
    struct SafetyType;
    // Nested type: ::GorillaNetworking::PlayFabAuthenticator::CachePlayFabIdRequest
    class CachePlayFabIdRequest;
    // Nested type: ::GorillaNetworking::PlayFabAuthenticator::PlayfabAuthRequestData
    class PlayfabAuthRequestData;
    // Nested type: ::GorillaNetworking::PlayFabAuthenticator::PlayfabAuthResponseData
    class PlayfabAuthResponseData;
    // Nested type: ::GorillaNetworking::PlayFabAuthenticator::BanInfo
    class BanInfo;
    // Nested type: ::GorillaNetworking::PlayFabAuthenticator::$$c
    class $$c;
    // Nested type: ::GorillaNetworking::PlayFabAuthenticator::$$c__DisplayClass65_0
    class $$c__DisplayClass65_0;
    // Nested type: ::GorillaNetworking::PlayFabAuthenticator::$CachePlayFabId$d__73
    class $CachePlayFabId$d__73;
    // Nested type: ::GorillaNetworking::PlayFabAuthenticator::$ComputerOnConnectedToMaster$d__60
    class $ComputerOnConnectedToMaster$d__60;
    // Nested type: ::GorillaNetworking::PlayFabAuthenticator::$DisplayGeneralFailureMessageOnGorillaComputerAfter1Frame$d__54
    class $DisplayGeneralFailureMessageOnGorillaComputerAfter1Frame$d__54;
    // Nested type: ::GorillaNetworking::PlayFabAuthenticator::$DoubleCheckEntitlement$d__45
    class $DoubleCheckEntitlement$d__45;
    // Nested type: ::GorillaNetworking::PlayFabAuthenticator::$PlayfabAuthenticate$d__71
    class $PlayfabAuthenticate$d__71;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: GorillaNetworking.PlayFabAuthenticator/SafetyType
    // [TokenAttribute] Offset: FFFFFFFF
    struct SafetyType/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: SafetyType
      constexpr SafetyType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public GorillaNetworking.PlayFabAuthenticator/SafetyType None
      static constexpr const int None = 0;
      // Get static field: static public GorillaNetworking.PlayFabAuthenticator/SafetyType None
      static ::GorillaNetworking::PlayFabAuthenticator::SafetyType _get_None();
      // Set static field: static public GorillaNetworking.PlayFabAuthenticator/SafetyType None
      static void _set_None(::GorillaNetworking::PlayFabAuthenticator::SafetyType value);
      // static field const value: static public GorillaNetworking.PlayFabAuthenticator/SafetyType Auto
      static constexpr const int Auto = 1;
      // Get static field: static public GorillaNetworking.PlayFabAuthenticator/SafetyType Auto
      static ::GorillaNetworking::PlayFabAuthenticator::SafetyType _get_Auto();
      // Set static field: static public GorillaNetworking.PlayFabAuthenticator/SafetyType Auto
      static void _set_Auto(::GorillaNetworking::PlayFabAuthenticator::SafetyType value);
      // static field const value: static public GorillaNetworking.PlayFabAuthenticator/SafetyType OptIn
      static constexpr const int OptIn = 2;
      // Get static field: static public GorillaNetworking.PlayFabAuthenticator/SafetyType OptIn
      static ::GorillaNetworking::PlayFabAuthenticator::SafetyType _get_OptIn();
      // Set static field: static public GorillaNetworking.PlayFabAuthenticator/SafetyType OptIn
      static void _set_OptIn(::GorillaNetworking::PlayFabAuthenticator::SafetyType value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // GorillaNetworking.PlayFabAuthenticator/SafetyType
    #pragma pack(pop)
    static check_size<sizeof(PlayFabAuthenticator::SafetyType), 0 + sizeof(int)> __GorillaNetworking_PlayFabAuthenticator_SafetyTypeSizeCheck;
    static_assert(sizeof(PlayFabAuthenticator::SafetyType) == 0x4);
    public:
    // public System.String _playFabPlayerIdCache
    // Size: 0x8
    // Offset: 0x20
    ::StringW playFabPlayerIdCache;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String _sessionTicket
    // Size: 0x8
    // Offset: 0x28
    ::StringW sessionTicket;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String _playFabId
    // Size: 0x8
    // Offset: 0x30
    ::StringW playFabId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String _displayName
    // Size: 0x8
    // Offset: 0x38
    ::StringW displayName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String _nonce
    // Size: 0x8
    // Offset: 0x40
    ::StringW nonce;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String _orgScopedId
    // Size: 0x8
    // Offset: 0x48
    ::StringW orgScopedId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String userID
    // Size: 0x8
    // Offset: 0x50
    ::StringW userID;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.UInt64 userIDLong
    // Size: 0x8
    // Offset: 0x58
    uint64_t userIDLong;
    // Field size check
    static_assert(sizeof(uint64_t) == 0x8);
    // private System.String userToken
    // Size: 0x8
    // Offset: 0x60
    ::StringW userToken;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String platform
    // Size: 0x8
    // Offset: 0x68
    ::StringW platform;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean isSafeAccount
    // Size: 0x1
    // Offset: 0x70
    bool isSafeAccount;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean doubleCheckEntitlement
    // Size: 0x1
    // Offset: 0x71
    bool doubleCheckEntitlement;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: doubleCheckEntitlement and: OnSafetyUpdate
    char __padding11[0x6] = {};
    // public System.Action`1<System.Boolean> OnSafetyUpdate
    // Size: 0x8
    // Offset: 0x78
    ::System::Action_1<bool>* OnSafetyUpdate;
    // Field size check
    static_assert(sizeof(::System::Action_1<bool>*) == 0x8);
    // private GorillaNetworking.PlayFabAuthenticator/SafetyType safetyType
    // Size: 0x4
    // Offset: 0x80
    ::GorillaNetworking::PlayFabAuthenticator::SafetyType safetyType;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::PlayFabAuthenticator::SafetyType) == 0x4);
    // public Oculus.Platform.AccountAgeCategory category
    // Size: 0x4
    // Offset: 0x84
    ::Oculus::Platform::AccountAgeCategory category;
    // Field size check
    static_assert(sizeof(::Oculus::Platform::AccountAgeCategory) == 0x4);
    // private System.Byte[] m_Ticket
    // Size: 0x8
    // Offset: 0x88
    ::ArrayW<uint8_t> m_Ticket;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // private System.UInt32 m_pcbTicket
    // Size: 0x4
    // Offset: 0x90
    uint m_pcbTicket;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // Padding between fields: m_pcbTicket and: debugText
    char __padding16[0x4] = {};
    // public UnityEngine.UI.Text debugText
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::UI::Text* debugText;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // public System.Boolean screenDebugMode
    // Size: 0x1
    // Offset: 0xA0
    bool screenDebugMode;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean loginFailed
    // Size: 0x1
    // Offset: 0xA1
    bool loginFailed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: loginFailed and: oculusID
    char __padding19[0x6] = {};
    // public System.String oculusID
    // Size: 0x8
    // Offset: 0xA8
    ::StringW oculusID;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public UnityEngine.GameObject emptyObject
    // Size: 0x8
    // Offset: 0xB0
    ::UnityEngine::GameObject* emptyObject;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Int32 playFabAuthRetryCount
    // Size: 0x4
    // Offset: 0xB8
    int playFabAuthRetryCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 playFabMaxRetries
    // Size: 0x4
    // Offset: 0xBC
    int playFabMaxRetries;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 playFabCacheRetryCount
    // Size: 0x4
    // Offset: 0xC0
    int playFabCacheRetryCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 playFabCacheMaxRetries
    // Size: 0x4
    // Offset: 0xC4
    int playFabCacheMaxRetries;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 maxLoginAttempts
    // Size: 0x4
    // Offset: 0xC8
    int maxLoginAttempts;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 currentLoginAttempts
    // Size: 0x4
    // Offset: 0xCC
    int currentLoginAttempts;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Boolean isModded
    // Size: 0x1
    // Offset: 0xD0
    bool isModded;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get static field: static public GorillaNetworking.PlayFabAuthenticator instance
    static ::GorillaNetworking::PlayFabAuthenticator* _get_instance();
    // Set static field: static public GorillaNetworking.PlayFabAuthenticator instance
    static void _set_instance(::GorillaNetworking::PlayFabAuthenticator* value);
    // static field const value: static public System.String Playfab_TitleId_Prod
    static constexpr const char* Playfab_TitleId_Prod = "63FDD";
    // Get static field: static public System.String Playfab_TitleId_Prod
    static ::StringW _get_Playfab_TitleId_Prod();
    // Set static field: static public System.String Playfab_TitleId_Prod
    static void _set_Playfab_TitleId_Prod(::StringW value);
    // static field const value: static public System.String Playfab_TitleId_Dev
    static constexpr const char* Playfab_TitleId_Dev = "195C0";
