// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.TextCore.Text.TextAsset
#include "UnityEngine/TextCore/Text/TextAsset.hpp"
// Including type: UnityEngine.TextCore.Text.AtlasPopulationMode
#include "UnityEngine/TextCore/Text/AtlasPopulationMode.hpp"
// Including type: UnityEngine.TextCore.FaceInfo
#include "UnityEngine/TextCore/FaceInfo.hpp"
// Including type: UnityEngine.TextCore.LowLevel.GlyphRenderMode
#include "UnityEngine/TextCore/LowLevel/GlyphRenderMode.hpp"
// Including type: UnityEngine.TextCore.GlyphRect
#include "UnityEngine/TextCore/GlyphRect.hpp"
// Including type: UnityEngine.TextCore.Text.FontAssetCreationEditorSettings
#include "UnityEngine/TextCore/Text/FontAssetCreationEditorSettings.hpp"
// Including type: UnityEngine.TextCore.Text.FontWeightPair
#include "UnityEngine/TextCore/Text/FontWeightPair.hpp"
// Including type: Unity.Profiling.ProfilerMarker
#include "Unity/Profiling/ProfilerMarker.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::TextCore::Text
namespace UnityEngine::TextCore::Text {
  // Forward declaring type: Character
  class Character;
  // Forward declaring type: FontFeatureTable
  class FontFeatureTable;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Font
  class Font;
  // Forward declaring type: Texture2D
  class Texture2D;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: HashSet`1<T>
  template<typename T>
  class HashSet_1;
}
// Forward declaring namespace: UnityEngine::TextCore
namespace UnityEngine::TextCore {
  // Forward declaring type: Glyph
  class Glyph;
}
// Forward declaring namespace: UnityEngine::TextCore::LowLevel
namespace UnityEngine::TextCore::LowLevel {
  // Forward declaring type: FontEngineError
  struct FontEngineError;
}
// Completed forward declares
// Type namespace: UnityEngine.TextCore.Text
namespace UnityEngine::TextCore::Text {
  // Forward declaring type: FontAsset
  class FontAsset;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::TextCore::Text::FontAsset);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::TextCore::Text::FontAsset*, "UnityEngine.TextCore.Text", "FontAsset");
// Type namespace: UnityEngine.TextCore.Text
namespace UnityEngine::TextCore::Text {
  // Size: 0x1F0
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.TextCore.Text.FontAsset
  // [TokenAttribute] Offset: FFFFFFFF
  // [ExcludeFromPresetAttribute] Offset: FFFFFFFF
  class FontAsset : public ::UnityEngine::TextCore::Text::TextAsset {
    public:
    // Writing base type padding for base size: 0x34 to desired offset: 0x38
    char ___base_padding[0x4] = {};
    // Nested type: ::UnityEngine::TextCore::Text::FontAsset::$$c
    class $$c;
    public:
    // System.String m_SourceFontFileGUID
    // Size: 0x8
    // Offset: 0x38
    ::StringW m_SourceFontFileGUID;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private UnityEngine.Font m_SourceFontFile
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::Font* m_SourceFontFile;
    // Field size check
    static_assert(sizeof(::UnityEngine::Font*) == 0x8);
    // private System.String m_SourceFontFilePath
    // Size: 0x8
    // Offset: 0x48
    ::StringW m_SourceFontFilePath;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private UnityEngine.TextCore.Text.AtlasPopulationMode m_AtlasPopulationMode
    // Size: 0x4
    // Offset: 0x50
    ::UnityEngine::TextCore::Text::AtlasPopulationMode m_AtlasPopulationMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextCore::Text::AtlasPopulationMode) == 0x4);
    // System.Boolean InternalDynamicOS
    // Size: 0x1
    // Offset: 0x54
    bool InternalDynamicOS;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: InternalDynamicOS and: m_FaceInfo
    char __padding4[0x3] = {};
    // UnityEngine.TextCore.FaceInfo m_FaceInfo
    // Size: 0x60
    // Offset: 0x58
    ::UnityEngine::TextCore::FaceInfo m_FaceInfo;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextCore::FaceInfo) == 0x60);
    // private System.Int32 m_FamilyNameHashCode
    // Size: 0x4
    // Offset: 0xB8
    int m_FamilyNameHashCode;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_StyleNameHashCode
    // Size: 0x4
    // Offset: 0xBC
    int m_StyleNameHashCode;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Collections.Generic.List`1<UnityEngine.TextCore.Glyph> m_GlyphTable
    // Size: 0x8
    // Offset: 0xC0
    ::System::Collections::Generic::List_1<::UnityEngine::TextCore::Glyph*>* m_GlyphTable;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::TextCore::Glyph*>*) == 0x8);
    // System.Collections.Generic.Dictionary`2<System.UInt32,UnityEngine.TextCore.Glyph> m_GlyphLookupDictionary
    // Size: 0x8
    // Offset: 0xC8
    ::System::Collections::Generic::Dictionary_2<uint, ::UnityEngine::TextCore::Glyph*>* m_GlyphLookupDictionary;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<uint, ::UnityEngine::TextCore::Glyph*>*) == 0x8);
    // System.Collections.Generic.List`1<UnityEngine.TextCore.Text.Character> m_CharacterTable
    // Size: 0x8
    // Offset: 0xD0
    ::System::Collections::Generic::List_1<::UnityEngine::TextCore::Text::Character*>* m_CharacterTable;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::TextCore::Text::Character*>*) == 0x8);
    // System.Collections.Generic.Dictionary`2<System.UInt32,UnityEngine.TextCore.Text.Character> m_CharacterLookupDictionary
    // Size: 0x8
    // Offset: 0xD8
    ::System::Collections::Generic::Dictionary_2<uint, ::UnityEngine::TextCore::Text::Character*>* m_CharacterLookupDictionary;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<uint, ::UnityEngine::TextCore::Text::Character*>*) == 0x8);
    // UnityEngine.Texture2D m_AtlasTexture
    // Size: 0x8
    // Offset: 0xE0
    ::UnityEngine::Texture2D* m_AtlasTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture2D*) == 0x8);
    // UnityEngine.Texture2D[] m_AtlasTextures
    // Size: 0x8
    // Offset: 0xE8
    ::ArrayW<::UnityEngine::Texture2D*> m_AtlasTextures;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Texture2D*>) == 0x8);
    // System.Int32 m_AtlasTextureIndex
    // Size: 0x4
    // Offset: 0xF0
    int m_AtlasTextureIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean m_IsMultiAtlasTexturesEnabled
    // Size: 0x1
    // Offset: 0xF4
    bool m_IsMultiAtlasTexturesEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_ClearDynamicDataOnBuild
    // Size: 0x1
    // Offset: 0xF5
    bool m_ClearDynamicDataOnBuild;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_ClearDynamicDataOnBuild and: m_AtlasWidth
    char __padding16[0x2] = {};
    // System.Int32 m_AtlasWidth
    // Size: 0x4
    // Offset: 0xF8
    int m_AtlasWidth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 m_AtlasHeight
    // Size: 0x4
    // Offset: 0xFC
    int m_AtlasHeight;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 m_AtlasPadding
    // Size: 0x4
    // Offset: 0x100
    int m_AtlasPadding;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // UnityEngine.TextCore.LowLevel.GlyphRenderMode m_AtlasRenderMode
    // Size: 0x4
    // Offset: 0x104
    ::UnityEngine::TextCore::LowLevel::GlyphRenderMode m_AtlasRenderMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextCore::LowLevel::GlyphRenderMode) == 0x4);
    // private System.Collections.Generic.List`1<UnityEngine.TextCore.GlyphRect> m_UsedGlyphRects
    // Size: 0x8
    // Offset: 0x108
    ::System::Collections::Generic::List_1<::UnityEngine::TextCore::GlyphRect>* m_UsedGlyphRects;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::TextCore::GlyphRect>*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.TextCore.GlyphRect> m_FreeGlyphRects
    // Size: 0x8
    // Offset: 0x110
    ::System::Collections::Generic::List_1<::UnityEngine::TextCore::GlyphRect>* m_FreeGlyphRects;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::TextCore::GlyphRect>*) == 0x8);
    // UnityEngine.TextCore.Text.FontFeatureTable m_FontFeatureTable
    // Size: 0x8
    // Offset: 0x118
    ::UnityEngine::TextCore::Text::FontFeatureTable* m_FontFeatureTable;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextCore::Text::FontFeatureTable*) == 0x8);
    // System.Collections.Generic.List`1<UnityEngine.TextCore.Text.FontAsset> m_FallbackFontAssetTable
    // Size: 0x8
    // Offset: 0x120
    ::System::Collections::Generic::List_1<::UnityEngine::TextCore::Text::FontAsset*>* m_FallbackFontAssetTable;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::TextCore::Text::FontAsset*>*) == 0x8);
    // UnityEngine.TextCore.Text.FontAssetCreationEditorSettings m_fontAssetCreationEditorSettings
    // Size: 0x55
    // Offset: 0x128
    ::UnityEngine::TextCore::Text::FontAssetCreationEditorSettings m_fontAssetCreationEditorSettings;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextCore::Text::FontAssetCreationEditorSettings) == 0x55);
    // Padding between fields: m_fontAssetCreationEditorSettings and: m_FontWeightTable
    char __padding25[0x3] = {};
    // private UnityEngine.TextCore.Text.FontWeightPair[] m_FontWeightTable
    // Size: 0x8
    // Offset: 0x180
    ::ArrayW<::UnityEngine::TextCore::Text::FontWeightPair> m_FontWeightTable;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::TextCore::Text::FontWeightPair>) == 0x8);
    // System.Single m_RegularStyleWeight
    // Size: 0x4
    // Offset: 0x188
    float m_RegularStyleWeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // System.Single m_RegularStyleSpacing
    // Size: 0x4
    // Offset: 0x18C
    float m_RegularStyleSpacing;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // System.Single m_BoldStyleWeight
    // Size: 0x4
    // Offset: 0x190
    float m_BoldStyleWeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // System.Single m_BoldStyleSpacing
    // Size: 0x4
    // Offset: 0x194
    float m_BoldStyleSpacing;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // System.Byte m_ItalicStyleSlant
    // Size: 0x1
    // Offset: 0x198
    uint8_t m_ItalicStyleSlant;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // System.Byte m_TabMultiple
    // Size: 0x1
    // Offset: 0x199
    uint8_t m_TabMultiple;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // System.Boolean IsFontAssetLookupTablesDirty
    // Size: 0x1
    // Offset: 0x19A
    bool IsFontAssetLookupTablesDirty;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: IsFontAssetLookupTablesDirty and: m_GlyphsToRender
    char __padding33[0x5] = {};
    // private System.Collections.Generic.List`1<UnityEngine.TextCore.Glyph> m_GlyphsToRender
    // Size: 0x8
    // Offset: 0x1A0
    ::System::Collections::Generic::List_1<::UnityEngine::TextCore::Glyph*>* m_GlyphsToRender;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::TextCore::Glyph*>*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.TextCore.Glyph> m_GlyphsRendered
    // Size: 0x8
    // Offset: 0x1A8
    ::System::Collections::Generic::List_1<::UnityEngine::TextCore::Glyph*>* m_GlyphsRendered;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::TextCore::Glyph*>*) == 0x8);
    // private System.Collections.Generic.List`1<System.UInt32> m_GlyphIndexList
    // Size: 0x8
    // Offset: 0x1B0
    ::System::Collections::Generic::List_1<uint>* m_GlyphIndexList;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<uint>*) == 0x8);
    // private System.Collections.Generic.List`1<System.UInt32> m_GlyphIndexListNewlyAdded
    // Size: 0x8
    // Offset: 0x1B8
    ::System::Collections::Generic::List_1<uint>* m_GlyphIndexListNewlyAdded;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<uint>*) == 0x8);
    // System.Collections.Generic.List`1<System.UInt32> m_GlyphsToAdd
    // Size: 0x8
    // Offset: 0x1C0
    ::System::Collections::Generic::List_1<uint>* m_GlyphsToAdd;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<uint>*) == 0x8);
    // System.Collections.Generic.HashSet`1<System.UInt32> m_GlyphsToAddLookup
    // Size: 0x8
    // Offset: 0x1C8
    ::System::Collections::Generic::HashSet_1<uint>* m_GlyphsToAddLookup;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::HashSet_1<uint>*) == 0x8);
    // System.Collections.Generic.List`1<UnityEngine.TextCore.Text.Character> m_CharactersToAdd
    // Size: 0x8
    // Offset: 0x1D0
    ::System::Collections::Generic::List_1<::UnityEngine::TextCore::Text::Character*>* m_CharactersToAdd;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::TextCore::Text::Character*>*) == 0x8);
    // System.Collections.Generic.HashSet`1<System.UInt32> m_CharactersToAddLookup
    // Size: 0x8
    // Offset: 0x1D8
    ::System::Collections::Generic::HashSet_1<uint>* m_CharactersToAddLookup;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::HashSet_1<uint>*) == 0x8);
    // System.Collections.Generic.List`1<System.UInt32> s_MissingCharacterList
    // Size: 0x8
    // Offset: 0x1E0
    ::System::Collections::Generic::List_1<uint>* s_MissingCharacterList;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<uint>*) == 0x8);
    // System.Collections.Generic.HashSet`1<System.UInt32> m_MissingUnicodesFromFontFile
    // Size: 0x8
    // Offset: 0x1E8
    ::System::Collections::Generic::HashSet_1<uint>* m_MissingUnicodesFromFontFile;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::HashSet_1<uint>*) == 0x8);
    public:
    // Get static field: static private Unity.Profiling.ProfilerMarker k_ReadFontAssetDefinitionMarker
    static ::Unity::Profiling::ProfilerMarker _get_k_ReadFontAssetDefinitionMarker();
    // Set static field: static private Unity.Profiling.ProfilerMarker k_ReadFontAssetDefinitionMarker
    static void _set_k_ReadFontAssetDefinitionMarker(::Unity::Profiling::ProfilerMarker value);
    // Get static field: static private Unity.Profiling.ProfilerMarker k_AddSynthesizedCharactersMarker
    static ::Unity::Profiling::ProfilerMarker _get_k_AddSynthesizedCharactersMarker();
    // Set static field: static private Unity.Profiling.ProfilerMarker k_AddSynthesizedCharactersMarker
