// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: UnityEngine.TextCore.Text.TagValueType
#include "UnityEngine/TextCore/Text/TagValueType.hpp"
// Including type: UnityEngine.TextCore.Text.TagUnitType
#include "UnityEngine/TextCore/Text/TagUnitType.hpp"
// Completed includes
// Type namespace: UnityEngine.TextCore.Text
namespace UnityEngine::TextCore::Text {
  // Forward declaring type: RichTextTagAttribute
  struct RichTextTagAttribute;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::TextCore::Text::RichTextTagAttribute, "UnityEngine.TextCore.Text", "RichTextTagAttribute");
// Type namespace: UnityEngine.TextCore.Text
namespace UnityEngine::TextCore::Text {
  // Size: 0x18
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: UnityEngine.TextCore.Text.RichTextTagAttribute
  // [TokenAttribute] Offset: FFFFFFFF
  struct RichTextTagAttribute/*, public ::System::ValueType*/ {
    public:
    public:
    // public System.Int32 nameHashCode
    // Size: 0x4
    // Offset: 0x0
    int nameHashCode;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 valueHashCode
    // Size: 0x4
    // Offset: 0x4
    int valueHashCode;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public UnityEngine.TextCore.Text.TagValueType valueType
    // Size: 0x4
    // Offset: 0x8
    ::UnityEngine::TextCore::Text::TagValueType valueType;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextCore::Text::TagValueType) == 0x4);
    // public System.Int32 valueStartIndex
    // Size: 0x4
    // Offset: 0xC
    int valueStartIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 valueLength
    // Size: 0x4
    // Offset: 0x10
    int valueLength;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public UnityEngine.TextCore.Text.TagUnitType unitType
    // Size: 0x4
    // Offset: 0x14
    ::UnityEngine::TextCore::Text::TagUnitType unitType;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextCore::Text::TagUnitType) == 0x4);
    public:
    // Creating value type constructor for type: RichTextTagAttribute
    constexpr RichTextTagAttribute(int nameHashCode_ = {}, int valueHashCode_ = {}, ::UnityEngine::TextCore::Text::TagValueType valueType_ = {}, int valueStartIndex_ = {}, int valueLength_ = {}, ::UnityEngine::TextCore::Text::TagUnitType unitType_ = {}) noexcept : nameHashCode{nameHashCode_}, valueHashCode{valueHashCode_}, valueType{valueType_}, valueStartIndex{valueStartIndex_}, valueLength{valueLength_}, unitType{unitType_} {}
    // Creating interface conversion operator: operator ::System::ValueType
    operator ::System::ValueType() noexcept {
      return *reinterpret_cast<::System::ValueType*>(this);
    }
    // Get instance field reference: public System.Int32 nameHashCode
    [[deprecated("Use field access instead!")]] int& dyn_nameHashCode();
    // Get instance field reference: public System.Int32 valueHashCode
    [[deprecated("Use field access instead!")]] int& dyn_valueHashCode();
    // Get instance field reference: public UnityEngine.TextCore.Text.TagValueType valueType
    [[deprecated("Use field access instead!")]] ::UnityEngine::TextCore::Text::TagValueType& dyn_valueType();
    // Get instance field reference: public System.Int32 valueStartIndex
    [[deprecated("Use field access instead!")]] int& dyn_valueStartIndex();
    // Get instance field reference: public System.Int32 valueLength
    [[deprecated("Use field access instead!")]] int& dyn_valueLength();
    // Get instance field reference: public UnityEngine.TextCore.Text.TagUnitType unitType
    [[deprecated("Use field access instead!")]] ::UnityEngine::TextCore::Text::TagUnitType& dyn_unitType();
  }; // UnityEngine.TextCore.Text.RichTextTagAttribute
  #pragma pack(pop)
  static check_size<sizeof(RichTextTagAttribute), 20 + sizeof(::UnityEngine::TextCore::Text::TagUnitType)> __UnityEngine_TextCore_Text_RichTextTagAttributeSizeCheck;
  static_assert(sizeof(RichTextTagAttribute) == 0x18);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
