// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.TextCore.Text.TextAsset
#include "UnityEngine/TextCore/Text/TextAsset.hpp"
// Including type: UnityEngine.TextCore.FaceInfo
#include "UnityEngine/TextCore/FaceInfo.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::TextCore::Text
namespace UnityEngine::TextCore::Text {
  // Forward declaring type: SpriteCharacter
  class SpriteCharacter;
  // Forward declaring type: SpriteGlyph
  class SpriteGlyph;
  // Forward declaring type: TextSettings
  class TextSettings;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: HashSet`1<T>
  template<typename T>
  class HashSet_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Texture
  class Texture;
}
// Completed forward declares
// Type namespace: UnityEngine.TextCore.Text
namespace UnityEngine::TextCore::Text {
  // Forward declaring type: SpriteAsset
  class SpriteAsset;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::TextCore::Text::SpriteAsset);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::TextCore::Text::SpriteAsset*, "UnityEngine.TextCore.Text", "SpriteAsset");
// Type namespace: UnityEngine.TextCore.Text
namespace UnityEngine::TextCore::Text {
  // Size: 0xD9
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.TextCore.Text.SpriteAsset
  // [TokenAttribute] Offset: FFFFFFFF
  // [ExcludeFromPresetAttribute] Offset: FFFFFFFF
  class SpriteAsset : public ::UnityEngine::TextCore::Text::TextAsset {
    public:
    // Writing base type padding for base size: 0x34 to desired offset: 0x38
    char ___base_padding[0x4] = {};
    // Nested type: ::UnityEngine::TextCore::Text::SpriteAsset::$$c
    class $$c;
    public:
    // System.Collections.Generic.Dictionary`2<System.Int32,System.Int32> m_NameLookup
    // Size: 0x8
    // Offset: 0x38
    ::System::Collections::Generic::Dictionary_2<int, int>* m_NameLookup;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<int, int>*) == 0x8);
    // System.Collections.Generic.Dictionary`2<System.UInt32,System.Int32> m_GlyphIndexLookup
    // Size: 0x8
    // Offset: 0x40
    ::System::Collections::Generic::Dictionary_2<uint, int>* m_GlyphIndexLookup;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<uint, int>*) == 0x8);
    // UnityEngine.TextCore.FaceInfo m_FaceInfo
    // Size: 0x60
    // Offset: 0x48
    ::UnityEngine::TextCore::FaceInfo m_FaceInfo;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextCore::FaceInfo) == 0x60);
    // UnityEngine.Texture m_SpriteAtlasTexture
    // Size: 0x8
    // Offset: 0xA8
    ::UnityEngine::Texture* m_SpriteAtlasTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.TextCore.Text.SpriteCharacter> m_SpriteCharacterTable
    // Size: 0x8
    // Offset: 0xB0
    ::System::Collections::Generic::List_1<::UnityEngine::TextCore::Text::SpriteCharacter*>* m_SpriteCharacterTable;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::TextCore::Text::SpriteCharacter*>*) == 0x8);
    // System.Collections.Generic.Dictionary`2<System.UInt32,UnityEngine.TextCore.Text.SpriteCharacter> m_SpriteCharacterLookup
    // Size: 0x8
    // Offset: 0xB8
    ::System::Collections::Generic::Dictionary_2<uint, ::UnityEngine::TextCore::Text::SpriteCharacter*>* m_SpriteCharacterLookup;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<uint, ::UnityEngine::TextCore::Text::SpriteCharacter*>*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.TextCore.Text.SpriteGlyph> m_SpriteGlyphTable
    // Size: 0x8
    // Offset: 0xC0
    ::System::Collections::Generic::List_1<::UnityEngine::TextCore::Text::SpriteGlyph*>* m_SpriteGlyphTable;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::TextCore::Text::SpriteGlyph*>*) == 0x8);
    // System.Collections.Generic.Dictionary`2<System.UInt32,UnityEngine.TextCore.Text.SpriteGlyph> m_SpriteGlyphLookup
    // Size: 0x8
    // Offset: 0xC8
    ::System::Collections::Generic::Dictionary_2<uint, ::UnityEngine::TextCore::Text::SpriteGlyph*>* m_SpriteGlyphLookup;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<uint, ::UnityEngine::TextCore::Text::SpriteGlyph*>*) == 0x8);
    // public System.Collections.Generic.List`1<UnityEngine.TextCore.Text.SpriteAsset> fallbackSpriteAssets
    // Size: 0x8
    // Offset: 0xD0
    ::System::Collections::Generic::List_1<::UnityEngine::TextCore::Text::SpriteAsset*>* fallbackSpriteAssets;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::TextCore::Text::SpriteAsset*>*) == 0x8);
    // System.Boolean m_IsSpriteAssetLookupTablesDirty
    // Size: 0x1
    // Offset: 0xD8
    bool m_IsSpriteAssetLookupTablesDirty;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get static field: static private System.Collections.Generic.HashSet`1<System.Int32> k_searchedSpriteAssets
    static ::System::Collections::Generic::HashSet_1<int>* _get_k_searchedSpriteAssets();
    // Set static field: static private System.Collections.Generic.HashSet`1<System.Int32> k_searchedSpriteAssets
    static void _set_k_searchedSpriteAssets(::System::Collections::Generic::HashSet_1<int>* value);
    // Get instance field reference: System.Collections.Generic.Dictionary`2<System.Int32,System.Int32> m_NameLookup
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::Dictionary_2<int, int>*& dyn_m_NameLookup();
    // Get instance field reference: System.Collections.Generic.Dictionary`2<System.UInt32,System.Int32> m_GlyphIndexLookup
