// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.ScriptableObject
#include "UnityEngine/ScriptableObject.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Font
  class Font;
}
// Forward declaring namespace: UnityEngine::TextCore::Text
namespace UnityEngine::TextCore::Text {
  // Forward declaring type: FontAsset
  class FontAsset;
  // Forward declaring type: SpriteAsset
  class SpriteAsset;
  // Forward declaring type: TextStyleSheet
  class TextStyleSheet;
  // Forward declaring type: UnicodeLineBreakingRules
  class UnicodeLineBreakingRules;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Completed forward declares
// Type namespace: UnityEngine.TextCore.Text
namespace UnityEngine::TextCore::Text {
  // Forward declaring type: TextSettings
  class TextSettings;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::TextCore::Text::TextSettings);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::TextCore::Text::TextSettings*, "UnityEngine.TextCore.Text", "TextSettings");
// Type namespace: UnityEngine.TextCore.Text
namespace UnityEngine::TextCore::Text {
  // Size: 0xA0
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.TextCore.Text.TextSettings
  // [TokenAttribute] Offset: FFFFFFFF
  // [ExcludeFromObjectFactoryAttribute] Offset: FFFFFFFF
  // [ExcludeFromPresetAttribute] Offset: FFFFFFFF
  class TextSettings : public ::UnityEngine::ScriptableObject {
    public:
    // Nested type: ::UnityEngine::TextCore::Text::TextSettings::FontReferenceMap
    struct FontReferenceMap;
    // Size: 0x10
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.TextCore.Text.TextSettings/FontReferenceMap
    // [TokenAttribute] Offset: FFFFFFFF
    struct FontReferenceMap/*, public ::System::ValueType*/ {
      public:
      public:
      // public UnityEngine.Font font
      // Size: 0x8
      // Offset: 0x0
      ::UnityEngine::Font* font;
      // Field size check
      static_assert(sizeof(::UnityEngine::Font*) == 0x8);
      // public UnityEngine.TextCore.Text.FontAsset fontAsset
      // Size: 0x8
      // Offset: 0x8
      ::UnityEngine::TextCore::Text::FontAsset* fontAsset;
      // Field size check
      static_assert(sizeof(::UnityEngine::TextCore::Text::FontAsset*) == 0x8);
      public:
      // Creating value type constructor for type: FontReferenceMap
      constexpr FontReferenceMap(::UnityEngine::Font* font_ = {}, ::UnityEngine::TextCore::Text::FontAsset* fontAsset_ = {}) noexcept : font{font_}, fontAsset{fontAsset_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public UnityEngine.Font font
      [[deprecated("Use field access instead!")]] ::UnityEngine::Font*& dyn_font();
      // Get instance field reference: public UnityEngine.TextCore.Text.FontAsset fontAsset
      [[deprecated("Use field access instead!")]] ::UnityEngine::TextCore::Text::FontAsset*& dyn_fontAsset();
      // public System.Void .ctor(UnityEngine.Font font, UnityEngine.TextCore.Text.FontAsset fontAsset)
      // Offset: 0x55737D4
      // ABORTED: conflicts with another method.  FontReferenceMap(::UnityEngine::Font* font, ::UnityEngine::TextCore::Text::FontAsset* fontAsset);
    }; // UnityEngine.TextCore.Text.TextSettings/FontReferenceMap
    #pragma pack(pop)
    static check_size<sizeof(TextSettings::FontReferenceMap), 8 + sizeof(::UnityEngine::TextCore::Text::FontAsset*)> __UnityEngine_TextCore_Text_TextSettings_FontReferenceMapSizeCheck;
    static_assert(sizeof(TextSettings::FontReferenceMap) == 0x10);
    public:
    // protected System.String m_Version
    // Size: 0x8
    // Offset: 0x18
    ::StringW m_Version;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // protected UnityEngine.TextCore.Text.FontAsset m_DefaultFontAsset
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::TextCore::Text::FontAsset* m_DefaultFontAsset;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextCore::Text::FontAsset*) == 0x8);
    // protected System.String m_DefaultFontAssetPath
    // Size: 0x8
    // Offset: 0x28
    ::StringW m_DefaultFontAssetPath;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // protected System.Collections.Generic.List`1<UnityEngine.TextCore.Text.FontAsset> m_FallbackFontAssets
    // Size: 0x8
    // Offset: 0x30
    ::System::Collections::Generic::List_1<::UnityEngine::TextCore::Text::FontAsset*>* m_FallbackFontAssets;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::TextCore::Text::FontAsset*>*) == 0x8);
    // protected System.Boolean m_MatchMaterialPreset
    // Size: 0x1
    // Offset: 0x38
    bool m_MatchMaterialPreset;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_MatchMaterialPreset and: m_MissingCharacterUnicode
    char __padding4[0x3] = {};
    // protected System.Int32 m_MissingCharacterUnicode
    // Size: 0x4
    // Offset: 0x3C
    int m_MissingCharacterUnicode;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Boolean m_ClearDynamicDataOnBuild
    // Size: 0x1
    // Offset: 0x40
    bool m_ClearDynamicDataOnBuild;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_ClearDynamicDataOnBuild and: m_DefaultSpriteAsset
    char __padding6[0x7] = {};
    // protected UnityEngine.TextCore.Text.SpriteAsset m_DefaultSpriteAsset
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::TextCore::Text::SpriteAsset* m_DefaultSpriteAsset;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextCore::Text::SpriteAsset*) == 0x8);
    // protected System.String m_DefaultSpriteAssetPath
    // Size: 0x8
    // Offset: 0x50
    ::StringW m_DefaultSpriteAssetPath;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // protected System.Collections.Generic.List`1<UnityEngine.TextCore.Text.SpriteAsset> m_FallbackSpriteAssets
    // Size: 0x8
    // Offset: 0x58
    ::System::Collections::Generic::List_1<::UnityEngine::TextCore::Text::SpriteAsset*>* m_FallbackSpriteAssets;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::TextCore::Text::SpriteAsset*>*) == 0x8);
    // protected System.UInt32 m_MissingSpriteCharacterUnicode
    // Size: 0x4
    // Offset: 0x60
    uint m_MissingSpriteCharacterUnicode;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // Padding between fields: m_MissingSpriteCharacterUnicode and: m_DefaultStyleSheet
    char __padding10[0x4] = {};
    // protected UnityEngine.TextCore.Text.TextStyleSheet m_DefaultStyleSheet
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::TextCore::Text::TextStyleSheet* m_DefaultStyleSheet;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextCore::Text::TextStyleSheet*) == 0x8);
    // protected System.String m_StyleSheetsResourcePath
    // Size: 0x8
    // Offset: 0x70
    ::StringW m_StyleSheetsResourcePath;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // protected System.String m_DefaultColorGradientPresetsPath
    // Size: 0x8
    // Offset: 0x78
    ::StringW m_DefaultColorGradientPresetsPath;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // protected UnityEngine.TextCore.Text.UnicodeLineBreakingRules m_UnicodeLineBreakingRules
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::TextCore::Text::UnicodeLineBreakingRules* m_UnicodeLineBreakingRules;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextCore::Text::UnicodeLineBreakingRules*) == 0x8);
    // private System.Boolean m_UseModernHangulLineBreakingRules
    // Size: 0x1
    // Offset: 0x88
    bool m_UseModernHangulLineBreakingRules;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean m_DisplayWarnings
    // Size: 0x1
    // Offset: 0x89
    bool m_DisplayWarnings;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_DisplayWarnings and: m_FontLookup
    char __padding16[0x6] = {};
    // System.Collections.Generic.Dictionary`2<System.Int32,UnityEngine.TextCore.Text.FontAsset> m_FontLookup
    // Size: 0x8
    // Offset: 0x90
    ::System::Collections::Generic::Dictionary_2<int, ::UnityEngine::TextCore::Text::FontAsset*>* m_FontLookup;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<int, ::UnityEngine::TextCore::Text::FontAsset*>*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.TextCore.Text.TextSettings/FontReferenceMap> m_FontReferences
    // Size: 0x8
    // Offset: 0x98
    ::System::Collections::Generic::List_1<::UnityEngine::TextCore::Text::TextSettings::FontReferenceMap>* m_FontReferences;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::TextCore::Text::TextSettings::FontReferenceMap>*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: protected System.String m_Version
    [[deprecated("Use field access instead!")]] ::StringW& dyn_m_Version();
    // Get instance field reference: protected UnityEngine.TextCore.Text.FontAsset m_DefaultFontAsset
    [[deprecated("Use field access instead!")]] ::UnityEngine::TextCore::Text::FontAsset*& dyn_m_DefaultFontAsset();
    // Get instance field reference: protected System.String m_DefaultFontAssetPath
    [[deprecated("Use field access instead!")]] ::StringW& dyn_m_DefaultFontAssetPath();
