// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.TextCore.Text.TextElementType
#include "UnityEngine/TextCore/Text/TextElementType.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::TextCore::Text
namespace UnityEngine::TextCore::Text {
  // Forward declaring type: TextAsset
  class TextAsset;
}
// Forward declaring namespace: UnityEngine::TextCore
namespace UnityEngine::TextCore {
  // Forward declaring type: Glyph
  class Glyph;
}
// Completed forward declares
// Type namespace: UnityEngine.TextCore.Text
namespace UnityEngine::TextCore::Text {
  // Forward declaring type: TextElement
  class TextElement;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::TextCore::Text::TextElement);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::TextCore::Text::TextElement*, "UnityEngine.TextCore.Text", "TextElement");
// Type namespace: UnityEngine.TextCore.Text
namespace UnityEngine::TextCore::Text {
  // Size: 0x30
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.TextCore.Text.TextElement
  // [TokenAttribute] Offset: FFFFFFFF
  class TextElement : public ::Il2CppObject {
    public:
    public:
    // protected UnityEngine.TextCore.Text.TextElementType m_ElementType
    // Size: 0x1
    // Offset: 0x10
    ::UnityEngine::TextCore::Text::TextElementType m_ElementType;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextCore::Text::TextElementType) == 0x1);
    // Padding between fields: m_ElementType and: m_Unicode
    char __padding0[0x3] = {};
    // System.UInt32 m_Unicode
    // Size: 0x4
    // Offset: 0x14
    uint m_Unicode;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // UnityEngine.TextCore.Text.TextAsset m_TextAsset
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::TextCore::Text::TextAsset* m_TextAsset;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextCore::Text::TextAsset*) == 0x8);
    // UnityEngine.TextCore.Glyph m_Glyph
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::TextCore::Glyph* m_Glyph;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextCore::Glyph*) == 0x8);
    // System.UInt32 m_GlyphIndex
    // Size: 0x4
    // Offset: 0x28
    uint m_GlyphIndex;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // System.Single m_Scale
    // Size: 0x4
    // Offset: 0x2C
    float m_Scale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Get instance field reference: protected UnityEngine.TextCore.Text.TextElementType m_ElementType
    [[deprecated("Use field access instead!")]] ::UnityEngine::TextCore::Text::TextElementType& dyn_m_ElementType();
    // Get instance field reference: System.UInt32 m_Unicode
    [[deprecated("Use field access instead!")]] uint& dyn_m_Unicode();
    // Get instance field reference: UnityEngine.TextCore.Text.TextAsset m_TextAsset
    [[deprecated("Use field access instead!")]] ::UnityEngine::TextCore::Text::TextAsset*& dyn_m_TextAsset();
    // Get instance field reference: UnityEngine.TextCore.Glyph m_Glyph
    [[deprecated("Use field access instead!")]] ::UnityEngine::TextCore::Glyph*& dyn_m_Glyph();
    // Get instance field reference: System.UInt32 m_GlyphIndex
    [[deprecated("Use field access instead!")]] uint& dyn_m_GlyphIndex();
    // Get instance field reference: System.Single m_Scale
    [[deprecated("Use field access instead!")]] float& dyn_m_Scale();
    // public UnityEngine.TextCore.Text.TextElementType get_elementType()
    // Offset: 0x555247C
    ::UnityEngine::TextCore::Text::TextElementType get_elementType();
    // public System.UInt32 get_unicode()
    // Offset: 0x55460A4
    uint get_unicode();
    // public System.Void set_unicode(System.UInt32 value)
    // Offset: 0x5543A98
    void set_unicode(uint value);
    // public UnityEngine.TextCore.Text.TextAsset get_textAsset()
    // Offset: 0x554DBEC
    ::UnityEngine::TextCore::Text::TextAsset* get_textAsset();
    // public System.Void set_textAsset(UnityEngine.TextCore.Text.TextAsset value)
    // Offset: 0x5543AA0
    void set_textAsset(::UnityEngine::TextCore::Text::TextAsset* value);
    // public UnityEngine.TextCore.Glyph get_glyph()
    // Offset: 0x5552484
    ::UnityEngine::TextCore::Glyph* get_glyph();
    // public System.Void set_glyph(UnityEngine.TextCore.Glyph value)
    // Offset: 0x5543AA8
    void set_glyph(::UnityEngine::TextCore::Glyph* value);
    // public System.UInt32 get_glyphIndex()
    // Offset: 0x55452C0
    uint get_glyphIndex();
    // public System.Void set_glyphIndex(System.UInt32 value)
    // Offset: 0x5543AB0
    void set_glyphIndex(uint value);
    // public System.Single get_scale()
    // Offset: 0x555248C
    float get_scale();
    // public System.Void set_scale(System.Single value)
    // Offset: 0x5543A14
    void set_scale(float value);
    // protected System.Void .ctor()
    // Offset: 0x5543A0C
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static TextElement* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::TextCore::Text::TextElement::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<TextElement*, creationType>()));
    }
  }; // UnityEngine.TextCore.Text.TextElement
  #pragma pack(pop)
  static check_size<sizeof(TextElement), 44 + sizeof(float)> __UnityEngine_TextCore_Text_TextElementSizeCheck;
  static_assert(sizeof(TextElement) == 0x30);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: UnityEngine::TextCore::Text::TextElement::get_elementType
// Il2CppName: get_elementType
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::TextCore::Text::TextElementType (UnityEngine::TextCore::Text::TextElement::*)()>(&UnityEngine::TextCore::Text::TextElement::get_elementType)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::TextCore::Text::TextElement*), "get_elementType", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: UnityEngine::TextCore::Text::TextElement::get_unicode
// Il2CppName: get_unicode
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<uint (UnityEngine::TextCore::Text::TextElement::*)()>(&UnityEngine::TextCore::Text::TextElement::get_unicode)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::TextCore::Text::TextElement*), "get_unicode", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: UnityEngine::TextCore::Text::TextElement::set_unicode
// Il2CppName: set_unicode
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (UnityEngine::TextCore::Text::TextElement::*)(uint)>(&UnityEngine::TextCore::Text::TextElement::set_unicode)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("System", "UInt32")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::TextCore::Text::TextElement*), "set_unicode", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: UnityEngine::TextCore::Text::TextElement::get_textAsset
// Il2CppName: get_textAsset
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::TextCore::Text::TextAsset* (UnityEngine::TextCore::Text::TextElement::*)()>(&UnityEngine::TextCore::Text::TextElement::get_textAsset)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::TextCore::Text::TextElement*), "get_textAsset", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: UnityEngine::TextCore::Text::TextElement::set_textAsset
// Il2CppName: set_textAsset
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (UnityEngine::TextCore::Text::TextElement::*)(::UnityEngine::TextCore::Text::TextAsset*)>(&UnityEngine::TextCore::Text::TextElement::set_textAsset)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("UnityEngine.TextCore.Text", "TextAsset")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::TextCore::Text::TextElement*), "set_textAsset", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: UnityEngine::TextCore::Text::TextElement::get_glyph
// Il2CppName: get_glyph
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::TextCore::Glyph* (UnityEngine::TextCore::Text::TextElement::*)()>(&UnityEngine::TextCore::Text::TextElement::get_glyph)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::TextCore::Text::TextElement*), "get_glyph", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: UnityEngine::TextCore::Text::TextElement::set_glyph
// Il2CppName: set_glyph
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (UnityEngine::TextCore::Text::TextElement::*)(::UnityEngine::TextCore::Glyph*)>(&UnityEngine::TextCore::Text::TextElement::set_glyph)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("UnityEngine.TextCore", "Glyph")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::TextCore::Text::TextElement*), "set_glyph", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: UnityEngine::TextCore::Text::TextElement::get_glyphIndex
// Il2CppName: get_glyphIndex
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<uint (UnityEngine::TextCore::Text::TextElement::*)()>(&UnityEngine::TextCore::Text::TextElement::get_glyphIndex)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::TextCore::Text::TextElement*), "get_glyphIndex", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: UnityEngine::TextCore::Text::TextElement::set_glyphIndex
// Il2CppName: set_glyphIndex
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (UnityEngine::TextCore::Text::TextElement::*)(uint)>(&UnityEngine::TextCore::Text::TextElement::set_glyphIndex)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("System", "UInt32")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::TextCore::Text::TextElement*), "set_glyphIndex", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: UnityEngine::TextCore::Text::TextElement::get_scale
// Il2CppName: get_scale
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<float (UnityEngine::TextCore::Text::TextElement::*)()>(&UnityEngine::TextCore::Text::TextElement::get_scale)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::TextCore::Text::TextElement*), "get_scale", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: UnityEngine::TextCore::Text::TextElement::set_scale
// Il2CppName: set_scale
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (UnityEngine::TextCore::Text::TextElement::*)(float)>(&UnityEngine::TextCore::Text::TextElement::set_scale)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("System", "Single")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::TextCore::Text::TextElement*), "set_scale", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: UnityEngine::TextCore::Text::TextElement::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
