// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.TextCore.Text.TextBackingContainer
#include "UnityEngine/TextCore/Text/TextBackingContainer.hpp"
// Including type: UnityEngine.TextCore.Text.TextProcessingElement
#include "UnityEngine/TextCore/Text/TextProcessingElement.hpp"
// Including type: UnityEngine.TextCore.Text.HighlightState
#include "UnityEngine/TextCore/Text/HighlightState.hpp"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
// Including type: UnityEngine.TextCore.Text.TextProcessingStack`1
#include "UnityEngine/TextCore/Text/TextProcessingStack_1.hpp"
// Including type: UnityEngine.TextCore.Text.MaterialReference
#include "UnityEngine/TextCore/Text/MaterialReference.hpp"
// Including type: UnityEngine.TextCore.Text.FontStyles
#include "UnityEngine/TextCore/Text/FontStyles.hpp"
// Including type: UnityEngine.TextCore.Text.FontStyleStack
#include "UnityEngine/TextCore/Text/FontStyleStack.hpp"
// Including type: UnityEngine.TextCore.Text.TextFontWeight
#include "UnityEngine/TextCore/Text/TextFontWeight.hpp"
// Including type: UnityEngine.TextCore.Text.TextAlignment
#include "UnityEngine/TextCore/Text/TextAlignment.hpp"
// Including type: UnityEngine.TextCore.Text.Extents
#include "UnityEngine/TextCore/Text/Extents.hpp"
// Including type: UnityEngine.TextCore.Text.WordWrapState
#include "UnityEngine/TextCore/Text/WordWrapState.hpp"
// Including type: UnityEngine.TextCore.Text.TextElementType
#include "UnityEngine/TextCore/Text/TextElementType.hpp"
// Including type: UnityEngine.TextCore.Text.RichTextTagAttribute
#include "UnityEngine/TextCore/Text/RichTextTagAttribute.hpp"
// Including type: UnityEngine.TextCore.Text.TextElementInfo
#include "UnityEngine/TextCore/Text/TextElementInfo.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::TextCore::Text
namespace UnityEngine::TextCore::Text {
  // Forward declaring type: FontAsset
  class FontAsset;
  // Forward declaring type: SpriteAsset
  class SpriteAsset;
  // Forward declaring type: TextColorGradient
  class TextColorGradient;
  // Forward declaring type: TextElement
  class TextElement;
  // Forward declaring type: TextGenerationSettings
  class TextGenerationSettings;
  // Forward declaring type: TextInfo
  class TextInfo;
  // Forward declaring type: TextWrappingMode
  struct TextWrappingMode;
  // Forward declaring type: Character
  class Character;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Material
  class Material;
  // Skipping declaration: Vector2 because it is already included!
  // Forward declaring type: Rect
  struct Rect;
  // Skipping declaration: Vector4 because it is already included!
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Completed forward declares
// Type namespace: UnityEngine.TextCore.Text
namespace UnityEngine::TextCore::Text {
  // Forward declaring type: TextGenerator
  class TextGenerator;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::TextCore::Text::TextGenerator);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::TextCore::Text::TextGenerator*, "UnityEngine.TextCore.Text", "TextGenerator");
// Type namespace: UnityEngine.TextCore.Text
namespace UnityEngine::TextCore::Text {
  // WARNING Size may be invalid!
  // Autogenerated type: UnityEngine.TextCore.Text.TextGenerator
  // [TokenAttribute] Offset: FFFFFFFF
  class TextGenerator : public ::Il2CppObject {
    public:
    // Nested type: ::UnityEngine::TextCore::Text::TextGenerator::MissingCharacterEventCallback
    class MissingCharacterEventCallback;
    // Nested type: ::UnityEngine::TextCore::Text::TextGenerator::SpecialCharacter
    struct SpecialCharacter;
    // Size: 0x1C
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.TextCore.Text.TextGenerator/SpecialCharacter
    // [TokenAttribute] Offset: FFFFFFFF
    struct SpecialCharacter/*, public ::System::ValueType*/ {
      public:
      public:
      // public UnityEngine.TextCore.Text.Character character
      // Size: 0x8
      // Offset: 0x0
      ::UnityEngine::TextCore::Text::Character* character;
      // Field size check
      static_assert(sizeof(::UnityEngine::TextCore::Text::Character*) == 0x8);
      // public UnityEngine.TextCore.Text.FontAsset fontAsset
      // Size: 0x8
      // Offset: 0x8
      ::UnityEngine::TextCore::Text::FontAsset* fontAsset;
      // Field size check
      static_assert(sizeof(::UnityEngine::TextCore::Text::FontAsset*) == 0x8);
      // public UnityEngine.Material material
      // Size: 0x8
      // Offset: 0x10
      ::UnityEngine::Material* material;
      // Field size check
      static_assert(sizeof(::UnityEngine::Material*) == 0x8);
      // public System.Int32 materialIndex
      // Size: 0x4
      // Offset: 0x18
      int materialIndex;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: SpecialCharacter
      constexpr SpecialCharacter(::UnityEngine::TextCore::Text::Character* character_ = {}, ::UnityEngine::TextCore::Text::FontAsset* fontAsset_ = {}, ::UnityEngine::Material* material_ = {}, int materialIndex_ = {}) noexcept : character{character_}, fontAsset{fontAsset_}, material{material_}, materialIndex{materialIndex_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public UnityEngine.TextCore.Text.Character character
      [[deprecated("Use field access instead!")]] ::UnityEngine::TextCore::Text::Character*& dyn_character();
      // Get instance field reference: public UnityEngine.TextCore.Text.FontAsset fontAsset
      [[deprecated("Use field access instead!")]] ::UnityEngine::TextCore::Text::FontAsset*& dyn_fontAsset();
      // Get instance field reference: public UnityEngine.Material material
      [[deprecated("Use field access instead!")]] ::UnityEngine::Material*& dyn_material();
      // Get instance field reference: public System.Int32 materialIndex
      [[deprecated("Use field access instead!")]] int& dyn_materialIndex();
      // public System.Void .ctor(UnityEngine.TextCore.Text.Character character, System.Int32 materialIndex)
      // Offset: 0x556C068
      SpecialCharacter(::UnityEngine::TextCore::Text::Character* character, int materialIndex);
    }; // UnityEngine.TextCore.Text.TextGenerator/SpecialCharacter
    #pragma pack(pop)
    static check_size<sizeof(TextGenerator::SpecialCharacter), 24 + sizeof(int)> __UnityEngine_TextCore_Text_TextGenerator_SpecialCharacterSizeCheck;
    static_assert(sizeof(TextGenerator::SpecialCharacter) == 0x1C);
    public:
    // private UnityEngine.TextCore.Text.TextBackingContainer m_TextBackingArray
    // Size: 0xC
    // Offset: 0x10
    ::UnityEngine::TextCore::Text::TextBackingContainer m_TextBackingArray;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextCore::Text::TextBackingContainer) == 0xC);
    // UnityEngine.TextCore.Text.TextProcessingElement[] m_TextProcessingArray
    // Size: 0x8
    // Offset: 0x20
    ::ArrayW<::UnityEngine::TextCore::Text::TextProcessingElement> m_TextProcessingArray;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::TextCore::Text::TextProcessingElement>) == 0x8);
    // System.Int32 m_InternalTextProcessingArraySize
    // Size: 0x4
    // Offset: 0x28
    int m_InternalTextProcessingArraySize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Boolean m_VertexBufferAutoSizeReduction
    // Size: 0x1
    // Offset: 0x2C
    bool m_VertexBufferAutoSizeReduction;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Char[] m_HtmlTag
    // Size: 0x8
    // Offset: 0x30
    ::ArrayW<::Il2CppChar> m_HtmlTag;
    // Field size check
    static_assert(sizeof(::ArrayW<::Il2CppChar>) == 0x8);
    // UnityEngine.TextCore.Text.HighlightState m_HighlightState
    // Size: 0x14
    // Offset: 0x38
    ::UnityEngine::TextCore::Text::HighlightState m_HighlightState;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextCore::Text::HighlightState) == 0x14);
    // protected System.Boolean m_IsIgnoringAlignment
    // Size: 0x1
    // Offset: 0x4C
    bool m_IsIgnoringAlignment;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private UnityEngine.Vector3[] m_RectTransformCorners
    // Size: 0x8
    // Offset: 0x50
    ::ArrayW<::UnityEngine::Vector3> m_RectTransformCorners;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector3>) == 0x8);
    // private System.Single m_MarginWidth
    // Size: 0x4
    // Offset: 0x58
    float m_MarginWidth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_MarginHeight
    // Size: 0x4
    // Offset: 0x5C
    float m_MarginHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_PreferredWidth
    // Size: 0x4
    // Offset: 0x60
    float m_PreferredWidth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_PreferredHeight
    // Size: 0x4
    // Offset: 0x64
    float m_PreferredHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.TextCore.Text.FontAsset m_CurrentFontAsset
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::TextCore::Text::FontAsset* m_CurrentFontAsset;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextCore::Text::FontAsset*) == 0x8);
    // private UnityEngine.Material m_CurrentMaterial
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::Material* m_CurrentMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private System.Int32 m_CurrentMaterialIndex
    // Size: 0x4
    // Offset: 0x78
    int m_CurrentMaterialIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.TextCore.Text.TextProcessingStack`1<UnityEngine.TextCore.Text.MaterialReference> m_MaterialReferenceStack
    // Size: 0xFFFFFFFF
    // Offset: 0x80
    ::UnityEngine::TextCore::Text::TextProcessingStack_1<::UnityEngine::TextCore::Text::MaterialReference> m_MaterialReferenceStack;
    // private System.Single m_Padding
    // Size: 0x4
    // Offset: 0xD8
    float m_Padding;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.TextCore.Text.SpriteAsset m_CurrentSpriteAsset
    // Size: 0x8
    // Offset: 0xE0
    ::UnityEngine::TextCore::Text::SpriteAsset* m_CurrentSpriteAsset;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextCore::Text::SpriteAsset*) == 0x8);
    // private System.Int32 m_TotalCharacterCount
    // Size: 0x4
    // Offset: 0xE8
    int m_TotalCharacterCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single m_FontSize
    // Size: 0x4
    // Offset: 0xEC
    float m_FontSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_FontScaleMultiplier
    // Size: 0x4
    // Offset: 0xF0
    float m_FontScaleMultiplier;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_CurrentFontSize
    // Size: 0x4
    // Offset: 0xF4
    float m_CurrentFontSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.TextCore.Text.TextProcessingStack`1<System.Single> m_SizeStack
    // Size: 0xFFFFFFFF
    // Offset: 0xF8
    ::UnityEngine::TextCore::Text::TextProcessingStack_1<float> m_SizeStack;
    // protected UnityEngine.TextCore.Text.TextProcessingStack`1<System.Int32>[] m_TextStyleStacks
    // Size: 0x8
    // Offset: 0x118
    ::ArrayW<::UnityEngine::TextCore::Text::TextProcessingStack_1<int>> m_TextStyleStacks;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::TextCore::Text::TextProcessingStack_1<int>>) == 0x8);
    // protected System.Int32 m_TextStyleStackDepth
    // Size: 0x4
    // Offset: 0x120
    int m_TextStyleStackDepth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.TextCore.Text.FontStyles m_FontStyleInternal
    // Size: 0x4
    // Offset: 0x124
    ::UnityEngine::TextCore::Text::FontStyles m_FontStyleInternal;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextCore::Text::FontStyles) == 0x4);
    // private UnityEngine.TextCore.Text.FontStyleStack m_FontStyleStack
    // Size: 0xA
    // Offset: 0x128
    ::UnityEngine::TextCore::Text::FontStyleStack m_FontStyleStack;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextCore::Text::FontStyleStack) == 0xA);
    // private UnityEngine.TextCore.Text.TextFontWeight m_FontWeightInternal
    // Size: 0x4
    // Offset: 0x134
    ::UnityEngine::TextCore::Text::TextFontWeight m_FontWeightInternal;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextCore::Text::TextFontWeight) == 0x4);
    // private UnityEngine.TextCore.Text.TextProcessingStack`1<UnityEngine.TextCore.Text.TextFontWeight> m_FontWeightStack
    // Size: 0xFFFFFFFF
    // Offset: 0x138
    ::UnityEngine::TextCore::Text::TextProcessingStack_1<::UnityEngine::TextCore::Text::TextFontWeight> m_FontWeightStack;
    // private UnityEngine.TextCore.Text.TextAlignment m_LineJustification
    // Size: 0x4
    // Offset: 0x158
    ::UnityEngine::TextCore::Text::TextAlignment m_LineJustification;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextCore::Text::TextAlignment) == 0x4);
    // private UnityEngine.TextCore.Text.TextProcessingStack`1<UnityEngine.TextCore.Text.TextAlignment> m_LineJustificationStack
    // Size: 0xFFFFFFFF
    // Offset: 0x160
    ::UnityEngine::TextCore::Text::TextProcessingStack_1<::UnityEngine::TextCore::Text::TextAlignment> m_LineJustificationStack;
    // private System.Single m_BaselineOffset
    // Size: 0x4
    // Offset: 0x180
    float m_BaselineOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.TextCore.Text.TextProcessingStack`1<System.Single> m_BaselineOffsetStack
    // Size: 0xFFFFFFFF
    // Offset: 0x188
    ::UnityEngine::TextCore::Text::TextProcessingStack_1<float> m_BaselineOffsetStack;
    // private UnityEngine.Color32 m_FontColor32
    // Size: 0x4
    // Offset: 0x1A8
    ::UnityEngine::Color32 m_FontColor32;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color32) == 0x4);
    // private UnityEngine.Color32 m_HtmlColor
    // Size: 0x4
    // Offset: 0x1AC
    ::UnityEngine::Color32 m_HtmlColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color32) == 0x4);
    // private UnityEngine.Color32 m_UnderlineColor
    // Size: 0x4
    // Offset: 0x1B0
    ::UnityEngine::Color32 m_UnderlineColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color32) == 0x4);
    // private UnityEngine.Color32 m_StrikethroughColor
    // Size: 0x4
    // Offset: 0x1B4
    ::UnityEngine::Color32 m_StrikethroughColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color32) == 0x4);
    // private UnityEngine.TextCore.Text.TextProcessingStack`1<UnityEngine.Color32> m_ColorStack
    // Size: 0xFFFFFFFF
    // Offset: 0x1B8
    ::UnityEngine::TextCore::Text::TextProcessingStack_1<::UnityEngine::Color32> m_ColorStack;
    // private UnityEngine.TextCore.Text.TextProcessingStack`1<UnityEngine.Color32> m_UnderlineColorStack
    // Size: 0xFFFFFFFF
    // Offset: 0x1D8
    ::UnityEngine::TextCore::Text::TextProcessingStack_1<::UnityEngine::Color32> m_UnderlineColorStack;
    // private UnityEngine.TextCore.Text.TextProcessingStack`1<UnityEngine.Color32> m_StrikethroughColorStack
    // Size: 0xFFFFFFFF
    // Offset: 0x1F8
    ::UnityEngine::TextCore::Text::TextProcessingStack_1<::UnityEngine::Color32> m_StrikethroughColorStack;
    // private UnityEngine.TextCore.Text.TextProcessingStack`1<UnityEngine.Color32> m_HighlightColorStack
    // Size: 0xFFFFFFFF
    // Offset: 0x218
    ::UnityEngine::TextCore::Text::TextProcessingStack_1<::UnityEngine::Color32> m_HighlightColorStack;
    // private UnityEngine.TextCore.Text.TextProcessingStack`1<UnityEngine.TextCore.Text.HighlightState> m_HighlightStateStack
    // Size: 0xFFFFFFFF
    // Offset: 0x238
    ::UnityEngine::TextCore::Text::TextProcessingStack_1<::UnityEngine::TextCore::Text::HighlightState> m_HighlightStateStack;
    // private UnityEngine.TextCore.Text.TextProcessingStack`1<System.Int32> m_ItalicAngleStack
    // Size: 0xFFFFFFFF
    // Offset: 0x268
    ::UnityEngine::TextCore::Text::TextProcessingStack_1<int> m_ItalicAngleStack;
    // private UnityEngine.TextCore.Text.TextColorGradient m_ColorGradientPreset
    // Size: 0x8
    // Offset: 0x288
    ::UnityEngine::TextCore::Text::TextColorGradient* m_ColorGradientPreset;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextCore::Text::TextColorGradient*) == 0x8);
    // private UnityEngine.TextCore.Text.TextProcessingStack`1<UnityEngine.TextCore.Text.TextColorGradient> m_ColorGradientStack
    // Size: 0xFFFFFFFF
    // Offset: 0x290
    ::UnityEngine::TextCore::Text::TextProcessingStack_1<::UnityEngine::TextCore::Text::TextColorGradient*> m_ColorGradientStack;
    // private System.Boolean m_ColorGradientPresetIsTinted
    // Size: 0x1
    // Offset: 0x2B8
    bool m_ColorGradientPresetIsTinted;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private UnityEngine.TextCore.Text.TextProcessingStack`1<System.Int32> m_ActionStack
    // Size: 0xFFFFFFFF
    // Offset: 0x2C0
    ::UnityEngine::TextCore::Text::TextProcessingStack_1<int> m_ActionStack;
    // private System.Single m_LineOffset
    // Size: 0x4
    // Offset: 0x2E0
    float m_LineOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_LineHeight
    // Size: 0x4
    // Offset: 0x2E4
    float m_LineHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_IsDrivenLineSpacing
    // Size: 0x1
    // Offset: 0x2E8
    bool m_IsDrivenLineSpacing;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Single m_CSpacing
    // Size: 0x4
    // Offset: 0x2EC
    float m_CSpacing;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_MonoSpacing
    // Size: 0x4
    // Offset: 0x2F0
    float m_MonoSpacing;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_XAdvance
    // Size: 0x4
    // Offset: 0x2F4
    float m_XAdvance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_TagLineIndent
    // Size: 0x4
    // Offset: 0x2F8
    float m_TagLineIndent;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_TagIndent
    // Size: 0x4
    // Offset: 0x2FC
    float m_TagIndent;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.TextCore.Text.TextProcessingStack`1<System.Single> m_IndentStack
    // Size: 0xFFFFFFFF
    // Offset: 0x300
    ::UnityEngine::TextCore::Text::TextProcessingStack_1<float> m_IndentStack;
    // private System.Boolean m_TagNoParsing
    // Size: 0x1
    // Offset: 0x320
    bool m_TagNoParsing;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Int32 m_CharacterCount
    // Size: 0x4
    // Offset: 0x324
    int m_CharacterCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_FirstCharacterOfLine
    // Size: 0x4
    // Offset: 0x328
    int m_FirstCharacterOfLine;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_LastCharacterOfLine
    // Size: 0x4
    // Offset: 0x32C
    int m_LastCharacterOfLine;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_FirstVisibleCharacterOfLine
    // Size: 0x4
    // Offset: 0x330
    int m_FirstVisibleCharacterOfLine;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_LastVisibleCharacterOfLine
    // Size: 0x4
    // Offset: 0x334
    int m_LastVisibleCharacterOfLine;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single m_MaxLineAscender
    // Size: 0x4
    // Offset: 0x338
    float m_MaxLineAscender;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_MaxLineDescender
    // Size: 0x4
    // Offset: 0x33C
    float m_MaxLineDescender;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 m_LineNumber
    // Size: 0x4
    // Offset: 0x340
    int m_LineNumber;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_LineVisibleCharacterCount
    // Size: 0x4
    // Offset: 0x344
    int m_LineVisibleCharacterCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_LineVisibleSpaceCount
    // Size: 0x4
    // Offset: 0x348
    int m_LineVisibleSpaceCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_FirstOverflowCharacterIndex
    // Size: 0x4
    // Offset: 0x34C
    int m_FirstOverflowCharacterIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_PageNumber
    // Size: 0x4
    // Offset: 0x350
    int m_PageNumber;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single m_MarginLeft
    // Size: 0x4
    // Offset: 0x354
    float m_MarginLeft;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_MarginRight
    // Size: 0x4
    // Offset: 0x358
    float m_MarginRight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_Width
    // Size: 0x4
    // Offset: 0x35C
    float m_Width;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.TextCore.Text.Extents m_MeshExtents
    // Size: 0x10
    // Offset: 0x360
    ::UnityEngine::TextCore::Text::Extents m_MeshExtents;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextCore::Text::Extents) == 0x10);
    // private System.Single m_MaxCapHeight
    // Size: 0x4
    // Offset: 0x370
    float m_MaxCapHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_MaxAscender
    // Size: 0x4
    // Offset: 0x374
    float m_MaxAscender;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_MaxDescender
    // Size: 0x4
    // Offset: 0x378
    float m_MaxDescender;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_IsNewPage
    // Size: 0x1
    // Offset: 0x37C
    bool m_IsNewPage;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_IsNonBreakingSpace
    // Size: 0x1
    // Offset: 0x37D
    bool m_IsNonBreakingSpace;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private UnityEngine.TextCore.Text.WordWrapState m_SavedWordWrapState
    // Size: 0xFFFFFFFF
    // Offset: 0x380
    ::UnityEngine::TextCore::Text::WordWrapState m_SavedWordWrapState;
    // private UnityEngine.TextCore.Text.WordWrapState m_SavedLineState
    // Size: 0xFFFFFFFF
    // Offset: 0x718
    ::UnityEngine::TextCore::Text::WordWrapState m_SavedLineState;
    // private UnityEngine.TextCore.Text.WordWrapState m_SavedEllipsisState
    // Size: 0xFFFFFFFF
    // Offset: 0xAB0
    ::UnityEngine::TextCore::Text::WordWrapState m_SavedEllipsisState;
    // private UnityEngine.TextCore.Text.WordWrapState m_SavedLastValidState
    // Size: 0xFFFFFFFF
    // Offset: 0xE48
    ::UnityEngine::TextCore::Text::WordWrapState m_SavedLastValidState;
    // private UnityEngine.TextCore.Text.WordWrapState m_SavedSoftLineBreakState
    // Size: 0xFFFFFFFF
    // Offset: 0x11E0
    ::UnityEngine::TextCore::Text::WordWrapState m_SavedSoftLineBreakState;
    // private UnityEngine.TextCore.Text.TextElementType m_TextElementType
    // Size: 0x1
    // Offset: 0x1578
    ::UnityEngine::TextCore::Text::TextElementType m_TextElementType;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextCore::Text::TextElementType) == 0x1);
    // private System.Boolean m_isTextLayoutPhase
    // Size: 0x1
    // Offset: 0x1579
    bool m_isTextLayoutPhase;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Int32 m_SpriteIndex
    // Size: 0x4
    // Offset: 0x157C
    int m_SpriteIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.Color32 m_SpriteColor
    // Size: 0x4
    // Offset: 0x1580
    ::UnityEngine::Color32 m_SpriteColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color32) == 0x4);
    // private UnityEngine.TextCore.Text.TextElement m_CachedTextElement
    // Size: 0x8
    // Offset: 0x1588
    ::UnityEngine::TextCore::Text::TextElement* m_CachedTextElement;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextCore::Text::TextElement*) == 0x8);
    // private UnityEngine.Color32 m_HighlightColor
    // Size: 0x4
    // Offset: 0x1590
    ::UnityEngine::Color32 m_HighlightColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color32) == 0x4);
    // private System.Single m_CharWidthAdjDelta
    // Size: 0x4
    // Offset: 0x1594
    float m_CharWidthAdjDelta;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_MaxFontSize
    // Size: 0x4
    // Offset: 0x1598
    float m_MaxFontSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_MinFontSize
    // Size: 0x4
    // Offset: 0x159C
    float m_MinFontSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 m_AutoSizeIterationCount
    // Size: 0x4
    // Offset: 0x15A0
    int m_AutoSizeIterationCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_AutoSizeMaxIterationCount
    // Size: 0x4
    // Offset: 0x15A4
    int m_AutoSizeMaxIterationCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean m_IsAutoSizePointSizeSet
    // Size: 0x1
    // Offset: 0x15A8
    bool m_IsAutoSizePointSizeSet;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Single m_StartOfLineAscender
    // Size: 0x4
    // Offset: 0x15AC
    float m_StartOfLineAscender;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_LineSpacingDelta
    // Size: 0x4
    // Offset: 0x15B0
    float m_LineSpacingDelta;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.TextCore.Text.MaterialReference[] m_MaterialReferences
    // Size: 0x8
    // Offset: 0x15B8
    ::ArrayW<::UnityEngine::TextCore::Text::MaterialReference> m_MaterialReferences;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::TextCore::Text::MaterialReference>) == 0x8);
    // private System.Int32 m_SpriteCount
    // Size: 0x4
    // Offset: 0x15C0
    int m_SpriteCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.TextCore.Text.TextProcessingStack`1<System.Int32> m_StyleStack
    // Size: 0xFFFFFFFF
    // Offset: 0x15C8
    ::UnityEngine::TextCore::Text::TextProcessingStack_1<int> m_StyleStack;
    // private UnityEngine.TextCore.Text.TextProcessingStack`1<UnityEngine.TextCore.Text.WordWrapState> m_EllipsisInsertionCandidateStack
    // Size: 0xFFFFFFFF
    // Offset: 0x15E8
    ::UnityEngine::TextCore::Text::TextProcessingStack_1<::UnityEngine::TextCore::Text::WordWrapState> m_EllipsisInsertionCandidateStack;
    // private System.Int32 m_SpriteAnimationId
    // Size: 0x4
    // Offset: 0x19A0
    int m_SpriteAnimationId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_ItalicAngle
    // Size: 0x4
    // Offset: 0x19A4
    int m_ItalicAngle;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.Vector3 m_FXScale
    // Size: 0xC
    // Offset: 0x19A8
    ::UnityEngine::Vector3 m_FXScale;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Quaternion m_FXRotation
    // Size: 0x10
    // Offset: 0x19B4
    ::UnityEngine::Quaternion m_FXRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private System.Int32 m_LastBaseGlyphIndex
    // Size: 0x4
    // Offset: 0x19C4
    int m_LastBaseGlyphIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single m_PageAscender
    // Size: 0x4
    // Offset: 0x19C8
    float m_PageAscender;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.TextCore.Text.RichTextTagAttribute[] m_XmlAttribute
    // Size: 0x8
    // Offset: 0x19D0
    ::ArrayW<::UnityEngine::TextCore::Text::RichTextTagAttribute> m_XmlAttribute;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::TextCore::Text::RichTextTagAttribute>) == 0x8);
    // private System.Single[] m_AttributeParameterValues
    // Size: 0x8
    // Offset: 0x19D8
    ::ArrayW<float> m_AttributeParameterValues;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.Int32,System.Int32> m_MaterialReferenceIndexLookup
    // Size: 0x8
    // Offset: 0x19E0
    ::System::Collections::Generic::Dictionary_2<int, int>* m_MaterialReferenceIndexLookup;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<int, int>*) == 0x8);
    // private System.Boolean m_IsCalculatingPreferredValues
    // Size: 0x1
    // Offset: 0x19E8
    bool m_IsCalculatingPreferredValues;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private UnityEngine.TextCore.Text.SpriteAsset m_DefaultSpriteAsset
    // Size: 0x8
    // Offset: 0x19F0
    ::UnityEngine::TextCore::Text::SpriteAsset* m_DefaultSpriteAsset;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextCore::Text::SpriteAsset*) == 0x8);
    // private System.Boolean m_TintSprite
    // Size: 0x1
    // Offset: 0x19F8
    bool m_TintSprite;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected UnityEngine.TextCore.Text.TextGenerator/SpecialCharacter m_Ellipsis
    // Size: 0x1C
    // Offset: 0x1A00
    ::UnityEngine::TextCore::Text::TextGenerator::SpecialCharacter m_Ellipsis;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextCore::Text::TextGenerator::SpecialCharacter) == 0x1C);
    // protected UnityEngine.TextCore.Text.TextGenerator/SpecialCharacter m_Underline
    // Size: 0x1C
    // Offset: 0x1A20
    ::UnityEngine::TextCore::Text::TextGenerator::SpecialCharacter m_Underline;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextCore::Text::TextGenerator::SpecialCharacter) == 0x1C);
    // private UnityEngine.TextCore.Text.TextElementInfo[] m_InternalTextElementInfo
    // Size: 0x8
    // Offset: 0x1A40
    ::ArrayW<::UnityEngine::TextCore::Text::TextElementInfo> m_InternalTextElementInfo;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::TextCore::Text::TextElementInfo>) == 0x8);
    public:
    // Get static field: static private UnityEngine.TextCore.Text.TextGenerator s_TextGenerator
    static ::UnityEngine::TextCore::Text::TextGenerator* _get_s_TextGenerator();
    // Set static field: static private UnityEngine.TextCore.Text.TextGenerator s_TextGenerator
    static void _set_s_TextGenerator(::UnityEngine::TextCore::Text::TextGenerator* value);
    // Get static field: static protected System.Boolean m_IsTextTruncated
    static bool _get_m_IsTextTruncated();
    // Set static field: static protected System.Boolean m_IsTextTruncated
    static void _set_m_IsTextTruncated(bool value);
    // Get static field: static private UnityEngine.TextCore.Text.TextGenerator/MissingCharacterEventCallback OnMissingCharacter
