// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: UnityEngine.TextCore.Text.FontStyles
#include "UnityEngine/TextCore/Text/FontStyles.hpp"
// Including type: UnityEngine.TextCore.Text.LineInfo
#include "UnityEngine/TextCore/Text/LineInfo.hpp"
// Including type: UnityEngine.Color32
#include "UnityEngine/Color32.hpp"
// Including type: UnityEngine.TextCore.Text.HighlightState
#include "UnityEngine/TextCore/Text/HighlightState.hpp"
// Including type: UnityEngine.TextCore.Text.FontStyleStack
#include "UnityEngine/TextCore/Text/FontStyleStack.hpp"
// Including type: UnityEngine.TextCore.Text.TextProcessingStack`1
#include "UnityEngine/TextCore/Text/TextProcessingStack_1.hpp"
// Including type: UnityEngine.TextCore.Text.TextFontWeight
#include "UnityEngine/TextCore/Text/TextFontWeight.hpp"
// Including type: UnityEngine.TextCore.Text.MaterialReference
#include "UnityEngine/TextCore/Text/MaterialReference.hpp"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
// Including type: UnityEngine.Quaternion
#include "UnityEngine/Quaternion.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::TextCore::Text
namespace UnityEngine::TextCore::Text {
  // Forward declaring type: TextInfo
  class TextInfo;
  // Forward declaring type: TextColorGradient
  class TextColorGradient;
  // Forward declaring type: FontAsset
  class FontAsset;
  // Forward declaring type: SpriteAsset
  class SpriteAsset;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Material
  class Material;
}
// Completed forward declares
// Type namespace: UnityEngine.TextCore.Text
namespace UnityEngine::TextCore::Text {
  // Forward declaring type: WordWrapState
  struct WordWrapState;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::TextCore::Text::WordWrapState, "UnityEngine.TextCore.Text", "WordWrapState");
// Type namespace: UnityEngine.TextCore.Text
namespace UnityEngine::TextCore::Text {
  // WARNING Size may be invalid!
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: UnityEngine.TextCore.Text.WordWrapState
  // [TokenAttribute] Offset: FFFFFFFF
  struct WordWrapState/*, public ::System::ValueType*/ {
    public:
    public:
    // public System.Int32 previousWordBreak
    // Size: 0x4
    // Offset: 0x0
    int previousWordBreak;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 totalCharacterCount
    // Size: 0x4
    // Offset: 0x4
    int totalCharacterCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 visibleCharacterCount
    // Size: 0x4
    // Offset: 0x8
    int visibleCharacterCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 visibleSpaceCount
    // Size: 0x4
    // Offset: 0xC
    int visibleSpaceCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 visibleSpriteCount
    // Size: 0x4
    // Offset: 0x10
    int visibleSpriteCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 visibleLinkCount
    // Size: 0x4
    // Offset: 0x14
    int visibleLinkCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 firstCharacterIndex
    // Size: 0x4
    // Offset: 0x18
    int firstCharacterIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 firstVisibleCharacterIndex
    // Size: 0x4
    // Offset: 0x1C
    int firstVisibleCharacterIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 lastCharacterIndex
    // Size: 0x4
    // Offset: 0x20
    int lastCharacterIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 lastVisibleCharIndex
    // Size: 0x4
    // Offset: 0x24
    int lastVisibleCharIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 lineNumber
    // Size: 0x4
    // Offset: 0x28
    int lineNumber;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Single maxCapHeight
    // Size: 0x4
    // Offset: 0x2C
    float maxCapHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single maxAscender
    // Size: 0x4
    // Offset: 0x30
    float maxAscender;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single maxDescender
    // Size: 0x4
    // Offset: 0x34
    float maxDescender;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single maxLineAscender
    // Size: 0x4
    // Offset: 0x38
    float maxLineAscender;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single maxLineDescender
    // Size: 0x4
    // Offset: 0x3C
    float maxLineDescender;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single startOfLineAscender
    // Size: 0x4
    // Offset: 0x40
    float startOfLineAscender;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single xAdvance
    // Size: 0x4
    // Offset: 0x44
    float xAdvance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single preferredWidth
    // Size: 0x4
    // Offset: 0x48
    float preferredWidth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single preferredHeight
    // Size: 0x4
    // Offset: 0x4C
    float preferredHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single previousLineScale
    // Size: 0x4
    // Offset: 0x50
    float previousLineScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single pageAscender
    // Size: 0x4
    // Offset: 0x54
    float pageAscender;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Int32 wordCount
    // Size: 0x4
    // Offset: 0x58
    int wordCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public UnityEngine.TextCore.Text.FontStyles fontStyle
    // Size: 0x4
    // Offset: 0x5C
    ::UnityEngine::TextCore::Text::FontStyles fontStyle;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextCore::Text::FontStyles) == 0x4);
    // public System.Single fontScale
    // Size: 0x4
    // Offset: 0x60
    float fontScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single fontScaleMultiplier
    // Size: 0x4
    // Offset: 0x64
    float fontScaleMultiplier;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Int32 italicAngle
    // Size: 0x4
    // Offset: 0x68
    int italicAngle;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Single currentFontSize
    // Size: 0x4
    // Offset: 0x6C
    float currentFontSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single baselineOffset
    // Size: 0x4
    // Offset: 0x70
    float baselineOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single lineOffset
    // Size: 0x4
    // Offset: 0x74
    float lineOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.TextCore.Text.TextInfo textInfo
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::TextCore::Text::TextInfo* textInfo;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextCore::Text::TextInfo*) == 0x8);
    // public UnityEngine.TextCore.Text.LineInfo lineInfo
    // Size: 0x60
    // Offset: 0x80
    ::UnityEngine::TextCore::Text::LineInfo lineInfo;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextCore::Text::LineInfo) == 0x60);
    // public UnityEngine.Color32 vertexColor
    // Size: 0x4
    // Offset: 0xE0
    ::UnityEngine::Color32 vertexColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color32) == 0x4);
    // public UnityEngine.Color32 underlineColor
    // Size: 0x4
    // Offset: 0xE4
    ::UnityEngine::Color32 underlineColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color32) == 0x4);
    // public UnityEngine.Color32 strikethroughColor
    // Size: 0x4
    // Offset: 0xE8
    ::UnityEngine::Color32 strikethroughColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color32) == 0x4);
    // public UnityEngine.Color32 highlightColor
    // Size: 0x4
    // Offset: 0xEC
    ::UnityEngine::Color32 highlightColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color32) == 0x4);
    // public UnityEngine.TextCore.Text.HighlightState highlightState
    // Size: 0x14
    // Offset: 0xF0
    ::UnityEngine::TextCore::Text::HighlightState highlightState;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextCore::Text::HighlightState) == 0x14);
    // public UnityEngine.TextCore.Text.FontStyleStack basicStyleStack
    // Size: 0xA
    // Offset: 0x104
    ::UnityEngine::TextCore::Text::FontStyleStack basicStyleStack;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextCore::Text::FontStyleStack) == 0xA);
    // public UnityEngine.TextCore.Text.TextProcessingStack`1<System.Int32> italicAngleStack
    // Size: 0xFFFFFFFF
    // Offset: 0x110
    ::UnityEngine::TextCore::Text::TextProcessingStack_1<int> italicAngleStack;
    // public UnityEngine.TextCore.Text.TextProcessingStack`1<UnityEngine.Color32> colorStack
    // Size: 0xFFFFFFFF
    // Offset: 0x130
    ::UnityEngine::TextCore::Text::TextProcessingStack_1<::UnityEngine::Color32> colorStack;
    // public UnityEngine.TextCore.Text.TextProcessingStack`1<UnityEngine.Color32> underlineColorStack
    // Size: 0xFFFFFFFF
    // Offset: 0x150
    ::UnityEngine::TextCore::Text::TextProcessingStack_1<::UnityEngine::Color32> underlineColorStack;
    // public UnityEngine.TextCore.Text.TextProcessingStack`1<UnityEngine.Color32> strikethroughColorStack
    // Size: 0xFFFFFFFF
    // Offset: 0x170
    ::UnityEngine::TextCore::Text::TextProcessingStack_1<::UnityEngine::Color32> strikethroughColorStack;
    // public UnityEngine.TextCore.Text.TextProcessingStack`1<UnityEngine.Color32> highlightColorStack
    // Size: 0xFFFFFFFF
    // Offset: 0x190
    ::UnityEngine::TextCore::Text::TextProcessingStack_1<::UnityEngine::Color32> highlightColorStack;
    // public UnityEngine.TextCore.Text.TextProcessingStack`1<UnityEngine.TextCore.Text.HighlightState> highlightStateStack
    // Size: 0xFFFFFFFF
    // Offset: 0x1B0
    ::UnityEngine::TextCore::Text::TextProcessingStack_1<::UnityEngine::TextCore::Text::HighlightState> highlightStateStack;
    // public UnityEngine.TextCore.Text.TextProcessingStack`1<UnityEngine.TextCore.Text.TextColorGradient> colorGradientStack
    // Size: 0xFFFFFFFF
    // Offset: 0x1E0
    ::UnityEngine::TextCore::Text::TextProcessingStack_1<::UnityEngine::TextCore::Text::TextColorGradient*> colorGradientStack;
    // public UnityEngine.TextCore.Text.TextProcessingStack`1<System.Single> sizeStack
    // Size: 0xFFFFFFFF
    // Offset: 0x208
    ::UnityEngine::TextCore::Text::TextProcessingStack_1<float> sizeStack;
    // public UnityEngine.TextCore.Text.TextProcessingStack`1<System.Single> indentStack
    // Size: 0xFFFFFFFF
    // Offset: 0x228
    ::UnityEngine::TextCore::Text::TextProcessingStack_1<float> indentStack;
    // public UnityEngine.TextCore.Text.TextProcessingStack`1<UnityEngine.TextCore.Text.TextFontWeight> fontWeightStack
    // Size: 0xFFFFFFFF
    // Offset: 0x248
    ::UnityEngine::TextCore::Text::TextProcessingStack_1<::UnityEngine::TextCore::Text::TextFontWeight> fontWeightStack;
    // public UnityEngine.TextCore.Text.TextProcessingStack`1<System.Int32> styleStack
    // Size: 0xFFFFFFFF
    // Offset: 0x268
    ::UnityEngine::TextCore::Text::TextProcessingStack_1<int> styleStack;
    // public UnityEngine.TextCore.Text.TextProcessingStack`1<System.Single> baselineStack
    // Size: 0xFFFFFFFF
    // Offset: 0x288
    ::UnityEngine::TextCore::Text::TextProcessingStack_1<float> baselineStack;
    // public UnityEngine.TextCore.Text.TextProcessingStack`1<System.Int32> actionStack
    // Size: 0xFFFFFFFF
    // Offset: 0x2A8
    ::UnityEngine::TextCore::Text::TextProcessingStack_1<int> actionStack;
    // public UnityEngine.TextCore.Text.TextProcessingStack`1<UnityEngine.TextCore.Text.MaterialReference> materialReferenceStack
    // Size: 0xFFFFFFFF
    // Offset: 0x2C8
    ::UnityEngine::TextCore::Text::TextProcessingStack_1<::UnityEngine::TextCore::Text::MaterialReference> materialReferenceStack;
    // public UnityEngine.TextCore.Text.TextProcessingStack`1<UnityEngine.TextCore.Text.TextAlignment> lineJustificationStack
    // Size: 0xFFFFFFFF
    // Offset: 0x320
    ::UnityEngine::TextCore::Text::TextProcessingStack_1<::UnityEngine::TextCore::Text::TextAlignment> lineJustificationStack;
    // public System.Int32 lastBaseGlyphIndex
    // Size: 0x4
    // Offset: 0x340
    int lastBaseGlyphIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 spriteAnimationId
    // Size: 0x4
    // Offset: 0x344
    int spriteAnimationId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public UnityEngine.TextCore.Text.FontAsset currentFontAsset
    // Size: 0x8
    // Offset: 0x348
    ::UnityEngine::TextCore::Text::FontAsset* currentFontAsset;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextCore::Text::FontAsset*) == 0x8);
    // public UnityEngine.TextCore.Text.SpriteAsset currentSpriteAsset
    // Size: 0x8
    // Offset: 0x350
    ::UnityEngine::TextCore::Text::SpriteAsset* currentSpriteAsset;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextCore::Text::SpriteAsset*) == 0x8);
    // public UnityEngine.Material currentMaterial
    // Size: 0x8
    // Offset: 0x358
    ::UnityEngine::Material* currentMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // public System.Int32 currentMaterialIndex
    // Size: 0x4
    // Offset: 0x360
    int currentMaterialIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public UnityEngine.TextCore.Text.Extents meshExtents
    // Size: 0x10
    // Offset: 0x364
    ::UnityEngine::TextCore::Text::Extents meshExtents;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextCore::Text::Extents) == 0x10);
    // public System.Boolean tagNoParsing
    // Size: 0x1
    // Offset: 0x374
    bool tagNoParsing;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean isNonBreakingSpace
    // Size: 0x1
    // Offset: 0x375
    bool isNonBreakingSpace;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean isDrivenLineSpacing
    // Size: 0x1
    // Offset: 0x376
    bool isDrivenLineSpacing;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public UnityEngine.Vector3 fxScale
    // Size: 0xC
    // Offset: 0x378
    ::UnityEngine::Vector3 fxScale;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Quaternion fxRotation
    // Size: 0x10
    // Offset: 0x384
    ::UnityEngine::Quaternion fxRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    public:
    // Creating value type constructor for type: WordWrapState
