// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Pathfinding.Poly2Tri.TriangulationDebugContext
#include "Pathfinding/Poly2Tri/TriangulationDebugContext.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Pathfinding::Poly2Tri
namespace Pathfinding::Poly2Tri {
  // Forward declaring type: DelaunayTriangle
  class DelaunayTriangle;
  // Forward declaring type: TriangulationPoint
  class TriangulationPoint;
  // Forward declaring type: AdvancingFrontNode
  class AdvancingFrontNode;
  // Forward declaring type: DTSweepConstraint
  class DTSweepConstraint;
}
// Completed forward declares
// Type namespace: Pathfinding.Poly2Tri
namespace Pathfinding::Poly2Tri {
  // Forward declaring type: DTSweepDebugContext
  class DTSweepDebugContext;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Pathfinding::Poly2Tri::DTSweepDebugContext);
DEFINE_IL2CPP_ARG_TYPE(::Pathfinding::Poly2Tri::DTSweepDebugContext*, "Pathfinding.Poly2Tri", "DTSweepDebugContext");
// Type namespace: Pathfinding.Poly2Tri
namespace Pathfinding::Poly2Tri {
  // Size: 0x40
  #pragma pack(push, 1)
  // Autogenerated type: Pathfinding.Poly2Tri.DTSweepDebugContext
  // [TokenAttribute] Offset: FFFFFFFF
  class DTSweepDebugContext : public ::Pathfinding::Poly2Tri::TriangulationDebugContext {
    public:
    public:
    // private Pathfinding.Poly2Tri.DelaunayTriangle _primaryTriangle
    // Size: 0x8
    // Offset: 0x18
    ::Pathfinding::Poly2Tri::DelaunayTriangle* primaryTriangle;
    // Field size check
    static_assert(sizeof(::Pathfinding::Poly2Tri::DelaunayTriangle*) == 0x8);
    // private Pathfinding.Poly2Tri.DelaunayTriangle _secondaryTriangle
    // Size: 0x8
    // Offset: 0x20
    ::Pathfinding::Poly2Tri::DelaunayTriangle* secondaryTriangle;
    // Field size check
    static_assert(sizeof(::Pathfinding::Poly2Tri::DelaunayTriangle*) == 0x8);
    // private Pathfinding.Poly2Tri.TriangulationPoint _activePoint
    // Size: 0x8
    // Offset: 0x28
    ::Pathfinding::Poly2Tri::TriangulationPoint* activePoint;
    // Field size check
    static_assert(sizeof(::Pathfinding::Poly2Tri::TriangulationPoint*) == 0x8);
    // private Pathfinding.Poly2Tri.AdvancingFrontNode _activeNode
    // Size: 0x8
    // Offset: 0x30
    ::Pathfinding::Poly2Tri::AdvancingFrontNode* activeNode;
    // Field size check
    static_assert(sizeof(::Pathfinding::Poly2Tri::AdvancingFrontNode*) == 0x8);
    // private Pathfinding.Poly2Tri.DTSweepConstraint _activeConstraint
    // Size: 0x8
    // Offset: 0x38
    ::Pathfinding::Poly2Tri::DTSweepConstraint* activeConstraint;
    // Field size check
    static_assert(sizeof(::Pathfinding::Poly2Tri::DTSweepConstraint*) == 0x8);
    public:
    // Deleting conversion operator: operator ::Pathfinding::Poly2Tri::TriangulationContext*
    constexpr operator ::Pathfinding::Poly2Tri::TriangulationContext*() const noexcept = delete;
    // Get instance field reference: private Pathfinding.Poly2Tri.DelaunayTriangle _primaryTriangle
    [[deprecated("Use field access instead!")]] ::Pathfinding::Poly2Tri::DelaunayTriangle*& dyn__primaryTriangle();
    // Get instance field reference: private Pathfinding.Poly2Tri.DelaunayTriangle _secondaryTriangle
    [[deprecated("Use field access instead!")]] ::Pathfinding::Poly2Tri::DelaunayTriangle*& dyn__secondaryTriangle();
    // Get instance field reference: private Pathfinding.Poly2Tri.TriangulationPoint _activePoint
    [[deprecated("Use field access instead!")]] ::Pathfinding::Poly2Tri::TriangulationPoint*& dyn__activePoint();
    // Get instance field reference: private Pathfinding.Poly2Tri.AdvancingFrontNode _activeNode
    [[deprecated("Use field access instead!")]] ::Pathfinding::Poly2Tri::AdvancingFrontNode*& dyn__activeNode();
    // Get instance field reference: private Pathfinding.Poly2Tri.DTSweepConstraint _activeConstraint
    [[deprecated("Use field access instead!")]] ::Pathfinding::Poly2Tri::DTSweepConstraint*& dyn__activeConstraint();
    // public System.Void set_PrimaryTriangle(Pathfinding.Poly2Tri.DelaunayTriangle value)
    // Offset: 0x49C5BCC
    void set_PrimaryTriangle(::Pathfinding::Poly2Tri::DelaunayTriangle* value);
    // public System.Void set_SecondaryTriangle(Pathfinding.Poly2Tri.DelaunayTriangle value)
    // Offset: 0x49C6BD8
    void set_SecondaryTriangle(::Pathfinding::Poly2Tri::DelaunayTriangle* value);
    // public System.Void set_ActivePoint(Pathfinding.Poly2Tri.TriangulationPoint value)
    // Offset: 0x49C7EE8
    void set_ActivePoint(::Pathfinding::Poly2Tri::TriangulationPoint* value);
    // public System.Void set_ActiveNode(Pathfinding.Poly2Tri.AdvancingFrontNode value)
    // Offset: 0x49C5380
    void set_ActiveNode(::Pathfinding::Poly2Tri::AdvancingFrontNode* value);
    // public System.Void set_ActiveConstraint(Pathfinding.Poly2Tri.DTSweepConstraint value)
    // Offset: 0x49C4938
    void set_ActiveConstraint(::Pathfinding::Poly2Tri::DTSweepConstraint* value);
    // public override System.Void Clear()
    // Offset: 0x49C7F40
    // Implemented from: Pathfinding.Poly2Tri.TriangulationDebugContext
    // Base method: System.Void TriangulationDebugContext::Clear()
    void Clear();
  }; // Pathfinding.Poly2Tri.DTSweepDebugContext
  #pragma pack(pop)
  static check_size<sizeof(DTSweepDebugContext), 56 + sizeof(::Pathfinding::Poly2Tri::DTSweepConstraint*)> __Pathfinding_Poly2Tri_DTSweepDebugContextSizeCheck;
  static_assert(sizeof(DTSweepDebugContext) == 0x40);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Pathfinding::Poly2Tri::DTSweepDebugContext::set_PrimaryTriangle
// Il2CppName: set_PrimaryTriangle
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Pathfinding::Poly2Tri::DTSweepDebugContext::*)(::Pathfinding::Poly2Tri::DelaunayTriangle*)>(&Pathfinding::Poly2Tri::DTSweepDebugContext::set_PrimaryTriangle)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("Pathfinding.Poly2Tri", "DelaunayTriangle")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Pathfinding::Poly2Tri::DTSweepDebugContext*), "set_PrimaryTriangle", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: Pathfinding::Poly2Tri::DTSweepDebugContext::set_SecondaryTriangle
// Il2CppName: set_SecondaryTriangle
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Pathfinding::Poly2Tri::DTSweepDebugContext::*)(::Pathfinding::Poly2Tri::DelaunayTriangle*)>(&Pathfinding::Poly2Tri::DTSweepDebugContext::set_SecondaryTriangle)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("Pathfinding.Poly2Tri", "DelaunayTriangle")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Pathfinding::Poly2Tri::DTSweepDebugContext*), "set_SecondaryTriangle", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: Pathfinding::Poly2Tri::DTSweepDebugContext::set_ActivePoint
// Il2CppName: set_ActivePoint
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Pathfinding::Poly2Tri::DTSweepDebugContext::*)(::Pathfinding::Poly2Tri::TriangulationPoint*)>(&Pathfinding::Poly2Tri::DTSweepDebugContext::set_ActivePoint)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("Pathfinding.Poly2Tri", "TriangulationPoint")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Pathfinding::Poly2Tri::DTSweepDebugContext*), "set_ActivePoint", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: Pathfinding::Poly2Tri::DTSweepDebugContext::set_ActiveNode
// Il2CppName: set_ActiveNode
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Pathfinding::Poly2Tri::DTSweepDebugContext::*)(::Pathfinding::Poly2Tri::AdvancingFrontNode*)>(&Pathfinding::Poly2Tri::DTSweepDebugContext::set_ActiveNode)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("Pathfinding.Poly2Tri", "AdvancingFrontNode")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Pathfinding::Poly2Tri::DTSweepDebugContext*), "set_ActiveNode", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: Pathfinding::Poly2Tri::DTSweepDebugContext::set_ActiveConstraint
// Il2CppName: set_ActiveConstraint
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Pathfinding::Poly2Tri::DTSweepDebugContext::*)(::Pathfinding::Poly2Tri::DTSweepConstraint*)>(&Pathfinding::Poly2Tri::DTSweepDebugContext::set_ActiveConstraint)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("Pathfinding.Poly2Tri", "DTSweepConstraint")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Pathfinding::Poly2Tri::DTSweepDebugContext*), "set_ActiveConstraint", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: Pathfinding::Poly2Tri::DTSweepDebugContext::Clear
// Il2CppName: Clear
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Pathfinding::Poly2Tri::DTSweepDebugContext::*)()>(&Pathfinding::Poly2Tri::DTSweepDebugContext::Clear)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Pathfinding::Poly2Tri::DTSweepDebugContext*), "Clear", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
