// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.ParticleCollisionEvent
#include "UnityEngine/ParticleCollisionEvent.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: ParticleSystem
  class ParticleSystem;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: SinglePool
  class SinglePool;
}
// Completed forward declares
// Type namespace: GorillaTag.Reactions
namespace GorillaTag::Reactions {
  // Forward declaring type: FlameThrowerParticleCollisionHandler
  class FlameThrowerParticleCollisionHandler;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GorillaTag::Reactions::FlameThrowerParticleCollisionHandler);
DEFINE_IL2CPP_ARG_TYPE(::GorillaTag::Reactions::FlameThrowerParticleCollisionHandler*, "GorillaTag.Reactions", "FlameThrowerParticleCollisionHandler");
// Type namespace: GorillaTag.Reactions
namespace GorillaTag::Reactions {
  // Size: 0x60
  #pragma pack(push, 1)
  // Autogenerated type: GorillaTag.Reactions.FlameThrowerParticleCollisionHandler
  // [TokenAttribute] Offset: FFFFFFFF
  class FlameThrowerParticleCollisionHandler : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private readonly System.Single _maxParticleHitReactionRate
    // Size: 0x4
    // Offset: 0x20
    float maxParticleHitReactionRate;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: maxParticleHitReactionRate and: prefabToSpawn
    char __padding0[0x4] = {};
    // private UnityEngine.GameObject _prefabToSpawn
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::GameObject* prefabToSpawn;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Single _extinguishAmount
    // Size: 0x4
    // Offset: 0x30
    float extinguishAmount;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: extinguishAmount and: particleSystem
    char __padding2[0x4] = {};
    // private UnityEngine.ParticleSystem _particleSystem
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::ParticleSystem* particleSystem;
    // Field size check
    static_assert(sizeof(::UnityEngine::ParticleSystem*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.ParticleCollisionEvent> _collisionEvents
    // Size: 0x8
    // Offset: 0x40
    ::System::Collections::Generic::List_1<::UnityEngine::ParticleCollisionEvent>* collisionEvents;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::ParticleCollisionEvent>*) == 0x8);
    // private System.Boolean _hasPrefabToSpawn
    // Size: 0x1
    // Offset: 0x48
    bool hasPrefabToSpawn;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _isPrefabInPool
    // Size: 0x1
    // Offset: 0x49
    bool isPrefabInPool;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isPrefabInPool and: lastCollisionTime
    char __padding6[0x6] = {};
    // private System.Double _lastCollisionTime
    // Size: 0x8
    // Offset: 0x50
    double lastCollisionTime;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private SinglePool _pool
    // Size: 0x8
    // Offset: 0x58
    ::GlobalNamespace::SinglePool* pool;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SinglePool*) == 0x8);
    public:
    // Get instance field reference: private readonly System.Single _maxParticleHitReactionRate
    [[deprecated("Use field access instead!")]] float& dyn__maxParticleHitReactionRate();
    // Get instance field reference: private UnityEngine.GameObject _prefabToSpawn
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn__prefabToSpawn();
    // Get instance field reference: private System.Single _extinguishAmount
    [[deprecated("Use field access instead!")]] float& dyn__extinguishAmount();
    // Get instance field reference: private UnityEngine.ParticleSystem _particleSystem
    [[deprecated("Use field access instead!")]] ::UnityEngine::ParticleSystem*& dyn__particleSystem();
    // Get instance field reference: private System.Collections.Generic.List`1<UnityEngine.ParticleCollisionEvent> _collisionEvents
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::UnityEngine::ParticleCollisionEvent>*& dyn__collisionEvents();
    // Get instance field reference: private System.Boolean _hasPrefabToSpawn
    [[deprecated("Use field access instead!")]] bool& dyn__hasPrefabToSpawn();
    // Get instance field reference: private System.Boolean _isPrefabInPool
    [[deprecated("Use field access instead!")]] bool& dyn__isPrefabInPool();
    // Get instance field reference: private System.Double _lastCollisionTime
    [[deprecated("Use field access instead!")]] double& dyn__lastCollisionTime();
    // Get instance field reference: private SinglePool _pool
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::SinglePool*& dyn__pool();
    // protected System.Void OnEnable()
    // Offset: 0x28A3A18
    void OnEnable();
    // protected System.Void OnParticleCollision(UnityEngine.GameObject other)
    // Offset: 0x28A3DCC
    void OnParticleCollision(::UnityEngine::GameObject* other);
    // public System.Void .ctor()
    // Offset: 0x28A4018
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static FlameThrowerParticleCollisionHandler* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::GorillaTag::Reactions::FlameThrowerParticleCollisionHandler::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<FlameThrowerParticleCollisionHandler*, creationType>()));
    }
  }; // GorillaTag.Reactions.FlameThrowerParticleCollisionHandler
  #pragma pack(pop)
  static check_size<sizeof(FlameThrowerParticleCollisionHandler), 88 + sizeof(::GlobalNamespace::SinglePool*)> __GorillaTag_Reactions_FlameThrowerParticleCollisionHandlerSizeCheck;
  static_assert(sizeof(FlameThrowerParticleCollisionHandler) == 0x60);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: GorillaTag::Reactions::FlameThrowerParticleCollisionHandler::OnEnable
// Il2CppName: OnEnable
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GorillaTag::Reactions::FlameThrowerParticleCollisionHandler::*)()>(&GorillaTag::Reactions::FlameThrowerParticleCollisionHandler::OnEnable)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GorillaTag::Reactions::FlameThrowerParticleCollisionHandler*), "OnEnable", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GorillaTag::Reactions::FlameThrowerParticleCollisionHandler::OnParticleCollision
// Il2CppName: OnParticleCollision
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GorillaTag::Reactions::FlameThrowerParticleCollisionHandler::*)(::UnityEngine::GameObject*)>(&GorillaTag::Reactions::FlameThrowerParticleCollisionHandler::OnParticleCollision)> {
  static const MethodInfo* get() {
    static auto* other = &::il2cpp_utils::GetClassFromName("UnityEngine", "GameObject")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(GorillaTag::Reactions::FlameThrowerParticleCollisionHandler*), "OnParticleCollision", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{other});
  }
};
// Writing MetadataGetter for method: GorillaTag::Reactions::FlameThrowerParticleCollisionHandler::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
