// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Technie.PhysicsCreator.IHull
#include "Technie/PhysicsCreator/IHull.hpp"
// Including type: Technie.PhysicsCreator.HullType
#include "Technie/PhysicsCreator/HullType.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: Technie.PhysicsCreator.BoxFitMethod
#include "Technie/PhysicsCreator/BoxFitMethod.hpp"
// Including type: Technie.PhysicsCreator.BoxDef
#include "Technie/PhysicsCreator/BoxDef.hpp"
// Including type: Technie.PhysicsCreator.CapsuleDef
#include "Technie/PhysicsCreator/CapsuleDef.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: PhysicMaterial
  class PhysicMaterial;
  // Forward declaring type: Mesh
  class Mesh;
  // Forward declaring type: Renderer
  class Renderer;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: Technie::PhysicsCreator
namespace Technie::PhysicsCreator {
  // Forward declaring type: Sphere
  class Sphere;
  // Forward declaring type: Triangle
  class Triangle;
}
// Completed forward declares
// Type namespace: Technie.PhysicsCreator.Rigid
namespace Technie::PhysicsCreator::Rigid {
  // Forward declaring type: Hull
  class Hull;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Technie::PhysicsCreator::Rigid::Hull);
DEFINE_IL2CPP_ARG_TYPE(::Technie::PhysicsCreator::Rigid::Hull*, "Technie.PhysicsCreator.Rigid", "Hull");
// Type namespace: Technie.PhysicsCreator.Rigid
namespace Technie::PhysicsCreator::Rigid {
  // Size: 0x119
  #pragma pack(push, 1)
  // Autogenerated type: Technie.PhysicsCreator.Rigid.Hull
  // [TokenAttribute] Offset: FFFFFFFF
  class Hull : public ::Il2CppObject/*, public ::Technie::PhysicsCreator::IHull*/ {
    public:
    public:
    // public System.String name
    // Size: 0x8
    // Offset: 0x10
    ::StringW name;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Boolean isVisible
    // Size: 0x1
    // Offset: 0x18
    bool isVisible;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isVisible and: type
    char __padding1[0x3] = {};
    // public Technie.PhysicsCreator.HullType type
    // Size: 0x4
    // Offset: 0x1C
    ::Technie::PhysicsCreator::HullType type;
    // Field size check
    static_assert(sizeof(::Technie::PhysicsCreator::HullType) == 0x4);
    // public UnityEngine.Color colour
    // Size: 0x10
    // Offset: 0x20
    ::UnityEngine::Color colour;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // public UnityEngine.PhysicMaterial material
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::PhysicMaterial* material;
    // Field size check
    static_assert(sizeof(::UnityEngine::PhysicMaterial*) == 0x8);
    // public System.Boolean enableInflation
    // Size: 0x1
    // Offset: 0x38
    bool enableInflation;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: enableInflation and: inflationAmount
    char __padding5[0x3] = {};
    // public System.Single inflationAmount
    // Size: 0x4
    // Offset: 0x3C
    float inflationAmount;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public Technie.PhysicsCreator.BoxFitMethod boxFitMethod
    // Size: 0x4
    // Offset: 0x40
    ::Technie::PhysicsCreator::BoxFitMethod boxFitMethod;
    // Field size check
    static_assert(sizeof(::Technie::PhysicsCreator::BoxFitMethod) == 0x4);
    // public System.Boolean isTrigger
    // Size: 0x1
    // Offset: 0x44
    bool isTrigger;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean isChildCollider
    // Size: 0x1
    // Offset: 0x45
    bool isChildCollider;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isChildCollider and: selectedFaces
    char __padding9[0x2] = {};
    // private System.Collections.Generic.List`1<System.Int32> selectedFaces
    // Size: 0x8
    // Offset: 0x48
    ::System::Collections::Generic::List_1<int>* selectedFaces;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<int>*) == 0x8);
    // public System.Collections.Generic.List`1<UnityEngine.Vector3> cachedTriangleVertices
    // Size: 0x8
    // Offset: 0x50
    ::System::Collections::Generic::List_1<::UnityEngine::Vector3>* cachedTriangleVertices;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Vector3>*) == 0x8);
    // public UnityEngine.Mesh collisionMesh
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::Mesh* collisionMesh;
    // Field size check
    static_assert(sizeof(::UnityEngine::Mesh*) == 0x8);
    // public Technie.PhysicsCreator.BoxDef collisionBox
    // Size: 0x34
    // Offset: 0x60
    ::Technie::PhysicsCreator::BoxDef collisionBox;
    // Field size check
    static_assert(sizeof(::Technie::PhysicsCreator::BoxDef) == 0x34);
    // Padding between fields: collisionBox and: collisionSphere
    char __padding13[0x4] = {};
    // public Technie.PhysicsCreator.Sphere collisionSphere
    // Size: 0x8
    // Offset: 0x98
    ::Technie::PhysicsCreator::Sphere* collisionSphere;
    // Field size check
    static_assert(sizeof(::Technie::PhysicsCreator::Sphere*) == 0x8);
    // public UnityEngine.Mesh faceCollisionMesh
    // Size: 0x8
    // Offset: 0xA0
    ::UnityEngine::Mesh* faceCollisionMesh;
    // Field size check
    static_assert(sizeof(::UnityEngine::Mesh*) == 0x8);
    // public UnityEngine.Vector3 faceBoxCenter
    // Size: 0xC
    // Offset: 0xA8
    ::UnityEngine::Vector3 faceBoxCenter;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 faceBoxSize
    // Size: 0xC
    // Offset: 0xB4
    ::UnityEngine::Vector3 faceBoxSize;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Quaternion faceAsBoxRotation
    // Size: 0x10
    // Offset: 0xC0
    ::UnityEngine::Quaternion faceAsBoxRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // public Technie.PhysicsCreator.CapsuleDef collisionCapsule
    // Size: 0x34
    // Offset: 0xD0
    ::Technie::PhysicsCreator::CapsuleDef collisionCapsule;
    // Field size check
    static_assert(sizeof(::Technie::PhysicsCreator::CapsuleDef) == 0x34);
    // Padding between fields: collisionCapsule and: autoMeshes
    char __padding19[0x4] = {};
    // public UnityEngine.Mesh[] autoMeshes
    // Size: 0x8
    // Offset: 0x108
    ::ArrayW<::UnityEngine::Mesh*> autoMeshes;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Mesh*>) == 0x8);
    // public System.Boolean hasColliderError
    // Size: 0x1
    // Offset: 0x110
    bool hasColliderError;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: hasColliderError and: numColliderFaces
    char __padding21[0x3] = {};
    // public System.Int32 numColliderFaces
    // Size: 0x4
    // Offset: 0x114
    int numColliderFaces;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Boolean noInputError
    // Size: 0x1
    // Offset: 0x118
    bool noInputError;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating interface conversion operator: operator ::Technie::PhysicsCreator::IHull
    operator ::Technie::PhysicsCreator::IHull() noexcept {
      return *reinterpret_cast<::Technie::PhysicsCreator::IHull*>(this);
    }
    // Get instance field reference: public System.String name
    [[deprecated("Use field access instead!")]] ::StringW& dyn_name();
    // Get instance field reference: public System.Boolean isVisible
    [[deprecated("Use field access instead!")]] bool& dyn_isVisible();
    // Get instance field reference: public Technie.PhysicsCreator.HullType type
    [[deprecated("Use field access instead!")]] ::Technie::PhysicsCreator::HullType& dyn_type();
    // Get instance field reference: public UnityEngine.Color colour
    [[deprecated("Use field access instead!")]] ::UnityEngine::Color& dyn_colour();
