// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ICloneable
#include "System/ICloneable.hpp"
// Including type: UnityEngine.Vector4
#include "UnityEngine/Vector4.hpp"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Type namespace: Oculus.Interaction.Grab.GrabSurfaces
namespace Oculus::Interaction::Grab::GrabSurfaces {
  // Forward declaring type: BoxGrabSurfaceData
  class BoxGrabSurfaceData;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Oculus::Interaction::Grab::GrabSurfaces::BoxGrabSurfaceData);
DEFINE_IL2CPP_ARG_TYPE(::Oculus::Interaction::Grab::GrabSurfaces::BoxGrabSurfaceData*, "Oculus.Interaction.Grab.GrabSurfaces", "BoxGrabSurfaceData");
// Type namespace: Oculus.Interaction.Grab.GrabSurfaces
namespace Oculus::Interaction::Grab::GrabSurfaces {
  // Size: 0x3C
  #pragma pack(push, 1)
  // Autogenerated type: Oculus.Interaction.Grab.GrabSurfaces.BoxGrabSurfaceData
  // [TokenAttribute] Offset: FFFFFFFF
  class BoxGrabSurfaceData : public ::Il2CppObject/*, public ::System::ICloneable*/ {
    public:
    public:
    // public System.Single widthOffset
    // Size: 0x4
    // Offset: 0x10
    float widthOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.Vector4 snapOffset
    // Size: 0x10
    // Offset: 0x14
    ::UnityEngine::Vector4 snapOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector4) == 0x10);
    // public UnityEngine.Vector3 size
    // Size: 0xC
    // Offset: 0x24
    ::UnityEngine::Vector3 size;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 eulerAngles
    // Size: 0xC
    // Offset: 0x30
    ::UnityEngine::Vector3 eulerAngles;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    public:
    // Creating interface conversion operator: operator ::System::ICloneable
    operator ::System::ICloneable() noexcept {
      return *reinterpret_cast<::System::ICloneable*>(this);
    }
    // Get instance field reference: public System.Single widthOffset
    [[deprecated("Use field access instead!")]] float& dyn_widthOffset();
    // Get instance field reference: public UnityEngine.Vector4 snapOffset
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector4& dyn_snapOffset();
    // Get instance field reference: public UnityEngine.Vector3 size
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_size();
    // Get instance field reference: public UnityEngine.Vector3 eulerAngles
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_eulerAngles();
    // public System.Object Clone()
    // Offset: 0x4832E2C
    ::Il2CppObject* Clone();
    // public Oculus.Interaction.Grab.GrabSurfaces.BoxGrabSurfaceData Mirror()
    // Offset: 0x4832EFC
    ::Oculus::Interaction::Grab::GrabSurfaces::BoxGrabSurfaceData* Mirror();
    // public System.Void .ctor()
    // Offset: 0x4832ED4
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static BoxGrabSurfaceData* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::Grab::GrabSurfaces::BoxGrabSurfaceData::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<BoxGrabSurfaceData*, creationType>()));
    }
  }; // Oculus.Interaction.Grab.GrabSurfaces.BoxGrabSurfaceData
  #pragma pack(pop)
  static check_size<sizeof(BoxGrabSurfaceData), 48 + sizeof(::UnityEngine::Vector3)> __Oculus_Interaction_Grab_GrabSurfaces_BoxGrabSurfaceDataSizeCheck;
  static_assert(sizeof(BoxGrabSurfaceData) == 0x3C);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Oculus::Interaction::Grab::GrabSurfaces::BoxGrabSurfaceData::Clone
// Il2CppName: Clone
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::Il2CppObject* (Oculus::Interaction::Grab::GrabSurfaces::BoxGrabSurfaceData::*)()>(&Oculus::Interaction::Grab::GrabSurfaces::BoxGrabSurfaceData::Clone)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Oculus::Interaction::Grab::GrabSurfaces::BoxGrabSurfaceData*), "Clone", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Oculus::Interaction::Grab::GrabSurfaces::BoxGrabSurfaceData::Mirror
// Il2CppName: Mirror
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::Oculus::Interaction::Grab::GrabSurfaces::BoxGrabSurfaceData* (Oculus::Interaction::Grab::GrabSurfaces::BoxGrabSurfaceData::*)()>(&Oculus::Interaction::Grab::GrabSurfaces::BoxGrabSurfaceData::Mirror)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Oculus::Interaction::Grab::GrabSurfaces::BoxGrabSurfaceData*), "Mirror", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Oculus::Interaction::Grab::GrabSurfaces::BoxGrabSurfaceData::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
