// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.ScriptableObject
#include "UnityEngine/ScriptableObject.hpp"
// Including type: Backtrace.Unity.Types.ReportFilterType
#include "Backtrace/Unity/Types/ReportFilterType.hpp"
// Including type: Backtrace.Unity.Types.DeduplicationStrategy
#include "Backtrace/Unity/Types/DeduplicationStrategy.hpp"
// Including type: Backtrace.Unity.Model.Breadcrumbs.BacktraceBreadcrumbType
#include "Backtrace/Unity/Model/Breadcrumbs/BacktraceBreadcrumbType.hpp"
// Including type: Backtrace.Unity.Model.Breadcrumbs.UnityEngineLogLevel
#include "Backtrace/Unity/Model/Breadcrumbs/UnityEngineLogLevel.hpp"
// Including type: Backtrace.Unity.Types.MiniDumpType
#include "Backtrace/Unity/Types/MiniDumpType.hpp"
// Including type: Backtrace.Unity.Types.RetryOrder
#include "Backtrace/Unity/Types/RetryOrder.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: HashSet`1<T>
  template<typename T>
  class HashSet_1;
}
// Forward declaring namespace: Backtrace::Unity::Model
namespace Backtrace::Unity::Model {
  // Forward declaring type: BacktraceCredentials
  class BacktraceCredentials;
}
// Completed forward declares
// Type namespace: Backtrace.Unity.Model
namespace Backtrace::Unity::Model {
  // Forward declaring type: BacktraceConfiguration
  class BacktraceConfiguration;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Backtrace::Unity::Model::BacktraceConfiguration);
DEFINE_IL2CPP_ARG_TYPE(::Backtrace::Unity::Model::BacktraceConfiguration*, "Backtrace.Unity.Model", "BacktraceConfiguration");
// Type namespace: Backtrace.Unity.Model
namespace Backtrace::Unity::Model {
  // Size: 0xAC
  #pragma pack(push, 1)
  // Autogenerated type: Backtrace.Unity.Model.BacktraceConfiguration
  // [TokenAttribute] Offset: FFFFFFFF
  // [CreateAssetMenuAttribute] Offset: FFFFFFFF
  class BacktraceConfiguration : public ::UnityEngine::ScriptableObject {
    public:
    public:
    // public System.String ServerUrl
    // Size: 0x8
    // Offset: 0x18
    ::StringW ServerUrl;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String Token
    // Size: 0x8
    // Offset: 0x20
    ::StringW Token;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Int32 ReportPerMin
    // Size: 0x4
    // Offset: 0x28
    int ReportPerMin;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Boolean DisableInEditor
    // Size: 0x1
    // Offset: 0x2C
    bool DisableInEditor;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean HandleUnhandledExceptions
    // Size: 0x1
    // Offset: 0x2D
    bool HandleUnhandledExceptions;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean IgnoreSslValidation
    // Size: 0x1
    // Offset: 0x2E
    bool IgnoreSslValidation;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean DestroyOnLoad
    // Size: 0x1
    // Offset: 0x2F
    bool DestroyOnLoad;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Double Sampling
    // Size: 0x8
    // Offset: 0x30
    double Sampling;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // public Backtrace.Unity.Types.ReportFilterType ReportFilterType
    // Size: 0x4
    // Offset: 0x38
    ::Backtrace::Unity::Types::ReportFilterType ReportFilterType;
    // Field size check
    static_assert(sizeof(::Backtrace::Unity::Types::ReportFilterType) == 0x4);
    // public System.Int32 GameObjectDepth
    // Size: 0x4
    // Offset: 0x3C
    int GameObjectDepth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.UInt32 NumberOfLogs
    // Size: 0x4
    // Offset: 0x40
    uint NumberOfLogs;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // public System.Boolean PerformanceStatistics
    // Size: 0x1
    // Offset: 0x44
    bool PerformanceStatistics;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean SendUnhandledGameCrashesOnGameStartup
    // Size: 0x1
    // Offset: 0x45
    bool SendUnhandledGameCrashesOnGameStartup;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean CaptureNativeCrashes
    // Size: 0x1
    // Offset: 0x46
    bool CaptureNativeCrashes;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean HandleANR
    // Size: 0x1
    // Offset: 0x47
    bool HandleANR;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Int32 AnrWatchdogTimeout
    // Size: 0x4
    // Offset: 0x48
    int AnrWatchdogTimeout;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Boolean OomReports
    // Size: 0x1
    // Offset: 0x4C
    bool OomReports;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean ClientSideUnwinding
    // Size: 0x1
    // Offset: 0x4D
    bool ClientSideUnwinding;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: ClientSideUnwinding and: SymbolsUploadToken
    char __padding17[0x2] = {};
    // public System.String SymbolsUploadToken
    // Size: 0x8
    // Offset: 0x50
    ::StringW SymbolsUploadToken;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public Backtrace.Unity.Types.DeduplicationStrategy DeduplicationStrategy
    // Size: 0x4
    // Offset: 0x58
    ::Backtrace::Unity::Types::DeduplicationStrategy DeduplicationStrategy;
    // Field size check
    static_assert(sizeof(::Backtrace::Unity::Types::DeduplicationStrategy) == 0x4);
    // public System.Boolean EnableBreadcrumbsSupport
    // Size: 0x1
    // Offset: 0x5C
    bool EnableBreadcrumbsSupport;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: EnableBreadcrumbsSupport and: BacktraceBreadcrumbsLevel
    char __padding20[0x3] = {};
    // public Backtrace.Unity.Model.Breadcrumbs.BacktraceBreadcrumbType BacktraceBreadcrumbsLevel
    // Size: 0x4
    // Offset: 0x60
    ::Backtrace::Unity::Model::Breadcrumbs::BacktraceBreadcrumbType BacktraceBreadcrumbsLevel;
    // Field size check
    static_assert(sizeof(::Backtrace::Unity::Model::Breadcrumbs::BacktraceBreadcrumbType) == 0x4);
    // public Backtrace.Unity.Model.Breadcrumbs.UnityEngineLogLevel LogLevel
    // Size: 0x4
    // Offset: 0x64
    ::Backtrace::Unity::Model::Breadcrumbs::UnityEngineLogLevel LogLevel;
    // Field size check
    static_assert(sizeof(::Backtrace::Unity::Model::Breadcrumbs::UnityEngineLogLevel) == 0x4);
    // public System.Boolean UseNormalizedExceptionMessage
    // Size: 0x1
    // Offset: 0x68
    bool UseNormalizedExceptionMessage;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: UseNormalizedExceptionMessage and: MinidumpType
    char __padding23[0x3] = {};
    // public Backtrace.Unity.Types.MiniDumpType MinidumpType
    // Size: 0x4
    // Offset: 0x6C
    ::Backtrace::Unity::Types::MiniDumpType MinidumpType;
    // Field size check
    static_assert(sizeof(::Backtrace::Unity::Types::MiniDumpType) == 0x4);
    // public System.Boolean GenerateScreenshotOnException
    // Size: 0x1
    // Offset: 0x70
    bool GenerateScreenshotOnException;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: GenerateScreenshotOnException and: AttachmentPaths
    char __padding25[0x7] = {};
    // public System.String[] AttachmentPaths
    // Size: 0x8
    // Offset: 0x78
    ::ArrayW<::StringW> AttachmentPaths;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // public System.String DatabasePath
    // Size: 0x8
    // Offset: 0x80
    ::StringW DatabasePath;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Boolean EnableMetricsSupport
    // Size: 0x1
    // Offset: 0x88
    bool EnableMetricsSupport;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: EnableMetricsSupport and: TimeIntervalInMin
    char __padding28[0x3] = {};
    // public System.UInt32 TimeIntervalInMin
    // Size: 0x4
    // Offset: 0x8C
    uint TimeIntervalInMin;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // public System.Boolean Enabled
    // Size: 0x1
    // Offset: 0x90
    bool Enabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean AddUnityLogToReport
    // Size: 0x1
    // Offset: 0x91
    bool AddUnityLogToReport;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean AutoSendMode
    // Size: 0x1
    // Offset: 0x92
    bool AutoSendMode;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean CreateDatabase
    // Size: 0x1
    // Offset: 0x93
    bool CreateDatabase;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Int32 MaxRecordCount
    // Size: 0x4
    // Offset: 0x94
    int MaxRecordCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int64 MaxDatabaseSize
    // Size: 0x8
    // Offset: 0x98
    int64_t MaxDatabaseSize;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // public System.Int32 RetryInterval
    // Size: 0x4
    // Offset: 0xA0
    int RetryInterval;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 RetryLimit
    // Size: 0x4
    // Offset: 0xA4
    int RetryLimit;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public Backtrace.Unity.Types.RetryOrder RetryOrder
    // Size: 0x4
    // Offset: 0xA8
    ::Backtrace::Unity::Types::RetryOrder RetryOrder;
    // Field size check
    static_assert(sizeof(::Backtrace::Unity::Types::RetryOrder) == 0x4);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // static field const value: static private Backtrace.Unity.Model.Breadcrumbs.BacktraceBreadcrumbType AllBreadcrumbsTypes
    static constexpr const int AllBreadcrumbsTypes = 127;
    // Get static field: static private Backtrace.Unity.Model.Breadcrumbs.BacktraceBreadcrumbType AllBreadcrumbsTypes
    static ::Backtrace::Unity::Model::Breadcrumbs::BacktraceBreadcrumbType _get_AllBreadcrumbsTypes();
    // Set static field: static private Backtrace.Unity.Model.Breadcrumbs.BacktraceBreadcrumbType AllBreadcrumbsTypes
    static void _set_AllBreadcrumbsTypes(::Backtrace::Unity::Model::Breadcrumbs::BacktraceBreadcrumbType value);
