// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: CjLib.DrawBase
#include "CjLib/DrawBase.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Skipping declaration: Color because it is already included!
}
// Completed forward declares
// Type namespace: CjLib
namespace CjLib {
  // Forward declaring type: DrawArrow
  class DrawArrow;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::CjLib::DrawArrow);
DEFINE_IL2CPP_ARG_TYPE(::CjLib::DrawArrow*, "CjLib", "DrawArrow");
// Type namespace: CjLib
namespace CjLib {
  // Size: 0x68
  #pragma pack(push, 1)
  // Autogenerated type: CjLib.DrawArrow
  // [TokenAttribute] Offset: FFFFFFFF
  // [ExecuteInEditMode] Offset: FFFFFFFF
  class DrawArrow : public ::CjLib::DrawBase {
    public:
    // Writing base type padding for base size: 0x49 to desired offset: 0x4C
    char ___base_padding[0x3] = {};
    public:
    // public UnityEngine.Vector3 LocalEndVector
    // Size: 0xC
    // Offset: 0x4C
    ::UnityEngine::Vector3 LocalEndVector;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public System.Single ConeRadius
    // Size: 0x4
    // Offset: 0x58
    float ConeRadius;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single ConeHeight
    // Size: 0x4
    // Offset: 0x5C
    float ConeHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single StemThickness
    // Size: 0x4
    // Offset: 0x60
    float StemThickness;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Int32 NumSegments
    // Size: 0x4
    // Offset: 0x64
    int NumSegments;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Get instance field reference: public UnityEngine.Vector3 LocalEndVector
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_LocalEndVector();
    // Get instance field reference: public System.Single ConeRadius
    [[deprecated("Use field access instead!")]] float& dyn_ConeRadius();
    // Get instance field reference: public System.Single ConeHeight
    [[deprecated("Use field access instead!")]] float& dyn_ConeHeight();
    // Get instance field reference: public System.Single StemThickness
    [[deprecated("Use field access instead!")]] float& dyn_StemThickness();
    // Get instance field reference: public System.Int32 NumSegments
    [[deprecated("Use field access instead!")]] int& dyn_NumSegments();
    // private System.Void OnValidate()
    // Offset: 0x28CF764
    void OnValidate();
    // protected override System.Void Draw(UnityEngine.Color color, CjLib.DebugUtil/Style style, System.Boolean depthTest)
    // Offset: 0x28CF79C
    // Implemented from: CjLib.DrawBase
    // Base method: System.Void DrawBase::Draw(UnityEngine.Color color, CjLib.DebugUtil/Style style, System.Boolean depthTest)
    void Draw(::UnityEngine::Color color, ::CjLib::DebugUtil::Style style, bool depthTest);
    // public System.Void .ctor()
    // Offset: 0x28CFE60
    // Implemented from: CjLib.DrawBase
    // Base method: System.Void DrawBase::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static DrawArrow* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::CjLib::DrawArrow::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<DrawArrow*, creationType>()));
    }
  }; // CjLib.DrawArrow
  #pragma pack(pop)
  static check_size<sizeof(DrawArrow), 100 + sizeof(int)> __CjLib_DrawArrowSizeCheck;
  static_assert(sizeof(DrawArrow) == 0x68);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: CjLib::DrawArrow::OnValidate
// Il2CppName: OnValidate
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (CjLib::DrawArrow::*)()>(&CjLib::DrawArrow::OnValidate)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(CjLib::DrawArrow*), "OnValidate", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: CjLib::DrawArrow::Draw
// Il2CppName: Draw
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (CjLib::DrawArrow::*)(::UnityEngine::Color, ::CjLib::DebugUtil::Style, bool)>(&CjLib::DrawArrow::Draw)> {
  static const MethodInfo* get() {
    static auto* color = &::il2cpp_utils::GetClassFromName("UnityEngine", "Color")->byval_arg;
    static auto* style = &::il2cpp_utils::GetClassFromName("CjLib", "DebugUtil/Style")->byval_arg;
    static auto* depthTest = &::il2cpp_utils::GetClassFromName("System", "Boolean")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(CjLib::DrawArrow*), "Draw", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{color, style, depthTest});
  }
};
// Writing MetadataGetter for method: CjLib::DrawArrow::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
