// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: Oculus.Interaction.Input.HandFinger
#include "Oculus/Interaction/Input/HandFinger.hpp"
// Including type: Oculus.Interaction.PoseDetection.ShapeRecognizer
#include "Oculus/Interaction/PoseDetection/ShapeRecognizer.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Renderer
  class Renderer;
  // Forward declaring type: Material
  class Material;
}
// Forward declaring namespace: TMPro
namespace TMPro {
  // Forward declaring type: TextMeshPro
  class TextMeshPro;
}
// Forward declaring namespace: Oculus::Interaction::PoseDetection
namespace Oculus::Interaction::PoseDetection {
  // Forward declaring type: IFingerFeatureStateProvider
  class IFingerFeatureStateProvider;
}
// Completed forward declares
// Type namespace: Oculus.Interaction.PoseDetection.Debug
namespace Oculus::Interaction::PoseDetection::Debug {
  // Forward declaring type: FingerFeatureDebugVisual
  class FingerFeatureDebugVisual;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Oculus::Interaction::PoseDetection::Debug::FingerFeatureDebugVisual);
DEFINE_IL2CPP_ARG_TYPE(::Oculus::Interaction::PoseDetection::Debug::FingerFeatureDebugVisual*, "Oculus.Interaction.PoseDetection.Debug", "FingerFeatureDebugVisual");
// Type namespace: Oculus.Interaction.PoseDetection.Debug
namespace Oculus::Interaction::PoseDetection::Debug {
  // Size: 0x71
  #pragma pack(push, 1)
  // Autogenerated type: Oculus.Interaction.PoseDetection.Debug.FingerFeatureDebugVisual
  // [TokenAttribute] Offset: FFFFFFFF
  class FingerFeatureDebugVisual : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private UnityEngine.Renderer _target
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::Renderer* target;
    // Field size check
    static_assert(sizeof(::UnityEngine::Renderer*) == 0x8);
    // private UnityEngine.Color _normalColor
    // Size: 0x10
    // Offset: 0x28
    ::UnityEngine::Color normalColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color _activeColor
    // Size: 0x10
    // Offset: 0x38
    ::UnityEngine::Color activeColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private TMPro.TextMeshPro _targetText
    // Size: 0x8
    // Offset: 0x48
    ::TMPro::TextMeshPro* targetText;
    // Field size check
    static_assert(sizeof(::TMPro::TextMeshPro*) == 0x8);
    // private Oculus.Interaction.PoseDetection.IFingerFeatureStateProvider _fingerFeatureState
    // Size: 0x8
    // Offset: 0x50
    ::Oculus::Interaction::PoseDetection::IFingerFeatureStateProvider* fingerFeatureState;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::PoseDetection::IFingerFeatureStateProvider*) == 0x8);
    // private UnityEngine.Material _material
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::Material* material;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private System.Boolean _lastActiveValue
    // Size: 0x1
    // Offset: 0x60
    bool lastActiveValue;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: lastActiveValue and: handFinger
    char __padding6[0x3] = {};
    // private Oculus.Interaction.Input.HandFinger _handFinger
    // Size: 0x4
    // Offset: 0x64
    ::Oculus::Interaction::Input::HandFinger handFinger;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::Input::HandFinger) == 0x4);
    // private Oculus.Interaction.PoseDetection.ShapeRecognizer/FingerFeatureConfig _featureConfig
    // Size: 0x8
    // Offset: 0x68
    ::Oculus::Interaction::PoseDetection::ShapeRecognizer::FingerFeatureConfig* featureConfig;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::PoseDetection::ShapeRecognizer::FingerFeatureConfig*) == 0x8);
    // private System.Boolean _initialized
    // Size: 0x1
    // Offset: 0x70
    bool initialized;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get instance field reference: private UnityEngine.Renderer _target
    [[deprecated("Use field access instead!")]] ::UnityEngine::Renderer*& dyn__target();
    // Get instance field reference: private UnityEngine.Color _normalColor
    [[deprecated("Use field access instead!")]] ::UnityEngine::Color& dyn__normalColor();
    // Get instance field reference: private UnityEngine.Color _activeColor
    [[deprecated("Use field access instead!")]] ::UnityEngine::Color& dyn__activeColor();
    // Get instance field reference: private TMPro.TextMeshPro _targetText
    [[deprecated("Use field access instead!")]] ::TMPro::TextMeshPro*& dyn__targetText();
    // Get instance field reference: private Oculus.Interaction.PoseDetection.IFingerFeatureStateProvider _fingerFeatureState
    [[deprecated("Use field access instead!")]] ::Oculus::Interaction::PoseDetection::IFingerFeatureStateProvider*& dyn__fingerFeatureState();
    // Get instance field reference: private UnityEngine.Material _material
    [[deprecated("Use field access instead!")]] ::UnityEngine::Material*& dyn__material();
    // Get instance field reference: private System.Boolean _lastActiveValue
    [[deprecated("Use field access instead!")]] bool& dyn__lastActiveValue();
    // Get instance field reference: private Oculus.Interaction.Input.HandFinger _handFinger
    [[deprecated("Use field access instead!")]] ::Oculus::Interaction::Input::HandFinger& dyn__handFinger();
    // Get instance field reference: private Oculus.Interaction.PoseDetection.ShapeRecognizer/FingerFeatureConfig _featureConfig
    [[deprecated("Use field access instead!")]] ::Oculus::Interaction::PoseDetection::ShapeRecognizer::FingerFeatureConfig*& dyn__featureConfig();
    // Get instance field reference: private System.Boolean _initialized
    [[deprecated("Use field access instead!")]] bool& dyn__initialized();
    // protected System.Void Awake()
    // Offset: 0x47F854C
    void Awake();
    // protected System.Void OnDestroy()
    // Offset: 0x47F85D4
    void OnDestroy();
    // public System.Void Initialize(Oculus.Interaction.Input.HandFinger handFinger, Oculus.Interaction.PoseDetection.ShapeRecognizer/FingerFeatureConfig config, Oculus.Interaction.PoseDetection.IFingerFeatureStateProvider fingerFeatureState)
    // Offset: 0x47F8630
    void Initialize(::Oculus::Interaction::Input::HandFinger handFinger, ::Oculus::Interaction::PoseDetection::ShapeRecognizer::FingerFeatureConfig* config, ::Oculus::Interaction::PoseDetection::IFingerFeatureStateProvider* fingerFeatureState);
    // protected System.Void Update()
    // Offset: 0x47F8670
    void Update();
    // public System.Void .ctor()
    // Offset: 0x47F8BA4
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static FingerFeatureDebugVisual* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::PoseDetection::Debug::FingerFeatureDebugVisual::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<FingerFeatureDebugVisual*, creationType>()));
    }
  }; // Oculus.Interaction.PoseDetection.Debug.FingerFeatureDebugVisual
  #pragma pack(pop)
  static check_size<sizeof(FingerFeatureDebugVisual), 112 + sizeof(bool)> __Oculus_Interaction_PoseDetection_Debug_FingerFeatureDebugVisualSizeCheck;
  static_assert(sizeof(FingerFeatureDebugVisual) == 0x71);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Oculus::Interaction::PoseDetection::Debug::FingerFeatureDebugVisual::Awake
// Il2CppName: Awake
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Oculus::Interaction::PoseDetection::Debug::FingerFeatureDebugVisual::*)()>(&Oculus::Interaction::PoseDetection::Debug::FingerFeatureDebugVisual::Awake)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Oculus::Interaction::PoseDetection::Debug::FingerFeatureDebugVisual*), "Awake", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Oculus::Interaction::PoseDetection::Debug::FingerFeatureDebugVisual::OnDestroy
// Il2CppName: OnDestroy
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Oculus::Interaction::PoseDetection::Debug::FingerFeatureDebugVisual::*)()>(&Oculus::Interaction::PoseDetection::Debug::FingerFeatureDebugVisual::OnDestroy)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Oculus::Interaction::PoseDetection::Debug::FingerFeatureDebugVisual*), "OnDestroy", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Oculus::Interaction::PoseDetection::Debug::FingerFeatureDebugVisual::Initialize
// Il2CppName: Initialize
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Oculus::Interaction::PoseDetection::Debug::FingerFeatureDebugVisual::*)(::Oculus::Interaction::Input::HandFinger, ::Oculus::Interaction::PoseDetection::ShapeRecognizer::FingerFeatureConfig*, ::Oculus::Interaction::PoseDetection::IFingerFeatureStateProvider*)>(&Oculus::Interaction::PoseDetection::Debug::FingerFeatureDebugVisual::Initialize)> {
  static const MethodInfo* get() {
    static auto* handFinger = &::il2cpp_utils::GetClassFromName("Oculus.Interaction.Input", "HandFinger")->byval_arg;
    static auto* config = &::il2cpp_utils::GetClassFromName("Oculus.Interaction.PoseDetection", "ShapeRecognizer/FingerFeatureConfig")->byval_arg;
    static auto* fingerFeatureState = &::il2cpp_utils::GetClassFromName("Oculus.Interaction.PoseDetection", "IFingerFeatureStateProvider")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Oculus::Interaction::PoseDetection::Debug::FingerFeatureDebugVisual*), "Initialize", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{handFinger, config, fingerFeatureState});
  }
};
// Writing MetadataGetter for method: Oculus::Interaction::PoseDetection::Debug::FingerFeatureDebugVisual::Update
// Il2CppName: Update
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Oculus::Interaction::PoseDetection::Debug::FingerFeatureDebugVisual::*)()>(&Oculus::Interaction::PoseDetection::Debug::FingerFeatureDebugVisual::Update)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Oculus::Interaction::PoseDetection::Debug::FingerFeatureDebugVisual*), "Update", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Oculus::Interaction::PoseDetection::Debug::FingerFeatureDebugVisual::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
