// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Oculus::Interaction::PoseDetection
namespace Oculus::Interaction::PoseDetection {
  // Forward declaring type: JointRotationActiveState
  class JointRotationActiveState;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: LineRenderer
  class LineRenderer;
  // Skipping declaration: Vector3 because it is already included!
  // Forward declaring type: Color
  struct Color;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: Oculus.Interaction.PoseDetection.Debug
namespace Oculus::Interaction::PoseDetection::Debug {
  // Forward declaring type: JointRotationDebugVisual
  class JointRotationDebugVisual;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Oculus::Interaction::PoseDetection::Debug::JointRotationDebugVisual);
DEFINE_IL2CPP_ARG_TYPE(::Oculus::Interaction::PoseDetection::Debug::JointRotationDebugVisual*, "Oculus.Interaction.PoseDetection.Debug", "JointRotationDebugVisual");
// Type namespace: Oculus.Interaction.PoseDetection.Debug
namespace Oculus::Interaction::PoseDetection::Debug {
  // Size: 0x45
  #pragma pack(push, 1)
  // Autogenerated type: Oculus.Interaction.PoseDetection.Debug.JointRotationDebugVisual
  // [TokenAttribute] Offset: FFFFFFFF
  class JointRotationDebugVisual : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private Oculus.Interaction.PoseDetection.JointRotationActiveState _jointRotation
    // Size: 0x8
    // Offset: 0x20
    ::Oculus::Interaction::PoseDetection::JointRotationActiveState* jointRotation;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::PoseDetection::JointRotationActiveState*) == 0x8);
    // private UnityEngine.Material _lineRendererMaterial
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::Material* lineRendererMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private System.Single _rendererLineWidth
    // Size: 0x4
    // Offset: 0x30
    float rendererLineWidth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _rendererLineLength
    // Size: 0x4
    // Offset: 0x34
    float rendererLineLength;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Collections.Generic.List`1<UnityEngine.LineRenderer> _lineRenderers
    // Size: 0x8
    // Offset: 0x38
    ::System::Collections::Generic::List_1<::UnityEngine::LineRenderer*>* lineRenderers;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::LineRenderer*>*) == 0x8);
    // private System.Int32 _enabledRendererCount
    // Size: 0x4
    // Offset: 0x40
    int enabledRendererCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Boolean _started
    // Size: 0x1
    // Offset: 0x44
    bool started;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get instance field reference: private Oculus.Interaction.PoseDetection.JointRotationActiveState _jointRotation
    [[deprecated("Use field access instead!")]] ::Oculus::Interaction::PoseDetection::JointRotationActiveState*& dyn__jointRotation();
    // Get instance field reference: private UnityEngine.Material _lineRendererMaterial
    [[deprecated("Use field access instead!")]] ::UnityEngine::Material*& dyn__lineRendererMaterial();
    // Get instance field reference: private System.Single _rendererLineWidth
    [[deprecated("Use field access instead!")]] float& dyn__rendererLineWidth();
    // Get instance field reference: private System.Single _rendererLineLength
    [[deprecated("Use field access instead!")]] float& dyn__rendererLineLength();
    // Get instance field reference: private System.Collections.Generic.List`1<UnityEngine.LineRenderer> _lineRenderers
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::UnityEngine::LineRenderer*>*& dyn__lineRenderers();
    // Get instance field reference: private System.Int32 _enabledRendererCount
    [[deprecated("Use field access instead!")]] int& dyn__enabledRendererCount();
    // Get instance field reference: protected System.Boolean _started
    [[deprecated("Use field access instead!")]] bool& dyn__started();
    // protected System.Void Awake()
    // Offset: 0x47FC02C
    void Awake();
    // protected System.Void Start()
    // Offset: 0x47FC0A8
    void Start();
    // protected System.Void OnDisable()
    // Offset: 0x47FC0E0
    void OnDisable();
    // protected System.Void Update()
    // Offset: 0x47FC290
    void Update();
    // private System.Void DrawDebugLine(UnityEngine.Vector3 jointPos, UnityEngine.Vector3 direction, System.Single amount)
    // Offset: 0x47FC714
    void DrawDebugLine(::UnityEngine::Vector3 jointPos, ::UnityEngine::Vector3 direction, float amount);
    // private System.Void ResetLines()
    // Offset: 0x47FC0F0
    void ResetLines();
    // private System.Void AddLine(UnityEngine.Vector3 start, UnityEngine.Vector3 end, UnityEngine.Color color)
    // Offset: 0x47FC8F4
    void AddLine(::UnityEngine::Vector3 start, ::UnityEngine::Vector3 end, ::UnityEngine::Color color);
    // public System.Void .ctor()
    // Offset: 0x47FCB38
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static JointRotationDebugVisual* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::Oculus::Interaction::PoseDetection::Debug::JointRotationDebugVisual::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<JointRotationDebugVisual*, creationType>()));
    }
  }; // Oculus.Interaction.PoseDetection.Debug.JointRotationDebugVisual
  #pragma pack(pop)
  static check_size<sizeof(JointRotationDebugVisual), 68 + sizeof(bool)> __Oculus_Interaction_PoseDetection_Debug_JointRotationDebugVisualSizeCheck;
  static_assert(sizeof(JointRotationDebugVisual) == 0x45);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Oculus::Interaction::PoseDetection::Debug::JointRotationDebugVisual::Awake
// Il2CppName: Awake
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Oculus::Interaction::PoseDetection::Debug::JointRotationDebugVisual::*)()>(&Oculus::Interaction::PoseDetection::Debug::JointRotationDebugVisual::Awake)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Oculus::Interaction::PoseDetection::Debug::JointRotationDebugVisual*), "Awake", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Oculus::Interaction::PoseDetection::Debug::JointRotationDebugVisual::Start
// Il2CppName: Start
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Oculus::Interaction::PoseDetection::Debug::JointRotationDebugVisual::*)()>(&Oculus::Interaction::PoseDetection::Debug::JointRotationDebugVisual::Start)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Oculus::Interaction::PoseDetection::Debug::JointRotationDebugVisual*), "Start", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Oculus::Interaction::PoseDetection::Debug::JointRotationDebugVisual::OnDisable
// Il2CppName: OnDisable
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Oculus::Interaction::PoseDetection::Debug::JointRotationDebugVisual::*)()>(&Oculus::Interaction::PoseDetection::Debug::JointRotationDebugVisual::OnDisable)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Oculus::Interaction::PoseDetection::Debug::JointRotationDebugVisual*), "OnDisable", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Oculus::Interaction::PoseDetection::Debug::JointRotationDebugVisual::Update
// Il2CppName: Update
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Oculus::Interaction::PoseDetection::Debug::JointRotationDebugVisual::*)()>(&Oculus::Interaction::PoseDetection::Debug::JointRotationDebugVisual::Update)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Oculus::Interaction::PoseDetection::Debug::JointRotationDebugVisual*), "Update", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Oculus::Interaction::PoseDetection::Debug::JointRotationDebugVisual::DrawDebugLine
// Il2CppName: DrawDebugLine
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Oculus::Interaction::PoseDetection::Debug::JointRotationDebugVisual::*)(::UnityEngine::Vector3, ::UnityEngine::Vector3, float)>(&Oculus::Interaction::PoseDetection::Debug::JointRotationDebugVisual::DrawDebugLine)> {
  static const MethodInfo* get() {
    static auto* jointPos = &::il2cpp_utils::GetClassFromName("UnityEngine", "Vector3")->byval_arg;
    static auto* direction = &::il2cpp_utils::GetClassFromName("UnityEngine", "Vector3")->byval_arg;
    static auto* amount = &::il2cpp_utils::GetClassFromName("System", "Single")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Oculus::Interaction::PoseDetection::Debug::JointRotationDebugVisual*), "DrawDebugLine", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{jointPos, direction, amount});
  }
};
// Writing MetadataGetter for method: Oculus::Interaction::PoseDetection::Debug::JointRotationDebugVisual::ResetLines
// Il2CppName: ResetLines
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Oculus::Interaction::PoseDetection::Debug::JointRotationDebugVisual::*)()>(&Oculus::Interaction::PoseDetection::Debug::JointRotationDebugVisual::ResetLines)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Oculus::Interaction::PoseDetection::Debug::JointRotationDebugVisual*), "ResetLines", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Oculus::Interaction::PoseDetection::Debug::JointRotationDebugVisual::AddLine
// Il2CppName: AddLine
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Oculus::Interaction::PoseDetection::Debug::JointRotationDebugVisual::*)(::UnityEngine::Vector3, ::UnityEngine::Vector3, ::UnityEngine::Color)>(&Oculus::Interaction::PoseDetection::Debug::JointRotationDebugVisual::AddLine)> {
  static const MethodInfo* get() {
    static auto* start = &::il2cpp_utils::GetClassFromName("UnityEngine", "Vector3")->byval_arg;
    static auto* end = &::il2cpp_utils::GetClassFromName("UnityEngine", "Vector3")->byval_arg;
    static auto* color = &::il2cpp_utils::GetClassFromName("UnityEngine", "Color")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Oculus::Interaction::PoseDetection::Debug::JointRotationDebugVisual*), "AddLine", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{start, end, color});
  }
};
// Writing MetadataGetter for method: Oculus::Interaction::PoseDetection::Debug::JointRotationDebugVisual::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
