// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Runtime.ConstrainedExecution.CriticalFinalizerObject
#include "System/Runtime/ConstrainedExecution/CriticalFinalizerObject.hpp"
// Including type: System.Threading.ExecutionContext
#include "System/Threading/ExecutionContext.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Threading
namespace System::Threading {
  // Forward declaring type: InternalThread
  class InternalThread;
  // Forward declaring type: ThreadPriority
  struct ThreadPriority;
  // Forward declaring type: AsyncLocal`1<T>
  template<typename T>
  class AsyncLocal_1;
  // Forward declaring type: ThreadStart
  class ThreadStart;
  // Forward declaring type: ParameterizedThreadStart
  class ParameterizedThreadStart;
  // Forward declaring type: StackCrawlMark
  struct StackCrawlMark;
  // Forward declaring type: ThreadState
  struct ThreadState;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: MulticastDelegate
  class MulticastDelegate;
  // Forward declaring type: LocalDataStoreMgr
  class LocalDataStoreMgr;
  // Forward declaring type: LocalDataStoreHolder
  class LocalDataStoreHolder;
  // Forward declaring type: Delegate
  class Delegate;
}
// Forward declaring namespace: System::Security::Principal
namespace System::Security::Principal {
  // Forward declaring type: IPrincipal
  class IPrincipal;
}
// Forward declaring namespace: System::Globalization
namespace System::Globalization {
  // Forward declaring type: CultureInfo
  class CultureInfo;
}
// Forward declaring namespace: System::Runtime::Remoting::Contexts
namespace System::Runtime::Remoting::Contexts {
  // Forward declaring type: Context
  class Context;
}
// Completed forward declares
// Type namespace: System.Threading
namespace System::Threading {
  // Forward declaring type: Thread
  class Thread;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Threading::Thread);
DEFINE_IL2CPP_ARG_TYPE(::System::Threading::Thread*, "System.Threading", "Thread");
// Type namespace: System.Threading
namespace System::Threading {
  // Size: 0x4C
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: System.Threading.Thread
  // [TokenAttribute] Offset: FFFFFFFF
  class Thread : public ::System::Runtime::ConstrainedExecution::CriticalFinalizerObject {
    public:
    public:
    // private System.Threading.InternalThread internal_thread
    // Size: 0x8
    // Offset: 0x10
    ::System::Threading::InternalThread* internal_thread;
    // Field size check
    static_assert(sizeof(::System::Threading::InternalThread*) == 0x8);
    // private System.Object m_ThreadStartArg
    // Size: 0x8
    // Offset: 0x18
    ::Il2CppObject* m_ThreadStartArg;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Object pending_exception
    // Size: 0x8
    // Offset: 0x20
    ::Il2CppObject* pending_exception;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.MulticastDelegate m_Delegate
    // Size: 0x8
    // Offset: 0x28
    ::System::MulticastDelegate* m_Delegate;
    // Field size check
    static_assert(sizeof(::System::MulticastDelegate*) == 0x8);
    // private System.Threading.ExecutionContext m_ExecutionContext
    // Size: 0x8
    // Offset: 0x30
    ::System::Threading::ExecutionContext* m_ExecutionContext;
    // Field size check
    static_assert(sizeof(::System::Threading::ExecutionContext*) == 0x8);
    // private System.Boolean m_ExecutionContextBelongsToOuterScope
    // Size: 0x1
    // Offset: 0x38
    bool m_ExecutionContextBelongsToOuterScope;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_ExecutionContextBelongsToOuterScope and: principal
    char __padding5[0x7] = {};
    // private System.Security.Principal.IPrincipal principal
    // Size: 0x8
    // Offset: 0x40
    ::System::Security::Principal::IPrincipal* principal;
    // Field size check
    static_assert(sizeof(::System::Security::Principal::IPrincipal*) == 0x8);
    // private System.Int32 principal_version
    // Size: 0x4
    // Offset: 0x48
    int principal_version;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Get static field: static private System.LocalDataStoreMgr s_LocalDataStoreMgr
    static ::System::LocalDataStoreMgr* _get_s_LocalDataStoreMgr();
    // Set static field: static private System.LocalDataStoreMgr s_LocalDataStoreMgr
    static void _set_s_LocalDataStoreMgr(::System::LocalDataStoreMgr* value);
    // Get static field: static private System.LocalDataStoreHolder s_LocalDataStore
    static ::System::LocalDataStoreHolder* _get_s_LocalDataStore();
    // Set static field: static private System.LocalDataStoreHolder s_LocalDataStore
    static void _set_s_LocalDataStore(::System::LocalDataStoreHolder* value);
    // Get static field: static System.Globalization.CultureInfo m_CurrentCulture
    static ::System::Globalization::CultureInfo* _get_m_CurrentCulture();
    // Set static field: static System.Globalization.CultureInfo m_CurrentCulture
