// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: Unity.Collections.NativeArray`1
#include "Unity/Collections/NativeArray_1.hpp"
// Including type: Unity.Mathematics.int2
#include "Unity/Mathematics/int2.hpp"
// Including type: UnityEngine.Rendering.Universal.UTess.UStar
#include "UnityEngine/Rendering/Universal/UTess/UStar.hpp"
// Including type: Unity.Mathematics.int3
#include "Unity/Mathematics/int3.hpp"
// Including type: UnityEngine.Rendering.Universal.UTess.UHull
#include "UnityEngine/Rendering/Universal/UTess/UHull.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::Rendering::Universal::UTess
namespace UnityEngine::Rendering::Universal::UTess {
  // Forward declaring type: UEvent
  struct UEvent;
}
// Completed forward declares
// Type namespace: UnityEngine.Rendering.Universal.UTess
namespace UnityEngine::Rendering::Universal::UTess {
  // Forward declaring type: Tessellator
  struct Tessellator;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::Rendering::Universal::UTess::Tessellator, "UnityEngine.Rendering.Universal.UTess", "Tessellator");
// Type namespace: UnityEngine.Rendering.Universal.UTess
namespace UnityEngine::Rendering::Universal::UTess {
  // WARNING Size may be invalid!
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: UnityEngine.Rendering.Universal.UTess.Tessellator
  // [TokenAttribute] Offset: FFFFFFFF
  struct Tessellator/*, public ::System::ValueType*/ {
    public:
    // Nested type: ::UnityEngine::Rendering::Universal::UTess::Tessellator::TestHullPointL
    struct TestHullPointL;
    // Nested type: ::UnityEngine::Rendering::Universal::UTess::Tessellator::TestHullPointU
    struct TestHullPointU;
    // Nested type: ::UnityEngine::Rendering::Universal::UTess::Tessellator::TestHullEventLe
    struct TestHullEventLe;
    // Nested type: ::UnityEngine::Rendering::Universal::UTess::Tessellator::TestHullEventE
    struct TestHullEventE;
    // Nested type: ::UnityEngine::Rendering::Universal::UTess::Tessellator::TestEdgePointE
    struct TestEdgePointE;
    // Nested type: ::UnityEngine::Rendering::Universal::UTess::Tessellator::TestCellE
    struct TestCellE;
    public:
    // private Unity.Collections.NativeArray`1<Unity.Mathematics.int2> m_Edges
    // Size: 0xFFFFFFFF
    // Offset: 0x0
    ::Unity::Collections::NativeArray_1<::Unity::Mathematics::int2> m_Edges;
    // private Unity.Collections.NativeArray`1<UnityEngine.Rendering.Universal.UTess.UStar> m_Stars
    // Size: 0xFFFFFFFF
    // Offset: 0x10
    ::Unity::Collections::NativeArray_1<::UnityEngine::Rendering::Universal::UTess::UStar> m_Stars;
    // private Unity.Collections.NativeArray`1<Unity.Mathematics.int3> m_Cells
    // Size: 0xFFFFFFFF
    // Offset: 0x20
    ::Unity::Collections::NativeArray_1<::Unity::Mathematics::int3> m_Cells;
    // private System.Int32 m_CellCount
    // Size: 0x4
    // Offset: 0x30
    int m_CellCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private Unity.Collections.NativeArray`1<System.Int32> m_ILArray
    // Size: 0xFFFFFFFF
    // Offset: 0x38
    ::Unity::Collections::NativeArray_1<int> m_ILArray;
    // private Unity.Collections.NativeArray`1<System.Int32> m_IUArray
    // Size: 0xFFFFFFFF
    // Offset: 0x48
    ::Unity::Collections::NativeArray_1<int> m_IUArray;
    // private Unity.Collections.NativeArray`1<System.Int32> m_SPArray
    // Size: 0xFFFFFFFF
    // Offset: 0x58
    ::Unity::Collections::NativeArray_1<int> m_SPArray;
    // private System.Int32 m_NumEdges
    // Size: 0x4
    // Offset: 0x68
    int m_NumEdges;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_NumHulls
    // Size: 0x4
    // Offset: 0x6C
    int m_NumHulls;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_NumPoints
    // Size: 0x4
    // Offset: 0x70
    int m_NumPoints;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_StarCount
    // Size: 0x4
    // Offset: 0x74
    int m_StarCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private Unity.Collections.NativeArray`1<System.Int32> m_Flags
    // Size: 0xFFFFFFFF
    // Offset: 0x78
    ::Unity::Collections::NativeArray_1<int> m_Flags;
    // private Unity.Collections.NativeArray`1<System.Int32> m_Neighbors
    // Size: 0xFFFFFFFF
    // Offset: 0x88
    ::Unity::Collections::NativeArray_1<int> m_Neighbors;
    // private Unity.Collections.NativeArray`1<System.Int32> m_Constraints
    // Size: 0xFFFFFFFF
    // Offset: 0x98
    ::Unity::Collections::NativeArray_1<int> m_Constraints;
    // private Unity.Collections.Allocator m_Allocator
    // Size: 0x4
    // Offset: 0xA8
    ::Unity::Collections::Allocator m_Allocator;
    // Field size check
    static_assert(sizeof(::Unity::Collections::Allocator) == 0x4);
    public:
    // Creating value type constructor for type: Tessellator
