// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.ScriptableObject
#include "UnityEngine/ScriptableObject.hpp"
// Including type: Technie.PhysicsCreator.IEditorData
#include "Technie/PhysicsCreator/IEditorData.hpp"
// Including type: Technie.PhysicsCreator.Skinned.ColliderType
#include "Technie/PhysicsCreator/Skinned/ColliderType.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Technie::PhysicsCreator::Skinned
namespace Technie::PhysicsCreator::Skinned {
  // Forward declaring type: SkinnedColliderRuntimeData
  class SkinnedColliderRuntimeData;
  // Forward declaring type: BoneData
  class BoneData;
  // Forward declaring type: BoneHullData
  class BoneHullData;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: PhysicMaterial
  class PhysicMaterial;
  // Forward declaring type: Mesh
  class Mesh;
  // Forward declaring type: Transform
  class Transform;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: Technie::PhysicsCreator
namespace Technie::PhysicsCreator {
  // Forward declaring type: Hash160
  class Hash160;
  // Forward declaring type: IHull
  class IHull;
}
// Completed forward declares
// Type namespace: Technie.PhysicsCreator.Skinned
namespace Technie::PhysicsCreator::Skinned {
  // Forward declaring type: SkinnedColliderEditorData
  class SkinnedColliderEditorData;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Technie::PhysicsCreator::Skinned::SkinnedColliderEditorData);
DEFINE_IL2CPP_ARG_TYPE(::Technie::PhysicsCreator::Skinned::SkinnedColliderEditorData*, "Technie.PhysicsCreator.Skinned", "SkinnedColliderEditorData");
// Type namespace: Technie.PhysicsCreator.Skinned
namespace Technie::PhysicsCreator::Skinned {
  // Size: 0x79
  #pragma pack(push, 1)
  // Autogenerated type: Technie.PhysicsCreator.Skinned.SkinnedColliderEditorData
  // [TokenAttribute] Offset: FFFFFFFF
  class SkinnedColliderEditorData : public ::UnityEngine::ScriptableObject/*, public ::Technie::PhysicsCreator::IEditorData*/ {
    public:
    public:
    // public Technie.PhysicsCreator.Skinned.SkinnedColliderRuntimeData runtimeData
    // Size: 0x8
    // Offset: 0x18
    ::Technie::PhysicsCreator::Skinned::SkinnedColliderRuntimeData* runtimeData;
    // Field size check
    static_assert(sizeof(::Technie::PhysicsCreator::Skinned::SkinnedColliderRuntimeData*) == 0x8);
    // public System.Single defaultMass
    // Size: 0x4
    // Offset: 0x20
    float defaultMass;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single defaultLinearDrag
    // Size: 0x4
    // Offset: 0x24
    float defaultLinearDrag;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single defaultAngularDrag
    // Size: 0x4
    // Offset: 0x28
    float defaultAngularDrag;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single defaultLinearDamping
    // Size: 0x4
    // Offset: 0x2C
    float defaultLinearDamping;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single defaultAngularDamping
    // Size: 0x4
    // Offset: 0x30
    float defaultAngularDamping;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: defaultAngularDamping and: defaultMaterial
    char __padding5[0x4] = {};
    // public UnityEngine.PhysicMaterial defaultMaterial
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::PhysicMaterial* defaultMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::PhysicMaterial*) == 0x8);
    // public Technie.PhysicsCreator.Skinned.ColliderType defaultColliderType
    // Size: 0x4
    // Offset: 0x40
    ::Technie::PhysicsCreator::Skinned::ColliderType defaultColliderType;
    // Field size check
    static_assert(sizeof(::Technie::PhysicsCreator::Skinned::ColliderType) == 0x4);
    // Padding between fields: defaultColliderType and: boneData
    char __padding7[0x4] = {};
    // public System.Collections.Generic.List`1<Technie.PhysicsCreator.Skinned.BoneData> boneData
    // Size: 0x8
    // Offset: 0x48
    ::System::Collections::Generic::List_1<::Technie::PhysicsCreator::Skinned::BoneData*>* boneData;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Technie::PhysicsCreator::Skinned::BoneData*>*) == 0x8);
    // public System.Collections.Generic.List`1<Technie.PhysicsCreator.Skinned.BoneHullData> boneHullData
    // Size: 0x8
    // Offset: 0x50
    ::System::Collections::Generic::List_1<::Technie::PhysicsCreator::Skinned::BoneHullData*>* boneHullData;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Technie::PhysicsCreator::Skinned::BoneHullData*>*) == 0x8);
    // private System.Int32 selectedBoneIndex
    // Size: 0x4
    // Offset: 0x58
    int selectedBoneIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 selectedHullIndex
    // Size: 0x4
    // Offset: 0x5C
    int selectedHullIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 lastModifiedFrame
    // Size: 0x4
    // Offset: 0x60
    int lastModifiedFrame;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: lastModifiedFrame and: sourceMesh
    char __padding12[0x4] = {};
    // public UnityEngine.Mesh sourceMesh
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::Mesh* sourceMesh;
    // Field size check
    static_assert(sizeof(::UnityEngine::Mesh*) == 0x8);
    // public Technie.PhysicsCreator.Hash160 sourceMeshHash
    // Size: 0x8
    // Offset: 0x70
    ::Technie::PhysicsCreator::Hash160* sourceMeshHash;
    // Field size check
    static_assert(sizeof(::Technie::PhysicsCreator::Hash160*) == 0x8);
    // public System.Boolean suppressMeshModificationWarning
    // Size: 0x1
    // Offset: 0x78
    bool suppressMeshModificationWarning;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating interface conversion operator: operator ::Technie::PhysicsCreator::IEditorData
    operator ::Technie::PhysicsCreator::IEditorData() noexcept {
      return *reinterpret_cast<::Technie::PhysicsCreator::IEditorData*>(this);
    }
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // static field const value: static public System.Int32 INVALID_INDEX
    static constexpr const int INVALID_INDEX = -1;
    // Get static field: static public System.Int32 INVALID_INDEX
    static int _get_INVALID_INDEX();
    // Set static field: static public System.Int32 INVALID_INDEX
    static void _set_INVALID_INDEX(int value);
    // Get instance field reference: public Technie.PhysicsCreator.Skinned.SkinnedColliderRuntimeData runtimeData
