// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Collider
  class Collider;
}
// Completed forward declares
// Type namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: ContactPoint
  struct ContactPoint;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::ContactPoint, "UnityEngine", "ContactPoint");
// Type namespace: UnityEngine
namespace UnityEngine {
  // Size: 0x30
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: UnityEngine.ContactPoint
  // [TokenAttribute] Offset: FFFFFFFF
  // [UsedByNativeCodeAttribute] Offset: FFFFFFFF
  // [NativeHeaderAttribute] Offset: FFFFFFFF
  struct ContactPoint/*, public ::System::ValueType*/ {
    public:
    public:
    // UnityEngine.Vector3 m_Point
    // Size: 0xC
    // Offset: 0x0
    ::UnityEngine::Vector3 m_Point;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // UnityEngine.Vector3 m_Normal
    // Size: 0xC
    // Offset: 0xC
    ::UnityEngine::Vector3 m_Normal;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // UnityEngine.Vector3 m_Impulse
    // Size: 0xC
    // Offset: 0x18
    ::UnityEngine::Vector3 m_Impulse;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // System.Int32 m_ThisColliderInstanceID
    // Size: 0x4
    // Offset: 0x24
    int m_ThisColliderInstanceID;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 m_OtherColliderInstanceID
    // Size: 0x4
    // Offset: 0x28
    int m_OtherColliderInstanceID;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Single m_Separation
    // Size: 0x4
    // Offset: 0x2C
    float m_Separation;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Creating value type constructor for type: ContactPoint
    constexpr ContactPoint(::UnityEngine::Vector3 m_Point_ = {}, ::UnityEngine::Vector3 m_Normal_ = {}, ::UnityEngine::Vector3 m_Impulse_ = {}, int m_ThisColliderInstanceID_ = {}, int m_OtherColliderInstanceID_ = {}, float m_Separation_ = {}) noexcept : m_Point{m_Point_}, m_Normal{m_Normal_}, m_Impulse{m_Impulse_}, m_ThisColliderInstanceID{m_ThisColliderInstanceID_}, m_OtherColliderInstanceID{m_OtherColliderInstanceID_}, m_Separation{m_Separation_} {}
    // Creating interface conversion operator: operator ::System::ValueType
    operator ::System::ValueType() noexcept {
      return *reinterpret_cast<::System::ValueType*>(this);
    }
    // Get instance field reference: UnityEngine.Vector3 m_Point
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_m_Point();
    // Get instance field reference: UnityEngine.Vector3 m_Normal
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_m_Normal();
    // Get instance field reference: UnityEngine.Vector3 m_Impulse
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_m_Impulse();
    // Get instance field reference: System.Int32 m_ThisColliderInstanceID
    [[deprecated("Use field access instead!")]] int& dyn_m_ThisColliderInstanceID();
    // Get instance field reference: System.Int32 m_OtherColliderInstanceID
    [[deprecated("Use field access instead!")]] int& dyn_m_OtherColliderInstanceID();
    // Get instance field reference: System.Single m_Separation
    [[deprecated("Use field access instead!")]] float& dyn_m_Separation();
    // public UnityEngine.Vector3 get_point()
    // Offset: 0x5534A48
    ::UnityEngine::Vector3 get_point();
    // public UnityEngine.Vector3 get_normal()
    // Offset: 0x5534A54
    ::UnityEngine::Vector3 get_normal();
    // public UnityEngine.Collider get_thisCollider()
    // Offset: 0x5534A60
    ::UnityEngine::Collider* get_thisCollider();
    // System.Void .ctor(UnityEngine.Vector3 point, UnityEngine.Vector3 normal, UnityEngine.Vector3 impulse, System.Single separation, System.Int32 thisInstanceID, System.Int32 otherInstenceID)
    // Offset: 0x5528230
    ContactPoint(::UnityEngine::Vector3 point, ::UnityEngine::Vector3 normal, ::UnityEngine::Vector3 impulse, float separation, int thisInstanceID, int otherInstenceID);
  }; // UnityEngine.ContactPoint
  #pragma pack(pop)
  static check_size<sizeof(ContactPoint), 44 + sizeof(float)> __UnityEngine_ContactPointSizeCheck;
  static_assert(sizeof(ContactPoint) == 0x30);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: UnityEngine::ContactPoint::get_point
// Il2CppName: get_point
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::Vector3 (UnityEngine::ContactPoint::*)()>(&UnityEngine::ContactPoint::get_point)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::ContactPoint), "get_point", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: UnityEngine::ContactPoint::get_normal
// Il2CppName: get_normal
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::Vector3 (UnityEngine::ContactPoint::*)()>(&UnityEngine::ContactPoint::get_normal)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::ContactPoint), "get_normal", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: UnityEngine::ContactPoint::get_thisCollider
// Il2CppName: get_thisCollider
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::Collider* (UnityEngine::ContactPoint::*)()>(&UnityEngine::ContactPoint::get_thisCollider)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::ContactPoint), "get_thisCollider", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: UnityEngine::ContactPoint::ContactPoint
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
