// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.Component
#include "UnityEngine/Component.hpp"
// Including type: UnityEngine.Vector4
#include "UnityEngine/Vector4.hpp"
// Including type: Unity.Jobs.LowLevel.Unsafe.JobsUtility
#include "Unity/Jobs/LowLevel/Unsafe/JobsUtility.hpp"
// Including type: UnityEngine.Color32
#include "UnityEngine/Color32.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Color
  struct Color;
  // Forward declaring type: ParticleSystemSimulationSpace
  struct ParticleSystemSimulationSpace;
  // Forward declaring type: ParticleSystemScalingMode
  struct ParticleSystemScalingMode;
  // Forward declaring type: ParticleSystemCustomData
  struct ParticleSystemCustomData;
  // Forward declaring type: ParticleSystemStopBehavior
  struct ParticleSystemStopBehavior;
  // Skipping declaration: Particle because it is already included!
}
// Forward declaring namespace: System
namespace System {
  // Skipping declaration: IntPtr because it is already included!
}
// Forward declaring namespace: Unity::Collections
namespace Unity::Collections {
  // Forward declaring type: NativeArray`1<T>
  template<typename T>
  struct NativeArray_1;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: Unity::Jobs
namespace Unity::Jobs {
  // Forward declaring type: JobHandle
  struct JobHandle;
}
// Forward declaring namespace: UnityEngine::ParticleSystemJobs
namespace UnityEngine::ParticleSystemJobs {
  // Forward declaring type: NativeParticleData
  struct NativeParticleData;
}
// Completed forward declares
// Type namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: ParticleSystem
  class ParticleSystem;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::ParticleSystem);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::ParticleSystem*, "UnityEngine", "ParticleSystem");
// Type namespace: UnityEngine
namespace UnityEngine {
  // Size: 0x18
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.ParticleSystem
  // [TokenAttribute] Offset: FFFFFFFF
  // [NativeHeaderAttribute] Offset: FFFFFFFF
  // [NativeHeaderAttribute] Offset: FFFFFFFF
  // [NativeHeaderAttribute] Offset: FFFFFFFF
  // [NativeHeaderAttribute] Offset: FFFFFFFF
  // [NativeHeaderAttribute] Offset: FFFFFFFF
  // [NativeHeaderAttribute] Offset: FFFFFFFF
  // [NativeHeaderAttribute] Offset: FFFFFFFF
  // [UsedByNativeCodeAttribute] Offset: FFFFFFFF
  // [RequireComponent] Offset: FFFFFFFF
  // [NativeHeaderAttribute] Offset: FFFFFFFF
  class ParticleSystem : public ::UnityEngine::Component {
    public:
    // Nested type: ::UnityEngine::ParticleSystem::MainModule
    struct MainModule;
    // Nested type: ::UnityEngine::ParticleSystem::EmissionModule
    struct EmissionModule;
    // Nested type: ::UnityEngine::ParticleSystem::ShapeModule
    struct ShapeModule;
    // Nested type: ::UnityEngine::ParticleSystem::CollisionModule
    struct CollisionModule;
    // Nested type: ::UnityEngine::ParticleSystem::TriggerModule
    struct TriggerModule;
    // Nested type: ::UnityEngine::ParticleSystem::SubEmittersModule
    struct SubEmittersModule;
    // Nested type: ::UnityEngine::ParticleSystem::TextureSheetAnimationModule
    struct TextureSheetAnimationModule;
    // Nested type: ::UnityEngine::ParticleSystem::Particle
    struct Particle;
    // Nested type: ::UnityEngine::ParticleSystem::Burst
    struct Burst;
    // Nested type: ::UnityEngine::ParticleSystem::MinMaxCurve
    struct MinMaxCurve;
    // Nested type: ::UnityEngine::ParticleSystem::MinMaxGradient
    struct MinMaxGradient;
    // Nested type: ::UnityEngine::ParticleSystem::EmitParams
    struct EmitParams;
    // Nested type: ::UnityEngine::ParticleSystem::PlaybackState
    struct PlaybackState;
    // Nested type: ::UnityEngine::ParticleSystem::Trails
    struct Trails;
    // Nested type: ::UnityEngine::ParticleSystem::VelocityOverLifetimeModule
    struct VelocityOverLifetimeModule;
    // Nested type: ::UnityEngine::ParticleSystem::LimitVelocityOverLifetimeModule
    struct LimitVelocityOverLifetimeModule;
    // Nested type: ::UnityEngine::ParticleSystem::InheritVelocityModule
    struct InheritVelocityModule;
    // Nested type: ::UnityEngine::ParticleSystem::LifetimeByEmitterSpeedModule
    struct LifetimeByEmitterSpeedModule;
    // Nested type: ::UnityEngine::ParticleSystem::ForceOverLifetimeModule
    struct ForceOverLifetimeModule;
    // Nested type: ::UnityEngine::ParticleSystem::ColorOverLifetimeModule
    struct ColorOverLifetimeModule;
    // Nested type: ::UnityEngine::ParticleSystem::ColorBySpeedModule
    struct ColorBySpeedModule;
    // Nested type: ::UnityEngine::ParticleSystem::SizeOverLifetimeModule
    struct SizeOverLifetimeModule;
    // Nested type: ::UnityEngine::ParticleSystem::SizeBySpeedModule
    struct SizeBySpeedModule;
    // Nested type: ::UnityEngine::ParticleSystem::RotationOverLifetimeModule
    struct RotationOverLifetimeModule;
    // Nested type: ::UnityEngine::ParticleSystem::RotationBySpeedModule
    struct RotationBySpeedModule;
    // Nested type: ::UnityEngine::ParticleSystem::ExternalForcesModule
    struct ExternalForcesModule;
    // Nested type: ::UnityEngine::ParticleSystem::NoiseModule
    struct NoiseModule;
    // Nested type: ::UnityEngine::ParticleSystem::LightsModule
    struct LightsModule;
    // Nested type: ::UnityEngine::ParticleSystem::TrailModule
    struct TrailModule;
    // Nested type: ::UnityEngine::ParticleSystem::CustomDataModule
    struct CustomDataModule;
    // Size: 0x84
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.ParticleSystem/Particle
    // [TokenAttribute] Offset: FFFFFFFF
    // [RequiredByNativeCodeAttribute] Offset: FFFFFFFF
    struct Particle/*, public ::System::ValueType*/ {
      public:
      public:
      // private UnityEngine.Vector3 m_Position
      // Size: 0xC
      // Offset: 0x0
      ::UnityEngine::Vector3 m_Position;
      // Field size check
      static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
      // private UnityEngine.Vector3 m_Velocity
      // Size: 0xC
      // Offset: 0xC
      ::UnityEngine::Vector3 m_Velocity;
      // Field size check
      static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
      // private UnityEngine.Vector3 m_AnimatedVelocity
      // Size: 0xC
      // Offset: 0x18
      ::UnityEngine::Vector3 m_AnimatedVelocity;
      // Field size check
      static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
      // private UnityEngine.Vector3 m_InitialVelocity
      // Size: 0xC
      // Offset: 0x24
      ::UnityEngine::Vector3 m_InitialVelocity;
      // Field size check
      static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
      // private UnityEngine.Vector3 m_AxisOfRotation
      // Size: 0xC
      // Offset: 0x30
      ::UnityEngine::Vector3 m_AxisOfRotation;
      // Field size check
      static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
      // private UnityEngine.Vector3 m_Rotation
      // Size: 0xC
      // Offset: 0x3C
      ::UnityEngine::Vector3 m_Rotation;
      // Field size check
      static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
      // private UnityEngine.Vector3 m_AngularVelocity
      // Size: 0xC
      // Offset: 0x48
      ::UnityEngine::Vector3 m_AngularVelocity;
      // Field size check
      static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
      // private UnityEngine.Vector3 m_StartSize
      // Size: 0xC
      // Offset: 0x54
      ::UnityEngine::Vector3 m_StartSize;
      // Field size check
      static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
      // private UnityEngine.Color32 m_StartColor
      // Size: 0x4
      // Offset: 0x60
      ::UnityEngine::Color32 m_StartColor;
      // Field size check
      static_assert(sizeof(::UnityEngine::Color32) == 0x4);
      // private System.UInt32 m_RandomSeed
      // Size: 0x4
      // Offset: 0x64
      uint m_RandomSeed;
      // Field size check
      static_assert(sizeof(uint) == 0x4);
      // private System.UInt32 m_ParentRandomSeed
      // Size: 0x4
      // Offset: 0x68
      uint m_ParentRandomSeed;
      // Field size check
      static_assert(sizeof(uint) == 0x4);
      // private System.Single m_Lifetime
      // Size: 0x4
      // Offset: 0x6C
      float m_Lifetime;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // private System.Single m_StartLifetime
      // Size: 0x4
      // Offset: 0x70
      float m_StartLifetime;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // private System.Int32 m_MeshIndex
      // Size: 0x4
      // Offset: 0x74
      int m_MeshIndex;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // private System.Single m_EmitAccumulator0
      // Size: 0x4
      // Offset: 0x78
      float m_EmitAccumulator0;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // private System.Single m_EmitAccumulator1
      // Size: 0x4
      // Offset: 0x7C
      float m_EmitAccumulator1;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // private System.UInt32 m_Flags
      // Size: 0x4
      // Offset: 0x80
      uint m_Flags;
      // Field size check
      static_assert(sizeof(uint) == 0x4);
      public:
      // Creating value type constructor for type: Particle
