// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.TextEditor/DblClickSnapping
#include "UnityEngine/TextEditor.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
// Including type: System.Char
#include "System/Char.hpp"
// Including type: UnityEngine.TextSelectOp
#include "UnityEngine/TextSelectOp.hpp"
// Including type: UnityEngine.TextCore.Text.TextElementInfo
#include "UnityEngine/TextCore/Text/TextElementInfo.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Event
  class Event;
  // Skipping declaration: Vector2 because it is already included!
}
// Forward declaring namespace: UnityEngine::TextCore::Text
namespace UnityEngine::TextCore::Text {
  // Forward declaring type: TextHandle
  class TextHandle;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Completed forward declares
// Type namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: TextSelectingUtilities
  class TextSelectingUtilities;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::TextSelectingUtilities);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::TextSelectingUtilities*, "UnityEngine", "TextSelectingUtilities");
// Type namespace: UnityEngine
namespace UnityEngine {
  // Size: 0x50
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.TextSelectingUtilities
  // [TokenAttribute] Offset: FFFFFFFF
  class TextSelectingUtilities : public ::Il2CppObject {
    public:
    // Nested type: ::UnityEngine::TextSelectingUtilities::CharacterType
    struct CharacterType;
    // Nested type: ::UnityEngine::TextSelectingUtilities::Direction
    struct Direction;
    public:
    // public UnityEngine.TextEditor/DblClickSnapping dblClickSnap
    // Size: 0x1
    // Offset: 0x10
    ::UnityEngine::TextEditor::DblClickSnapping dblClickSnap;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextEditor::DblClickSnapping) == 0x1);
    // Padding between fields: dblClickSnap and: iAltCursorPos
    char __padding0[0x3] = {};
    // public System.Int32 iAltCursorPos
    // Size: 0x4
    // Offset: 0x14
    int iAltCursorPos;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Boolean hasHorizontalCursorPos
    // Size: 0x1
    // Offset: 0x18
    bool hasHorizontalCursorPos;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_bJustSelected
    // Size: 0x1
    // Offset: 0x19
    bool m_bJustSelected;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_MouseDragSelectsWholeWords
    // Size: 0x1
    // Offset: 0x1A
    bool m_MouseDragSelectsWholeWords;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_MouseDragSelectsWholeWords and: m_DblClickInitPos
    char __padding4[0x1] = {};
    // private System.Int32 m_DblClickInitPos
    // Size: 0x4
    // Offset: 0x1C
    int m_DblClickInitPos;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.TextCore.Text.TextHandle m_TextHandle
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::TextCore::Text::TextHandle* m_TextHandle;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextCore::Text::TextHandle*) == 0x8);
    // private System.Boolean m_RevealCursor
    // Size: 0x1
    // Offset: 0x28
    bool m_RevealCursor;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_RevealCursor and: m_CursorIndex
    char __padding7[0x3] = {};
    // private System.Int32 m_CursorIndex
    // Size: 0x4
    // Offset: 0x2C
    int m_CursorIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 m_SelectIndex
    // Size: 0x4
    // Offset: 0x30
    int m_SelectIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: m_SelectIndex and: OnCursorIndexChange
    char __padding9[0x4] = {};
    // System.Action OnCursorIndexChange
    // Size: 0x8
    // Offset: 0x38
    ::System::Action* OnCursorIndexChange;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // System.Action OnSelectIndexChange
    // Size: 0x8
    // Offset: 0x40
    ::System::Action* OnSelectIndexChange;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // System.Action OnRevealCursorChange
    // Size: 0x8
    // Offset: 0x48
    ::System::Action* OnRevealCursorChange;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    public:
    // static field const value: static private System.Int32 kMoveDownHeight
    static constexpr const int kMoveDownHeight = 5;
    // Get static field: static private System.Int32 kMoveDownHeight
    static int _get_kMoveDownHeight();
    // Set static field: static private System.Int32 kMoveDownHeight
    static void _set_kMoveDownHeight(int value);
    // static field const value: static private System.Char kNewLineChar
    static constexpr const ::Il2CppChar kNewLineChar = u'\u000a';
    // Get static field: static private System.Char kNewLineChar
    static ::Il2CppChar _get_kNewLineChar();
    // Set static field: static private System.Char kNewLineChar
    static void _set_kNewLineChar(::Il2CppChar value);
