// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include <initializer_list>
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.ResourceManagement.Util.BinaryStorageBuffer
#include "UnityEngine/ResourceManagement/Util/BinaryStorageBuffer.hpp"
// Including type: UnityEngine.Hash128
#include "UnityEngine/Hash128.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::ResourceManagement::Util
namespace UnityEngine::ResourceManagement::Util {
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: IEnumerable`1<T>
  template<typename T>
  class IEnumerable_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Type
  class Type;
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: Encoding
  class Encoding;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: Stream
  class Stream;
}
// Completed forward declares
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::ResourceManagement::Util::BinaryStorageBuffer::Writer);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::ResourceManagement::Util::BinaryStorageBuffer::Writer*, "UnityEngine.ResourceManagement.Util", "BinaryStorageBuffer/Writer");
// Type namespace: UnityEngine.ResourceManagement.Util
namespace UnityEngine::ResourceManagement::Util {
  // Size: 0x30
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.ResourceManagement.Util.BinaryStorageBuffer/Writer
  // [TokenAttribute] Offset: FFFFFFFF
  class BinaryStorageBuffer::Writer : public ::Il2CppObject {
    public:
    // Nested type: ::UnityEngine::ResourceManagement::Util::BinaryStorageBuffer::Writer::Chunk
    class Chunk;
    // Nested type: ::UnityEngine::ResourceManagement::Util::BinaryStorageBuffer::Writer::StringParts
    struct StringParts;
    // Size: 0xD
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.ResourceManagement.Util.BinaryStorageBuffer/Writer/StringParts
    // [TokenAttribute] Offset: FFFFFFFF
    struct StringParts/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.String str
      // Size: 0x8
      // Offset: 0x0
      ::StringW str;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      // public System.UInt32 dataSize
      // Size: 0x4
      // Offset: 0x8
      uint dataSize;
      // Field size check
      static_assert(sizeof(uint) == 0x4);
      // public System.Boolean isUnicode
      // Size: 0x1
      // Offset: 0xC
      bool isUnicode;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      public:
      // Creating value type constructor for type: StringParts
      constexpr StringParts(::StringW str_ = {}, uint dataSize_ = {}, bool isUnicode_ = {}) noexcept : str{str_}, dataSize{dataSize_}, isUnicode{isUnicode_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public System.String str
      [[deprecated("Use field access instead!")]] ::StringW& dyn_str();
      // Get instance field reference: public System.UInt32 dataSize
      [[deprecated("Use field access instead!")]] uint& dyn_dataSize();
      // Get instance field reference: public System.Boolean isUnicode
      [[deprecated("Use field access instead!")]] bool& dyn_isUnicode();
    }; // UnityEngine.ResourceManagement.Util.BinaryStorageBuffer/Writer/StringParts
    #pragma pack(pop)
    static check_size<sizeof(BinaryStorageBuffer::Writer::StringParts), 12 + sizeof(bool)> __UnityEngine_ResourceManagement_Util_BinaryStorageBuffer_Writer_StringPartsSizeCheck;
    static_assert(sizeof(BinaryStorageBuffer::Writer::StringParts) == 0xD);
    public:
    // private System.UInt32 totalBytes
    // Size: 0x4
    // Offset: 0x10
    uint totalBytes;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 defaulChunkSize
    // Size: 0x4
    // Offset: 0x14
    uint defaulChunkSize;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.Collections.Generic.List`1<UnityEngine.ResourceManagement.Util.BinaryStorageBuffer/Writer/Chunk> chunks
    // Size: 0x8
    // Offset: 0x18
    ::System::Collections::Generic::List_1<::UnityEngine::ResourceManagement::Util::BinaryStorageBuffer::Writer::Chunk*>* chunks;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::ResourceManagement::Util::BinaryStorageBuffer::Writer::Chunk*>*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<UnityEngine.Hash128,System.UInt32> existingValues
    // Size: 0x8
    // Offset: 0x20
    ::System::Collections::Generic::Dictionary_2<::UnityEngine::Hash128, uint>* existingValues;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::UnityEngine::Hash128, uint>*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.Type,UnityEngine.ResourceManagement.Util.BinaryStorageBuffer/ISerializationAdapter> serializationAdapters
    // Size: 0x8
    // Offset: 0x28
    ::System::Collections::Generic::Dictionary_2<::System::Type*, ::UnityEngine::ResourceManagement::Util::BinaryStorageBuffer::ISerializationAdapter*>* serializationAdapters;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::System::Type*, ::UnityEngine::ResourceManagement::Util::BinaryStorageBuffer::ISerializationAdapter*>*) == 0x8);
    public:
    // Get instance field reference: private System.UInt32 totalBytes
    [[deprecated("Use field access instead!")]] uint& dyn_totalBytes();
    // Get instance field reference: private System.UInt32 defaulChunkSize
    [[deprecated("Use field access instead!")]] uint& dyn_defaulChunkSize();
    // Get instance field reference: private System.Collections.Generic.List`1<UnityEngine.ResourceManagement.Util.BinaryStorageBuffer/Writer/Chunk> chunks
