// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: Fusion::Photon::Realtime
namespace Fusion::Photon::Realtime {
  // Forward declaring type: FriendInfo
  class FriendInfo;
}
// Completed forward declares
// Type namespace: Fusion.Photon.Realtime.Async
namespace Fusion::Photon::Realtime::Async {
  // Forward declaring type: PhotonMatchmakingCallbacks
  class PhotonMatchmakingCallbacks;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Fusion::Photon::Realtime::Async::PhotonMatchmakingCallbacks);
DEFINE_IL2CPP_ARG_TYPE(::Fusion::Photon::Realtime::Async::PhotonMatchmakingCallbacks*, "Fusion.Photon.Realtime.Async", "PhotonMatchmakingCallbacks");
// Type namespace: Fusion.Photon.Realtime.Async
namespace Fusion::Photon::Realtime::Async {
  // Size: 0x48
  #pragma pack(push, 1)
  // Autogenerated type: Fusion.Photon.Realtime.Async.PhotonMatchmakingCallbacks
  // [TokenAttribute] Offset: FFFFFFFF
  class PhotonMatchmakingCallbacks : public ::Il2CppObject {
    public:
    public:
    // public System.Action`1<System.Collections.Generic.List`1<Fusion.Photon.Realtime.FriendInfo>> FriendListUpdate
    // Size: 0x8
    // Offset: 0x10
    ::System::Action_1<::System::Collections::Generic::List_1<::Fusion::Photon::Realtime::FriendInfo*>*>* FriendListUpdate;
    // Field size check
    static_assert(sizeof(::System::Action_1<::System::Collections::Generic::List_1<::Fusion::Photon::Realtime::FriendInfo*>*>*) == 0x8);
    // public System.Action JoinedRoom
    // Size: 0x8
    // Offset: 0x18
    ::System::Action* JoinedRoom;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // public System.Action CreatedRoom
    // Size: 0x8
    // Offset: 0x20
    ::System::Action* CreatedRoom;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // public System.Action`2<System.Int16,System.String> JoinRoomFailed
    // Size: 0x8
    // Offset: 0x28
    ::System::Action_2<int16_t, ::StringW>* JoinRoomFailed;
    // Field size check
    static_assert(sizeof(::System::Action_2<int16_t, ::StringW>*) == 0x8);
    // public System.Action`2<System.Int16,System.String> JoinRoomRandomFailed
    // Size: 0x8
    // Offset: 0x30
    ::System::Action_2<int16_t, ::StringW>* JoinRoomRandomFailed;
    // Field size check
    static_assert(sizeof(::System::Action_2<int16_t, ::StringW>*) == 0x8);
    // public System.Action`2<System.Int16,System.String> CreateRoomFailed
    // Size: 0x8
    // Offset: 0x38
    ::System::Action_2<int16_t, ::StringW>* CreateRoomFailed;
    // Field size check
    static_assert(sizeof(::System::Action_2<int16_t, ::StringW>*) == 0x8);
    // public System.Action LeftRoom
    // Size: 0x8
    // Offset: 0x40
    ::System::Action* LeftRoom;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    public:
    // Get instance field reference: public System.Action`1<System.Collections.Generic.List`1<Fusion.Photon.Realtime.FriendInfo>> FriendListUpdate
    [[deprecated("Use field access instead!")]] ::System::Action_1<::System::Collections::Generic::List_1<::Fusion::Photon::Realtime::FriendInfo*>*>*& dyn_FriendListUpdate();
    // Get instance field reference: public System.Action JoinedRoom
    [[deprecated("Use field access instead!")]] ::System::Action*& dyn_JoinedRoom();
    // Get instance field reference: public System.Action CreatedRoom
    [[deprecated("Use field access instead!")]] ::System::Action*& dyn_CreatedRoom();
    // Get instance field reference: public System.Action`2<System.Int16,System.String> JoinRoomFailed
    [[deprecated("Use field access instead!")]] ::System::Action_2<int16_t, ::StringW>*& dyn_JoinRoomFailed();
    // Get instance field reference: public System.Action`2<System.Int16,System.String> JoinRoomRandomFailed
    [[deprecated("Use field access instead!")]] ::System::Action_2<int16_t, ::StringW>*& dyn_JoinRoomRandomFailed();
    // Get instance field reference: public System.Action`2<System.Int16,System.String> CreateRoomFailed
    [[deprecated("Use field access instead!")]] ::System::Action_2<int16_t, ::StringW>*& dyn_CreateRoomFailed();
    // Get instance field reference: public System.Action LeftRoom
    [[deprecated("Use field access instead!")]] ::System::Action*& dyn_LeftRoom();
    // public System.Void .ctor()
    // Offset: 0x2AFA0B0
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static PhotonMatchmakingCallbacks* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::Fusion::Photon::Realtime::Async::PhotonMatchmakingCallbacks::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<PhotonMatchmakingCallbacks*, creationType>()));
    }
  }; // Fusion.Photon.Realtime.Async.PhotonMatchmakingCallbacks
  #pragma pack(pop)
  static check_size<sizeof(PhotonMatchmakingCallbacks), 64 + sizeof(::System::Action*)> __Fusion_Photon_Realtime_Async_PhotonMatchmakingCallbacksSizeCheck;
  static_assert(sizeof(PhotonMatchmakingCallbacks) == 0x48);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Fusion::Photon::Realtime::Async::PhotonMatchmakingCallbacks::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
