// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: Oculus.Interaction.Throw.IVelocityCalculator
#include "Oculus/Interaction/Throw/IVelocityCalculator.hpp"
// Including type: Oculus.Interaction.Input.OneEuroFilterPropertyBlock
#include "Oculus/Interaction/Input/OneEuroFilterPropertyBlock.hpp"
// Including type: System.Nullable`1
#include "System/Nullable_1.hpp"
// Including type: UnityEngine.Pose
#include "UnityEngine/Pose.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Oculus::Interaction::Throw
namespace Oculus::Interaction::Throw {
  // Forward declaring type: IPoseInputDevice
  class IPoseInputDevice;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Func`1<TResult>
  template<typename TResult>
  class Func_1;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: ValueTuple`2<T1, T2>
  template<typename T1, typename T2>
  struct ValueTuple_2;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Skipping declaration: Object because it is already included!
  // Forward declaring type: Transform
  class Transform;
}
// Forward declaring namespace: Oculus::Interaction::Input
namespace Oculus::Interaction::Input {
  // Forward declaring type: IOneEuroFilter`1<TData>
  template<typename TData>
  class IOneEuroFilter_1;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: IReadOnlyList`1<T>
  template<typename T>
  class IReadOnlyList_1;
}
// Completed forward declares
// Type namespace: Oculus.Interaction.Throw
namespace Oculus::Interaction::Throw {
  // Forward declaring type: StandardVelocityCalculator
  class StandardVelocityCalculator;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Oculus::Interaction::Throw::StandardVelocityCalculator);
DEFINE_IL2CPP_ARG_TYPE(::Oculus::Interaction::Throw::StandardVelocityCalculator*, "Oculus.Interaction.Throw", "StandardVelocityCalculator");
// Type namespace: Oculus.Interaction.Throw
namespace Oculus::Interaction::Throw {
  // WARNING Size may be invalid!
  // Autogenerated type: Oculus.Interaction.Throw.StandardVelocityCalculator
  // [TokenAttribute] Offset: FFFFFFFF
  class StandardVelocityCalculator : public ::UnityEngine::MonoBehaviour/*, public ::Oculus::Interaction::Throw::IVelocityCalculator*/ {
    public:
    // Nested type: ::Oculus::Interaction::Throw::StandardVelocityCalculator::BufferingParams
    class BufferingParams;
    // Nested type: ::Oculus::Interaction::Throw::StandardVelocityCalculator::SamplePoseData
    struct SamplePoseData;
    // Nested type: ::Oculus::Interaction::Throw::StandardVelocityCalculator::$$c
    class $$c;
    // Size: 0x38
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: Oculus.Interaction.Throw.StandardVelocityCalculator/SamplePoseData
    // [TokenAttribute] Offset: FFFFFFFF
    struct SamplePoseData/*, public ::System::ValueType*/ {
      public:
      public:
      // public readonly UnityEngine.Pose TransformPose
      // Size: 0x1C
      // Offset: 0x0
      ::UnityEngine::Pose TransformPose;
      // Field size check
      static_assert(sizeof(::UnityEngine::Pose) == 0x1C);
      // public readonly UnityEngine.Vector3 LinearVelocity
      // Size: 0xC
      // Offset: 0x1C
      ::UnityEngine::Vector3 LinearVelocity;
      // Field size check
      static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
      // public readonly UnityEngine.Vector3 AngularVelocity
      // Size: 0xC
      // Offset: 0x28
      ::UnityEngine::Vector3 AngularVelocity;
      // Field size check
      static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
      // public readonly System.Single Time
      // Size: 0x4
      // Offset: 0x34
      float Time;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      public:
      // Creating value type constructor for type: SamplePoseData
      constexpr SamplePoseData(::UnityEngine::Pose TransformPose_ = {}, ::UnityEngine::Vector3 LinearVelocity_ = {}, ::UnityEngine::Vector3 AngularVelocity_ = {}, float Time_ = {}) noexcept : TransformPose{TransformPose_}, LinearVelocity{LinearVelocity_}, AngularVelocity{AngularVelocity_}, Time{Time_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public readonly UnityEngine.Pose TransformPose
      [[deprecated("Use field access instead!")]] ::UnityEngine::Pose& dyn_TransformPose();
      // Get instance field reference: public readonly UnityEngine.Vector3 LinearVelocity
      [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_LinearVelocity();
      // Get instance field reference: public readonly UnityEngine.Vector3 AngularVelocity
      [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_AngularVelocity();
      // Get instance field reference: public readonly System.Single Time
      [[deprecated("Use field access instead!")]] float& dyn_Time();
      // public System.Void .ctor(UnityEngine.Pose transformPose, UnityEngine.Vector3 linearVelocity, UnityEngine.Vector3 angularVelocity, System.Single time)
      // Offset: 0x47E5A74
      // ABORTED: conflicts with another method.  SamplePoseData(::UnityEngine::Pose transformPose, ::UnityEngine::Vector3 linearVelocity, ::UnityEngine::Vector3 angularVelocity, float time);
    }; // Oculus.Interaction.Throw.StandardVelocityCalculator/SamplePoseData
    #pragma pack(pop)
    static check_size<sizeof(StandardVelocityCalculator::SamplePoseData), 52 + sizeof(float)> __Oculus_Interaction_Throw_StandardVelocityCalculator_SamplePoseDataSizeCheck;
    static_assert(sizeof(StandardVelocityCalculator::SamplePoseData) == 0x38);
    public:
    // private UnityEngine.Object _throwInputDevice
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::Object* throwInputDevice;
    // Field size check
    static_assert(sizeof(::UnityEngine::Object*) == 0x8);
    // private Oculus.Interaction.Throw.IPoseInputDevice <ThrowInputDevice>k__BackingField
    // Size: 0x8
    // Offset: 0x28
    ::Oculus::Interaction::Throw::IPoseInputDevice* ThrowInputDevice;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::Throw::IPoseInputDevice*) == 0x8);
    // private UnityEngine.Vector3 _referenceOffset
    // Size: 0xC
    // Offset: 0x30
    ::UnityEngine::Vector3 referenceOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private Oculus.Interaction.Throw.StandardVelocityCalculator/BufferingParams _bufferingParams
    // Size: 0x8
    // Offset: 0x40
    ::Oculus::Interaction::Throw::StandardVelocityCalculator::BufferingParams* bufferingParams;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::Throw::StandardVelocityCalculator::BufferingParams*) == 0x8);
    // private System.Single _instantVelocityInfluence
    // Size: 0x4
    // Offset: 0x48
    float instantVelocityInfluence;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _trendVelocityInfluence
    // Size: 0x4
    // Offset: 0x4C
    float trendVelocityInfluence;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _tangentialVelocityInfluence
    // Size: 0x4
    // Offset: 0x50
    float tangentialVelocityInfluence;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _externalVelocityInfluence
    // Size: 0x4
    // Offset: 0x54
    float externalVelocityInfluence;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _stepBackTime
    // Size: 0x4
    // Offset: 0x58
    float stepBackTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _maxPercentZeroSamplesTrendVeloc
    // Size: 0x4
    // Offset: 0x5C
    float maxPercentZeroSamplesTrendVeloc;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private Oculus.Interaction.Input.OneEuroFilterPropertyBlock _filterProps
    // Size: 0xC
    // Offset: 0x60
    ::Oculus::Interaction::Input::OneEuroFilterPropertyBlock filterProps;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::Input::OneEuroFilterPropertyBlock) == 0xC);
    // private System.Single _updateFrequency
    // Size: 0x4
    // Offset: 0x6C
    float updateFrequency;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _updateLatency
    // Size: 0x4
    // Offset: 0x70
    float updateLatency;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _lastUpdateTime
    // Size: 0x4
    // Offset: 0x74
    float lastUpdateTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private Oculus.Interaction.Input.IOneEuroFilter`1<UnityEngine.Vector3> _linearVelocityFilter
    // Size: 0x8
    // Offset: 0x78
    ::Oculus::Interaction::Input::IOneEuroFilter_1<::UnityEngine::Vector3>* linearVelocityFilter;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::Input::IOneEuroFilter_1<::UnityEngine::Vector3>*) == 0x8);
    // private UnityEngine.Vector3 <AddedInstantLinearVelocity>k__BackingField
    // Size: 0xC
    // Offset: 0x80
    ::UnityEngine::Vector3 AddedInstantLinearVelocity;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 <AddedTrendLinearVelocity>k__BackingField
    // Size: 0xC
    // Offset: 0x8C
    ::UnityEngine::Vector3 AddedTrendLinearVelocity;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 <AddedTangentialLinearVelocity>k__BackingField
    // Size: 0xC
    // Offset: 0x98
    ::UnityEngine::Vector3 AddedTangentialLinearVelocity;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 <AxisOfRotation>k__BackingField
    // Size: 0xC
    // Offset: 0xA4
    ::UnityEngine::Vector3 AxisOfRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 <CenterOfMassToObject>k__BackingField
    // Size: 0xC
    // Offset: 0xB0
    ::UnityEngine::Vector3 CenterOfMassToObject;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 <TangentialDirection>k__BackingField
    // Size: 0xC
    // Offset: 0xBC
    ::UnityEngine::Vector3 TangentialDirection;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 <AxisOfRotationOrigin>k__BackingField
    // Size: 0xC
    // Offset: 0xC8
    ::UnityEngine::Vector3 AxisOfRotationOrigin;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Collections.Generic.List`1<Oculus.Interaction.Throw.ReleaseVelocityInformation> _currentThrowVelocities
    // Size: 0x8
    // Offset: 0xD8
    ::System::Collections::Generic::List_1<::Oculus::Interaction::Throw::ReleaseVelocityInformation>* currentThrowVelocities;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Oculus::Interaction::Throw::ReleaseVelocityInformation>*) == 0x8);
    // private System.Action`1<System.Collections.Generic.List`1<Oculus.Interaction.Throw.ReleaseVelocityInformation>> WhenThrowVelocitiesChanged
    // Size: 0x8
    // Offset: 0xE0
    ::System::Action_1<::System::Collections::Generic::List_1<::Oculus::Interaction::Throw::ReleaseVelocityInformation>*>* WhenThrowVelocitiesChanged;
    // Field size check
    static_assert(sizeof(::System::Action_1<::System::Collections::Generic::List_1<::Oculus::Interaction::Throw::ReleaseVelocityInformation>*>*) == 0x8);
    // private System.Action`1<Oculus.Interaction.Throw.ReleaseVelocityInformation> WhenNewSampleAvailable
    // Size: 0x8
    // Offset: 0xE8
    ::System::Action_1<::Oculus::Interaction::Throw::ReleaseVelocityInformation>* WhenNewSampleAvailable;
    // Field size check
    static_assert(sizeof(::System::Action_1<::Oculus::Interaction::Throw::ReleaseVelocityInformation>*) == 0x8);
    // private UnityEngine.Vector3 _linearVelocity
    // Size: 0xC
    // Offset: 0xF0
    ::UnityEngine::Vector3 linearVelocity;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 _angularVelocity
    // Size: 0xC
    // Offset: 0xFC
    ::UnityEngine::Vector3 angularVelocity;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Nullable`1<UnityEngine.Vector3> _previousReferencePosition
    // Size: 0xFFFFFFFF
    // Offset: 0x108
    ::System::Nullable_1<::UnityEngine::Vector3> previousReferencePosition;
    // private System.Nullable`1<UnityEngine.Quaternion> _previousReferenceRotation
    // Size: 0xFFFFFFFF
    // Offset: 0x118
    ::System::Nullable_1<::UnityEngine::Quaternion> previousReferenceRotation;
    // private System.Single _accumulatedDelta
    // Size: 0x4
    // Offset: 0x12C
    float accumulatedDelta;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Collections.Generic.List`1<Oculus.Interaction.Throw.StandardVelocityCalculator/SamplePoseData> _bufferedPoses
    // Size: 0x8
    // Offset: 0x130
    ::System::Collections::Generic::List_1<::Oculus::Interaction::Throw::StandardVelocityCalculator::SamplePoseData>* bufferedPoses;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Oculus::Interaction::Throw::StandardVelocityCalculator::SamplePoseData>*) == 0x8);
    // private System.Int32 _lastWritePos
    // Size: 0x4
    // Offset: 0x138
    int lastWritePos;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _bufferSize
    // Size: 0x4
    // Offset: 0x13C
    int bufferSize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Collections.Generic.List`1<Oculus.Interaction.Throw.StandardVelocityCalculator/SamplePoseData> _windowWithMovement
    // Size: 0x8
    // Offset: 0x140
    ::System::Collections::Generic::List_1<::Oculus::Interaction::Throw::StandardVelocityCalculator::SamplePoseData>* windowWithMovement;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Oculus::Interaction::Throw::StandardVelocityCalculator::SamplePoseData>*) == 0x8);
    // private System.Collections.Generic.List`1<Oculus.Interaction.Throw.StandardVelocityCalculator/SamplePoseData> _tempWindow
    // Size: 0x8
    // Offset: 0x148
    ::System::Collections::Generic::List_1<::Oculus::Interaction::Throw::StandardVelocityCalculator::SamplePoseData>* tempWindow;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Oculus::Interaction::Throw::StandardVelocityCalculator::SamplePoseData>*) == 0x8);
    // private System.Func`1<System.Single> _timeProvider
    // Size: 0x8
    // Offset: 0x150
    ::System::Func_1<float>* timeProvider;
    // Field size check
    static_assert(sizeof(::System::Func_1<float>*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::Oculus::Interaction::Throw::IVelocityCalculator
    operator ::Oculus::Interaction::Throw::IVelocityCalculator() noexcept {
      return *reinterpret_cast<::Oculus::Interaction::Throw::IVelocityCalculator*>(this);
    }
    // static field const value: static private System.Single _TREND_DOT_THRESHOLD
    static constexpr const float _TREND_DOT_THRESHOLD = 0.6;
    // Get static field: static private System.Single _TREND_DOT_THRESHOLD
    static float _get__TREND_DOT_THRESHOLD();
    // Set static field: static private System.Single _TREND_DOT_THRESHOLD
    static void _set__TREND_DOT_THRESHOLD(float value);
    // Get instance field reference: private UnityEngine.Object _throwInputDevice
