// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.XR.Interaction.Toolkit.AffordanceSystem.State.AffordanceStateData
#include "UnityEngine/XR/Interaction/Toolkit/AffordanceSystem/State/AffordanceStateData.hpp"
// Including type: Unity.Jobs.JobHandle
#include "Unity/Jobs/JobHandle.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Unity::XR::CoreUtils::Bindings::Variables
namespace Unity::XR::CoreUtils::Bindings::Variables {
  // Forward declaring type: BindableVariable`1<T>
  template<typename T>
  class BindableVariable_1;
  // Forward declaring type: IReadOnlyBindableVariable`1<T>
  template<typename T>
  class IReadOnlyBindableVariable_1;
}
// Forward declaring namespace: Unity::XR::CoreUtils::Collections
namespace Unity::XR::CoreUtils::Collections {
  // Forward declaring type: HashSetList`1<T>
  template<typename T>
  class HashSetList_1;
}
// Forward declaring namespace: UnityEngine::XR::Interaction::Toolkit::AffordanceSystem::Receiver
namespace UnityEngine::XR::Interaction::Toolkit::AffordanceSystem::Receiver {
  // Forward declaring type: IAsyncAffordanceStateReceiver
  class IAsyncAffordanceStateReceiver;
  // Forward declaring type: ISynchronousAffordanceStateReceiver
  class ISynchronousAffordanceStateReceiver;
  // Forward declaring type: IAffordanceStateReceiver
  class IAffordanceStateReceiver;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: Unity::XR::CoreUtils::Bindings
namespace Unity::XR::CoreUtils::Bindings {
  // Forward declaring type: BindingsGroup
  class BindingsGroup;
  // Forward declaring type: IEventBinding
  class IEventBinding;
}
// Completed forward declares
// Type namespace: UnityEngine.XR.Interaction.Toolkit.AffordanceSystem.State
namespace UnityEngine::XR::Interaction::Toolkit::AffordanceSystem::State {
  // Forward declaring type: BaseAffordanceStateProvider
  class BaseAffordanceStateProvider;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::XR::Interaction::Toolkit::AffordanceSystem::State::BaseAffordanceStateProvider);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::XR::Interaction::Toolkit::AffordanceSystem::State::BaseAffordanceStateProvider*, "UnityEngine.XR.Interaction.Toolkit.AffordanceSystem.State", "BaseAffordanceStateProvider");
// Type namespace: UnityEngine.XR.Interaction.Toolkit.AffordanceSystem.State
namespace UnityEngine::XR::Interaction::Toolkit::AffordanceSystem::State {
  // Size: 0x60
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.AffordanceSystem.State.BaseAffordanceStateProvider
  // [TokenAttribute] Offset: FFFFFFFF
  class BaseAffordanceStateProvider : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private System.Single m_TransitionDuration
    // Size: 0x4
    // Offset: 0x20
    float m_TransitionDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: m_TransitionDuration and: m_AffordanceStateData
    char __padding0[0x4] = {};
    // private readonly Unity.XR.CoreUtils.Bindings.Variables.BindableVariable`1<UnityEngine.XR.Interaction.Toolkit.AffordanceSystem.State.AffordanceStateData> m_AffordanceStateData
    // Size: 0x8
    // Offset: 0x28
    ::Unity::XR::CoreUtils::Bindings::Variables::BindableVariable_1<::UnityEngine::XR::Interaction::Toolkit::AffordanceSystem::State::AffordanceStateData>* m_AffordanceStateData;
    // Field size check
    static_assert(sizeof(::Unity::XR::CoreUtils::Bindings::Variables::BindableVariable_1<::UnityEngine::XR::Interaction::Toolkit::AffordanceSystem::State::AffordanceStateData>*) == 0x8);
    // private readonly Unity.XR.CoreUtils.Collections.HashSetList`1<UnityEngine.XR.Interaction.Toolkit.AffordanceSystem.Receiver.IAsyncAffordanceStateReceiver> m_AsyncAffordanceReceivers
    // Size: 0x8
    // Offset: 0x30
    ::Unity::XR::CoreUtils::Collections::HashSetList_1<::UnityEngine::XR::Interaction::Toolkit::AffordanceSystem::Receiver::IAsyncAffordanceStateReceiver*>* m_AsyncAffordanceReceivers;
    // Field size check
    static_assert(sizeof(::Unity::XR::CoreUtils::Collections::HashSetList_1<::UnityEngine::XR::Interaction::Toolkit::AffordanceSystem::Receiver::IAsyncAffordanceStateReceiver*>*) == 0x8);
    // private readonly Unity.XR.CoreUtils.Collections.HashSetList`1<UnityEngine.XR.Interaction.Toolkit.AffordanceSystem.Receiver.ISynchronousAffordanceStateReceiver> m_SynchronousAffordanceReceivers
    // Size: 0x8
    // Offset: 0x38
    ::Unity::XR::CoreUtils::Collections::HashSetList_1<::UnityEngine::XR::Interaction::Toolkit::AffordanceSystem::Receiver::ISynchronousAffordanceStateReceiver*>* m_SynchronousAffordanceReceivers;
    // Field size check
    static_assert(sizeof(::Unity::XR::CoreUtils::Collections::HashSetList_1<::UnityEngine::XR::Interaction::Toolkit::AffordanceSystem::Receiver::ISynchronousAffordanceStateReceiver*>*) == 0x8);
    // private readonly System.Collections.Generic.List`1<Unity.Jobs.JobHandle> m_ScheduledJobs
    // Size: 0x8
    // Offset: 0x40
    ::System::Collections::Generic::List_1<::Unity::Jobs::JobHandle>* m_ScheduledJobs;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Unity::Jobs::JobHandle>*) == 0x8);
    // private readonly Unity.XR.CoreUtils.Bindings.BindingsGroup m_BindingsGroup
    // Size: 0x8
    // Offset: 0x48
    ::Unity::XR::CoreUtils::Bindings::BindingsGroup* m_BindingsGroup;
    // Field size check
    static_assert(sizeof(::Unity::XR::CoreUtils::Bindings::BindingsGroup*) == 0x8);
    // private System.Single m_TimeSinceLastStateUpdate
    // Size: 0x4
    // Offset: 0x50
    float m_TimeSinceLastStateUpdate;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_IsFirstFrame
    // Size: 0x1
    // Offset: 0x54
    bool m_IsFirstFrame;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_CompletingTweens
    // Size: 0x1
    // Offset: 0x55
    bool m_CompletingTweens;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_CompletingTweens and: m_InterpolationSpeed
    char __padding8[0x2] = {};
    // private System.Single m_InterpolationSpeed
    // Size: 0x4
    // Offset: 0x58
    float m_InterpolationSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_MaxTransitionDuration
    // Size: 0x4
    // Offset: 0x5C
    float m_MaxTransitionDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Get instance field reference: private System.Single m_TransitionDuration
    [[deprecated("Use field access instead!")]] float& dyn_m_TransitionDuration();
    // Get instance field reference: private readonly Unity.XR.CoreUtils.Bindings.Variables.BindableVariable`1<UnityEngine.XR.Interaction.Toolkit.AffordanceSystem.State.AffordanceStateData> m_AffordanceStateData
    [[deprecated("Use field access instead!")]] ::Unity::XR::CoreUtils::Bindings::Variables::BindableVariable_1<::UnityEngine::XR::Interaction::Toolkit::AffordanceSystem::State::AffordanceStateData>*& dyn_m_AffordanceStateData();
    // Get instance field reference: private readonly Unity.XR.CoreUtils.Collections.HashSetList`1<UnityEngine.XR.Interaction.Toolkit.AffordanceSystem.Receiver.IAsyncAffordanceStateReceiver> m_AsyncAffordanceReceivers
