// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.XR.Interaction.Toolkit.AffordanceSystem.State.BaseAffordanceStateProvider
#include "UnityEngine/XR/Interaction/Toolkit/AffordanceSystem/State/BaseAffordanceStateProvider.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::XR::Interaction::Toolkit
namespace UnityEngine::XR::Interaction::Toolkit {
  // Forward declaring type: IXRInteractable
  class IXRInteractable;
  // Forward declaring type: IXRHoverInteractable
  class IXRHoverInteractable;
  // Forward declaring type: IXRSelectInteractable
  class IXRSelectInteractable;
  // Forward declaring type: IXRActivateInteractable
  class IXRActivateInteractable;
  // Forward declaring type: IXRInteractionStrengthInteractable
  class IXRInteractionStrengthInteractable;
  // Forward declaring type: InteractableRegisteredEventArgs
  class InteractableRegisteredEventArgs;
  // Forward declaring type: InteractableUnregisteredEventArgs

  // Skipping declaration: SelectClickAnimationMode because it is already included!
  // Skipping declaration: ActivateClickAnimationMode because it is already included!
  // Skipping declaration: AffordanceStateData because it is already included!
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Skipping declaration: Object because it is already included!
  // Forward declaring type: Coroutine
  class Coroutine;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
}
// Completed forward declares
// Type namespace: UnityEngine.XR.Interaction.Toolkit.AffordanceSystem.State
namespace UnityEngine::XR::Interaction::Toolkit::AffordanceSystem::State {
  // Forward declaring type: XRInteractableAffordanceStateProvider
  class XRInteractableAffordanceStateProvider;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::XR::Interaction::Toolkit::AffordanceSystem::State::XRInteractableAffordanceStateProvider);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::XR::Interaction::Toolkit::AffordanceSystem::State::XRInteractableAffordanceStateProvider*, "UnityEngine.XR.Interaction.Toolkit.AffordanceSystem.State", "XRInteractableAffordanceStateProvider");
// Type namespace: UnityEngine.XR.Interaction.Toolkit.AffordanceSystem.State
namespace UnityEngine::XR::Interaction::Toolkit::AffordanceSystem::State {
  // Size: 0xCC
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.AffordanceSystem.State.XRInteractableAffordanceStateProvider
  // [TokenAttribute] Offset: FFFFFFFF
  // [DisallowMultipleComponent] Offset: FFFFFFFF
  // [HelpURLAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: FFFFFFFF
  class XRInteractableAffordanceStateProvider : public ::UnityEngine::XR::Interaction::Toolkit::AffordanceSystem::State::BaseAffordanceStateProvider {
    public:
    // Nested type: ::UnityEngine::XR::Interaction::Toolkit::AffordanceSystem::State::XRInteractableAffordanceStateProvider::SelectClickAnimationMode
    struct SelectClickAnimationMode;
    // Nested type: ::UnityEngine::XR::Interaction::Toolkit::AffordanceSystem::State::XRInteractableAffordanceStateProvider::ActivateClickAnimationMode
    struct ActivateClickAnimationMode;
    // Nested type: ::UnityEngine::XR::Interaction::Toolkit::AffordanceSystem::State::XRInteractableAffordanceStateProvider::$ClickAnimation$d__80
    class $ClickAnimation$d__80;
    // Nested type: ::UnityEngine::XR::Interaction::Toolkit::AffordanceSystem::State::XRInteractableAffordanceStateProvider::$HoveredPriorityRoutine$d__82
    class $HoveredPriorityRoutine$d__82;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.AffordanceSystem.State.XRInteractableAffordanceStateProvider/SelectClickAnimationMode
    // [TokenAttribute] Offset: FFFFFFFF
    struct SelectClickAnimationMode/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: SelectClickAnimationMode
      constexpr SelectClickAnimationMode(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.AffordanceSystem.State.XRInteractableAffordanceStateProvider/SelectClickAnimationMode None
      static constexpr const int None = 0;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.AffordanceSystem.State.XRInteractableAffordanceStateProvider/SelectClickAnimationMode None
      static ::UnityEngine::XR::Interaction::Toolkit::AffordanceSystem::State::XRInteractableAffordanceStateProvider::SelectClickAnimationMode _get_None();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.AffordanceSystem.State.XRInteractableAffordanceStateProvider/SelectClickAnimationMode None
      static void _set_None(::UnityEngine::XR::Interaction::Toolkit::AffordanceSystem::State::XRInteractableAffordanceStateProvider::SelectClickAnimationMode value);
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.AffordanceSystem.State.XRInteractableAffordanceStateProvider/SelectClickAnimationMode SelectEntered
      static constexpr const int SelectEntered = 1;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.AffordanceSystem.State.XRInteractableAffordanceStateProvider/SelectClickAnimationMode SelectEntered
      static ::UnityEngine::XR::Interaction::Toolkit::AffordanceSystem::State::XRInteractableAffordanceStateProvider::SelectClickAnimationMode _get_SelectEntered();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.AffordanceSystem.State.XRInteractableAffordanceStateProvider/SelectClickAnimationMode SelectEntered
      static void _set_SelectEntered(::UnityEngine::XR::Interaction::Toolkit::AffordanceSystem::State::XRInteractableAffordanceStateProvider::SelectClickAnimationMode value);
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.AffordanceSystem.State.XRInteractableAffordanceStateProvider/SelectClickAnimationMode SelectExited
      static constexpr const int SelectExited = 2;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.AffordanceSystem.State.XRInteractableAffordanceStateProvider/SelectClickAnimationMode SelectExited
      static ::UnityEngine::XR::Interaction::Toolkit::AffordanceSystem::State::XRInteractableAffordanceStateProvider::SelectClickAnimationMode _get_SelectExited();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.AffordanceSystem.State.XRInteractableAffordanceStateProvider/SelectClickAnimationMode SelectExited
      static void _set_SelectExited(::UnityEngine::XR::Interaction::Toolkit::AffordanceSystem::State::XRInteractableAffordanceStateProvider::SelectClickAnimationMode value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.XR.Interaction.Toolkit.AffordanceSystem.State.XRInteractableAffordanceStateProvider/SelectClickAnimationMode
    #pragma pack(pop)
    static check_size<sizeof(XRInteractableAffordanceStateProvider::SelectClickAnimationMode), 0 + sizeof(int)> __UnityEngine_XR_Interaction_Toolkit_AffordanceSystem_State_XRInteractableAffordanceStateProvider_SelectClickAnimationModeSizeCheck;
    static_assert(sizeof(XRInteractableAffordanceStateProvider::SelectClickAnimationMode) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.XR.Interaction.Toolkit.AffordanceSystem.State.XRInteractableAffordanceStateProvider/ActivateClickAnimationMode
    // [TokenAttribute] Offset: FFFFFFFF
    struct ActivateClickAnimationMode/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: ActivateClickAnimationMode
      constexpr ActivateClickAnimationMode(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.AffordanceSystem.State.XRInteractableAffordanceStateProvider/ActivateClickAnimationMode None
      static constexpr const int None = 0;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.AffordanceSystem.State.XRInteractableAffordanceStateProvider/ActivateClickAnimationMode None
      static ::UnityEngine::XR::Interaction::Toolkit::AffordanceSystem::State::XRInteractableAffordanceStateProvider::ActivateClickAnimationMode _get_None();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.AffordanceSystem.State.XRInteractableAffordanceStateProvider/ActivateClickAnimationMode None
      static void _set_None(::UnityEngine::XR::Interaction::Toolkit::AffordanceSystem::State::XRInteractableAffordanceStateProvider::ActivateClickAnimationMode value);
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.AffordanceSystem.State.XRInteractableAffordanceStateProvider/ActivateClickAnimationMode Activated
      static constexpr const int Activated = 1;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.AffordanceSystem.State.XRInteractableAffordanceStateProvider/ActivateClickAnimationMode Activated
      static ::UnityEngine::XR::Interaction::Toolkit::AffordanceSystem::State::XRInteractableAffordanceStateProvider::ActivateClickAnimationMode _get_Activated();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.AffordanceSystem.State.XRInteractableAffordanceStateProvider/ActivateClickAnimationMode Activated
      static void _set_Activated(::UnityEngine::XR::Interaction::Toolkit::AffordanceSystem::State::XRInteractableAffordanceStateProvider::ActivateClickAnimationMode value);
      // static field const value: static public UnityEngine.XR.Interaction.Toolkit.AffordanceSystem.State.XRInteractableAffordanceStateProvider/ActivateClickAnimationMode Deactivated
      static constexpr const int Deactivated = 2;
      // Get static field: static public UnityEngine.XR.Interaction.Toolkit.AffordanceSystem.State.XRInteractableAffordanceStateProvider/ActivateClickAnimationMode Deactivated
      static ::UnityEngine::XR::Interaction::Toolkit::AffordanceSystem::State::XRInteractableAffordanceStateProvider::ActivateClickAnimationMode _get_Deactivated();
      // Set static field: static public UnityEngine.XR.Interaction.Toolkit.AffordanceSystem.State.XRInteractableAffordanceStateProvider/ActivateClickAnimationMode Deactivated
      static void _set_Deactivated(::UnityEngine::XR::Interaction::Toolkit::AffordanceSystem::State::XRInteractableAffordanceStateProvider::ActivateClickAnimationMode value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.XR.Interaction.Toolkit.AffordanceSystem.State.XRInteractableAffordanceStateProvider/ActivateClickAnimationMode
    #pragma pack(pop)
    static check_size<sizeof(XRInteractableAffordanceStateProvider::ActivateClickAnimationMode), 0 + sizeof(int)> __UnityEngine_XR_Interaction_Toolkit_AffordanceSystem_State_XRInteractableAffordanceStateProvider_ActivateClickAnimationModeSizeCheck;
    static_assert(sizeof(XRInteractableAffordanceStateProvider::ActivateClickAnimationMode) == 0x4);
    public:
    // private UnityEngine.Object m_InteractableSource
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::Object* m_InteractableSource;
    // Field size check
    static_assert(sizeof(::UnityEngine::Object*) == 0x8);
    // private System.Boolean m_IgnoreHoverEvents
    // Size: 0x1
    // Offset: 0x68
    bool m_IgnoreHoverEvents;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_IgnoreHoverPriorityEvents
    // Size: 0x1
    // Offset: 0x69
    bool m_IgnoreHoverPriorityEvents;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_IgnoreSelectEvents
    // Size: 0x1
    // Offset: 0x6A
    bool m_IgnoreSelectEvents;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_IgnoreActivateEvents
    // Size: 0x1
    // Offset: 0x6B
    bool m_IgnoreActivateEvents;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private UnityEngine.XR.Interaction.Toolkit.AffordanceSystem.State.XRInteractableAffordanceStateProvider/SelectClickAnimationMode m_SelectClickAnimationMode
    // Size: 0x4
    // Offset: 0x6C
    ::UnityEngine::XR::Interaction::Toolkit::AffordanceSystem::State::XRInteractableAffordanceStateProvider::SelectClickAnimationMode m_SelectClickAnimationMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::AffordanceSystem::State::XRInteractableAffordanceStateProvider::SelectClickAnimationMode) == 0x4);
    // private UnityEngine.XR.Interaction.Toolkit.AffordanceSystem.State.XRInteractableAffordanceStateProvider/ActivateClickAnimationMode m_ActivateClickAnimationMode
    // Size: 0x4
    // Offset: 0x70
    ::UnityEngine::XR::Interaction::Toolkit::AffordanceSystem::State::XRInteractableAffordanceStateProvider::ActivateClickAnimationMode m_ActivateClickAnimationMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::AffordanceSystem::State::XRInteractableAffordanceStateProvider::ActivateClickAnimationMode) == 0x4);
    // private System.Single m_ClickAnimationDuration
    // Size: 0x4
    // Offset: 0x74
    float m_ClickAnimationDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private Unity.XR.CoreUtils.Datums.AnimationCurveDatumProperty m_ClickAnimationCurve
    // Size: 0x8
    // Offset: 0x78
    ::Unity::XR::CoreUtils::Datums::AnimationCurveDatumProperty* m_ClickAnimationCurve;
    // Field size check
    static_assert(sizeof(::Unity::XR::CoreUtils::Datums::AnimationCurveDatumProperty*) == 0x8);
    // private UnityEngine.XR.Interaction.Toolkit.IXRInteractable m_Interactable
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::XR::Interaction::Toolkit::IXRInteractable* m_Interactable;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::IXRInteractable*) == 0x8);
    // private UnityEngine.XR.Interaction.Toolkit.IXRHoverInteractable m_HoverInteractable
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::XR::Interaction::Toolkit::IXRHoverInteractable* m_HoverInteractable;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::IXRHoverInteractable*) == 0x8);
    // private UnityEngine.XR.Interaction.Toolkit.IXRSelectInteractable m_SelectInteractable
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::XR::Interaction::Toolkit::IXRSelectInteractable* m_SelectInteractable;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::IXRSelectInteractable*) == 0x8);
    // private UnityEngine.XR.Interaction.Toolkit.IXRActivateInteractable m_ActivateInteractable
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::XR::Interaction::Toolkit::IXRActivateInteractable* m_ActivateInteractable;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::IXRActivateInteractable*) == 0x8);
    // private UnityEngine.XR.Interaction.Toolkit.IXRInteractionStrengthInteractable m_InteractionStrengthInteractable
    // Size: 0x8
    // Offset: 0xA0
    ::UnityEngine::XR::Interaction::Toolkit::IXRInteractionStrengthInteractable* m_InteractionStrengthInteractable;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::Interaction::Toolkit::IXRInteractionStrengthInteractable*) == 0x8);
    // private UnityEngine.Coroutine m_SelectedClickAnimation
    // Size: 0x8
    // Offset: 0xA8
    ::UnityEngine::Coroutine* m_SelectedClickAnimation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Coroutine*) == 0x8);
    // private UnityEngine.Coroutine m_ActivatedClickAnimation
    // Size: 0x8
    // Offset: 0xB0
    ::UnityEngine::Coroutine* m_ActivatedClickAnimation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Coroutine*) == 0x8);
    // private UnityEngine.Coroutine m_HoveredPriorityRoutine
    // Size: 0x8
    // Offset: 0xB8
    ::UnityEngine::Coroutine* m_HoveredPriorityRoutine;
    // Field size check
    static_assert(sizeof(::UnityEngine::Coroutine*) == 0x8);
    // private System.Boolean m_IsBoundToInteractionEvents
    // Size: 0x1
    // Offset: 0xC0
    bool m_IsBoundToInteractionEvents;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_IsActivated
    // Size: 0x1
    // Offset: 0xC1
    bool m_IsActivated;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_IsRegistered
    // Size: 0x1
    // Offset: 0xC2
    bool m_IsRegistered;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_IsHoveredPriority
    // Size: 0x1
    // Offset: 0xC3
    bool m_IsHoveredPriority;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_HasInteractionStrengthInteractable
    // Size: 0x1
    // Offset: 0xC4
    bool m_HasInteractionStrengthInteractable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_HasInteractionStrengthInteractable and: m_HoveringPriorityInteractorCount
    char __padding21[0x3] = {};
    // private System.Int32 m_HoveringPriorityInteractorCount
    // Size: 0x4
    // Offset: 0xC8
    int m_HoveringPriorityInteractorCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Get instance field reference: private UnityEngine.Object m_InteractableSource
    [[deprecated("Use field access instead!")]] ::UnityEngine::Object*& dyn_m_InteractableSource();
    // Get instance field reference: private System.Boolean m_IgnoreHoverEvents
    [[deprecated("Use field access instead!")]] bool& dyn_m_IgnoreHoverEvents();
    // Get instance field reference: private System.Boolean m_IgnoreHoverPriorityEvents
    [[deprecated("Use field access instead!")]] bool& dyn_m_IgnoreHoverPriorityEvents();
    // Get instance field reference: private System.Boolean m_IgnoreSelectEvents
    [[deprecated("Use field access instead!")]] bool& dyn_m_IgnoreSelectEvents();
    // Get instance field reference: private System.Boolean m_IgnoreActivateEvents
    [[deprecated("Use field access instead!")]] bool& dyn_m_IgnoreActivateEvents();
