// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.Experimental.Rendering.RenderGraphModule.RendererListHandle
#include "UnityEngine/Experimental/Rendering/RenderGraphModule/RendererListHandle.hpp"
// Including type: UnityEngine.Experimental.Rendering.RenderGraphModule.RenderGraphBuilder
#include "UnityEngine/Experimental/Rendering/RenderGraphModule/RenderGraphBuilder.hpp"
// Including type: UnityEngine.Experimental.Rendering.RenderGraphModule.RenderGraphDebugData
#include "UnityEngine/Experimental/Rendering/RenderGraphModule/RenderGraphDebugData.hpp"
// Including type: UnityEngine.Rendering.GraphicsFence
#include "UnityEngine/Rendering/GraphicsFence.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Stack`1<T>
  template<typename T>
  class Stack_1;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: UnityEngine::Experimental::Rendering::RenderGraphModule
namespace UnityEngine::Experimental::Rendering::RenderGraphModule {
  // Forward declaring type: RenderGraphResourceRegistry
  class RenderGraphResourceRegistry;
  // Forward declaring type: RenderGraphObjectPool
  class RenderGraphObjectPool;
  // Forward declaring type: RenderGraphPass
  class RenderGraphPass;
  // Forward declaring type: RenderGraphDebugParams
  class RenderGraphDebugParams;
  // Forward declaring type: RenderGraphLogger
  class RenderGraphLogger;
  // Forward declaring type: RenderGraphDefaultResources
  class RenderGraphDefaultResources;
  // Forward declaring type: RenderGraphContext
  class RenderGraphContext;
  // Forward declaring type: TextureHandle
  struct TextureHandle;
  // Forward declaring type: TextureDesc
  struct TextureDesc;
  // Forward declaring type: RenderGraphExecution
  struct RenderGraphExecution;
  // Forward declaring type: RenderGraphParameters
  struct RenderGraphParameters;
  // Skipping declaration: CompiledPassInfo because it is already included!
  // Skipping declaration: CompiledResourceInfo because it is already included!
}
// Forward declaring namespace: UnityEngine::Rendering
namespace UnityEngine::Rendering {
  // Forward declaring type: ProfilingSampler
  class ProfilingSampler;
  // Forward declaring type: CommandBuffer
  class CommandBuffer;
  // Forward declaring type: DynamicArray`1<T>
  template<typename T>
  class DynamicArray_1;
  // Forward declaring type: RTHandle
  class RTHandle;
  // Forward declaring type: RenderTargetIdentifier
  struct RenderTargetIdentifier;
}
// Completed forward declares
// Type namespace: UnityEngine.Experimental.Rendering.RenderGraphModule
namespace UnityEngine::Experimental::Rendering::RenderGraphModule {
  // Forward declaring type: RenderGraph
  class RenderGraph;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraph);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraph*, "UnityEngine.Experimental.Rendering.RenderGraphModule", "RenderGraph");
// Type namespace: UnityEngine.Experimental.Rendering.RenderGraphModule
namespace UnityEngine::Experimental::Rendering::RenderGraphModule {
  // Size: 0xC0
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.Experimental.Rendering.RenderGraphModule.RenderGraph
  // [TokenAttribute] Offset: FFFFFFFF
  class RenderGraph : public ::Il2CppObject {
    public:
    // Nested type: ::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraph::CompiledResourceInfo
    struct CompiledResourceInfo;
    // Nested type: ::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraph::CompiledPassInfo
    struct CompiledPassInfo;
    // Nested type: ::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraph::OnGraphRegisteredDelegate
    class OnGraphRegisteredDelegate;
    // Nested type: ::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraph::OnExecutionRegisteredDelegate
    class OnExecutionRegisteredDelegate;
    // Size: 0x15
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.Experimental.Rendering.RenderGraphModule.RenderGraph/CompiledResourceInfo
    // [TokenAttribute] Offset: FFFFFFFF
    struct CompiledResourceInfo/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.Collections.Generic.List`1<System.Int32> producers
      // Size: 0x8
      // Offset: 0x0
      ::System::Collections::Generic::List_1<int>* producers;
      // Field size check
      static_assert(sizeof(::System::Collections::Generic::List_1<int>*) == 0x8);
      // public System.Collections.Generic.List`1<System.Int32> consumers
      // Size: 0x8
      // Offset: 0x8
      ::System::Collections::Generic::List_1<int>* consumers;
      // Field size check
      static_assert(sizeof(::System::Collections::Generic::List_1<int>*) == 0x8);
      // public System.Int32 refCount
      // Size: 0x4
      // Offset: 0x10
      int refCount;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Boolean imported
      // Size: 0x1
      // Offset: 0x14
      bool imported;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      public:
      // Creating value type constructor for type: CompiledResourceInfo
      constexpr CompiledResourceInfo(::System::Collections::Generic::List_1<int>* producers_ = {}, ::System::Collections::Generic::List_1<int>* consumers_ = {}, int refCount_ = {}, bool imported_ = {}) noexcept : producers{producers_}, consumers{consumers_}, refCount{refCount_}, imported{imported_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public System.Collections.Generic.List`1<System.Int32> producers
      [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<int>*& dyn_producers();
      // Get instance field reference: public System.Collections.Generic.List`1<System.Int32> consumers
      [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<int>*& dyn_consumers();
      // Get instance field reference: public System.Int32 refCount
      [[deprecated("Use field access instead!")]] int& dyn_refCount();
      // Get instance field reference: public System.Boolean imported
      [[deprecated("Use field access instead!")]] bool& dyn_imported();
      // public System.Void Reset()
      // Offset: 0x5232D28
      void Reset();
    }; // UnityEngine.Experimental.Rendering.RenderGraphModule.RenderGraph/CompiledResourceInfo
    #pragma pack(pop)
    static check_size<sizeof(RenderGraph::CompiledResourceInfo), 20 + sizeof(bool)> __UnityEngine_Experimental_Rendering_RenderGraphModule_RenderGraph_CompiledResourceInfoSizeCheck;
    static_assert(sizeof(RenderGraph::CompiledResourceInfo) == 0x15);
    // Size: 0x41
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.Experimental.Rendering.RenderGraphModule.RenderGraph/CompiledPassInfo
    // [TokenAttribute] Offset: FFFFFFFF
    // [DebuggerDisplayAttribute] Offset: FFFFFFFF
    struct CompiledPassInfo/*, public ::System::ValueType*/ {
      public:
      public:
      // public UnityEngine.Experimental.Rendering.RenderGraphModule.RenderGraphPass pass
      // Size: 0x8
      // Offset: 0x0
      ::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraphPass* pass;
      // Field size check
      static_assert(sizeof(::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraphPass*) == 0x8);
      // public System.Collections.Generic.List`1<System.Int32>[] resourceCreateList
      // Size: 0x8
      // Offset: 0x8
      ::ArrayW<::System::Collections::Generic::List_1<int>*> resourceCreateList;
      // Field size check
      static_assert(sizeof(::ArrayW<::System::Collections::Generic::List_1<int>*>) == 0x8);
      // public System.Collections.Generic.List`1<System.Int32>[] resourceReleaseList
      // Size: 0x8
      // Offset: 0x10
      ::ArrayW<::System::Collections::Generic::List_1<int>*> resourceReleaseList;
      // Field size check
      static_assert(sizeof(::ArrayW<::System::Collections::Generic::List_1<int>*>) == 0x8);
      // public System.Int32 refCount
      // Size: 0x4
      // Offset: 0x18
      int refCount;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Boolean culled
      // Size: 0x1
      // Offset: 0x1C
      bool culled;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // public System.Boolean culledByRendererList
      // Size: 0x1
      // Offset: 0x1D
      bool culledByRendererList;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // public System.Boolean hasSideEffect
      // Size: 0x1
      // Offset: 0x1E
      bool hasSideEffect;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // Padding between fields: hasSideEffect and: syncToPassIndex
      char __padding6[0x1] = {};
      // public System.Int32 syncToPassIndex
      // Size: 0x4
      // Offset: 0x20
      int syncToPassIndex;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Int32 syncFromPassIndex
      // Size: 0x4
      // Offset: 0x24
      int syncFromPassIndex;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Boolean needGraphicsFence
      // Size: 0x1
      // Offset: 0x28
      bool needGraphicsFence;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // Padding between fields: needGraphicsFence and: fence
      char __padding9[0x7] = {};
      // public UnityEngine.Rendering.GraphicsFence fence
      // Size: 0x10
      // Offset: 0x30
      ::UnityEngine::Rendering::GraphicsFence fence;
      // Field size check
      static_assert(sizeof(::UnityEngine::Rendering::GraphicsFence) == 0x10);
      // public System.Boolean enableAsyncCompute
      // Size: 0x1
      // Offset: 0x40
      bool enableAsyncCompute;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      public:
      // Creating value type constructor for type: CompiledPassInfo
      constexpr CompiledPassInfo(::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraphPass* pass_ = {}, ::ArrayW<::System::Collections::Generic::List_1<int>*> resourceCreateList_ = ::ArrayW<::System::Collections::Generic::List_1<int>*>(static_cast<void*>(nullptr)), ::ArrayW<::System::Collections::Generic::List_1<int>*> resourceReleaseList_ = ::ArrayW<::System::Collections::Generic::List_1<int>*>(static_cast<void*>(nullptr)), int refCount_ = {}, bool culled_ = {}, bool culledByRendererList_ = {}, bool hasSideEffect_ = {}, int syncToPassIndex_ = {}, int syncFromPassIndex_ = {}, bool needGraphicsFence_ = {}, ::UnityEngine::Rendering::GraphicsFence fence_ = {}, bool enableAsyncCompute_ = {}) noexcept : pass{pass_}, resourceCreateList{resourceCreateList_}, resourceReleaseList{resourceReleaseList_}, refCount{refCount_}, culled{culled_}, culledByRendererList{culledByRendererList_}, hasSideEffect{hasSideEffect_}, syncToPassIndex{syncToPassIndex_}, syncFromPassIndex{syncFromPassIndex_}, needGraphicsFence{needGraphicsFence_}, fence{fence_}, enableAsyncCompute{enableAsyncCompute_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public UnityEngine.Experimental.Rendering.RenderGraphModule.RenderGraphPass pass
      [[deprecated("Use field access instead!")]] ::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraphPass*& dyn_pass();
      // Get instance field reference: public System.Collections.Generic.List`1<System.Int32>[] resourceCreateList
      [[deprecated("Use field access instead!")]] ::ArrayW<::System::Collections::Generic::List_1<int>*>& dyn_resourceCreateList();
      // Get instance field reference: public System.Collections.Generic.List`1<System.Int32>[] resourceReleaseList
      [[deprecated("Use field access instead!")]] ::ArrayW<::System::Collections::Generic::List_1<int>*>& dyn_resourceReleaseList();
      // Get instance field reference: public System.Int32 refCount
      [[deprecated("Use field access instead!")]] int& dyn_refCount();
      // Get instance field reference: public System.Boolean culled
      [[deprecated("Use field access instead!")]] bool& dyn_culled();
      // Get instance field reference: public System.Boolean culledByRendererList
      [[deprecated("Use field access instead!")]] bool& dyn_culledByRendererList();
      // Get instance field reference: public System.Boolean hasSideEffect
      [[deprecated("Use field access instead!")]] bool& dyn_hasSideEffect();
      // Get instance field reference: public System.Int32 syncToPassIndex
      [[deprecated("Use field access instead!")]] int& dyn_syncToPassIndex();
      // Get instance field reference: public System.Int32 syncFromPassIndex
      [[deprecated("Use field access instead!")]] int& dyn_syncFromPassIndex();
      // Get instance field reference: public System.Boolean needGraphicsFence
      [[deprecated("Use field access instead!")]] bool& dyn_needGraphicsFence();
      // Get instance field reference: public UnityEngine.Rendering.GraphicsFence fence
      [[deprecated("Use field access instead!")]] ::UnityEngine::Rendering::GraphicsFence& dyn_fence();
      // Get instance field reference: public System.Boolean enableAsyncCompute
      [[deprecated("Use field access instead!")]] bool& dyn_enableAsyncCompute();
      // public System.Boolean get_allowPassCulling()
      // Offset: 0x523404C
      bool get_allowPassCulling();
      // public System.Void Reset(UnityEngine.Experimental.Rendering.RenderGraphModule.RenderGraphPass pass)
      // Offset: 0x5232FA4
      void Reset(::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraphPass* pass);
    }; // UnityEngine.Experimental.Rendering.RenderGraphModule.RenderGraph/CompiledPassInfo
    #pragma pack(pop)
    static check_size<sizeof(RenderGraph::CompiledPassInfo), 64 + sizeof(bool)> __UnityEngine_Experimental_Rendering_RenderGraphModule_RenderGraph_CompiledPassInfoSizeCheck;
    static_assert(sizeof(RenderGraph::CompiledPassInfo) == 0x41);
    public:
    // private UnityEngine.Experimental.Rendering.RenderGraphModule.RenderGraphResourceRegistry m_Resources
    // Size: 0x8
    // Offset: 0x10
    ::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraphResourceRegistry* m_Resources;
    // Field size check
    static_assert(sizeof(::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraphResourceRegistry*) == 0x8);
    // private UnityEngine.Experimental.Rendering.RenderGraphModule.RenderGraphObjectPool m_RenderGraphPool
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraphObjectPool* m_RenderGraphPool;
    // Field size check
    static_assert(sizeof(::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraphObjectPool*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.Experimental.Rendering.RenderGraphModule.RenderGraphPass> m_RenderPasses
    // Size: 0x8
    // Offset: 0x20
    ::System::Collections::Generic::List_1<::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraphPass*>* m_RenderPasses;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraphPass*>*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.Experimental.Rendering.RenderGraphModule.RendererListHandle> m_RendererLists
    // Size: 0x8
    // Offset: 0x28
    ::System::Collections::Generic::List_1<::UnityEngine::Experimental::Rendering::RenderGraphModule::RendererListHandle>* m_RendererLists;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Experimental::Rendering::RenderGraphModule::RendererListHandle>*) == 0x8);
    // private UnityEngine.Experimental.Rendering.RenderGraphModule.RenderGraphDebugParams m_DebugParameters
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraphDebugParams* m_DebugParameters;
    // Field size check
    static_assert(sizeof(::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraphDebugParams*) == 0x8);
    // private UnityEngine.Experimental.Rendering.RenderGraphModule.RenderGraphLogger m_FrameInformationLogger
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraphLogger* m_FrameInformationLogger;
    // Field size check
    static_assert(sizeof(::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraphLogger*) == 0x8);
    // private UnityEngine.Experimental.Rendering.RenderGraphModule.RenderGraphDefaultResources m_DefaultResources
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraphDefaultResources* m_DefaultResources;
    // Field size check
    static_assert(sizeof(::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraphDefaultResources*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.Int32,UnityEngine.Rendering.ProfilingSampler> m_DefaultProfilingSamplers
    // Size: 0x8
    // Offset: 0x48
    ::System::Collections::Generic::Dictionary_2<int, ::UnityEngine::Rendering::ProfilingSampler*>* m_DefaultProfilingSamplers;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<int, ::UnityEngine::Rendering::ProfilingSampler*>*) == 0x8);
    // private System.Boolean m_ExecutionExceptionWasRaised
    // Size: 0x1
    // Offset: 0x50
    bool m_ExecutionExceptionWasRaised;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_ExecutionExceptionWasRaised and: m_RenderGraphContext
    char __padding8[0x7] = {};
    // private UnityEngine.Experimental.Rendering.RenderGraphModule.RenderGraphContext m_RenderGraphContext
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraphContext* m_RenderGraphContext;
    // Field size check
    static_assert(sizeof(::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraphContext*) == 0x8);
    // private UnityEngine.Rendering.CommandBuffer m_PreviousCommandBuffer
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::Rendering::CommandBuffer* m_PreviousCommandBuffer;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::CommandBuffer*) == 0x8);
    // private System.Int32 m_CurrentImmediatePassIndex
    // Size: 0x4
    // Offset: 0x68
    int m_CurrentImmediatePassIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: m_CurrentImmediatePassIndex and: m_ImmediateModeResourceList
    char __padding11[0x4] = {};
    // private System.Collections.Generic.List`1<System.Int32>[] m_ImmediateModeResourceList
    // Size: 0x8
    // Offset: 0x70
    ::ArrayW<::System::Collections::Generic::List_1<int>*> m_ImmediateModeResourceList;
    // Field size check
    static_assert(sizeof(::ArrayW<::System::Collections::Generic::List_1<int>*>) == 0x8);
    // private UnityEngine.Rendering.DynamicArray`1<UnityEngine.Experimental.Rendering.RenderGraphModule.RenderGraph/CompiledResourceInfo>[] m_CompiledResourcesInfos
    // Size: 0x8
    // Offset: 0x78
    ::ArrayW<::UnityEngine::Rendering::DynamicArray_1<::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraph::CompiledResourceInfo>*> m_CompiledResourcesInfos;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Rendering::DynamicArray_1<::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraph::CompiledResourceInfo>*>) == 0x8);
    // private UnityEngine.Rendering.DynamicArray`1<UnityEngine.Experimental.Rendering.RenderGraphModule.RenderGraph/CompiledPassInfo> m_CompiledPassInfos
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::Rendering::DynamicArray_1<::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraph::CompiledPassInfo>* m_CompiledPassInfos;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::DynamicArray_1<::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraph::CompiledPassInfo>*) == 0x8);
    // private System.Collections.Generic.Stack`1<System.Int32> m_CullingStack
    // Size: 0x8
    // Offset: 0x88
    ::System::Collections::Generic::Stack_1<int>* m_CullingStack;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Stack_1<int>*) == 0x8);
    // private System.Int32 m_ExecutionCount
    // Size: 0x4
    // Offset: 0x90
    int m_ExecutionCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_CurrentFrameIndex
    // Size: 0x4
    // Offset: 0x94
    int m_CurrentFrameIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean m_HasRenderGraphBegun
    // Size: 0x1
    // Offset: 0x98
    bool m_HasRenderGraphBegun;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_HasRenderGraphBegun and: m_CurrentExecutionName
    char __padding18[0x7] = {};
    // private System.String m_CurrentExecutionName
    // Size: 0x8
    // Offset: 0xA0
    ::StringW m_CurrentExecutionName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean m_RendererListCulling
    // Size: 0x1
    // Offset: 0xA8
    bool m_RendererListCulling;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_RendererListCulling and: m_DebugData
    char __padding20[0x7] = {};
    // private System.Collections.Generic.Dictionary`2<System.String,UnityEngine.Experimental.Rendering.RenderGraphModule.RenderGraphDebugData> m_DebugData
    // Size: 0x8
    // Offset: 0xB0
    ::System::Collections::Generic::Dictionary_2<::StringW, ::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraphDebugData*>* m_DebugData;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, ::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraphDebugData*>*) == 0x8);
    // private System.String <name>k__BackingField
    // Size: 0x8
    // Offset: 0xB8
    ::StringW name;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Get static field: static public readonly System.Int32 kMaxMRTCount
    static int _get_kMaxMRTCount();
    // Set static field: static public readonly System.Int32 kMaxMRTCount
    static void _set_kMaxMRTCount(int value);
    // Get static field: static private System.Collections.Generic.List`1<UnityEngine.Experimental.Rendering.RenderGraphModule.RenderGraph> s_RegisteredGraphs
    static ::System::Collections::Generic::List_1<::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraph*>* _get_s_RegisteredGraphs();
    // Set static field: static private System.Collections.Generic.List`1<UnityEngine.Experimental.Rendering.RenderGraphModule.RenderGraph> s_RegisteredGraphs
    static void _set_s_RegisteredGraphs(::System::Collections::Generic::List_1<::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraph*>* value);
