// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.Rendering.ScriptableRenderContext
#include "UnityEngine/Rendering/ScriptableRenderContext.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::Rendering
namespace UnityEngine::Rendering {
  // Forward declaring type: CommandBuffer
  class CommandBuffer;
}
// Forward declaring namespace: UnityEngine::Experimental::Rendering::RenderGraphModule
namespace UnityEngine::Experimental::Rendering::RenderGraphModule {
  // Forward declaring type: RenderGraphObjectPool
  class RenderGraphObjectPool;
  // Forward declaring type: RenderGraphDefaultResources
  class RenderGraphDefaultResources;
}
// Completed forward declares
// Type namespace: UnityEngine.Experimental.Rendering.RenderGraphModule
namespace UnityEngine::Experimental::Rendering::RenderGraphModule {
  // Forward declaring type: RenderGraphContext
  class RenderGraphContext;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraphContext);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraphContext*, "UnityEngine.Experimental.Rendering.RenderGraphModule", "RenderGraphContext");
// Type namespace: UnityEngine.Experimental.Rendering.RenderGraphModule
namespace UnityEngine::Experimental::Rendering::RenderGraphModule {
  // Size: 0x30
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.Experimental.Rendering.RenderGraphModule.RenderGraphContext
  // [TokenAttribute] Offset: FFFFFFFF
  class RenderGraphContext : public ::Il2CppObject {
    public:
    public:
    // public UnityEngine.Rendering.ScriptableRenderContext renderContext
    // Size: 0x8
    // Offset: 0x10
    ::UnityEngine::Rendering::ScriptableRenderContext renderContext;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::ScriptableRenderContext) == 0x8);
    // public UnityEngine.Rendering.CommandBuffer cmd
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::Rendering::CommandBuffer* cmd;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::CommandBuffer*) == 0x8);
    // public UnityEngine.Experimental.Rendering.RenderGraphModule.RenderGraphObjectPool renderGraphPool
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraphObjectPool* renderGraphPool;
    // Field size check
    static_assert(sizeof(::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraphObjectPool*) == 0x8);
    // public UnityEngine.Experimental.Rendering.RenderGraphModule.RenderGraphDefaultResources defaultResources
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraphDefaultResources* defaultResources;
    // Field size check
    static_assert(sizeof(::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraphDefaultResources*) == 0x8);
    public:
    // Get instance field reference: public UnityEngine.Rendering.ScriptableRenderContext renderContext
    [[deprecated("Use field access instead!")]] ::UnityEngine::Rendering::ScriptableRenderContext& dyn_renderContext();
    // Get instance field reference: public UnityEngine.Rendering.CommandBuffer cmd
    [[deprecated("Use field access instead!")]] ::UnityEngine::Rendering::CommandBuffer*& dyn_cmd();
    // Get instance field reference: public UnityEngine.Experimental.Rendering.RenderGraphModule.RenderGraphObjectPool renderGraphPool
    [[deprecated("Use field access instead!")]] ::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraphObjectPool*& dyn_renderGraphPool();
    // Get instance field reference: public UnityEngine.Experimental.Rendering.RenderGraphModule.RenderGraphDefaultResources defaultResources
    [[deprecated("Use field access instead!")]] ::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraphDefaultResources*& dyn_defaultResources();
    // public System.Void .ctor()
    // Offset: 0x523032C
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static RenderGraphContext* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraphContext::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<RenderGraphContext*, creationType>()));
    }
  }; // UnityEngine.Experimental.Rendering.RenderGraphModule.RenderGraphContext
  #pragma pack(pop)
  static check_size<sizeof(RenderGraphContext), 40 + sizeof(::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraphDefaultResources*)> __UnityEngine_Experimental_Rendering_RenderGraphModule_RenderGraphContextSizeCheck;
  static_assert(sizeof(RenderGraphContext) == 0x30);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraphContext::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
