// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.Experimental.Rendering.RenderGraphModule.RendererListResource
#include "UnityEngine/Experimental/Rendering/RenderGraphModule/RendererListResource.hpp"
// Including type: UnityEngine.Experimental.Rendering.RenderGraphModule.RendererListHandle
#include "UnityEngine/Experimental/Rendering/RenderGraphModule/RendererListHandle.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::Experimental::Rendering::RenderGraphModule
namespace UnityEngine::Experimental::Rendering::RenderGraphModule {
  // Forward declaring type: RenderGraphDebugParams
  class RenderGraphDebugParams;
  // Forward declaring type: RenderGraphLogger
  class RenderGraphLogger;
  // Forward declaring type: TextureHandle
  struct TextureHandle;
  // Forward declaring type: ResourceHandle
  struct ResourceHandle;
  // Forward declaring type: RenderGraphResourceType
  struct RenderGraphResourceType;
  // Forward declaring type: TextureDesc
  struct TextureDesc;
  // Forward declaring type: TextureResource
  class TextureResource;
  // Forward declaring type: RenderGraphContext
  class RenderGraphContext;
  // Forward declaring type: IRenderGraphResource
  class IRenderGraphResource;
}
// Forward declaring namespace: UnityEngine::Rendering
namespace UnityEngine::Rendering {
  // Forward declaring type: DynamicArray`1<T>
  template<typename T>
  class DynamicArray_1;
  // Forward declaring type: RTHandle
  class RTHandle;
  // Forward declaring type: ScriptableRenderContext
  struct ScriptableRenderContext;
  // Forward declaring type: RenderTargetIdentifier
  struct RenderTargetIdentifier;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: UnityEngine.Experimental.Rendering.RenderGraphModule
namespace UnityEngine::Experimental::Rendering::RenderGraphModule {
  // Forward declaring type: RenderGraphResourceRegistry
  class RenderGraphResourceRegistry;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraphResourceRegistry);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraphResourceRegistry*, "UnityEngine.Experimental.Rendering.RenderGraphModule", "RenderGraphResourceRegistry");
// Type namespace: UnityEngine.Experimental.Rendering.RenderGraphModule
namespace UnityEngine::Experimental::Rendering::RenderGraphModule {
  // Size: 0x50
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.Experimental.Rendering.RenderGraphModule.RenderGraphResourceRegistry
  // [TokenAttribute] Offset: FFFFFFFF
  class RenderGraphResourceRegistry : public ::Il2CppObject {
    public:
    // Nested type: ::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraphResourceRegistry::ResourceCallback
    class ResourceCallback;
    // Nested type: ::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraphResourceRegistry::RenderGraphResourcesData
    class RenderGraphResourcesData;
    public:
    // private UnityEngine.Experimental.Rendering.RenderGraphModule.RenderGraphResourceRegistry/RenderGraphResourcesData[] m_RenderGraphResources
    // Size: 0x8
    // Offset: 0x10
    ::ArrayW<::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraphResourceRegistry::RenderGraphResourcesData*> m_RenderGraphResources;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraphResourceRegistry::RenderGraphResourcesData*>) == 0x8);
    // private UnityEngine.Rendering.DynamicArray`1<UnityEngine.Experimental.Rendering.RenderGraphModule.RendererListResource> m_RendererListResources
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::Rendering::DynamicArray_1<::UnityEngine::Experimental::Rendering::RenderGraphModule::RendererListResource>* m_RendererListResources;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::DynamicArray_1<::UnityEngine::Experimental::Rendering::RenderGraphModule::RendererListResource>*) == 0x8);
    // private UnityEngine.Experimental.Rendering.RenderGraphModule.RenderGraphDebugParams m_RenderGraphDebug
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraphDebugParams* m_RenderGraphDebug;
    // Field size check
    static_assert(sizeof(::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraphDebugParams*) == 0x8);
    // private UnityEngine.Experimental.Rendering.RenderGraphModule.RenderGraphLogger m_ResourceLogger
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraphLogger* m_ResourceLogger;
    // Field size check
    static_assert(sizeof(::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraphLogger*) == 0x8);
    // private UnityEngine.Experimental.Rendering.RenderGraphModule.RenderGraphLogger m_FrameInformationLogger
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraphLogger* m_FrameInformationLogger;
    // Field size check
    static_assert(sizeof(::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraphLogger*) == 0x8);
    // private System.Int32 m_CurrentFrameIndex
    // Size: 0x4
    // Offset: 0x38
    int m_CurrentFrameIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_ExecutionCount
    // Size: 0x4
    // Offset: 0x3C
    int m_ExecutionCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.Rendering.RTHandle m_CurrentBackbuffer
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::Rendering::RTHandle* m_CurrentBackbuffer;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::RTHandle*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.Rendering.RendererList> m_ActiveRendererLists
    // Size: 0x8
    // Offset: 0x48
    ::System::Collections::Generic::List_1<::UnityEngine::Rendering::RendererList>* m_ActiveRendererLists;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Rendering::RendererList>*) == 0x8);
    public:
    // Get static field: static private UnityEngine.Experimental.Rendering.RenderGraphModule.RenderGraphResourceRegistry m_CurrentRegistry
    static ::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraphResourceRegistry* _get_m_CurrentRegistry();
    // Set static field: static private UnityEngine.Experimental.Rendering.RenderGraphModule.RenderGraphResourceRegistry m_CurrentRegistry
    static void _set_m_CurrentRegistry(::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraphResourceRegistry* value);
    // Get instance field reference: private UnityEngine.Experimental.Rendering.RenderGraphModule.RenderGraphResourceRegistry/RenderGraphResourcesData[] m_RenderGraphResources
