// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.Experimental.Rendering.RenderGraphModule.TextureHandle
#include "UnityEngine/Experimental/Rendering/RenderGraphModule/TextureHandle.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::Rendering
namespace UnityEngine::Rendering {
  // Forward declaring type: RTHandle
  class RTHandle;
}
// Forward declaring namespace: UnityEngine::Experimental::Rendering::RenderGraphModule
namespace UnityEngine::Experimental::Rendering::RenderGraphModule {
  // Forward declaring type: RenderGraph
  class RenderGraph;
}
// Completed forward declares
// Type namespace: UnityEngine.Experimental.Rendering.RenderGraphModule
namespace UnityEngine::Experimental::Rendering::RenderGraphModule {
  // Forward declaring type: RenderGraphDefaultResources
  class RenderGraphDefaultResources;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraphDefaultResources);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraphDefaultResources*, "UnityEngine.Experimental.Rendering.RenderGraphModule", "RenderGraphDefaultResources");
// Type namespace: UnityEngine.Experimental.Rendering.RenderGraphModule
namespace UnityEngine::Experimental::Rendering::RenderGraphModule {
  // Size: 0x78
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.Experimental.Rendering.RenderGraphModule.RenderGraphDefaultResources
  // [TokenAttribute] Offset: FFFFFFFF
  class RenderGraphDefaultResources : public ::Il2CppObject {
    public:
    public:
    // private UnityEngine.Rendering.RTHandle m_BlackTexture2D
    // Size: 0x8
    // Offset: 0x10
    ::UnityEngine::Rendering::RTHandle* m_BlackTexture2D;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::RTHandle*) == 0x8);
    // private UnityEngine.Rendering.RTHandle m_WhiteTexture2D
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::Rendering::RTHandle* m_WhiteTexture2D;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::RTHandle*) == 0x8);
    // private UnityEngine.Rendering.RTHandle m_ShadowTexture2D
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::Rendering::RTHandle* m_ShadowTexture2D;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::RTHandle*) == 0x8);
    // private UnityEngine.Experimental.Rendering.RenderGraphModule.TextureHandle <blackTexture>k__BackingField
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::Experimental::Rendering::RenderGraphModule::TextureHandle blackTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::Experimental::Rendering::RenderGraphModule::TextureHandle) == 0x8);
    // private UnityEngine.Experimental.Rendering.RenderGraphModule.TextureHandle <whiteTexture>k__BackingField
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Experimental::Rendering::RenderGraphModule::TextureHandle whiteTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::Experimental::Rendering::RenderGraphModule::TextureHandle) == 0x8);
    // private UnityEngine.Experimental.Rendering.RenderGraphModule.TextureHandle <clearTextureXR>k__BackingField
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::Experimental::Rendering::RenderGraphModule::TextureHandle clearTextureXR;
    // Field size check
    static_assert(sizeof(::UnityEngine::Experimental::Rendering::RenderGraphModule::TextureHandle) == 0x8);
    // private UnityEngine.Experimental.Rendering.RenderGraphModule.TextureHandle <magentaTextureXR>k__BackingField
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::Experimental::Rendering::RenderGraphModule::TextureHandle magentaTextureXR;
    // Field size check
    static_assert(sizeof(::UnityEngine::Experimental::Rendering::RenderGraphModule::TextureHandle) == 0x8);
    // private UnityEngine.Experimental.Rendering.RenderGraphModule.TextureHandle <blackTextureXR>k__BackingField
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::Experimental::Rendering::RenderGraphModule::TextureHandle blackTextureXR;
    // Field size check
    static_assert(sizeof(::UnityEngine::Experimental::Rendering::RenderGraphModule::TextureHandle) == 0x8);
    // private UnityEngine.Experimental.Rendering.RenderGraphModule.TextureHandle <blackTextureArrayXR>k__BackingField
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::Experimental::Rendering::RenderGraphModule::TextureHandle blackTextureArrayXR;
    // Field size check
    static_assert(sizeof(::UnityEngine::Experimental::Rendering::RenderGraphModule::TextureHandle) == 0x8);
    // private UnityEngine.Experimental.Rendering.RenderGraphModule.TextureHandle <blackUIntTextureXR>k__BackingField
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::Experimental::Rendering::RenderGraphModule::TextureHandle blackUIntTextureXR;
    // Field size check
    static_assert(sizeof(::UnityEngine::Experimental::Rendering::RenderGraphModule::TextureHandle) == 0x8);
    // private UnityEngine.Experimental.Rendering.RenderGraphModule.TextureHandle <blackTexture3DXR>k__BackingField
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::Experimental::Rendering::RenderGraphModule::TextureHandle blackTexture3DXR;
    // Field size check
    static_assert(sizeof(::UnityEngine::Experimental::Rendering::RenderGraphModule::TextureHandle) == 0x8);
    // private UnityEngine.Experimental.Rendering.RenderGraphModule.TextureHandle <whiteTextureXR>k__BackingField
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::Experimental::Rendering::RenderGraphModule::TextureHandle whiteTextureXR;
    // Field size check
    static_assert(sizeof(::UnityEngine::Experimental::Rendering::RenderGraphModule::TextureHandle) == 0x8);
    // private UnityEngine.Experimental.Rendering.RenderGraphModule.TextureHandle <defaultShadowTexture>k__BackingField
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::Experimental::Rendering::RenderGraphModule::TextureHandle defaultShadowTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::Experimental::Rendering::RenderGraphModule::TextureHandle) == 0x8);
    public:
    // Get instance field reference: private UnityEngine.Rendering.RTHandle m_BlackTexture2D
    [[deprecated("Use field access instead!")]] ::UnityEngine::Rendering::RTHandle*& dyn_m_BlackTexture2D();
    // Get instance field reference: private UnityEngine.Rendering.RTHandle m_WhiteTexture2D
    [[deprecated("Use field access instead!")]] ::UnityEngine::Rendering::RTHandle*& dyn_m_WhiteTexture2D();
    // Get instance field reference: private UnityEngine.Rendering.RTHandle m_ShadowTexture2D
    [[deprecated("Use field access instead!")]] ::UnityEngine::Rendering::RTHandle*& dyn_m_ShadowTexture2D();
