// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.Experimental.Rendering.RenderGraphModule.TextureHandle
#include "UnityEngine/Experimental/Rendering/RenderGraphModule/TextureHandle.hpp"
// Including type: UnityEngine.Experimental.Rendering.RenderGraphModule.RendererListHandle
#include "UnityEngine/Experimental/Rendering/RenderGraphModule/RendererListHandle.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::Rendering
namespace UnityEngine::Rendering {
  // Forward declaring type: ProfilingSampler
  class ProfilingSampler;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine::Experimental::Rendering::RenderGraphModule
namespace UnityEngine::Experimental::Rendering::RenderGraphModule {
  // Forward declaring type: RenderFunc`1<PassData>
  template<typename PassData>
  class RenderFunc_1;
  // Forward declaring type: RenderGraphContext
  class RenderGraphContext;
  // Forward declaring type: RenderGraphObjectPool
  class RenderGraphObjectPool;
  // Forward declaring type: DepthAccess
  struct DepthAccess;
}
// Completed forward declares
// Type namespace: UnityEngine.Experimental.Rendering.RenderGraphModule
namespace UnityEngine::Experimental::Rendering::RenderGraphModule {
  // Forward declaring type: RenderGraphPass
  class RenderGraphPass;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraphPass);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::Experimental::Rendering::RenderGraphModule::RenderGraphPass*, "UnityEngine.Experimental.Rendering.RenderGraphModule", "RenderGraphPass");
// Type namespace: UnityEngine.Experimental.Rendering.RenderGraphModule
namespace UnityEngine::Experimental::Rendering::RenderGraphModule {
  // Size: 0x70
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.Experimental.Rendering.RenderGraphModule.RenderGraphPass
  // [TokenAttribute] Offset: FFFFFFFF
  // [DebuggerDisplayAttribute] Offset: FFFFFFFF
  class RenderGraphPass : public ::Il2CppObject {
    public:
    public:
    // private System.String <name>k__BackingField
    // Size: 0x8
    // Offset: 0x10
    ::StringW name;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Int32 <index>k__BackingField
    // Size: 0x4
    // Offset: 0x18
    int index;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: index and: customSampler
    char __padding1[0x4] = {};
    // private UnityEngine.Rendering.ProfilingSampler <customSampler>k__BackingField
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::Rendering::ProfilingSampler* customSampler;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::ProfilingSampler*) == 0x8);
    // private System.Boolean <enableAsyncCompute>k__BackingField
    // Size: 0x1
    // Offset: 0x28
    bool enableAsyncCompute;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <allowPassCulling>k__BackingField
    // Size: 0x1
    // Offset: 0x29
    bool allowPassCulling;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: allowPassCulling and: depthBuffer
    char __padding4[0x2] = {};
    // private UnityEngine.Experimental.Rendering.RenderGraphModule.TextureHandle <depthBuffer>k__BackingField
    // Size: 0x8
    // Offset: 0x2C
    ::UnityEngine::Experimental::Rendering::RenderGraphModule::TextureHandle depthBuffer;
    // Field size check
    static_assert(sizeof(::UnityEngine::Experimental::Rendering::RenderGraphModule::TextureHandle) == 0x8);
    // Padding between fields: depthBuffer and: colorBuffers
    char __padding5[0x4] = {};
    // private UnityEngine.Experimental.Rendering.RenderGraphModule.TextureHandle[] <colorBuffers>k__BackingField
    // Size: 0x8
    // Offset: 0x38
    ::ArrayW<::UnityEngine::Experimental::Rendering::RenderGraphModule::TextureHandle> colorBuffers;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Experimental::Rendering::RenderGraphModule::TextureHandle>) == 0x8);
    // private System.Int32 <colorBufferMaxIndex>k__BackingField
    // Size: 0x4
    // Offset: 0x40
    int colorBufferMaxIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 <refCount>k__BackingField
    // Size: 0x4
    // Offset: 0x44
    int refCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean <generateDebugData>k__BackingField
    // Size: 0x1
    // Offset: 0x48
    bool generateDebugData;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <allowRendererListCulling>k__BackingField
    // Size: 0x1
    // Offset: 0x49
    bool allowRendererListCulling;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: allowRendererListCulling and: resourceReadLists
    char __padding10[0x6] = {};
    // public System.Collections.Generic.List`1<UnityEngine.Experimental.Rendering.RenderGraphModule.ResourceHandle>[] resourceReadLists
    // Size: 0x8
    // Offset: 0x50
    ::ArrayW<::System::Collections::Generic::List_1<::UnityEngine::Experimental::Rendering::RenderGraphModule::ResourceHandle>*> resourceReadLists;
    // Field size check
    static_assert(sizeof(::ArrayW<::System::Collections::Generic::List_1<::UnityEngine::Experimental::Rendering::RenderGraphModule::ResourceHandle>*>) == 0x8);
    // public System.Collections.Generic.List`1<UnityEngine.Experimental.Rendering.RenderGraphModule.ResourceHandle>[] resourceWriteLists
    // Size: 0x8
    // Offset: 0x58
    ::ArrayW<::System::Collections::Generic::List_1<::UnityEngine::Experimental::Rendering::RenderGraphModule::ResourceHandle>*> resourceWriteLists;
    // Field size check
    static_assert(sizeof(::ArrayW<::System::Collections::Generic::List_1<::UnityEngine::Experimental::Rendering::RenderGraphModule::ResourceHandle>*>) == 0x8);
    // public System.Collections.Generic.List`1<UnityEngine.Experimental.Rendering.RenderGraphModule.ResourceHandle>[] transientResourceList
    // Size: 0x8
    // Offset: 0x60
    ::ArrayW<::System::Collections::Generic::List_1<::UnityEngine::Experimental::Rendering::RenderGraphModule::ResourceHandle>*> transientResourceList;
    // Field size check
    static_assert(sizeof(::ArrayW<::System::Collections::Generic::List_1<::UnityEngine::Experimental::Rendering::RenderGraphModule::ResourceHandle>*>) == 0x8);
    // public System.Collections.Generic.List`1<UnityEngine.Experimental.Rendering.RenderGraphModule.RendererListHandle> usedRendererListList
    // Size: 0x8
    // Offset: 0x68
    ::System::Collections::Generic::List_1<::UnityEngine::Experimental::Rendering::RenderGraphModule::RendererListHandle>* usedRendererListList;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Experimental::Rendering::RenderGraphModule::RendererListHandle>*) == 0x8);
    public:
    // Get instance field reference: private System.String <name>k__BackingField
    [[deprecated("Use field access instead!")]] ::StringW& dyn_$name$k__BackingField();
    // Get instance field reference: private System.Int32 <index>k__BackingField
    [[deprecated("Use field access instead!")]] int& dyn_$index$k__BackingField();
    // Get instance field reference: private UnityEngine.Rendering.ProfilingSampler <customSampler>k__BackingField
    [[deprecated("Use field access instead!")]] ::UnityEngine::Rendering::ProfilingSampler*& dyn_$customSampler$k__BackingField();
