// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.EventSystems.BaseInputModule
#include "UnityEngine/EventSystems/BaseInputModule.hpp"
// Including type: UnityEngine.InputSystem.UI.UIPointerBehavior
#include "UnityEngine/InputSystem/UI/UIPointerBehavior.hpp"
// Including type: UnityEngine.InputSystem.InputAction/CallbackContext
#include "UnityEngine/InputSystem/InputAction_CallbackContext.hpp"
// Including type: UnityEngine.InputSystem.UI.UIPointerType
#include "UnityEngine/InputSystem/UI/UIPointerType.hpp"
// Including type: UnityEngine.InputSystem.Utilities.InlinedArray`1
#include "UnityEngine/InputSystem/Utilities/InlinedArray_1.hpp"
// Including type: UnityEngine.InputSystem.UI.PointerModel
#include "UnityEngine/InputSystem/UI/PointerModel.hpp"
// Including type: UnityEngine.InputSystem.UI.NavigationModel
#include "UnityEngine/InputSystem/UI/NavigationModel.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::InputSystem::UI
namespace UnityEngine::InputSystem::UI {
  // Skipping declaration: CursorLockBehavior because it is already included!
  // Forward declaring type: ExtendedPointerEventData
  class ExtendedPointerEventData;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: UnityEngine::InputSystem
namespace UnityEngine::InputSystem {
  // Forward declaring type: InputActionAsset
  class InputActionAsset;
  // Forward declaring type: InputActionReference
  class InputActionReference;
  // Forward declaring type: InputControl
  class InputControl;
  // Forward declaring type: InputAction
  class InputAction;
  // Forward declaring type: InputDevice
  class InputDevice;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: UnityEngine::EventSystems
namespace UnityEngine::EventSystems {
  // Skipping declaration: RaycastResult because it is already included!
  // Skipping declaration: PointerEventData because it is already included!
  // Forward declaring type: AxisEventData
  class AxisEventData;
}
// Completed forward declares
// Type namespace: UnityEngine.InputSystem.UI
namespace UnityEngine::InputSystem::UI {
  // Forward declaring type: InputSystemUIInputModule
  class InputSystemUIInputModule;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::InputSystem::UI::InputSystemUIInputModule);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::InputSystem::UI::InputSystemUIInputModule*, "UnityEngine.InputSystem.UI", "InputSystemUIInputModule");
// Type namespace: UnityEngine.InputSystem.UI
namespace UnityEngine::InputSystem::UI {
  // WARNING Size may be invalid!
  // Autogenerated type: UnityEngine.InputSystem.UI.InputSystemUIInputModule
  // [TokenAttribute] Offset: FFFFFFFF
  // [HelpURLAttribute] Offset: FFFFFFFF
  class InputSystemUIInputModule : public ::UnityEngine::EventSystems::BaseInputModule {
    public:
    // Nested type: ::UnityEngine::InputSystem::UI::InputSystemUIInputModule::InputActionReferenceState
    struct InputActionReferenceState;
    // Nested type: ::UnityEngine::InputSystem::UI::InputSystemUIInputModule::CursorLockBehavior
    struct CursorLockBehavior;
    // Size: 0x5
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.InputSystem.UI.InputSystemUIInputModule/InputActionReferenceState
    // [TokenAttribute] Offset: FFFFFFFF
    struct InputActionReferenceState/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.Int32 refCount
      // Size: 0x4
      // Offset: 0x0
      int refCount;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Boolean enabledByInputModule
      // Size: 0x1
      // Offset: 0x4
      bool enabledByInputModule;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      public:
      // Creating value type constructor for type: InputActionReferenceState
      constexpr InputActionReferenceState(int refCount_ = {}, bool enabledByInputModule_ = {}) noexcept : refCount{refCount_}, enabledByInputModule{enabledByInputModule_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public System.Int32 refCount
      [[deprecated("Use field access instead!")]] int& dyn_refCount();
      // Get instance field reference: public System.Boolean enabledByInputModule
      [[deprecated("Use field access instead!")]] bool& dyn_enabledByInputModule();
    }; // UnityEngine.InputSystem.UI.InputSystemUIInputModule/InputActionReferenceState
    #pragma pack(pop)
    static check_size<sizeof(InputSystemUIInputModule::InputActionReferenceState), 4 + sizeof(bool)> __UnityEngine_InputSystem_UI_InputSystemUIInputModule_InputActionReferenceStateSizeCheck;
    static_assert(sizeof(InputSystemUIInputModule::InputActionReferenceState) == 0x5);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.InputSystem.UI.InputSystemUIInputModule/CursorLockBehavior
    // [TokenAttribute] Offset: FFFFFFFF
    struct CursorLockBehavior/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: CursorLockBehavior
      constexpr CursorLockBehavior(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.InputSystem.UI.InputSystemUIInputModule/CursorLockBehavior OutsideScreen
      static constexpr const int OutsideScreen = 0;
      // Get static field: static public UnityEngine.InputSystem.UI.InputSystemUIInputModule/CursorLockBehavior OutsideScreen
      static ::UnityEngine::InputSystem::UI::InputSystemUIInputModule::CursorLockBehavior _get_OutsideScreen();
      // Set static field: static public UnityEngine.InputSystem.UI.InputSystemUIInputModule/CursorLockBehavior OutsideScreen
      static void _set_OutsideScreen(::UnityEngine::InputSystem::UI::InputSystemUIInputModule::CursorLockBehavior value);
      // static field const value: static public UnityEngine.InputSystem.UI.InputSystemUIInputModule/CursorLockBehavior ScreenCenter
      static constexpr const int ScreenCenter = 1;
      // Get static field: static public UnityEngine.InputSystem.UI.InputSystemUIInputModule/CursorLockBehavior ScreenCenter
      static ::UnityEngine::InputSystem::UI::InputSystemUIInputModule::CursorLockBehavior _get_ScreenCenter();
      // Set static field: static public UnityEngine.InputSystem.UI.InputSystemUIInputModule/CursorLockBehavior ScreenCenter
      static void _set_ScreenCenter(::UnityEngine::InputSystem::UI::InputSystemUIInputModule::CursorLockBehavior value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.InputSystem.UI.InputSystemUIInputModule/CursorLockBehavior
    #pragma pack(pop)
    static check_size<sizeof(InputSystemUIInputModule::CursorLockBehavior), 0 + sizeof(int)> __UnityEngine_InputSystem_UI_InputSystemUIInputModule_CursorLockBehaviorSizeCheck;
    static_assert(sizeof(InputSystemUIInputModule::CursorLockBehavior) == 0x4);
    public:
    // private System.Single m_MoveRepeatDelay
    // Size: 0x4
    // Offset: 0x58
    float m_MoveRepeatDelay;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_MoveRepeatRate
    // Size: 0x4
    // Offset: 0x5C
    float m_MoveRepeatRate;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_TrackedDeviceDragThresholdMultiplier
    // Size: 0x4
    // Offset: 0x60
    float m_TrackedDeviceDragThresholdMultiplier;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Transform m_XRTrackingOrigin
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::Transform* m_XRTrackingOrigin;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.InputSystem.InputActionAsset m_ActionsAsset
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::InputSystem::InputActionAsset* m_ActionsAsset;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionAsset*) == 0x8);
    // private UnityEngine.InputSystem.InputActionReference m_PointAction
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::InputSystem::InputActionReference* m_PointAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // private UnityEngine.InputSystem.InputActionReference m_MoveAction
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::InputSystem::InputActionReference* m_MoveAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // private UnityEngine.InputSystem.InputActionReference m_SubmitAction
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::InputSystem::InputActionReference* m_SubmitAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // private UnityEngine.InputSystem.InputActionReference m_CancelAction
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::InputSystem::InputActionReference* m_CancelAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // private UnityEngine.InputSystem.InputActionReference m_LeftClickAction
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::InputSystem::InputActionReference* m_LeftClickAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // private UnityEngine.InputSystem.InputActionReference m_MiddleClickAction
    // Size: 0x8
    // Offset: 0xA0
    ::UnityEngine::InputSystem::InputActionReference* m_MiddleClickAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // private UnityEngine.InputSystem.InputActionReference m_RightClickAction
    // Size: 0x8
    // Offset: 0xA8
    ::UnityEngine::InputSystem::InputActionReference* m_RightClickAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // private UnityEngine.InputSystem.InputActionReference m_ScrollWheelAction
    // Size: 0x8
    // Offset: 0xB0
    ::UnityEngine::InputSystem::InputActionReference* m_ScrollWheelAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // private UnityEngine.InputSystem.InputActionReference m_TrackedDevicePositionAction
    // Size: 0x8
    // Offset: 0xB8
    ::UnityEngine::InputSystem::InputActionReference* m_TrackedDevicePositionAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // private UnityEngine.InputSystem.InputActionReference m_TrackedDeviceOrientationAction
    // Size: 0x8
    // Offset: 0xC0
    ::UnityEngine::InputSystem::InputActionReference* m_TrackedDeviceOrientationAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionReference*) == 0x8);
    // private System.Boolean m_DeselectOnBackgroundClick
    // Size: 0x1
    // Offset: 0xC8
    bool m_DeselectOnBackgroundClick;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private UnityEngine.InputSystem.UI.UIPointerBehavior m_PointerBehavior
    // Size: 0x4
    // Offset: 0xCC
    ::UnityEngine::InputSystem::UI::UIPointerBehavior m_PointerBehavior;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::UI::UIPointerBehavior) == 0x4);
    // UnityEngine.InputSystem.UI.InputSystemUIInputModule/CursorLockBehavior m_CursorLockBehavior
    // Size: 0x4
    // Offset: 0xD0
    ::UnityEngine::InputSystem::UI::InputSystemUIInputModule::CursorLockBehavior m_CursorLockBehavior;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::UI::InputSystemUIInputModule::CursorLockBehavior) == 0x4);
    // private System.Boolean m_ActionsHooked
    // Size: 0x1
    // Offset: 0xD4
    bool m_ActionsHooked;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_NeedToPurgeStalePointers
    // Size: 0x1
    // Offset: 0xD5
    bool m_NeedToPurgeStalePointers;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Action`1<UnityEngine.InputSystem.InputAction/CallbackContext> m_OnPointDelegate
    // Size: 0x8
    // Offset: 0xD8
    ::System::Action_1<::UnityEngine::InputSystem::InputAction_CallbackContext>* m_OnPointDelegate;
    // Field size check
    static_assert(sizeof(::System::Action_1<::UnityEngine::InputSystem::InputAction_CallbackContext>*) == 0x8);
    // private System.Action`1<UnityEngine.InputSystem.InputAction/CallbackContext> m_OnMoveDelegate
    // Size: 0x8
    // Offset: 0xE0
    ::System::Action_1<::UnityEngine::InputSystem::InputAction_CallbackContext>* m_OnMoveDelegate;
    // Field size check
    static_assert(sizeof(::System::Action_1<::UnityEngine::InputSystem::InputAction_CallbackContext>*) == 0x8);
    // private System.Action`1<UnityEngine.InputSystem.InputAction/CallbackContext> m_OnLeftClickDelegate
    // Size: 0x8
    // Offset: 0xE8
    ::System::Action_1<::UnityEngine::InputSystem::InputAction_CallbackContext>* m_OnLeftClickDelegate;
    // Field size check
    static_assert(sizeof(::System::Action_1<::UnityEngine::InputSystem::InputAction_CallbackContext>*) == 0x8);
    // private System.Action`1<UnityEngine.InputSystem.InputAction/CallbackContext> m_OnRightClickDelegate
    // Size: 0x8
    // Offset: 0xF0
    ::System::Action_1<::UnityEngine::InputSystem::InputAction_CallbackContext>* m_OnRightClickDelegate;
    // Field size check
    static_assert(sizeof(::System::Action_1<::UnityEngine::InputSystem::InputAction_CallbackContext>*) == 0x8);
    // private System.Action`1<UnityEngine.InputSystem.InputAction/CallbackContext> m_OnMiddleClickDelegate
    // Size: 0x8
    // Offset: 0xF8
    ::System::Action_1<::UnityEngine::InputSystem::InputAction_CallbackContext>* m_OnMiddleClickDelegate;
    // Field size check
    static_assert(sizeof(::System::Action_1<::UnityEngine::InputSystem::InputAction_CallbackContext>*) == 0x8);
    // private System.Action`1<UnityEngine.InputSystem.InputAction/CallbackContext> m_OnScrollWheelDelegate
    // Size: 0x8
    // Offset: 0x100
    ::System::Action_1<::UnityEngine::InputSystem::InputAction_CallbackContext>* m_OnScrollWheelDelegate;
    // Field size check
    static_assert(sizeof(::System::Action_1<::UnityEngine::InputSystem::InputAction_CallbackContext>*) == 0x8);
    // private System.Action`1<UnityEngine.InputSystem.InputAction/CallbackContext> m_OnTrackedDevicePositionDelegate
    // Size: 0x8
    // Offset: 0x108
    ::System::Action_1<::UnityEngine::InputSystem::InputAction_CallbackContext>* m_OnTrackedDevicePositionDelegate;
    // Field size check
    static_assert(sizeof(::System::Action_1<::UnityEngine::InputSystem::InputAction_CallbackContext>*) == 0x8);
    // private System.Action`1<UnityEngine.InputSystem.InputAction/CallbackContext> m_OnTrackedDeviceOrientationDelegate
    // Size: 0x8
    // Offset: 0x110
    ::System::Action_1<::UnityEngine::InputSystem::InputAction_CallbackContext>* m_OnTrackedDeviceOrientationDelegate;
    // Field size check
    static_assert(sizeof(::System::Action_1<::UnityEngine::InputSystem::InputAction_CallbackContext>*) == 0x8);
    // private System.Action`1<System.Object> m_OnControlsChangedDelegate
    // Size: 0x8
    // Offset: 0x118
    ::System::Action_1<::Il2CppObject*>* m_OnControlsChangedDelegate;
    // Field size check
    static_assert(sizeof(::System::Action_1<::Il2CppObject*>*) == 0x8);
    // private System.Int32 m_CurrentPointerId
    // Size: 0x4
    // Offset: 0x120
    int m_CurrentPointerId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_CurrentPointerIndex
    // Size: 0x4
    // Offset: 0x124
    int m_CurrentPointerIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // UnityEngine.InputSystem.UI.UIPointerType m_CurrentPointerType
    // Size: 0x4
    // Offset: 0x128
    ::UnityEngine::InputSystem::UI::UIPointerType m_CurrentPointerType;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::UI::UIPointerType) == 0x4);
    // UnityEngine.InputSystem.Utilities.InlinedArray`1<System.Int32> m_PointerIds
    // Size: 0xFFFFFFFF
    // Offset: 0x130
    ::UnityEngine::InputSystem::Utilities::InlinedArray_1<int> m_PointerIds;
    // UnityEngine.InputSystem.Utilities.InlinedArray`1<UnityEngine.InputSystem.InputControl> m_PointerTouchControls
    // Size: 0xFFFFFFFF
    // Offset: 0x140
    ::UnityEngine::InputSystem::Utilities::InlinedArray_1<::UnityEngine::InputSystem::InputControl*> m_PointerTouchControls;
    // UnityEngine.InputSystem.Utilities.InlinedArray`1<UnityEngine.InputSystem.UI.PointerModel> m_PointerStates
    // Size: 0xFFFFFFFF
    // Offset: 0x158
    ::UnityEngine::InputSystem::Utilities::InlinedArray_1<::UnityEngine::InputSystem::UI::PointerModel> m_PointerStates;
    // private UnityEngine.InputSystem.UI.NavigationModel m_NavigationState
    // Size: 0x20
    // Offset: 0x388
    ::UnityEngine::InputSystem::UI::NavigationModel m_NavigationState;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::UI::NavigationModel) == 0x20);
    // private UnityEngine.GameObject m_LocalMultiPlayerRoot
    // Size: 0x8
    // Offset: 0x3A8
    ::UnityEngine::GameObject* m_LocalMultiPlayerRoot;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    public:
    // static field const value: static private System.Single kClickSpeed
    static constexpr const float kClickSpeed = 0.3;
    // Get static field: static private System.Single kClickSpeed
    static float _get_kClickSpeed();
    // Set static field: static private System.Single kClickSpeed
    static void _set_kClickSpeed(float value);
    // static field const value: static System.Single kPixelPerLine
    static constexpr const float kPixelPerLine = 20;
    // Get static field: static System.Single kPixelPerLine
    static float _get_kPixelPerLine();
    // Set static field: static System.Single kPixelPerLine
    static void _set_kPixelPerLine(float value);
