// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.InputSystem.InputActionProperty
#include "UnityEngine/InputSystem/InputActionProperty.hpp"
// Including type: UnityEngine.InputSystem.InputAction/CallbackContext
#include "UnityEngine/InputSystem/InputAction_CallbackContext.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Graphic
  class Graphic;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: RectTransform
  class RectTransform;
  // Forward declaring type: Canvas
  class Canvas;
}
// Forward declaring namespace: UnityEngine::InputSystem
namespace UnityEngine::InputSystem {
  // Forward declaring type: Mouse
  class Mouse;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: UnityEngine::InputSystem::UI
namespace UnityEngine::InputSystem::UI {
  // Skipping declaration: CursorMode because it is already included!
}
// Completed forward declares
// Type namespace: UnityEngine.InputSystem.UI
namespace UnityEngine::InputSystem::UI {
  // Forward declaring type: VirtualMouseInput
  class VirtualMouseInput;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::InputSystem::UI::VirtualMouseInput);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::InputSystem::UI::VirtualMouseInput*, "UnityEngine.InputSystem.UI", "VirtualMouseInput");
// Type namespace: UnityEngine.InputSystem.UI
namespace UnityEngine::InputSystem::UI {
  // Size: 0x120
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.InputSystem.UI.VirtualMouseInput
  // [TokenAttribute] Offset: FFFFFFFF
  // [HelpURLAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: FFFFFFFF
  class VirtualMouseInput : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::UnityEngine::InputSystem::UI::VirtualMouseInput::CursorMode
    struct CursorMode;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.InputSystem.UI.VirtualMouseInput/CursorMode
    // [TokenAttribute] Offset: FFFFFFFF
    struct CursorMode/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: CursorMode
      constexpr CursorMode(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.InputSystem.UI.VirtualMouseInput/CursorMode SoftwareCursor
      static constexpr const int SoftwareCursor = 0;
      // Get static field: static public UnityEngine.InputSystem.UI.VirtualMouseInput/CursorMode SoftwareCursor
      static ::UnityEngine::InputSystem::UI::VirtualMouseInput::CursorMode _get_SoftwareCursor();
      // Set static field: static public UnityEngine.InputSystem.UI.VirtualMouseInput/CursorMode SoftwareCursor
      static void _set_SoftwareCursor(::UnityEngine::InputSystem::UI::VirtualMouseInput::CursorMode value);
      // static field const value: static public UnityEngine.InputSystem.UI.VirtualMouseInput/CursorMode HardwareCursorIfAvailable
      static constexpr const int HardwareCursorIfAvailable = 1;
      // Get static field: static public UnityEngine.InputSystem.UI.VirtualMouseInput/CursorMode HardwareCursorIfAvailable
      static ::UnityEngine::InputSystem::UI::VirtualMouseInput::CursorMode _get_HardwareCursorIfAvailable();
      // Set static field: static public UnityEngine.InputSystem.UI.VirtualMouseInput/CursorMode HardwareCursorIfAvailable
      static void _set_HardwareCursorIfAvailable(::UnityEngine::InputSystem::UI::VirtualMouseInput::CursorMode value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.InputSystem.UI.VirtualMouseInput/CursorMode
    #pragma pack(pop)
    static check_size<sizeof(VirtualMouseInput::CursorMode), 0 + sizeof(int)> __UnityEngine_InputSystem_UI_VirtualMouseInput_CursorModeSizeCheck;
    static_assert(sizeof(VirtualMouseInput::CursorMode) == 0x4);
    public:
    // private UnityEngine.InputSystem.UI.VirtualMouseInput/CursorMode m_CursorMode
    // Size: 0x4
    // Offset: 0x20
    ::UnityEngine::InputSystem::UI::VirtualMouseInput::CursorMode m_CursorMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::UI::VirtualMouseInput::CursorMode) == 0x4);
    // Padding between fields: m_CursorMode and: m_CursorGraphic
    char __padding0[0x4] = {};
    // private UnityEngine.UI.Graphic m_CursorGraphic
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::UI::Graphic* m_CursorGraphic;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Graphic*) == 0x8);
    // private UnityEngine.RectTransform m_CursorTransform
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::RectTransform* m_CursorTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::RectTransform*) == 0x8);
    // private System.Single m_CursorSpeed
    // Size: 0x4
    // Offset: 0x38
    float m_CursorSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_ScrollSpeed
    // Size: 0x4
    // Offset: 0x3C
    float m_ScrollSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.InputSystem.InputActionProperty m_StickAction
    // Size: 0x18
    // Offset: 0x40
    ::UnityEngine::InputSystem::InputActionProperty m_StickAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionProperty) == 0x18);
    // private UnityEngine.InputSystem.InputActionProperty m_LeftButtonAction
    // Size: 0x18
    // Offset: 0x58
    ::UnityEngine::InputSystem::InputActionProperty m_LeftButtonAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionProperty) == 0x18);
    // private UnityEngine.InputSystem.InputActionProperty m_MiddleButtonAction
    // Size: 0x18
    // Offset: 0x70
    ::UnityEngine::InputSystem::InputActionProperty m_MiddleButtonAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionProperty) == 0x18);
    // private UnityEngine.InputSystem.InputActionProperty m_RightButtonAction
    // Size: 0x18
    // Offset: 0x88
    ::UnityEngine::InputSystem::InputActionProperty m_RightButtonAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionProperty) == 0x18);
    // private UnityEngine.InputSystem.InputActionProperty m_ForwardButtonAction
    // Size: 0x18
    // Offset: 0xA0
    ::UnityEngine::InputSystem::InputActionProperty m_ForwardButtonAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionProperty) == 0x18);
    // private UnityEngine.InputSystem.InputActionProperty m_BackButtonAction
    // Size: 0x18
    // Offset: 0xB8
    ::UnityEngine::InputSystem::InputActionProperty m_BackButtonAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionProperty) == 0x18);
    // private UnityEngine.InputSystem.InputActionProperty m_ScrollWheelAction
    // Size: 0x18
    // Offset: 0xD0
    ::UnityEngine::InputSystem::InputActionProperty m_ScrollWheelAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::InputActionProperty) == 0x18);
    // private UnityEngine.Canvas m_Canvas
    // Size: 0x8
    // Offset: 0xE8
    ::UnityEngine::Canvas* m_Canvas;
    // Field size check
    static_assert(sizeof(::UnityEngine::Canvas*) == 0x8);
    // private UnityEngine.InputSystem.Mouse m_VirtualMouse
    // Size: 0x8
    // Offset: 0xF0
    ::UnityEngine::InputSystem::Mouse* m_VirtualMouse;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::Mouse*) == 0x8);
    // private UnityEngine.InputSystem.Mouse m_SystemMouse
    // Size: 0x8
    // Offset: 0xF8
    ::UnityEngine::InputSystem::Mouse* m_SystemMouse;
    // Field size check
    static_assert(sizeof(::UnityEngine::InputSystem::Mouse*) == 0x8);
    // private System.Action m_AfterInputUpdateDelegate
    // Size: 0x8
    // Offset: 0x100
    ::System::Action* m_AfterInputUpdateDelegate;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private System.Action`1<UnityEngine.InputSystem.InputAction/CallbackContext> m_ButtonActionTriggeredDelegate
    // Size: 0x8
    // Offset: 0x108
    ::System::Action_1<::UnityEngine::InputSystem::InputAction_CallbackContext>* m_ButtonActionTriggeredDelegate;
    // Field size check
    static_assert(sizeof(::System::Action_1<::UnityEngine::InputSystem::InputAction_CallbackContext>*) == 0x8);
    // private System.Double m_LastTime
    // Size: 0x8
    // Offset: 0x110
    double m_LastTime;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private UnityEngine.Vector2 m_LastStickValue
    // Size: 0x8
    // Offset: 0x118
    ::UnityEngine::Vector2 m_LastStickValue;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    public:
    // Get instance field reference: private UnityEngine.InputSystem.UI.VirtualMouseInput/CursorMode m_CursorMode
    [[deprecated("Use field access instead!")]] ::UnityEngine::InputSystem::UI::VirtualMouseInput::CursorMode& dyn_m_CursorMode();
    // Get instance field reference: private UnityEngine.UI.Graphic m_CursorGraphic
    [[deprecated("Use field access instead!")]] ::UnityEngine::UI::Graphic*& dyn_m_CursorGraphic();
    // Get instance field reference: private UnityEngine.RectTransform m_CursorTransform
    [[deprecated("Use field access instead!")]] ::UnityEngine::RectTransform*& dyn_m_CursorTransform();
    // Get instance field reference: private System.Single m_CursorSpeed
    [[deprecated("Use field access instead!")]] float& dyn_m_CursorSpeed();
