// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: ITickSystemPost
#include "GlobalNamespace/ITickSystemPost.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: UnityEngine.Vector4
#include "UnityEngine/Vector4.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: Texture2D
  class Texture2D;
  // Skipping declaration: Vector3 because it is already included!
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
}
// Forward declaring namespace: GorillaTag::Rendering
namespace GorillaTag::Rendering {
  // Skipping declaration: EZoneLiquidType because it is already included!
  // Skipping declaration: ELiquidShape because it is already included!
  // Skipping declaration: EOverrideMode because it is already included!
}
// Completed forward declares
// Type namespace: GorillaTag.Rendering
namespace GorillaTag::Rendering {
  // Forward declaring type: ZoneShaderSettings
  class ZoneShaderSettings;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GorillaTag::Rendering::ZoneShaderSettings);
DEFINE_IL2CPP_ARG_TYPE(::GorillaTag::Rendering::ZoneShaderSettings*, "GorillaTag.Rendering", "ZoneShaderSettings");
// Type namespace: GorillaTag.Rendering
namespace GorillaTag::Rendering {
  // Size: 0x119
  #pragma pack(push, 1)
  // Autogenerated type: GorillaTag.Rendering.ZoneShaderSettings
  // [TokenAttribute] Offset: FFFFFFFF
  class ZoneShaderSettings : public ::UnityEngine::MonoBehaviour/*, public ::GlobalNamespace::ITickSystemPost*/ {
    public:
    // Nested type: ::GorillaTag::Rendering::ZoneShaderSettings::EOverrideMode
    struct EOverrideMode;
    // Nested type: ::GorillaTag::Rendering::ZoneShaderSettings::EZoneLiquidType
    struct EZoneLiquidType;
    // Nested type: ::GorillaTag::Rendering::ZoneShaderSettings::ELiquidShape
    struct ELiquidShape;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: GorillaTag.Rendering.ZoneShaderSettings/EOverrideMode
    // [TokenAttribute] Offset: FFFFFFFF
    struct EOverrideMode/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: EOverrideMode
      constexpr EOverrideMode(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public GorillaTag.Rendering.ZoneShaderSettings/EOverrideMode LeaveUnchanged
      static constexpr const int LeaveUnchanged = 0;
      // Get static field: static public GorillaTag.Rendering.ZoneShaderSettings/EOverrideMode LeaveUnchanged
      static ::GorillaTag::Rendering::ZoneShaderSettings::EOverrideMode _get_LeaveUnchanged();
      // Set static field: static public GorillaTag.Rendering.ZoneShaderSettings/EOverrideMode LeaveUnchanged
      static void _set_LeaveUnchanged(::GorillaTag::Rendering::ZoneShaderSettings::EOverrideMode value);
      // static field const value: static public GorillaTag.Rendering.ZoneShaderSettings/EOverrideMode ApplyNewValue
      static constexpr const int ApplyNewValue = 1;
      // Get static field: static public GorillaTag.Rendering.ZoneShaderSettings/EOverrideMode ApplyNewValue
      static ::GorillaTag::Rendering::ZoneShaderSettings::EOverrideMode _get_ApplyNewValue();
      // Set static field: static public GorillaTag.Rendering.ZoneShaderSettings/EOverrideMode ApplyNewValue
      static void _set_ApplyNewValue(::GorillaTag::Rendering::ZoneShaderSettings::EOverrideMode value);
      // static field const value: static public GorillaTag.Rendering.ZoneShaderSettings/EOverrideMode ApplyDefaultValue
      static constexpr const int ApplyDefaultValue = 2;
      // Get static field: static public GorillaTag.Rendering.ZoneShaderSettings/EOverrideMode ApplyDefaultValue
      static ::GorillaTag::Rendering::ZoneShaderSettings::EOverrideMode _get_ApplyDefaultValue();
      // Set static field: static public GorillaTag.Rendering.ZoneShaderSettings/EOverrideMode ApplyDefaultValue
      static void _set_ApplyDefaultValue(::GorillaTag::Rendering::ZoneShaderSettings::EOverrideMode value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // GorillaTag.Rendering.ZoneShaderSettings/EOverrideMode
    #pragma pack(pop)
    static check_size<sizeof(ZoneShaderSettings::EOverrideMode), 0 + sizeof(int)> __GorillaTag_Rendering_ZoneShaderSettings_EOverrideModeSizeCheck;
    static_assert(sizeof(ZoneShaderSettings::EOverrideMode) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: GorillaTag.Rendering.ZoneShaderSettings/EZoneLiquidType
    // [TokenAttribute] Offset: FFFFFFFF
    struct EZoneLiquidType/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: EZoneLiquidType
      constexpr EZoneLiquidType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public GorillaTag.Rendering.ZoneShaderSettings/EZoneLiquidType None
      static constexpr const int None = 0;
      // Get static field: static public GorillaTag.Rendering.ZoneShaderSettings/EZoneLiquidType None
      static ::GorillaTag::Rendering::ZoneShaderSettings::EZoneLiquidType _get_None();
      // Set static field: static public GorillaTag.Rendering.ZoneShaderSettings/EZoneLiquidType None
      static void _set_None(::GorillaTag::Rendering::ZoneShaderSettings::EZoneLiquidType value);
      // static field const value: static public GorillaTag.Rendering.ZoneShaderSettings/EZoneLiquidType Water
      static constexpr const int Water = 1;
      // Get static field: static public GorillaTag.Rendering.ZoneShaderSettings/EZoneLiquidType Water
      static ::GorillaTag::Rendering::ZoneShaderSettings::EZoneLiquidType _get_Water();
      // Set static field: static public GorillaTag.Rendering.ZoneShaderSettings/EZoneLiquidType Water
      static void _set_Water(::GorillaTag::Rendering::ZoneShaderSettings::EZoneLiquidType value);
      // static field const value: static public GorillaTag.Rendering.ZoneShaderSettings/EZoneLiquidType Lava
      static constexpr const int Lava = 2;
      // Get static field: static public GorillaTag.Rendering.ZoneShaderSettings/EZoneLiquidType Lava
      static ::GorillaTag::Rendering::ZoneShaderSettings::EZoneLiquidType _get_Lava();
      // Set static field: static public GorillaTag.Rendering.ZoneShaderSettings/EZoneLiquidType Lava
      static void _set_Lava(::GorillaTag::Rendering::ZoneShaderSettings::EZoneLiquidType value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // GorillaTag.Rendering.ZoneShaderSettings/EZoneLiquidType
    #pragma pack(pop)
    static check_size<sizeof(ZoneShaderSettings::EZoneLiquidType), 0 + sizeof(int)> __GorillaTag_Rendering_ZoneShaderSettings_EZoneLiquidTypeSizeCheck;
    static_assert(sizeof(ZoneShaderSettings::EZoneLiquidType) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: GorillaTag.Rendering.ZoneShaderSettings/ELiquidShape
    // [TokenAttribute] Offset: FFFFFFFF
    struct ELiquidShape/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: ELiquidShape
      constexpr ELiquidShape(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public GorillaTag.Rendering.ZoneShaderSettings/ELiquidShape Plane
      static constexpr const int Plane = 0;
      // Get static field: static public GorillaTag.Rendering.ZoneShaderSettings/ELiquidShape Plane
      static ::GorillaTag::Rendering::ZoneShaderSettings::ELiquidShape _get_Plane();
      // Set static field: static public GorillaTag.Rendering.ZoneShaderSettings/ELiquidShape Plane
      static void _set_Plane(::GorillaTag::Rendering::ZoneShaderSettings::ELiquidShape value);
      // static field const value: static public GorillaTag.Rendering.ZoneShaderSettings/ELiquidShape Cylinder
      static constexpr const int Cylinder = 1;
      // Get static field: static public GorillaTag.Rendering.ZoneShaderSettings/ELiquidShape Cylinder
      static ::GorillaTag::Rendering::ZoneShaderSettings::ELiquidShape _get_Cylinder();
      // Set static field: static public GorillaTag.Rendering.ZoneShaderSettings/ELiquidShape Cylinder
      static void _set_Cylinder(::GorillaTag::Rendering::ZoneShaderSettings::ELiquidShape value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // GorillaTag.Rendering.ZoneShaderSettings/ELiquidShape
    #pragma pack(pop)
    static check_size<sizeof(ZoneShaderSettings::ELiquidShape), 0 + sizeof(int)> __GorillaTag_Rendering_ZoneShaderSettings_ELiquidShapeSizeCheck;
    static_assert(sizeof(ZoneShaderSettings::ELiquidShape) == 0x4);
    public:
    // private System.Boolean _activateOnAwake
    // Size: 0x1
    // Offset: 0x20
    bool activateOnAwake;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean isDefaultValues
    // Size: 0x1
    // Offset: 0x21
    bool isDefaultValues;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isDefaultValues and: groundFogColor_overrideMode
    char __padding1[0x2] = {};
    // private GorillaTag.Rendering.ZoneShaderSettings/EOverrideMode groundFogColor_overrideMode
    // Size: 0x4
    // Offset: 0x24
    ::GorillaTag::Rendering::ZoneShaderSettings::EOverrideMode groundFogColor_overrideMode;
    // Field size check
    static_assert(sizeof(::GorillaTag::Rendering::ZoneShaderSettings::EOverrideMode) == 0x4);
    // private UnityEngine.Color groundFogColor
    // Size: 0x10
    // Offset: 0x28
    ::UnityEngine::Color groundFogColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private GorillaTag.Rendering.ZoneShaderSettings/EOverrideMode groundFogDepthFade_overrideMode
    // Size: 0x4
    // Offset: 0x38
    ::GorillaTag::Rendering::ZoneShaderSettings::EOverrideMode groundFogDepthFade_overrideMode;
    // Field size check
    static_assert(sizeof(::GorillaTag::Rendering::ZoneShaderSettings::EOverrideMode) == 0x4);
    // private System.Single _groundFogDepthFadeSize
    // Size: 0x4
    // Offset: 0x3C
    float groundFogDepthFadeSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private GorillaTag.Rendering.ZoneShaderSettings/EOverrideMode groundFogHeight_overrideMode
    // Size: 0x4
    // Offset: 0x40
    ::GorillaTag::Rendering::ZoneShaderSettings::EOverrideMode groundFogHeight_overrideMode;
    // Field size check
    static_assert(sizeof(::GorillaTag::Rendering::ZoneShaderSettings::EOverrideMode) == 0x4);
    // private System.Single groundFogHeight
    // Size: 0x4
    // Offset: 0x44
    float groundFogHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private GorillaTag.Rendering.ZoneShaderSettings/EOverrideMode groundFogHeightFade_overrideMode
    // Size: 0x4
    // Offset: 0x48
    ::GorillaTag::Rendering::ZoneShaderSettings::EOverrideMode groundFogHeightFade_overrideMode;
    // Field size check
    static_assert(sizeof(::GorillaTag::Rendering::ZoneShaderSettings::EOverrideMode) == 0x4);
    // private System.Single _groundFogHeightFadeSize
    // Size: 0x4
    // Offset: 0x4C
    float groundFogHeightFadeSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private GorillaTag.Rendering.ZoneShaderSettings/EOverrideMode zoneLiquidType_overrideMode
    // Size: 0x4
    // Offset: 0x50
    ::GorillaTag::Rendering::ZoneShaderSettings::EOverrideMode zoneLiquidType_overrideMode;
    // Field size check
    static_assert(sizeof(::GorillaTag::Rendering::ZoneShaderSettings::EOverrideMode) == 0x4);
    // private GorillaTag.Rendering.ZoneShaderSettings/EZoneLiquidType zoneLiquidType
    // Size: 0x4
    // Offset: 0x54
    ::GorillaTag::Rendering::ZoneShaderSettings::EZoneLiquidType zoneLiquidType;
    // Field size check
    static_assert(sizeof(::GorillaTag::Rendering::ZoneShaderSettings::EZoneLiquidType) == 0x4);
    // private GorillaTag.Rendering.ZoneShaderSettings/EOverrideMode liquidShape_overrideMode
    // Size: 0x4
    // Offset: 0x58
    ::GorillaTag::Rendering::ZoneShaderSettings::EOverrideMode liquidShape_overrideMode;
    // Field size check
    static_assert(sizeof(::GorillaTag::Rendering::ZoneShaderSettings::EOverrideMode) == 0x4);
    // private GorillaTag.Rendering.ZoneShaderSettings/ELiquidShape liquidShape
    // Size: 0x4
    // Offset: 0x5C
    ::GorillaTag::Rendering::ZoneShaderSettings::ELiquidShape liquidShape;
    // Field size check
    static_assert(sizeof(::GorillaTag::Rendering::ZoneShaderSettings::ELiquidShape) == 0x4);
    // private GorillaTag.Rendering.ZoneShaderSettings/EOverrideMode liquidShapeRadius_overrideMode
    // Size: 0x4
    // Offset: 0x60
    ::GorillaTag::Rendering::ZoneShaderSettings::EOverrideMode liquidShapeRadius_overrideMode;
    // Field size check
    static_assert(sizeof(::GorillaTag::Rendering::ZoneShaderSettings::EOverrideMode) == 0x4);
    // private System.Single liquidShapeRadius
    // Size: 0x4
    // Offset: 0x64
    float liquidShapeRadius;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean hasLiquidBottomTransform
    // Size: 0x1
    // Offset: 0x68
    bool hasLiquidBottomTransform;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: hasLiquidBottomTransform and: liquidBottomTransform_overrideMode
    char __padding16[0x3] = {};
    // private GorillaTag.Rendering.ZoneShaderSettings/EOverrideMode liquidBottomTransform_overrideMode
    // Size: 0x4
    // Offset: 0x6C
    ::GorillaTag::Rendering::ZoneShaderSettings::EOverrideMode liquidBottomTransform_overrideMode;
    // Field size check
    static_assert(sizeof(::GorillaTag::Rendering::ZoneShaderSettings::EOverrideMode) == 0x4);
    // private UnityEngine.Transform liquidBottomTransform
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::Transform* liquidBottomTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private System.Single liquidBottomPosY_previousValue
    // Size: 0x4
    // Offset: 0x78
    float liquidBottomPosY_previousValue;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private GorillaTag.Rendering.ZoneShaderSettings/EOverrideMode zoneLiquidUVScale_overrideMode
    // Size: 0x4
    // Offset: 0x7C
    ::GorillaTag::Rendering::ZoneShaderSettings::EOverrideMode zoneLiquidUVScale_overrideMode;
    // Field size check
    static_assert(sizeof(::GorillaTag::Rendering::ZoneShaderSettings::EOverrideMode) == 0x4);
    // private System.Single zoneLiquidUVScale
    // Size: 0x4
    // Offset: 0x80
    float zoneLiquidUVScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private GorillaTag.Rendering.ZoneShaderSettings/EOverrideMode underwaterTintColor_overrideMode
    // Size: 0x4
    // Offset: 0x84
    ::GorillaTag::Rendering::ZoneShaderSettings::EOverrideMode underwaterTintColor_overrideMode;
    // Field size check
    static_assert(sizeof(::GorillaTag::Rendering::ZoneShaderSettings::EOverrideMode) == 0x4);
    // private UnityEngine.Color underwaterTintColor
    // Size: 0x10
    // Offset: 0x88
    ::UnityEngine::Color underwaterTintColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private GorillaTag.Rendering.ZoneShaderSettings/EOverrideMode underwaterFogColor_overrideMode
    // Size: 0x4
    // Offset: 0x98
    ::GorillaTag::Rendering::ZoneShaderSettings::EOverrideMode underwaterFogColor_overrideMode;
    // Field size check
    static_assert(sizeof(::GorillaTag::Rendering::ZoneShaderSettings::EOverrideMode) == 0x4);
    // private UnityEngine.Color underwaterFogColor
    // Size: 0x10
    // Offset: 0x9C
    ::UnityEngine::Color underwaterFogColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private GorillaTag.Rendering.ZoneShaderSettings/EOverrideMode underwaterFogParams_overrideMode
    // Size: 0x4
    // Offset: 0xAC
    ::GorillaTag::Rendering::ZoneShaderSettings::EOverrideMode underwaterFogParams_overrideMode;
    // Field size check
    static_assert(sizeof(::GorillaTag::Rendering::ZoneShaderSettings::EOverrideMode) == 0x4);
    // private UnityEngine.Vector4 underwaterFogParams
    // Size: 0x10
    // Offset: 0xB0
    ::UnityEngine::Vector4 underwaterFogParams;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector4) == 0x10);
    // private GorillaTag.Rendering.ZoneShaderSettings/EOverrideMode underwaterCausticsParams_overrideMode
    // Size: 0x4
    // Offset: 0xC0
    ::GorillaTag::Rendering::ZoneShaderSettings::EOverrideMode underwaterCausticsParams_overrideMode;
    // Field size check
    static_assert(sizeof(::GorillaTag::Rendering::ZoneShaderSettings::EOverrideMode) == 0x4);
    // private UnityEngine.Vector4 underwaterCausticsParams
    // Size: 0x10
    // Offset: 0xC4
    ::UnityEngine::Vector4 underwaterCausticsParams;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector4) == 0x10);
    // private GorillaTag.Rendering.ZoneShaderSettings/EOverrideMode underwaterCausticsTexture_overrideMode
    // Size: 0x4
    // Offset: 0xD4
    ::GorillaTag::Rendering::ZoneShaderSettings::EOverrideMode underwaterCausticsTexture_overrideMode;
    // Field size check
    static_assert(sizeof(::GorillaTag::Rendering::ZoneShaderSettings::EOverrideMode) == 0x4);
    // private UnityEngine.Texture2D underwaterCausticsTexture
    // Size: 0x8
    // Offset: 0xD8
    ::UnityEngine::Texture2D* underwaterCausticsTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture2D*) == 0x8);
    // private GorillaTag.Rendering.ZoneShaderSettings/EOverrideMode underwaterEffectsDistanceToSurfaceFade_overrideMode
    // Size: 0x4
    // Offset: 0xE0
    ::GorillaTag::Rendering::ZoneShaderSettings::EOverrideMode underwaterEffectsDistanceToSurfaceFade_overrideMode;
    // Field size check
    static_assert(sizeof(::GorillaTag::Rendering::ZoneShaderSettings::EOverrideMode) == 0x4);
    // private UnityEngine.Vector2 underwaterEffectsDistanceToSurfaceFade
    // Size: 0x8
    // Offset: 0xE4
    ::UnityEngine::Vector2 underwaterEffectsDistanceToSurfaceFade;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private GorillaTag.Rendering.ZoneShaderSettings/EOverrideMode liquidResidueTex_overrideMode
    // Size: 0x4
    // Offset: 0xEC
    ::GorillaTag::Rendering::ZoneShaderSettings::EOverrideMode liquidResidueTex_overrideMode;
    // Field size check
    static_assert(sizeof(::GorillaTag::Rendering::ZoneShaderSettings::EOverrideMode) == 0x4);
    // private UnityEngine.Texture2D liquidResidueTex
    // Size: 0x8
    // Offset: 0xF0
    ::UnityEngine::Texture2D* liquidResidueTex;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture2D*) == 0x8);
    // private readonly System.Int32 shaderParam_GlobalMainWaterSurfacePlane
    // Size: 0x4
    // Offset: 0xF8
    int shaderParam_GlobalMainWaterSurfacePlane;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean hasMainWaterSurfacePlane
    // Size: 0x1
    // Offset: 0xFC
    bool hasMainWaterSurfacePlane;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean hasDynamicWaterSurfacePlane
    // Size: 0x1
    // Offset: 0xFD
    bool hasDynamicWaterSurfacePlane;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: hasDynamicWaterSurfacePlane and: mainWaterSurfacePlane_overrideMode
    char __padding38[0x2] = {};
    // private GorillaTag.Rendering.ZoneShaderSettings/EOverrideMode mainWaterSurfacePlane_overrideMode
    // Size: 0x4
    // Offset: 0x100
    ::GorillaTag::Rendering::ZoneShaderSettings::EOverrideMode mainWaterSurfacePlane_overrideMode;
    // Field size check
    static_assert(sizeof(::GorillaTag::Rendering::ZoneShaderSettings::EOverrideMode) == 0x4);
    // Padding between fields: mainWaterSurfacePlane_overrideMode and: mainWaterSurfacePlane
    char __padding39[0x4] = {};
    // private UnityEngine.Transform mainWaterSurfacePlane
    // Size: 0x8
    // Offset: 0x108
    ::UnityEngine::Transform* mainWaterSurfacePlane;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private GorillaTag.Rendering.ZoneShaderSettings/EOverrideMode zoneWeatherMapDissolveProgress_overrideMode
    // Size: 0x4
    // Offset: 0x110
    ::GorillaTag::Rendering::ZoneShaderSettings::EOverrideMode zoneWeatherMapDissolveProgress_overrideMode;
    // Field size check
    static_assert(sizeof(::GorillaTag::Rendering::ZoneShaderSettings::EOverrideMode) == 0x4);
    // private System.Single zoneWeatherMapDissolveProgress
    // Size: 0x4
    // Offset: 0x114
    float zoneWeatherMapDissolveProgress;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean <ITickSystemPost.PostTickRunning>k__BackingField
    // Size: 0x1
    // Offset: 0x118
    bool PostTickRunning;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating interface conversion operator: operator ::GlobalNamespace::ITickSystemPost
    operator ::GlobalNamespace::ITickSystemPost() noexcept {
      return *reinterpret_cast<::GlobalNamespace::ITickSystemPost*>(this);
    }
    // Get static field: static private System.Boolean isInitialized
    static bool _get_isInitialized();
    // Set static field: static private System.Boolean isInitialized
    static void _set_isInitialized(bool value);
    // Get static field: static private GorillaTag.Rendering.ZoneShaderSettings <defaultsInstance>k__BackingField
    static ::GorillaTag::Rendering::ZoneShaderSettings* _get_$defaultsInstance$k__BackingField();
    // Set static field: static private GorillaTag.Rendering.ZoneShaderSettings <defaultsInstance>k__BackingField
