// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.IO.Stream
#include "System/IO/Stream.hpp"
// Including type: System.Security.Cryptography.CryptoStreamMode
#include "System/Security/Cryptography/CryptoStreamMode.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Security::Cryptography
namespace System::Security::Cryptography {
  // Forward declaring type: ICryptoTransform
  class ICryptoTransform;
}
// Forward declaring namespace: System::Threading
namespace System::Threading {
  // Forward declaring type: SemaphoreSlim
  class SemaphoreSlim;
  // Forward declaring type: CancellationToken
  struct CancellationToken;
}
// Forward declaring namespace: System::Threading::Tasks
namespace System::Threading::Tasks {
  // Forward declaring type: Task`1<TResult>
  template<typename TResult>
  class Task_1;
  // Forward declaring type: Task
  class Task;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: SeekOrigin
  struct SeekOrigin;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: IAsyncResult
  class IAsyncResult;
  // Forward declaring type: AsyncCallback
  class AsyncCallback;
}
// Completed forward declares
// Type namespace: System.Security.Cryptography
namespace System::Security::Cryptography {
  // Forward declaring type: CryptoStream
  class CryptoStream;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Security::Cryptography::CryptoStream);
DEFINE_IL2CPP_ARG_TYPE(::System::Security::Cryptography::CryptoStream*, "System.Security.Cryptography", "CryptoStream");
// Type namespace: System.Security.Cryptography
namespace System::Security::Cryptography {
  // Size: 0x71
  #pragma pack(push, 1)
  // Autogenerated type: System.Security.Cryptography.CryptoStream
  // [TokenAttribute] Offset: FFFFFFFF
  class CryptoStream : public ::System::IO::Stream {
    public:
    // Nested type: ::System::Security::Cryptography::CryptoStream::$ReadAsyncInternal$d__37
    struct $ReadAsyncInternal$d__37;
    // Nested type: ::System::Security::Cryptography::CryptoStream::$ReadAsyncCore$d__42
    struct $ReadAsyncCore$d__42;
    // Nested type: ::System::Security::Cryptography::CryptoStream::$WriteAsyncInternal$d__46
    struct $WriteAsyncInternal$d__46;
    // Nested type: ::System::Security::Cryptography::CryptoStream::$WriteAsyncCore$d__49
    struct $WriteAsyncCore$d__49;
    // Nested type: ::System::Security::Cryptography::CryptoStream::$$c
    class $$c;
    public:
    // private readonly System.IO.Stream _stream
    // Size: 0x8
    // Offset: 0x28
    ::System::IO::Stream* stream;
    // Field size check
    static_assert(sizeof(::System::IO::Stream*) == 0x8);
    // private readonly System.Security.Cryptography.ICryptoTransform _transform
    // Size: 0x8
    // Offset: 0x30
    ::System::Security::Cryptography::ICryptoTransform* transform;
    // Field size check
    static_assert(sizeof(::System::Security::Cryptography::ICryptoTransform*) == 0x8);
    // private readonly System.Security.Cryptography.CryptoStreamMode _transformMode
    // Size: 0x4
    // Offset: 0x38
    ::System::Security::Cryptography::CryptoStreamMode transformMode;
    // Field size check
    static_assert(sizeof(::System::Security::Cryptography::CryptoStreamMode) == 0x4);
    // Padding between fields: transformMode and: inputBuffer
    char __padding2[0x4] = {};
    // private System.Byte[] _inputBuffer
    // Size: 0x8
    // Offset: 0x40
    ::ArrayW<uint8_t> inputBuffer;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // private System.Int32 _inputBufferIndex
    // Size: 0x4
    // Offset: 0x48
    int inputBufferIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _inputBlockSize
    // Size: 0x4
    // Offset: 0x4C
    int inputBlockSize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Byte[] _outputBuffer
    // Size: 0x8
    // Offset: 0x50
    ::ArrayW<uint8_t> outputBuffer;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // private System.Int32 _outputBufferIndex
    // Size: 0x4
    // Offset: 0x58
    int outputBufferIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _outputBlockSize
    // Size: 0x4
    // Offset: 0x5C
    int outputBlockSize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean _canRead
    // Size: 0x1
    // Offset: 0x60
    bool canRead;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _canWrite
    // Size: 0x1
    // Offset: 0x61
    bool canWrite;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _finalBlockTransformed
    // Size: 0x1
    // Offset: 0x62
    bool finalBlockTransformed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: finalBlockTransformed and: lazyAsyncActiveSemaphore
    char __padding11[0x5] = {};
    // private System.Threading.SemaphoreSlim _lazyAsyncActiveSemaphore
    // Size: 0x8
    // Offset: 0x68
    ::System::Threading::SemaphoreSlim* lazyAsyncActiveSemaphore;
    // Field size check
    static_assert(sizeof(::System::Threading::SemaphoreSlim*) == 0x8);
    // private readonly System.Boolean _leaveOpen
    // Size: 0x1
    // Offset: 0x70
    bool leaveOpen;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get instance field reference: private readonly System.IO.Stream _stream
    [[deprecated("Use field access instead!")]] ::System::IO::Stream*& dyn__stream();
    // Get instance field reference: private readonly System.Security.Cryptography.ICryptoTransform _transform
    [[deprecated("Use field access instead!")]] ::System::Security::Cryptography::ICryptoTransform*& dyn__transform();
    // Get instance field reference: private readonly System.Security.Cryptography.CryptoStreamMode _transformMode
    [[deprecated("Use field access instead!")]] ::System::Security::Cryptography::CryptoStreamMode& dyn__transformMode();
    // Get instance field reference: private System.Byte[] _inputBuffer
    [[deprecated("Use field access instead!")]] ::ArrayW<uint8_t>& dyn__inputBuffer();
    // Get instance field reference: private System.Int32 _inputBufferIndex
