// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: Oculus.Interaction.TubePoint
#include "Oculus/Interaction/TubePoint.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Oculus::Interaction::Locomotion
namespace Oculus::Interaction::Locomotion {
  // Forward declaring type: LocomotionTurnerInteractor
  class LocomotionTurnerInteractor;
  // Forward declaring type: TurnerEventBroadcaster
  class TurnerEventBroadcaster;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Skipping declaration: Object because it is already included!
  // Forward declaring type: Renderer
  class Renderer;
  // Forward declaring type: Vector2
  struct Vector2;
}
// Forward declaring namespace: Oculus::Interaction::Input
namespace Oculus::Interaction::Input {
  // Forward declaring type: IAxis1D
  class IAxis1D;
}
// Forward declaring namespace: Oculus::Interaction
namespace Oculus::Interaction {
  // Forward declaring type: TubeRenderer
  class TubeRenderer;
  // Forward declaring type: MaterialPropertyBlockEditor
  class MaterialPropertyBlockEditor;
  // Forward declaring type: InteractorStateChangeArgs
  struct InteractorStateChangeArgs;
}
// Completed forward declares
// Type namespace: Oculus.Interaction.Locomotion
namespace Oculus::Interaction::Locomotion {
  // Forward declaring type: LocomotionTurnerInteractorVisual
  class LocomotionTurnerInteractorVisual;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Oculus::Interaction::Locomotion::LocomotionTurnerInteractorVisual);
DEFINE_IL2CPP_ARG_TYPE(::Oculus::Interaction::Locomotion::LocomotionTurnerInteractorVisual*, "Oculus.Interaction.Locomotion", "LocomotionTurnerInteractorVisual");
// Type namespace: Oculus.Interaction.Locomotion
namespace Oculus::Interaction::Locomotion {
  // Size: 0xDD
  #pragma pack(push, 1)
  // Autogenerated type: Oculus.Interaction.Locomotion.LocomotionTurnerInteractorVisual
  // [TokenAttribute] Offset: FFFFFFFF
  class LocomotionTurnerInteractorVisual : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private Oculus.Interaction.Locomotion.LocomotionTurnerInteractor _turner
    // Size: 0x8
    // Offset: 0x20
    ::Oculus::Interaction::Locomotion::LocomotionTurnerInteractor* turner;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::Locomotion::LocomotionTurnerInteractor*) == 0x8);
    // private Oculus.Interaction.Locomotion.TurnerEventBroadcaster _broadcaster
    // Size: 0x8
    // Offset: 0x28
    ::Oculus::Interaction::Locomotion::TurnerEventBroadcaster* broadcaster;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::Locomotion::TurnerEventBroadcaster*) == 0x8);
    // private UnityEngine.Transform _lookAt
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Transform* lookAt;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Object _progress
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::Object* progress;
    // Field size check
    static_assert(sizeof(::UnityEngine::Object*) == 0x8);
    // private Oculus.Interaction.Input.IAxis1D <Progress>k__BackingField
    // Size: 0x8
    // Offset: 0x40
    ::Oculus::Interaction::Input::IAxis1D* Progress;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::Input::IAxis1D*) == 0x8);
    // private UnityEngine.Transform _root
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::Transform* root;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Renderer _leftArrow
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::Renderer* leftArrow;
    // Field size check
    static_assert(sizeof(::UnityEngine::Renderer*) == 0x8);
    // private UnityEngine.Renderer _rightArrow
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::Renderer* rightArrow;
    // Field size check
    static_assert(sizeof(::UnityEngine::Renderer*) == 0x8);
    // private Oculus.Interaction.TubeRenderer _leftRail
    // Size: 0x8
    // Offset: 0x60
    ::Oculus::Interaction::TubeRenderer* leftRail;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::TubeRenderer*) == 0x8);
    // private Oculus.Interaction.TubeRenderer _rightRail
    // Size: 0x8
    // Offset: 0x68
    ::Oculus::Interaction::TubeRenderer* rightRail;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::TubeRenderer*) == 0x8);
    // private Oculus.Interaction.TubeRenderer _leftTrail
    // Size: 0x8
    // Offset: 0x70
    ::Oculus::Interaction::TubeRenderer* leftTrail;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::TubeRenderer*) == 0x8);
    // private Oculus.Interaction.TubeRenderer _rightTrail
    // Size: 0x8
    // Offset: 0x78
    ::Oculus::Interaction::TubeRenderer* rightTrail;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::TubeRenderer*) == 0x8);
    // private Oculus.Interaction.MaterialPropertyBlockEditor _leftMaterialBlock
    // Size: 0x8
    // Offset: 0x80
    ::Oculus::Interaction::MaterialPropertyBlockEditor* leftMaterialBlock;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::MaterialPropertyBlockEditor*) == 0x8);
    // private Oculus.Interaction.MaterialPropertyBlockEditor _rightMaterialBlock
    // Size: 0x8
    // Offset: 0x88
    ::Oculus::Interaction::MaterialPropertyBlockEditor* rightMaterialBlock;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::MaterialPropertyBlockEditor*) == 0x8);
    // private System.Single _verticalOffset
    // Size: 0x4
    // Offset: 0x90
    float verticalOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _radius
    // Size: 0x4
    // Offset: 0x94
    float radius;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _margin
    // Size: 0x4
    // Offset: 0x98
    float margin;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _trailLength
    // Size: 0x4
    // Offset: 0x9C
    float trailLength;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _maxAngle
    // Size: 0x4
    // Offset: 0xA0
    float maxAngle;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _railGap
    // Size: 0x4
    // Offset: 0xA4
    float railGap;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _squeezeLength
    // Size: 0x4
    // Offset: 0xA8
    float squeezeLength;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Color _disabledColor
    // Size: 0x10
    // Offset: 0xAC
    ::UnityEngine::Color disabledColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color _enabledColor
    // Size: 0x10
    // Offset: 0xBC
    ::UnityEngine::Color enabledColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color _highligtedColor
    // Size: 0x10
    // Offset: 0xCC
    ::UnityEngine::Color highligtedColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // protected System.Boolean _started
    // Size: 0x1
    // Offset: 0xDC
    bool started;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // static field const value: static private System.Single _degreesPerSegment
    static constexpr const float _degreesPerSegment = 1;
    // Get static field: static private System.Single _degreesPerSegment
    static float _get__degreesPerSegment();
    // Set static field: static private System.Single _degreesPerSegment
    static void _set__degreesPerSegment(float value);
    // Get static field: static private readonly UnityEngine.Quaternion _rotationCorrectionLeft
    static ::UnityEngine::Quaternion _get__rotationCorrectionLeft();
    // Set static field: static private readonly UnityEngine.Quaternion _rotationCorrectionLeft
    static void _set__rotationCorrectionLeft(::UnityEngine::Quaternion value);
    // Get static field: static private readonly System.Int32 _colorShaderPropertyID
    static int _get__colorShaderPropertyID();
