// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Pose
#include "UnityEngine/Pose.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: Oculus::Interaction::Locomotion
namespace Oculus::Interaction::Locomotion {
  // Skipping declaration: LocomotionMode because it is already included!
  // Forward declaring type: VirtualActiveState
  class VirtualActiveState;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Skipping declaration: Object because it is already included!
  // Forward declaring type: Transform
  class Transform;
}
// Forward declaring namespace: Oculus::Interaction::Input
namespace Oculus::Interaction::Input {
  // Forward declaring type: IHand
  class IHand;
}
// Forward declaring namespace: Oculus::Interaction
namespace Oculus::Interaction {
  // Forward declaring type: IActiveState
  class IActiveState;
}
// Completed forward declares
// Type namespace: Oculus.Interaction.Locomotion
namespace Oculus::Interaction::Locomotion {
  // Forward declaring type: LocomotionGate
  class LocomotionGate;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Oculus::Interaction::Locomotion::LocomotionGate);
DEFINE_IL2CPP_ARG_TYPE(::Oculus::Interaction::Locomotion::LocomotionGate*, "Oculus.Interaction.Locomotion", "LocomotionGate");
// Type namespace: Oculus.Interaction.Locomotion
namespace Oculus::Interaction::Locomotion {
  // Size: 0xB1
  #pragma pack(push, 1)
  // Autogenerated type: Oculus.Interaction.Locomotion.LocomotionGate
  // [TokenAttribute] Offset: FFFFFFFF
  class LocomotionGate : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::Oculus::Interaction::Locomotion::LocomotionGate::LocomotionMode
    struct LocomotionMode;
    // Nested type: ::Oculus::Interaction::Locomotion::LocomotionGate::GateSection
    class GateSection;
    // Nested type: ::Oculus::Interaction::Locomotion::LocomotionGate::LocomotionModeEventArgs
    struct LocomotionModeEventArgs;
    // Nested type: ::Oculus::Interaction::Locomotion::LocomotionGate::$$c
    class $$c;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: Oculus.Interaction.Locomotion.LocomotionGate/LocomotionMode
    // [TokenAttribute] Offset: FFFFFFFF
    struct LocomotionMode/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: LocomotionMode
      constexpr LocomotionMode(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public Oculus.Interaction.Locomotion.LocomotionGate/LocomotionMode None
      static constexpr const int None = 0;
      // Get static field: static public Oculus.Interaction.Locomotion.LocomotionGate/LocomotionMode None
      static ::Oculus::Interaction::Locomotion::LocomotionGate::LocomotionMode _get_None();
      // Set static field: static public Oculus.Interaction.Locomotion.LocomotionGate/LocomotionMode None
      static void _set_None(::Oculus::Interaction::Locomotion::LocomotionGate::LocomotionMode value);
      // static field const value: static public Oculus.Interaction.Locomotion.LocomotionGate/LocomotionMode Teleport
      static constexpr const int Teleport = 1;
      // Get static field: static public Oculus.Interaction.Locomotion.LocomotionGate/LocomotionMode Teleport
      static ::Oculus::Interaction::Locomotion::LocomotionGate::LocomotionMode _get_Teleport();
      // Set static field: static public Oculus.Interaction.Locomotion.LocomotionGate/LocomotionMode Teleport
      static void _set_Teleport(::Oculus::Interaction::Locomotion::LocomotionGate::LocomotionMode value);
      // static field const value: static public Oculus.Interaction.Locomotion.LocomotionGate/LocomotionMode Turn
      static constexpr const int Turn = 2;
      // Get static field: static public Oculus.Interaction.Locomotion.LocomotionGate/LocomotionMode Turn
      static ::Oculus::Interaction::Locomotion::LocomotionGate::LocomotionMode _get_Turn();
      // Set static field: static public Oculus.Interaction.Locomotion.LocomotionGate/LocomotionMode Turn
      static void _set_Turn(::Oculus::Interaction::Locomotion::LocomotionGate::LocomotionMode value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // Oculus.Interaction.Locomotion.LocomotionGate/LocomotionMode
    #pragma pack(pop)
    static check_size<sizeof(LocomotionGate::LocomotionMode), 0 + sizeof(int)> __Oculus_Interaction_Locomotion_LocomotionGate_LocomotionModeSizeCheck;
    static_assert(sizeof(LocomotionGate::LocomotionMode) == 0x4);
    // Size: 0x8
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: Oculus.Interaction.Locomotion.LocomotionGate/LocomotionModeEventArgs
    // [TokenAttribute] Offset: FFFFFFFF
    struct LocomotionModeEventArgs/*, public ::System::ValueType*/ {
      public:
      public:
      // private readonly Oculus.Interaction.Locomotion.LocomotionGate/LocomotionMode <PreviousMode>k__BackingField
      // Size: 0x4
      // Offset: 0x0
      ::Oculus::Interaction::Locomotion::LocomotionGate::LocomotionMode PreviousMode;
      // Field size check
      static_assert(sizeof(::Oculus::Interaction::Locomotion::LocomotionGate::LocomotionMode) == 0x4);
      // private readonly Oculus.Interaction.Locomotion.LocomotionGate/LocomotionMode <NewMode>k__BackingField
      // Size: 0x4
      // Offset: 0x4
      ::Oculus::Interaction::Locomotion::LocomotionGate::LocomotionMode NewMode;
      // Field size check
      static_assert(sizeof(::Oculus::Interaction::Locomotion::LocomotionGate::LocomotionMode) == 0x4);
      public:
      // Creating value type constructor for type: LocomotionModeEventArgs
      constexpr LocomotionModeEventArgs(::Oculus::Interaction::Locomotion::LocomotionGate::LocomotionMode PreviousMode_ = {}, ::Oculus::Interaction::Locomotion::LocomotionGate::LocomotionMode NewMode_ = {}) noexcept : PreviousMode{PreviousMode_}, NewMode{NewMode_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: private readonly Oculus.Interaction.Locomotion.LocomotionGate/LocomotionMode <PreviousMode>k__BackingField
      [[deprecated("Use field access instead!")]] ::Oculus::Interaction::Locomotion::LocomotionGate::LocomotionMode& dyn_$PreviousMode$k__BackingField();
      // Get instance field reference: private readonly Oculus.Interaction.Locomotion.LocomotionGate/LocomotionMode <NewMode>k__BackingField
      [[deprecated("Use field access instead!")]] ::Oculus::Interaction::Locomotion::LocomotionGate::LocomotionMode& dyn_$NewMode$k__BackingField();
      // public Oculus.Interaction.Locomotion.LocomotionGate/LocomotionMode get_PreviousMode()
      // Offset: 0x4807748
      ::Oculus::Interaction::Locomotion::LocomotionGate::LocomotionMode get_PreviousMode();
      // public Oculus.Interaction.Locomotion.LocomotionGate/LocomotionMode get_NewMode()
      // Offset: 0x4807750
      ::Oculus::Interaction::Locomotion::LocomotionGate::LocomotionMode get_NewMode();
      // public System.Void .ctor(Oculus.Interaction.Locomotion.LocomotionGate/LocomotionMode previousMode, Oculus.Interaction.Locomotion.LocomotionGate/LocomotionMode newMode)
      // Offset: 0x4805FB0
      // ABORTED: conflicts with another method.  LocomotionModeEventArgs(::Oculus::Interaction::Locomotion::LocomotionGate::LocomotionMode previousMode, ::Oculus::Interaction::Locomotion::LocomotionGate::LocomotionMode newMode);
    }; // Oculus.Interaction.Locomotion.LocomotionGate/LocomotionModeEventArgs
    #pragma pack(pop)
    static check_size<sizeof(LocomotionGate::LocomotionModeEventArgs), 4 + sizeof(::Oculus::Interaction::Locomotion::LocomotionGate::LocomotionMode)> __Oculus_Interaction_Locomotion_LocomotionGate_LocomotionModeEventArgsSizeCheck;
    static_assert(sizeof(LocomotionGate::LocomotionModeEventArgs) == 0x8);
    public:
    // private UnityEngine.Object _hand
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::Object* hand;
    // Field size check
    static_assert(sizeof(::UnityEngine::Object*) == 0x8);
    // private Oculus.Interaction.Input.IHand <Hand>k__BackingField
    // Size: 0x8
    // Offset: 0x28
    ::Oculus::Interaction::Input::IHand* Hand;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::Input::IHand*) == 0x8);
    // private UnityEngine.Transform _shoulder
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Transform* shoulder;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private Oculus.Interaction.Locomotion.LocomotionGate/GateSection[] _gateSections
    // Size: 0x8
    // Offset: 0x38
    ::ArrayW<::Oculus::Interaction::Locomotion::LocomotionGate::GateSection*> gateSections;
    // Field size check
    static_assert(sizeof(::ArrayW<::Oculus::Interaction::Locomotion::LocomotionGate::GateSection*>) == 0x8);
    // private UnityEngine.Object _enableShape
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::Object* enableShape;
    // Field size check
    static_assert(sizeof(::UnityEngine::Object*) == 0x8);
    // private Oculus.Interaction.IActiveState <EnableShape>k__BackingField
    // Size: 0x8
    // Offset: 0x48
    ::Oculus::Interaction::IActiveState* EnableShape;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::IActiveState*) == 0x8);
    // private UnityEngine.Object _disableShape
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::Object* disableShape;
    // Field size check
    static_assert(sizeof(::UnityEngine::Object*) == 0x8);
    // private Oculus.Interaction.IActiveState <DisableShape>k__BackingField
    // Size: 0x8
    // Offset: 0x58
    ::Oculus::Interaction::IActiveState* DisableShape;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::IActiveState*) == 0x8);
    // private Oculus.Interaction.Locomotion.VirtualActiveState _turningState
    // Size: 0x8
    // Offset: 0x60
    ::Oculus::Interaction::Locomotion::VirtualActiveState* turningState;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::Locomotion::VirtualActiveState*) == 0x8);
    // private Oculus.Interaction.Locomotion.VirtualActiveState _teleportState
    // Size: 0x8
    // Offset: 0x68
    ::Oculus::Interaction::Locomotion::VirtualActiveState* teleportState;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::Locomotion::VirtualActiveState*) == 0x8);
    // protected System.Boolean _started
    // Size: 0x1
    // Offset: 0x70
    bool started;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _previousShapeEnabled
    // Size: 0x1
    // Offset: 0x71
    bool previousShapeEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: previousShapeEnabled and: currentGateIndex
    char __padding11[0x2] = {};
    // private System.Int32 _currentGateIndex
    // Size: 0x4
    // Offset: 0x74
    int currentGateIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private Oculus.Interaction.Locomotion.LocomotionGate/LocomotionMode _activeMode
    // Size: 0x4
    // Offset: 0x78
    ::Oculus::Interaction::Locomotion::LocomotionGate::LocomotionMode activeMode;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::Locomotion::LocomotionGate::LocomotionMode) == 0x4);
    // private System.Single <CurrentAngle>k__BackingField
    // Size: 0x4
    // Offset: 0x7C
    float CurrentAngle;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector3 <WristDirection>k__BackingField
    // Size: 0xC
    // Offset: 0x80
    ::UnityEngine::Vector3 WristDirection;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Pose <StabilizationPose>k__BackingField
    // Size: 0x1C
    // Offset: 0x8C
    ::UnityEngine::Pose StabilizationPose;
    // Field size check
    static_assert(sizeof(::UnityEngine::Pose) == 0x1C);
    // private System.Action`1<Oculus.Interaction.Locomotion.LocomotionGate/LocomotionModeEventArgs> _whenActiveModeChanged
    // Size: 0x8
    // Offset: 0xA8
    ::System::Action_1<::Oculus::Interaction::Locomotion::LocomotionGate::LocomotionModeEventArgs>* whenActiveModeChanged;
    // Field size check
    static_assert(sizeof(::System::Action_1<::Oculus::Interaction::Locomotion::LocomotionGate::LocomotionModeEventArgs>*) == 0x8);
    // private System.Boolean _cancelled
    // Size: 0x1
    // Offset: 0xB0
    bool cancelled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get static field: static private readonly Oculus.Interaction.Locomotion.LocomotionGate/GateSection DefaultSection
    static ::Oculus::Interaction::Locomotion::LocomotionGate::GateSection* _get_DefaultSection();
    // Set static field: static private readonly Oculus.Interaction.Locomotion.LocomotionGate/GateSection DefaultSection
    static void _set_DefaultSection(::Oculus::Interaction::Locomotion::LocomotionGate::GateSection* value);
    // static field const value: static private System.Single _enterPoseThreshold
    static constexpr const float _enterPoseThreshold = 0.5;
    // Get static field: static private System.Single _enterPoseThreshold
    static float _get__enterPoseThreshold();
    // Set static field: static private System.Single _enterPoseThreshold
    static void _set__enterPoseThreshold(float value);
