// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: Oculus.Interaction.TubePoint
#include "Oculus/Interaction/TubePoint.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Oculus::Interaction::Locomotion
namespace Oculus::Interaction::Locomotion {
  // Forward declaring type: TeleportInteractor
  class TeleportInteractor;
  // Forward declaring type: TeleportInteractable
  class TeleportInteractable;
}
// Forward declaring namespace: Oculus::Interaction
namespace Oculus::Interaction {
  // Forward declaring type: TubeRenderer
  class TubeRenderer;
  // Forward declaring type: PinchPointerVisual
  class PinchPointerVisual;
  // Forward declaring type: InteractorStateChangeArgs
  struct InteractorStateChangeArgs;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Skipping declaration: Object because it is already included!
  // Forward declaring type: Pose
  struct Pose;
  // Skipping declaration: Vector3 because it is already included!
}
// Forward declaring namespace: Oculus::Interaction::Input
namespace Oculus::Interaction::Input {
  // Forward declaring type: IAxis1D
  class IAxis1D;
}
// Forward declaring namespace: Oculus::Interaction::DistanceReticles
namespace Oculus::Interaction::DistanceReticles {
  // Forward declaring type: IReticleData
  class IReticleData;
}
// Completed forward declares
// Type namespace: Oculus.Interaction.Locomotion
namespace Oculus::Interaction::Locomotion {
  // Forward declaring type: TeleportProceduralArcVisual
  class TeleportProceduralArcVisual;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Oculus::Interaction::Locomotion::TeleportProceduralArcVisual);
DEFINE_IL2CPP_ARG_TYPE(::Oculus::Interaction::Locomotion::TeleportProceduralArcVisual*, "Oculus.Interaction.Locomotion", "TeleportProceduralArcVisual");
// Type namespace: Oculus.Interaction.Locomotion
namespace Oculus::Interaction::Locomotion {
  // Size: 0x79
  #pragma pack(push, 1)
  // Autogenerated type: Oculus.Interaction.Locomotion.TeleportProceduralArcVisual
  // [TokenAttribute] Offset: FFFFFFFF
  class TeleportProceduralArcVisual : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private Oculus.Interaction.Locomotion.TeleportInteractor _interactor
    // Size: 0x8
    // Offset: 0x20
    ::Oculus::Interaction::Locomotion::TeleportInteractor* interactor;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::Locomotion::TeleportInteractor*) == 0x8);
    // private Oculus.Interaction.TubeRenderer _tubeRenderer
    // Size: 0x8
    // Offset: 0x28
    ::Oculus::Interaction::TubeRenderer* tubeRenderer;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::TubeRenderer*) == 0x8);
    // private Oculus.Interaction.PinchPointerVisual _pointer
    // Size: 0x8
    // Offset: 0x30
    ::Oculus::Interaction::PinchPointerVisual* pointer;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::PinchPointerVisual*) == 0x8);
    // private UnityEngine.Transform _pointerAnchor
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::Transform* pointerAnchor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Object _progress
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::Object* progress;
    // Field size check
    static_assert(sizeof(::UnityEngine::Object*) == 0x8);
    // private Oculus.Interaction.Input.IAxis1D Progress
    // Size: 0x8
    // Offset: 0x48
    ::Oculus::Interaction::Input::IAxis1D* Progress;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::Input::IAxis1D*) == 0x8);
    // private System.Int32 _arcPointsCount
    // Size: 0x4
    // Offset: 0x50
    int arcPointsCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.Color _noDestinationTint
    // Size: 0x10
    // Offset: 0x54
    ::UnityEngine::Color noDestinationTint;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // Padding between fields: noDestinationTint and: arcPoints
    char __padding7[0x4] = {};
    // private Oculus.Interaction.TubePoint[] _arcPoints
    // Size: 0x8
    // Offset: 0x68
    ::ArrayW<::Oculus::Interaction::TubePoint> arcPoints;
    // Field size check
    static_assert(sizeof(::ArrayW<::Oculus::Interaction::TubePoint>) == 0x8);
    // private Oculus.Interaction.DistanceReticles.IReticleData _reticleData
    // Size: 0x8
    // Offset: 0x70
    ::Oculus::Interaction::DistanceReticles::IReticleData* reticleData;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::DistanceReticles::IReticleData*) == 0x8);
    // protected System.Boolean _started
    // Size: 0x1
    // Offset: 0x78
    bool started;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get static field: static private System.Single[,] MIDPOINT_FACTOR
    static ::ArrayW<float> _get_MIDPOINT_FACTOR();
    // Set static field: static private System.Single[,] MIDPOINT_FACTOR
    static void _set_MIDPOINT_FACTOR(::ArrayW<float> value);
    // Get instance field reference: private Oculus.Interaction.Locomotion.TeleportInteractor _interactor
    [[deprecated("Use field access instead!")]] ::Oculus::Interaction::Locomotion::TeleportInteractor*& dyn__interactor();
    // Get instance field reference: private Oculus.Interaction.TubeRenderer _tubeRenderer
    [[deprecated("Use field access instead!")]] ::Oculus::Interaction::TubeRenderer*& dyn__tubeRenderer();
    // Get instance field reference: private Oculus.Interaction.PinchPointerVisual _pointer
    [[deprecated("Use field access instead!")]] ::Oculus::Interaction::PinchPointerVisual*& dyn__pointer();
