// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: Oculus.Interaction.Locomotion.ILocomotionEventBroadcaster
#include "Oculus/Interaction/Locomotion/ILocomotionEventBroadcaster.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: AnimationCurve
  class AnimationCurve;
  // Skipping declaration: Object because it is already included!
}
// Forward declaring namespace: Oculus::Interaction::Locomotion
namespace Oculus::Interaction::Locomotion {
  // Skipping declaration: TurnMode because it is already included!
}
// Forward declaring namespace: Oculus::Interaction
namespace Oculus::Interaction {
  // Forward declaring type: IInteractor
  class IInteractor;
  // Forward declaring type: UniqueIdentifier
  class UniqueIdentifier;
  // Forward declaring type: InteractorStateChangeArgs
  struct InteractorStateChangeArgs;
}
// Forward declaring namespace: Oculus::Interaction::Input
namespace Oculus::Interaction::Input {
  // Forward declaring type: IAxis1D
  class IAxis1D;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Completed forward declares
// Type namespace: Oculus.Interaction.Locomotion
namespace Oculus::Interaction::Locomotion {
  // Forward declaring type: TurnerEventBroadcaster
  class TurnerEventBroadcaster;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Oculus::Interaction::Locomotion::TurnerEventBroadcaster);
DEFINE_IL2CPP_ARG_TYPE(::Oculus::Interaction::Locomotion::TurnerEventBroadcaster*, "Oculus.Interaction.Locomotion", "TurnerEventBroadcaster");
// Type namespace: Oculus.Interaction.Locomotion
namespace Oculus::Interaction::Locomotion {
  // Size: 0x70
  #pragma pack(push, 1)
  // Autogenerated type: Oculus.Interaction.Locomotion.TurnerEventBroadcaster
  // [TokenAttribute] Offset: FFFFFFFF
  class TurnerEventBroadcaster : public ::UnityEngine::MonoBehaviour/*, public ::Oculus::Interaction::Locomotion::ILocomotionEventBroadcaster*/ {
    public:
    // Nested type: ::Oculus::Interaction::Locomotion::TurnerEventBroadcaster::TurnMode
    struct TurnMode;
    // Nested type: ::Oculus::Interaction::Locomotion::TurnerEventBroadcaster::$$c
    class $$c;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: Oculus.Interaction.Locomotion.TurnerEventBroadcaster/TurnMode
    // [TokenAttribute] Offset: FFFFFFFF
    struct TurnMode/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: TurnMode
      constexpr TurnMode(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public Oculus.Interaction.Locomotion.TurnerEventBroadcaster/TurnMode Snap
      static constexpr const int Snap = 0;
      // Get static field: static public Oculus.Interaction.Locomotion.TurnerEventBroadcaster/TurnMode Snap
      static ::Oculus::Interaction::Locomotion::TurnerEventBroadcaster::TurnMode _get_Snap();
      // Set static field: static public Oculus.Interaction.Locomotion.TurnerEventBroadcaster/TurnMode Snap
      static void _set_Snap(::Oculus::Interaction::Locomotion::TurnerEventBroadcaster::TurnMode value);
      // static field const value: static public Oculus.Interaction.Locomotion.TurnerEventBroadcaster/TurnMode Smooth
      static constexpr const int Smooth = 1;
      // Get static field: static public Oculus.Interaction.Locomotion.TurnerEventBroadcaster/TurnMode Smooth
      static ::Oculus::Interaction::Locomotion::TurnerEventBroadcaster::TurnMode _get_Smooth();
      // Set static field: static public Oculus.Interaction.Locomotion.TurnerEventBroadcaster/TurnMode Smooth
      static void _set_Smooth(::Oculus::Interaction::Locomotion::TurnerEventBroadcaster::TurnMode value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // Oculus.Interaction.Locomotion.TurnerEventBroadcaster/TurnMode
    #pragma pack(pop)
    static check_size<sizeof(TurnerEventBroadcaster::TurnMode), 0 + sizeof(int)> __Oculus_Interaction_Locomotion_TurnerEventBroadcaster_TurnModeSizeCheck;
    static_assert(sizeof(TurnerEventBroadcaster::TurnMode) == 0x4);
    public:
    // private UnityEngine.Object _interactor
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::Object* interactor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Object*) == 0x8);
    // private Oculus.Interaction.IInteractor <Interactor>k__BackingField
    // Size: 0x8
    // Offset: 0x28
    ::Oculus::Interaction::IInteractor* Interactor;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::IInteractor*) == 0x8);
    // private UnityEngine.Object _axis
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Object* axis;
    // Field size check
    static_assert(sizeof(::UnityEngine::Object*) == 0x8);
    // private Oculus.Interaction.Input.IAxis1D <Axis>k__BackingField
    // Size: 0x8
    // Offset: 0x38
    ::Oculus::Interaction::Input::IAxis1D* Axis;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::Input::IAxis1D*) == 0x8);
    // private Oculus.Interaction.Locomotion.TurnerEventBroadcaster/TurnMode _turnMethod
    // Size: 0x4
    // Offset: 0x40
    ::Oculus::Interaction::Locomotion::TurnerEventBroadcaster::TurnMode turnMethod;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::Locomotion::TurnerEventBroadcaster::TurnMode) == 0x4);
    // private System.Single _snapTurnDegrees
    // Size: 0x4
    // Offset: 0x44
    float snapTurnDegrees;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.AnimationCurve _smoothTurnCurve
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::AnimationCurve* smoothTurnCurve;
    // Field size check
    static_assert(sizeof(::UnityEngine::AnimationCurve*) == 0x8);
    // private System.Boolean _fireSnapOnUnselect
    // Size: 0x1
    // Offset: 0x50
    bool fireSnapOnUnselect;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: fireSnapOnUnselect and: identifier
    char __padding7[0x7] = {};
    // private Oculus.Interaction.UniqueIdentifier _identifier
    // Size: 0x8
    // Offset: 0x58
    ::Oculus::Interaction::UniqueIdentifier* identifier;
    // Field size check
    static_assert(sizeof(::Oculus::Interaction::UniqueIdentifier*) == 0x8);
    // private System.Boolean _wasSelecting
    // Size: 0x1
    // Offset: 0x60
    bool wasSelecting;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean _started
    // Size: 0x1
    // Offset: 0x61
    bool started;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: started and: whenLocomotionEventRaised
    char __padding10[0x6] = {};
    // private System.Action`1<Oculus.Interaction.Locomotion.LocomotionEvent> _whenLocomotionEventRaised
    // Size: 0x8
    // Offset: 0x68
    ::System::Action_1<::Oculus::Interaction::Locomotion::LocomotionEvent>* whenLocomotionEventRaised;
    // Field size check
    static_assert(sizeof(::System::Action_1<::Oculus::Interaction::Locomotion::LocomotionEvent>*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::Oculus::Interaction::Locomotion::ILocomotionEventBroadcaster
    operator ::Oculus::Interaction::Locomotion::ILocomotionEventBroadcaster() noexcept {
      return *reinterpret_cast<::Oculus::Interaction::Locomotion::ILocomotionEventBroadcaster*>(this);
    }
    // Get instance field reference: private UnityEngine.Object _interactor
    [[deprecated("Use field access instead!")]] ::UnityEngine::Object*& dyn__interactor();
    // Get instance field reference: private Oculus.Interaction.IInteractor <Interactor>k__BackingField
    [[deprecated("Use field access instead!")]] ::Oculus::Interaction::IInteractor*& dyn_$Interactor$k__BackingField();
