// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Photon.Voice.Unity.VoiceComponent
#include "Photon/Voice/Unity/VoiceComponent.hpp"
// Including type: UnityEngine.AudioSpeakerMode
#include "UnityEngine/AudioSpeakerMode.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Photon::Voice
namespace Photon::Voice {
  // Forward declaring type: WebRTCAudioProcessor
  class WebRTCAudioProcessor;
  // Forward declaring type: LocalVoiceAudioShort
  class LocalVoiceAudioShort;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: AudioListener
  class AudioListener;
}
// Forward declaring namespace: Photon::Voice::Unity
namespace Photon::Voice::Unity {
  // Forward declaring type: AudioOutCapture
  class AudioOutCapture;
  // Forward declaring type: Recorder
  class Recorder;
  // Forward declaring type: PhotonVoiceCreatedParams
  class PhotonVoiceCreatedParams;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Completed forward declares
// Type namespace: Photon.Voice.Unity
namespace Photon::Voice::Unity {
  // Forward declaring type: WebRtcAudioDsp
  class WebRtcAudioDsp;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Photon::Voice::Unity::WebRtcAudioDsp);
DEFINE_IL2CPP_ARG_TYPE(::Photon::Voice::Unity::WebRtcAudioDsp*, "Photon.Voice.Unity", "WebRtcAudioDsp");
// Type namespace: Photon.Voice.Unity
namespace Photon::Voice::Unity {
  // Size: 0x89
  #pragma pack(push, 1)
  // Autogenerated type: Photon.Voice.Unity.WebRtcAudioDsp
  // [TokenAttribute] Offset: FFFFFFFF
  // [RequireComponent] Offset: FFFFFFFF
  // [DisallowMultipleComponent] Offset: FFFFFFFF
  class WebRtcAudioDsp : public ::Photon::Voice::Unity::VoiceComponent {
    public:
    public:
    // private System.Boolean aec
    // Size: 0x1
    // Offset: 0x2A
    bool aec;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean aecHighPass
    // Size: 0x1
    // Offset: 0x2B
    bool aecHighPass;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean agc
    // Size: 0x1
    // Offset: 0x2C
    bool agc;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: agc and: agcCompressionGain
    char __padding2[0x3] = {};
    // private System.Int32 agcCompressionGain
    // Size: 0x4
    // Offset: 0x30
    int agcCompressionGain;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean vad
    // Size: 0x1
    // Offset: 0x34
    bool vad;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean highPass
    // Size: 0x1
    // Offset: 0x35
    bool highPass;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean bypass
    // Size: 0x1
    // Offset: 0x36
    bool bypass;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean noiseSuppression
    // Size: 0x1
    // Offset: 0x37
    bool noiseSuppression;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Int32 reverseStreamDelayMs
    // Size: 0x4
    // Offset: 0x38
    int reverseStreamDelayMs;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 reverseChannels
    // Size: 0x4
    // Offset: 0x3C
    int reverseChannels;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private Photon.Voice.WebRTCAudioProcessor proc
    // Size: 0x8
    // Offset: 0x40
    ::Photon::Voice::WebRTCAudioProcessor* proc;
    // Field size check
    static_assert(sizeof(::Photon::Voice::WebRTCAudioProcessor*) == 0x8);
    // private UnityEngine.AudioListener audioListener
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::AudioListener* audioListener;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioListener*) == 0x8);
    // private Photon.Voice.Unity.AudioOutCapture audioOutCapture
    // Size: 0x8
    // Offset: 0x50
    ::Photon::Voice::Unity::AudioOutCapture* audioOutCapture;
    // Field size check
    static_assert(sizeof(::Photon::Voice::Unity::AudioOutCapture*) == 0x8);
    // private System.Boolean aecStarted
    // Size: 0x1
    // Offset: 0x58
    bool aecStarted;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean autoDestroyAudioOutCapture
    // Size: 0x1
    // Offset: 0x59
    bool autoDestroyAudioOutCapture;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: autoDestroyAudioOutCapture and: localVoice
    char __padding14[0x6] = {};
    // private Photon.Voice.LocalVoiceAudioShort localVoice
    // Size: 0x8
    // Offset: 0x60
    ::Photon::Voice::LocalVoiceAudioShort* localVoice;
    // Field size check
    static_assert(sizeof(::Photon::Voice::LocalVoiceAudioShort*) == 0x8);
    // private System.Int32 outputSampleRate
    // Size: 0x4
    // Offset: 0x68
    int outputSampleRate;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: outputSampleRate and: recorder
    char __padding16[0x4] = {};
    // private Photon.Voice.Unity.Recorder recorder
    // Size: 0x8
    // Offset: 0x70
    ::Photon::Voice::Unity::Recorder* recorder;
    // Field size check
    static_assert(sizeof(::Photon::Voice::Unity::Recorder*) == 0x8);
    // public System.Boolean ForceNormalAecInMobile
    // Size: 0x1
    // Offset: 0x78
    bool ForceNormalAecInMobile;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean aecOnlyWhenEnabled
    // Size: 0x1
    // Offset: 0x79
    bool aecOnlyWhenEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean AutoRestartOnAudioChannelsMismatch
    // Size: 0x1
    // Offset: 0x7A
    bool AutoRestartOnAudioChannelsMismatch;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: AutoRestartOnAudioChannelsMismatch and: threadSafety
    char __padding20[0x5] = {};
    // private System.Object threadSafety
    // Size: 0x8
    // Offset: 0x80
    ::Il2CppObject* threadSafety;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // public System.Boolean AECMobileComfortNoise
    // Size: 0x1
    // Offset: 0x88
    bool AECMobileComfortNoise;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get static field: static private readonly System.Collections.Generic.Dictionary`2<UnityEngine.AudioSpeakerMode,System.Int32> channelsMap
    static ::System::Collections::Generic::Dictionary_2<::UnityEngine::AudioSpeakerMode, int>* _get_channelsMap();
    // Set static field: static private readonly System.Collections.Generic.Dictionary`2<UnityEngine.AudioSpeakerMode,System.Int32> channelsMap
    static void _set_channelsMap(::System::Collections::Generic::Dictionary_2<::UnityEngine::AudioSpeakerMode, int>* value);
    // Get instance field reference: private System.Boolean aec
    [[deprecated("Use field access instead!")]] bool& dyn_aec();
    // Get instance field reference: private System.Boolean aecHighPass
    [[deprecated("Use field access instead!")]] bool& dyn_aecHighPass();
    // Get instance field reference: private System.Boolean agc
