// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: Unity.XR.CoreUtils.ARTrackablesParentTransformChangedEventArgs
#include "Unity/XR/CoreUtils/ARTrackablesParentTransformChangedEventArgs.hpp"
// Including type: UnityEngine.XR.TrackingOriginModeFlags
#include "UnityEngine/XR/TrackingOriginModeFlags.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: Unity::XR::CoreUtils
namespace Unity::XR::CoreUtils {
  // Skipping declaration: TrackingOriginMode because it is already included!
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Camera
  class Camera;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: GameObject
  class GameObject;
  // Skipping declaration: Vector3 because it is already included!
  // Forward declaring type: Pose
  struct Pose;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: UnityEngine::XR
namespace UnityEngine::XR {
  // Forward declaring type: XRInputSubsystem
  class XRInputSubsystem;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: Unity.XR.CoreUtils
namespace Unity::XR::CoreUtils {
  // Forward declaring type: XROrigin
  class XROrigin;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Unity::XR::CoreUtils::XROrigin);
DEFINE_IL2CPP_ARG_TYPE(::Unity::XR::CoreUtils::XROrigin*, "Unity.XR.CoreUtils", "XROrigin");
// Type namespace: Unity.XR.CoreUtils
namespace Unity::XR::CoreUtils {
  // Size: 0x56
  #pragma pack(push, 1)
  // Autogenerated type: Unity.XR.CoreUtils.XROrigin
  // [TokenAttribute] Offset: FFFFFFFF
  // [HelpURLAttribute] Offset: FFFFFFFF
  // [DisallowMultipleComponent] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: FFFFFFFF
  class XROrigin : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::Unity::XR::CoreUtils::XROrigin::TrackingOriginMode
    struct TrackingOriginMode;
    // Nested type: ::Unity::XR::CoreUtils::XROrigin::$RepeatInitializeCamera$d__48
    class $RepeatInitializeCamera$d__48;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: Unity.XR.CoreUtils.XROrigin/TrackingOriginMode
    // [TokenAttribute] Offset: FFFFFFFF
    struct TrackingOriginMode/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: TrackingOriginMode
      constexpr TrackingOriginMode(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public Unity.XR.CoreUtils.XROrigin/TrackingOriginMode NotSpecified
      static constexpr const int NotSpecified = 0;
      // Get static field: static public Unity.XR.CoreUtils.XROrigin/TrackingOriginMode NotSpecified
      static ::Unity::XR::CoreUtils::XROrigin::TrackingOriginMode _get_NotSpecified();
      // Set static field: static public Unity.XR.CoreUtils.XROrigin/TrackingOriginMode NotSpecified
      static void _set_NotSpecified(::Unity::XR::CoreUtils::XROrigin::TrackingOriginMode value);
      // static field const value: static public Unity.XR.CoreUtils.XROrigin/TrackingOriginMode Device
      static constexpr const int Device = 1;
      // Get static field: static public Unity.XR.CoreUtils.XROrigin/TrackingOriginMode Device
      static ::Unity::XR::CoreUtils::XROrigin::TrackingOriginMode _get_Device();
      // Set static field: static public Unity.XR.CoreUtils.XROrigin/TrackingOriginMode Device
      static void _set_Device(::Unity::XR::CoreUtils::XROrigin::TrackingOriginMode value);
      // static field const value: static public Unity.XR.CoreUtils.XROrigin/TrackingOriginMode Floor
      static constexpr const int Floor = 2;
      // Get static field: static public Unity.XR.CoreUtils.XROrigin/TrackingOriginMode Floor
      static ::Unity::XR::CoreUtils::XROrigin::TrackingOriginMode _get_Floor();
      // Set static field: static public Unity.XR.CoreUtils.XROrigin/TrackingOriginMode Floor
      static void _set_Floor(::Unity::XR::CoreUtils::XROrigin::TrackingOriginMode value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // Unity.XR.CoreUtils.XROrigin/TrackingOriginMode
    #pragma pack(pop)
    static check_size<sizeof(XROrigin::TrackingOriginMode), 0 + sizeof(int)> __Unity_XR_CoreUtils_XROrigin_TrackingOriginModeSizeCheck;
    static_assert(sizeof(XROrigin::TrackingOriginMode) == 0x4);
    public:
    // private UnityEngine.Camera m_Camera
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::Camera* m_Camera;
    // Field size check
    static_assert(sizeof(::UnityEngine::Camera*) == 0x8);
    // private UnityEngine.Transform <TrackablesParent>k__BackingField
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::Transform* TrackablesParent;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private System.Action`1<Unity.XR.CoreUtils.ARTrackablesParentTransformChangedEventArgs> TrackablesParentTransformChanged
    // Size: 0x8
    // Offset: 0x30
    ::System::Action_1<::Unity::XR::CoreUtils::ARTrackablesParentTransformChangedEventArgs>* TrackablesParentTransformChanged;
    // Field size check
    static_assert(sizeof(::System::Action_1<::Unity::XR::CoreUtils::ARTrackablesParentTransformChangedEventArgs>*) == 0x8);
    // private UnityEngine.GameObject m_OriginBaseGameObject
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::GameObject* m_OriginBaseGameObject;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject m_CameraFloorOffsetObject
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::GameObject* m_CameraFloorOffsetObject;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private Unity.XR.CoreUtils.XROrigin/TrackingOriginMode m_RequestedTrackingOriginMode
    // Size: 0x4
    // Offset: 0x48
    ::Unity::XR::CoreUtils::XROrigin::TrackingOriginMode m_RequestedTrackingOriginMode;
    // Field size check
    static_assert(sizeof(::Unity::XR::CoreUtils::XROrigin::TrackingOriginMode) == 0x4);
    // private System.Single m_CameraYOffset
    // Size: 0x4
    // Offset: 0x4C
    float m_CameraYOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.XR.TrackingOriginModeFlags <CurrentTrackingOriginMode>k__BackingField
    // Size: 0x4
    // Offset: 0x50
    ::UnityEngine::XR::TrackingOriginModeFlags CurrentTrackingOriginMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::XR::TrackingOriginModeFlags) == 0x4);
    // private System.Boolean m_CameraInitialized
    // Size: 0x1
    // Offset: 0x54
    bool m_CameraInitialized;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_CameraInitializing
    // Size: 0x1
    // Offset: 0x55
    bool m_CameraInitializing;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // static field const value: static private System.Single k_DefaultCameraYOffset
    static constexpr const float k_DefaultCameraYOffset = 1.1176;
    // Get static field: static private System.Single k_DefaultCameraYOffset
    static float _get_k_DefaultCameraYOffset();
    // Set static field: static private System.Single k_DefaultCameraYOffset
    static void _set_k_DefaultCameraYOffset(float value);
    // Get static field: static private readonly System.Collections.Generic.List`1<UnityEngine.XR.XRInputSubsystem> s_InputSubsystems
    static ::System::Collections::Generic::List_1<::UnityEngine::XR::XRInputSubsystem*>* _get_s_InputSubsystems();
    // Set static field: static private readonly System.Collections.Generic.List`1<UnityEngine.XR.XRInputSubsystem> s_InputSubsystems
