// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Cinemachine.CinemachineVirtualCameraBase
#include "Cinemachine/CinemachineVirtualCameraBase.hpp"
// Including type: Cinemachine.LensSettings
#include "Cinemachine/LensSettings.hpp"
// Including type: Cinemachine.CinemachineVirtualCameraBase/TransitionParams
#include "Cinemachine/CinemachineVirtualCameraBase_TransitionParams.hpp"
// Including type: Cinemachine.CinemachineOrbitalTransposer/Heading
#include "Cinemachine/CinemachineOrbitalTransposer.hpp"
// Including type: Cinemachine.CinemachineTransposer/BindingMode
#include "Cinemachine/CinemachineTransposer.hpp"
// Including type: UnityEngine.Vector4
#include "UnityEngine/Vector4.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Cinemachine
namespace Cinemachine {
  // Forward declaring type: CinemachineVirtualCamera
  class CinemachineVirtualCamera;
  // Skipping declaration: CinemachineOrbitalTransposer because it is already included!
  // Forward declaring type: CinemachineBlend
  class CinemachineBlend;
  // Skipping declaration: ICinemachineCamera because it is already included!
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Skipping declaration: Vector3 because it is already included!
  // Skipping declaration: Quaternion because it is already included!
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: Cinemachine
namespace Cinemachine {
  // Forward declaring type: CinemachineFreeLook
  class CinemachineFreeLook;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Cinemachine::CinemachineFreeLook);
DEFINE_IL2CPP_ARG_TYPE(::Cinemachine::CinemachineFreeLook*, "Cinemachine", "CinemachineFreeLook");
// Type namespace: Cinemachine
namespace Cinemachine {
  // Size: 0x388
  #pragma pack(push, 1)
  // Autogenerated type: Cinemachine.CinemachineFreeLook
  // [TokenAttribute] Offset: FFFFFFFF
  // [ExecuteAlways] Offset: FFFFFFFF
  // [ExcludeFromPresetAttribute] Offset: FFFFFFFF
  // [HelpURLAttribute] Offset: FFFFFFFF
  // [DisallowMultipleComponent] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: FFFFFFFF
  // [DocumentationSortingAttribute] Offset: FFFFFFFF
  class CinemachineFreeLook : public ::Cinemachine::CinemachineVirtualCameraBase {
    public:
    // Writing base type padding for base size: 0xA2 to desired offset: 0xA8
    char ___base_padding[0x6] = {};
    // Nested type: ::Cinemachine::CinemachineFreeLook::Orbit
    struct Orbit;
    // Nested type: ::Cinemachine::CinemachineFreeLook::CreateRigDelegate
    class CreateRigDelegate;
    // Nested type: ::Cinemachine::CinemachineFreeLook::DestroyRigDelegate
    class DestroyRigDelegate;
    // Nested type: ::Cinemachine::CinemachineFreeLook::$$c__DisplayClass47_0
    struct $$c__DisplayClass47_0;
    // Size: 0x8
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: Cinemachine.CinemachineFreeLook/Orbit
    // [TokenAttribute] Offset: FFFFFFFF
    struct Orbit/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.Single m_Height
      // Size: 0x4
      // Offset: 0x0
      float m_Height;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Single m_Radius
      // Size: 0x4
      // Offset: 0x4
      float m_Radius;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      public:
      // Creating value type constructor for type: Orbit
      constexpr Orbit(float m_Height_ = {}, float m_Radius_ = {}) noexcept : m_Height{m_Height_}, m_Radius{m_Radius_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public System.Single m_Height
      [[deprecated("Use field access instead!")]] float& dyn_m_Height();
      // Get instance field reference: public System.Single m_Radius
      [[deprecated("Use field access instead!")]] float& dyn_m_Radius();
      // public System.Void .ctor(System.Single h, System.Single r)
      // Offset: 0x2A90F38
      // ABORTED: conflicts with another method.  Orbit(float h, float r);
    }; // Cinemachine.CinemachineFreeLook/Orbit
    #pragma pack(pop)
    static check_size<sizeof(CinemachineFreeLook::Orbit), 4 + sizeof(float)> __Cinemachine_CinemachineFreeLook_OrbitSizeCheck;
    static_assert(sizeof(CinemachineFreeLook::Orbit) == 0x8);
    public:
    // public UnityEngine.Transform m_LookAt
    // Size: 0x8
    // Offset: 0xA8
    ::UnityEngine::Transform* m_LookAt;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Transform m_Follow
    // Size: 0x8
    // Offset: 0xB0
    ::UnityEngine::Transform* m_Follow;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public System.Boolean m_CommonLens
    // Size: 0x1
    // Offset: 0xB8
    bool m_CommonLens;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_CommonLens and: m_Lens
    char __padding2[0x3] = {};
    // public Cinemachine.LensSettings m_Lens
    // Size: 0x32
    // Offset: 0xBC
    ::Cinemachine::LensSettings m_Lens;
    // Field size check
    static_assert(sizeof(::Cinemachine::LensSettings) == 0x32);
    // Padding between fields: m_Lens and: m_Transitions
    char __padding3[0x2] = {};
    // public Cinemachine.CinemachineVirtualCameraBase/TransitionParams m_Transitions
    // Size: 0x10
    // Offset: 0xF0
    ::Cinemachine::CinemachineVirtualCameraBase::TransitionParams m_Transitions;
    // Field size check
    static_assert(sizeof(::Cinemachine::CinemachineVirtualCameraBase::TransitionParams) == 0x10);
    // private Cinemachine.CinemachineVirtualCameraBase/BlendHint m_LegacyBlendHint
    // Size: 0x4
    // Offset: 0x100
    ::Cinemachine::CinemachineVirtualCameraBase::BlendHint m_LegacyBlendHint;
    // Field size check
    static_assert(sizeof(::Cinemachine::CinemachineVirtualCameraBase::BlendHint) == 0x4);
    // Padding between fields: m_LegacyBlendHint and: m_YAxis
    char __padding5[0x4] = {};
    // public Cinemachine.AxisState m_YAxis
    // Size: 0x6E
    // Offset: 0x108
    ::Cinemachine::AxisState m_YAxis;
    // Field size check
    static_assert(sizeof(::Cinemachine::AxisState) == 0x6E);
    // Padding between fields: m_YAxis and: m_YAxisRecentering
    char __padding6[0x2] = {};
    // public Cinemachine.AxisState/Recentering m_YAxisRecentering
    // Size: 0x20
    // Offset: 0x178
    ::Cinemachine::AxisState::Recentering m_YAxisRecentering;
    // Field size check
    static_assert(sizeof(::Cinemachine::AxisState::Recentering) == 0x20);
    // public Cinemachine.AxisState m_XAxis
    // Size: 0x6E
    // Offset: 0x198
    ::Cinemachine::AxisState m_XAxis;
    // Field size check
    static_assert(sizeof(::Cinemachine::AxisState) == 0x6E);
    // Padding between fields: m_XAxis and: m_Heading
    char __padding8[0x2] = {};
    // public Cinemachine.CinemachineOrbitalTransposer/Heading m_Heading
    // Size: 0xC
    // Offset: 0x208
    ::Cinemachine::CinemachineOrbitalTransposer::Heading m_Heading;
    // Field size check
    static_assert(sizeof(::Cinemachine::CinemachineOrbitalTransposer::Heading) == 0xC);
    // public Cinemachine.AxisState/Recentering m_RecenterToTargetHeading
    // Size: 0x20
    // Offset: 0x214
    ::Cinemachine::AxisState::Recentering m_RecenterToTargetHeading;
    // Field size check
    static_assert(sizeof(::Cinemachine::AxisState::Recentering) == 0x20);
    // public Cinemachine.CinemachineTransposer/BindingMode m_BindingMode
    // Size: 0x4
    // Offset: 0x234
    ::Cinemachine::CinemachineTransposer::BindingMode m_BindingMode;
    // Field size check
    static_assert(sizeof(::Cinemachine::CinemachineTransposer::BindingMode) == 0x4);
    // public System.Single m_SplineCurvature
    // Size: 0x4
    // Offset: 0x238
    float m_SplineCurvature;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: m_SplineCurvature and: m_Orbits
    char __padding12[0x4] = {};
    // public Cinemachine.CinemachineFreeLook/Orbit[] m_Orbits
    // Size: 0x8
    // Offset: 0x240
    ::ArrayW<::Cinemachine::CinemachineFreeLook::Orbit> m_Orbits;
    // Field size check
    static_assert(sizeof(::ArrayW<::Cinemachine::CinemachineFreeLook::Orbit>) == 0x8);
    // private System.Single m_LegacyHeadingBias
    // Size: 0x4
    // Offset: 0x248
    float m_LegacyHeadingBias;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean mUseLegacyRigDefinitions
    // Size: 0x1
    // Offset: 0x24C
    bool mUseLegacyRigDefinitions;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean mIsDestroyed
    // Size: 0x1
    // Offset: 0x24D
    bool mIsDestroyed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: mIsDestroyed and: m_State
    char __padding16[0x2] = {};
    // private Cinemachine.CameraState m_State
    // Size: 0xE4
    // Offset: 0x250
    ::Cinemachine::CameraState m_State;
    // Field size check
    static_assert(sizeof(::Cinemachine::CameraState) == 0xE4);
    // Padding between fields: m_State and: m_Rigs
    char __padding17[0x4] = {};
    // private Cinemachine.CinemachineVirtualCamera[] m_Rigs
    // Size: 0x8
    // Offset: 0x338
    ::ArrayW<::Cinemachine::CinemachineVirtualCamera*> m_Rigs;
    // Field size check
    static_assert(sizeof(::ArrayW<::Cinemachine::CinemachineVirtualCamera*>) == 0x8);
    // private Cinemachine.CinemachineOrbitalTransposer[] mOrbitals
    // Size: 0x8
    // Offset: 0x340
    ::ArrayW<::Cinemachine::CinemachineOrbitalTransposer*> mOrbitals;
    // Field size check
    static_assert(sizeof(::ArrayW<::Cinemachine::CinemachineOrbitalTransposer*>) == 0x8);
    // private Cinemachine.CinemachineBlend mBlendA
    // Size: 0x8
    // Offset: 0x348
    ::Cinemachine::CinemachineBlend* mBlendA;
    // Field size check
    static_assert(sizeof(::Cinemachine::CinemachineBlend*) == 0x8);
    // private Cinemachine.CinemachineBlend mBlendB
    // Size: 0x8
    // Offset: 0x350
    ::Cinemachine::CinemachineBlend* mBlendB;
    // Field size check
    static_assert(sizeof(::Cinemachine::CinemachineBlend*) == 0x8);
    // private System.Single m_CachedXAxisHeading
    // Size: 0x4
    // Offset: 0x358
    float m_CachedXAxisHeading;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_LastHeadingUpdateFrame
    // Size: 0x4
    // Offset: 0x35C
    float m_LastHeadingUpdateFrame;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private Cinemachine.CinemachineFreeLook/Orbit[] m_CachedOrbits
    // Size: 0x8
    // Offset: 0x360
    ::ArrayW<::Cinemachine::CinemachineFreeLook::Orbit> m_CachedOrbits;
    // Field size check
    static_assert(sizeof(::ArrayW<::Cinemachine::CinemachineFreeLook::Orbit>) == 0x8);
    // private System.Single m_CachedTension
    // Size: 0x4
    // Offset: 0x368
    float m_CachedTension;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: m_CachedTension and: m_CachedKnots
    char __padding25[0x4] = {};
    // private UnityEngine.Vector4[] m_CachedKnots
    // Size: 0x8
    // Offset: 0x370
    ::ArrayW<::UnityEngine::Vector4> m_CachedKnots;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector4>) == 0x8);
    // private UnityEngine.Vector4[] m_CachedCtrl1
    // Size: 0x8
    // Offset: 0x378
    ::ArrayW<::UnityEngine::Vector4> m_CachedCtrl1;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector4>) == 0x8);
    // private UnityEngine.Vector4[] m_CachedCtrl2
    // Size: 0x8
    // Offset: 0x380
    ::ArrayW<::UnityEngine::Vector4> m_CachedCtrl2;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector4>) == 0x8);
    public:
    // Get static field: static public Cinemachine.CinemachineFreeLook/CreateRigDelegate CreateRigOverride
    static ::Cinemachine::CinemachineFreeLook::CreateRigDelegate* _get_CreateRigOverride();
    // Set static field: static public Cinemachine.CinemachineFreeLook/CreateRigDelegate CreateRigOverride
    static void _set_CreateRigOverride(::Cinemachine::CinemachineFreeLook::CreateRigDelegate* value);
    // Get static field: static public Cinemachine.CinemachineFreeLook/DestroyRigDelegate DestroyRigOverride
    static ::Cinemachine::CinemachineFreeLook::DestroyRigDelegate* _get_DestroyRigOverride();
    // Set static field: static public Cinemachine.CinemachineFreeLook/DestroyRigDelegate DestroyRigOverride
