// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Cinemachine.ClipperLib
#include "Cinemachine/ClipperLib.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Cinemachine::ClipperLib::LocalMinima);
DEFINE_IL2CPP_ARG_TYPE(::Cinemachine::ClipperLib::LocalMinima*, "Cinemachine", "ClipperLib/LocalMinima");
// Type namespace: Cinemachine
namespace Cinemachine {
  // Size: 0x30
  #pragma pack(push, 1)
  // Autogenerated type: Cinemachine.ClipperLib/LocalMinima
  // [TokenAttribute] Offset: FFFFFFFF
  class ClipperLib::LocalMinima : public ::Il2CppObject {
    public:
    public:
    // System.Int64 Y
    // Size: 0x8
    // Offset: 0x10
    int64_t Y;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // Cinemachine.ClipperLib/TEdge LeftBound
    // Size: 0x8
    // Offset: 0x18
    ::Cinemachine::ClipperLib::TEdge* LeftBound;
    // Field size check
    static_assert(sizeof(::Cinemachine::ClipperLib::TEdge*) == 0x8);
    // Cinemachine.ClipperLib/TEdge RightBound
    // Size: 0x8
    // Offset: 0x20
    ::Cinemachine::ClipperLib::TEdge* RightBound;
    // Field size check
    static_assert(sizeof(::Cinemachine::ClipperLib::TEdge*) == 0x8);
    // Cinemachine.ClipperLib/LocalMinima Next
    // Size: 0x8
    // Offset: 0x28
    ::Cinemachine::ClipperLib::LocalMinima* Next;
    // Field size check
    static_assert(sizeof(::Cinemachine::ClipperLib::LocalMinima*) == 0x8);
    public:
    // Get instance field reference: System.Int64 Y
    [[deprecated("Use field access instead!")]] int64_t& dyn_Y();
    // Get instance field reference: Cinemachine.ClipperLib/TEdge LeftBound
    [[deprecated("Use field access instead!")]] ::Cinemachine::ClipperLib::TEdge*& dyn_LeftBound();
    // Get instance field reference: Cinemachine.ClipperLib/TEdge RightBound
    [[deprecated("Use field access instead!")]] ::Cinemachine::ClipperLib::TEdge*& dyn_RightBound();
    // Get instance field reference: Cinemachine.ClipperLib/LocalMinima Next
    [[deprecated("Use field access instead!")]] ::Cinemachine::ClipperLib::LocalMinima*& dyn_Next();
    // public System.Void .ctor()
    // Offset: 0x2ABCBEC
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static ClipperLib::LocalMinima* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::Cinemachine::ClipperLib::LocalMinima::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<ClipperLib::LocalMinima*, creationType>()));
    }
  }; // Cinemachine.ClipperLib/LocalMinima
  #pragma pack(pop)
  static check_size<sizeof(ClipperLib::LocalMinima), 40 + sizeof(::Cinemachine::ClipperLib::LocalMinima*)> __Cinemachine_ClipperLib_LocalMinimaSizeCheck;
  static_assert(sizeof(ClipperLib::LocalMinima) == 0x30);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Cinemachine::ClipperLib::LocalMinima::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
