// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Cinemachine.ClipperLib
#include "Cinemachine/ClipperLib.hpp"
// Including type: Cinemachine.ClipperLib/IntPoint
#include "Cinemachine/ClipperLib_IntPoint.hpp"
// Including type: Cinemachine.ClipperLib/JoinType
#include "Cinemachine/ClipperLib_JoinType.hpp"
// Including type: Cinemachine.ClipperLib/EndType
#include "Cinemachine/ClipperLib_EndType.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Cinemachine::ClipperLib::PolyNode);
DEFINE_IL2CPP_ARG_TYPE(::Cinemachine::ClipperLib::PolyNode*, "Cinemachine", "ClipperLib/PolyNode");
// Type namespace: Cinemachine
namespace Cinemachine {
  // Size: 0x39
  #pragma pack(push, 1)
  // Autogenerated type: Cinemachine.ClipperLib/PolyNode
  // [TokenAttribute] Offset: FFFFFFFF
  class ClipperLib::PolyNode : public ::Il2CppObject {
    public:
    public:
    // Cinemachine.ClipperLib/PolyNode m_Parent
    // Size: 0x8
    // Offset: 0x10
    ::Cinemachine::ClipperLib::PolyNode* m_Parent;
    // Field size check
    static_assert(sizeof(::Cinemachine::ClipperLib::PolyNode*) == 0x8);
    // System.Collections.Generic.List`1<Cinemachine.ClipperLib/IntPoint> m_polygon
    // Size: 0x8
    // Offset: 0x18
    ::System::Collections::Generic::List_1<::Cinemachine::ClipperLib::IntPoint>* m_polygon;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Cinemachine::ClipperLib::IntPoint>*) == 0x8);
    // System.Int32 m_Index
    // Size: 0x4
    // Offset: 0x20
    int m_Index;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Cinemachine.ClipperLib/JoinType m_jointype
    // Size: 0x4
    // Offset: 0x24
    ::Cinemachine::ClipperLib::JoinType m_jointype;
    // Field size check
    static_assert(sizeof(::Cinemachine::ClipperLib::JoinType) == 0x4);
    // Cinemachine.ClipperLib/EndType m_endtype
    // Size: 0x4
    // Offset: 0x28
    ::Cinemachine::ClipperLib::EndType m_endtype;
    // Field size check
    static_assert(sizeof(::Cinemachine::ClipperLib::EndType) == 0x4);
    // Padding between fields: m_endtype and: m_Childs
    char __padding4[0x4] = {};
    // System.Collections.Generic.List`1<Cinemachine.ClipperLib/PolyNode> m_Childs
    // Size: 0x8
    // Offset: 0x30
    ::System::Collections::Generic::List_1<::Cinemachine::ClipperLib::PolyNode*>* m_Childs;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Cinemachine::ClipperLib::PolyNode*>*) == 0x8);
    // private System.Boolean <IsOpen>k__BackingField
    // Size: 0x1
    // Offset: 0x38
    bool IsOpen;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get instance field reference: Cinemachine.ClipperLib/PolyNode m_Parent
    [[deprecated("Use field access instead!")]] ::Cinemachine::ClipperLib::PolyNode*& dyn_m_Parent();
    // Get instance field reference: System.Collections.Generic.List`1<Cinemachine.ClipperLib/IntPoint> m_polygon
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::Cinemachine::ClipperLib::IntPoint>*& dyn_m_polygon();
    // Get instance field reference: System.Int32 m_Index
    [[deprecated("Use field access instead!")]] int& dyn_m_Index();
    // Get instance field reference: Cinemachine.ClipperLib/JoinType m_jointype
    [[deprecated("Use field access instead!")]] ::Cinemachine::ClipperLib::JoinType& dyn_m_jointype();
    // Get instance field reference: Cinemachine.ClipperLib/EndType m_endtype
    [[deprecated("Use field access instead!")]] ::Cinemachine::ClipperLib::EndType& dyn_m_endtype();
    // Get instance field reference: System.Collections.Generic.List`1<Cinemachine.ClipperLib/PolyNode> m_Childs
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::Cinemachine::ClipperLib::PolyNode*>*& dyn_m_Childs();
    // Get instance field reference: private System.Boolean <IsOpen>k__BackingField
    [[deprecated("Use field access instead!")]] bool& dyn_$IsOpen$k__BackingField();
    // private System.Boolean IsHoleNode()
    // Offset: 0x2ABC4A0
    bool IsHoleNode();
    // public System.Int32 get_ChildCount()
    // Offset: 0x2ABC4BC
    int get_ChildCount();
    // public System.Collections.Generic.List`1<Cinemachine.ClipperLib/IntPoint> get_Contour()
    // Offset: 0x2ABC504
    ::System::Collections::Generic::List_1<::Cinemachine::ClipperLib::IntPoint>* get_Contour();
    // System.Void AddChild(Cinemachine.ClipperLib/PolyNode Child)
    // Offset: 0x2ABC50C
    void AddChild(::Cinemachine::ClipperLib::PolyNode* Child);
    // public Cinemachine.ClipperLib/PolyNode GetNext()
    // Offset: 0x2ABC5D8
    ::Cinemachine::ClipperLib::PolyNode* GetNext();
    // Cinemachine.ClipperLib/PolyNode GetNextSiblingUp()
    // Offset: 0x2ABC654
    ::Cinemachine::ClipperLib::PolyNode* GetNextSiblingUp();
    // public System.Collections.Generic.List`1<Cinemachine.ClipperLib/PolyNode> get_Childs()
    // Offset: 0x2ABC6F4
    ::System::Collections::Generic::List_1<::Cinemachine::ClipperLib::PolyNode*>* get_Childs();
    // public Cinemachine.ClipperLib/PolyNode get_Parent()
    // Offset: 0x2ABC6FC
    ::Cinemachine::ClipperLib::PolyNode* get_Parent();
    // public System.Boolean get_IsHole()
    // Offset: 0x2ABC704
    bool get_IsHole();
    // public System.Boolean get_IsOpen()
    // Offset: 0x2ABC720
    bool get_IsOpen();
    // public System.Void set_IsOpen(System.Boolean value)
    // Offset: 0x2ABC728
    void set_IsOpen(bool value);
    // public System.Void .ctor()
    // Offset: 0x2ABC3C4
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static ClipperLib::PolyNode* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::Cinemachine::ClipperLib::PolyNode::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<ClipperLib::PolyNode*, creationType>()));
    }
  }; // Cinemachine.ClipperLib/PolyNode
  #pragma pack(pop)
  static check_size<sizeof(ClipperLib::PolyNode), 56 + sizeof(bool)> __Cinemachine_ClipperLib_PolyNodeSizeCheck;
  static_assert(sizeof(ClipperLib::PolyNode) == 0x39);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Cinemachine::ClipperLib::PolyNode::IsHoleNode
// Il2CppName: IsHoleNode
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (Cinemachine::ClipperLib::PolyNode::*)()>(&Cinemachine::ClipperLib::PolyNode::IsHoleNode)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Cinemachine::ClipperLib::PolyNode*), "IsHoleNode", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Cinemachine::ClipperLib::PolyNode::get_ChildCount
// Il2CppName: get_ChildCount
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<int (Cinemachine::ClipperLib::PolyNode::*)()>(&Cinemachine::ClipperLib::PolyNode::get_ChildCount)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Cinemachine::ClipperLib::PolyNode*), "get_ChildCount", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Cinemachine::ClipperLib::PolyNode::get_Contour
// Il2CppName: get_Contour
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::System::Collections::Generic::List_1<::Cinemachine::ClipperLib::IntPoint>* (Cinemachine::ClipperLib::PolyNode::*)()>(&Cinemachine::ClipperLib::PolyNode::get_Contour)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Cinemachine::ClipperLib::PolyNode*), "get_Contour", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Cinemachine::ClipperLib::PolyNode::AddChild
// Il2CppName: AddChild
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Cinemachine::ClipperLib::PolyNode::*)(::Cinemachine::ClipperLib::PolyNode*)>(&Cinemachine::ClipperLib::PolyNode::AddChild)> {
  static const MethodInfo* get() {
    static auto* Child = &::il2cpp_utils::GetClassFromName("Cinemachine", "ClipperLib/PolyNode")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Cinemachine::ClipperLib::PolyNode*), "AddChild", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{Child});
  }
};
// Writing MetadataGetter for method: Cinemachine::ClipperLib::PolyNode::GetNext
// Il2CppName: GetNext
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::Cinemachine::ClipperLib::PolyNode* (Cinemachine::ClipperLib::PolyNode::*)()>(&Cinemachine::ClipperLib::PolyNode::GetNext)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Cinemachine::ClipperLib::PolyNode*), "GetNext", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Cinemachine::ClipperLib::PolyNode::GetNextSiblingUp
// Il2CppName: GetNextSiblingUp
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::Cinemachine::ClipperLib::PolyNode* (Cinemachine::ClipperLib::PolyNode::*)()>(&Cinemachine::ClipperLib::PolyNode::GetNextSiblingUp)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Cinemachine::ClipperLib::PolyNode*), "GetNextSiblingUp", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Cinemachine::ClipperLib::PolyNode::get_Childs
// Il2CppName: get_Childs
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::System::Collections::Generic::List_1<::Cinemachine::ClipperLib::PolyNode*>* (Cinemachine::ClipperLib::PolyNode::*)()>(&Cinemachine::ClipperLib::PolyNode::get_Childs)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Cinemachine::ClipperLib::PolyNode*), "get_Childs", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Cinemachine::ClipperLib::PolyNode::get_Parent
// Il2CppName: get_Parent
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::Cinemachine::ClipperLib::PolyNode* (Cinemachine::ClipperLib::PolyNode::*)()>(&Cinemachine::ClipperLib::PolyNode::get_Parent)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Cinemachine::ClipperLib::PolyNode*), "get_Parent", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Cinemachine::ClipperLib::PolyNode::get_IsHole
// Il2CppName: get_IsHole
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (Cinemachine::ClipperLib::PolyNode::*)()>(&Cinemachine::ClipperLib::PolyNode::get_IsHole)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Cinemachine::ClipperLib::PolyNode*), "get_IsHole", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Cinemachine::ClipperLib::PolyNode::get_IsOpen
// Il2CppName: get_IsOpen
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (Cinemachine::ClipperLib::PolyNode::*)()>(&Cinemachine::ClipperLib::PolyNode::get_IsOpen)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Cinemachine::ClipperLib::PolyNode*), "get_IsOpen", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Cinemachine::ClipperLib::PolyNode::set_IsOpen
// Il2CppName: set_IsOpen
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Cinemachine::ClipperLib::PolyNode::*)(bool)>(&Cinemachine::ClipperLib::PolyNode::set_IsOpen)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("System", "Boolean")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Cinemachine::ClipperLib::PolyNode*), "set_IsOpen", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: Cinemachine::ClipperLib::PolyNode::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
