// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Cinemachine.ClipperLib
#include "Cinemachine/ClipperLib.hpp"
// Including type: Cinemachine.ClipperLib/IntPoint
#include "Cinemachine/ClipperLib_IntPoint.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Cinemachine::ClipperLib::OutPt);
DEFINE_IL2CPP_ARG_TYPE(::Cinemachine::ClipperLib::OutPt*, "Cinemachine", "ClipperLib/OutPt");
// Type namespace: Cinemachine
namespace Cinemachine {
  // Size: 0x38
  #pragma pack(push, 1)
  // Autogenerated type: Cinemachine.ClipperLib/OutPt
  // [TokenAttribute] Offset: FFFFFFFF
  class ClipperLib::OutPt : public ::Il2CppObject {
    public:
    public:
    // System.Int32 Idx
    // Size: 0x4
    // Offset: 0x10
    int Idx;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: Idx and: Pt
    char __padding0[0x4] = {};
    // Cinemachine.ClipperLib/IntPoint Pt
    // Size: 0x10
    // Offset: 0x18
    ::Cinemachine::ClipperLib::IntPoint Pt;
    // Field size check
    static_assert(sizeof(::Cinemachine::ClipperLib::IntPoint) == 0x10);
    // Cinemachine.ClipperLib/OutPt Next
    // Size: 0x8
    // Offset: 0x28
    ::Cinemachine::ClipperLib::OutPt* Next;
    // Field size check
    static_assert(sizeof(::Cinemachine::ClipperLib::OutPt*) == 0x8);
    // Cinemachine.ClipperLib/OutPt Prev
    // Size: 0x8
    // Offset: 0x30
    ::Cinemachine::ClipperLib::OutPt* Prev;
    // Field size check
    static_assert(sizeof(::Cinemachine::ClipperLib::OutPt*) == 0x8);
    public:
    // Get instance field reference: System.Int32 Idx
    [[deprecated("Use field access instead!")]] int& dyn_Idx();
    // Get instance field reference: Cinemachine.ClipperLib/IntPoint Pt
    [[deprecated("Use field access instead!")]] ::Cinemachine::ClipperLib::IntPoint& dyn_Pt();
    // Get instance field reference: Cinemachine.ClipperLib/OutPt Next
    [[deprecated("Use field access instead!")]] ::Cinemachine::ClipperLib::OutPt*& dyn_Next();
    // Get instance field reference: Cinemachine.ClipperLib/OutPt Prev
    [[deprecated("Use field access instead!")]] ::Cinemachine::ClipperLib::OutPt*& dyn_Prev();
    // public System.Void .ctor()
    // Offset: 0x2ABCC0C
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static ClipperLib::OutPt* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::Cinemachine::ClipperLib::OutPt::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<ClipperLib::OutPt*, creationType>()));
    }
  }; // Cinemachine.ClipperLib/OutPt
  #pragma pack(pop)
  static check_size<sizeof(ClipperLib::OutPt), 48 + sizeof(::Cinemachine::ClipperLib::OutPt*)> __Cinemachine_ClipperLib_OutPtSizeCheck;
  static_assert(sizeof(ClipperLib::OutPt) == 0x38);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Cinemachine::ClipperLib::OutPt::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
