// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Cinemachine.ClipperLib
#include "Cinemachine/ClipperLib.hpp"
// Including type: Cinemachine.ClipperLib/ClipperBase
#include "Cinemachine/ClipperLib_ClipperBase.hpp"
// Including type: Cinemachine.ClipperLib/ClipType
#include "Cinemachine/ClipperLib_ClipType.hpp"
// Including type: Cinemachine.ClipperLib/PolyFillType
#include "Cinemachine/ClipperLib_PolyFillType.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Cinemachine
namespace Cinemachine {
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: IComparer`1<T>
  template<typename T>
  class IComparer_1;
}
// Completed forward declares
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Cinemachine::ClipperLib::Clipper);
DEFINE_IL2CPP_ARG_TYPE(::Cinemachine::ClipperLib::Clipper*, "Cinemachine", "ClipperLib/Clipper");
// Type namespace: Cinemachine
namespace Cinemachine {
  // Size: 0x8B
  #pragma pack(push, 1)
  // Autogenerated type: Cinemachine.ClipperLib/Clipper
  // [TokenAttribute] Offset: FFFFFFFF
  class ClipperLib::Clipper : public ::Cinemachine::ClipperLib::ClipperBase {
    public:
    // Writing base type padding for base size: 0x43 to desired offset: 0x44
    char ___base_padding[0x1] = {};
    // Nested type: ::Cinemachine::ClipperLib::Clipper::NodeType
    struct NodeType;
    public:
    // private Cinemachine.ClipperLib/ClipType m_ClipType
    // Size: 0x4
    // Offset: 0x44
    ::Cinemachine::ClipperLib::ClipType m_ClipType;
    // Field size check
    static_assert(sizeof(::Cinemachine::ClipperLib::ClipType) == 0x4);
    // private Cinemachine.ClipperLib/Maxima m_Maxima
    // Size: 0x8
    // Offset: 0x48
    ::Cinemachine::ClipperLib::Maxima* m_Maxima;
    // Field size check
    static_assert(sizeof(::Cinemachine::ClipperLib::Maxima*) == 0x8);
    // private Cinemachine.ClipperLib/TEdge m_SortedEdges
    // Size: 0x8
    // Offset: 0x50
    ::Cinemachine::ClipperLib::TEdge* m_SortedEdges;
    // Field size check
    static_assert(sizeof(::Cinemachine::ClipperLib::TEdge*) == 0x8);
    // private System.Collections.Generic.List`1<Cinemachine.ClipperLib/IntersectNode> m_IntersectList
    // Size: 0x8
    // Offset: 0x58
    ::System::Collections::Generic::List_1<::Cinemachine::ClipperLib::IntersectNode*>* m_IntersectList;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Cinemachine::ClipperLib::IntersectNode*>*) == 0x8);
    // private System.Collections.Generic.IComparer`1<Cinemachine.ClipperLib/IntersectNode> m_IntersectNodeComparer
    // Size: 0x8
    // Offset: 0x60
    ::System::Collections::Generic::IComparer_1<::Cinemachine::ClipperLib::IntersectNode*>* m_IntersectNodeComparer;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::IComparer_1<::Cinemachine::ClipperLib::IntersectNode*>*) == 0x8);
    // private System.Boolean m_ExecuteLocked
    // Size: 0x1
    // Offset: 0x68
    bool m_ExecuteLocked;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_ExecuteLocked and: m_ClipFillType
    char __padding5[0x3] = {};
    // private Cinemachine.ClipperLib/PolyFillType m_ClipFillType
    // Size: 0x4
    // Offset: 0x6C
    ::Cinemachine::ClipperLib::PolyFillType m_ClipFillType;
    // Field size check
    static_assert(sizeof(::Cinemachine::ClipperLib::PolyFillType) == 0x4);
    // private Cinemachine.ClipperLib/PolyFillType m_SubjFillType
    // Size: 0x4
    // Offset: 0x70
    ::Cinemachine::ClipperLib::PolyFillType m_SubjFillType;
    // Field size check
    static_assert(sizeof(::Cinemachine::ClipperLib::PolyFillType) == 0x4);
    // Padding between fields: m_SubjFillType and: m_Joins
    char __padding7[0x4] = {};
    // private System.Collections.Generic.List`1<Cinemachine.ClipperLib/Join> m_Joins
    // Size: 0x8
    // Offset: 0x78
    ::System::Collections::Generic::List_1<::Cinemachine::ClipperLib::Join*>* m_Joins;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Cinemachine::ClipperLib::Join*>*) == 0x8);
    // private System.Collections.Generic.List`1<Cinemachine.ClipperLib/Join> m_GhostJoins
    // Size: 0x8
    // Offset: 0x80
    ::System::Collections::Generic::List_1<::Cinemachine::ClipperLib::Join*>* m_GhostJoins;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Cinemachine::ClipperLib::Join*>*) == 0x8);
    // private System.Boolean m_UsingPolyTree
    // Size: 0x1
    // Offset: 0x88
    bool m_UsingPolyTree;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <ReverseSolution>k__BackingField
    // Size: 0x1
    // Offset: 0x89
    bool ReverseSolution;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <StrictlySimple>k__BackingField
    // Size: 0x1
    // Offset: 0x8A
    bool StrictlySimple;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // static field const value: static public System.Int32 ioReverseSolution
    static constexpr const int ioReverseSolution = 1;
    // Get static field: static public System.Int32 ioReverseSolution
    static int _get_ioReverseSolution();
    // Set static field: static public System.Int32 ioReverseSolution
    static void _set_ioReverseSolution(int value);
    // static field const value: static public System.Int32 ioStrictlySimple
    static constexpr const int ioStrictlySimple = 2;
    // Get static field: static public System.Int32 ioStrictlySimple
    static int _get_ioStrictlySimple();
    // Set static field: static public System.Int32 ioStrictlySimple
    static void _set_ioStrictlySimple(int value);
    // static field const value: static public System.Int32 ioPreserveCollinear
    static constexpr const int ioPreserveCollinear = 4;
