// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Fusion::Photon::Realtime
namespace Fusion::Photon::Realtime {
  // Forward declaring type: LoadBalancingClient
  class LoadBalancingClient;
}
// Forward declaring namespace: System::Diagnostics
namespace System::Diagnostics {
  // Forward declaring type: Stopwatch
  class Stopwatch;
}
// Completed forward declares
// Type namespace: Fusion.Photon.Realtime
namespace Fusion::Photon::Realtime {
  // Forward declaring type: ConnectionHandler
  class ConnectionHandler;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Fusion::Photon::Realtime::ConnectionHandler);
DEFINE_IL2CPP_ARG_TYPE(::Fusion::Photon::Realtime::ConnectionHandler*, "Fusion.Photon.Realtime", "ConnectionHandler");
// Type namespace: Fusion.Photon.Realtime
namespace Fusion::Photon::Realtime {
  // Size: 0x40
  #pragma pack(push, 1)
  // Autogenerated type: Fusion.Photon.Realtime.ConnectionHandler
  // [TokenAttribute] Offset: FFFFFFFF
  class ConnectionHandler : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private Fusion.Photon.Realtime.LoadBalancingClient <Client>k__BackingField
    // Size: 0x8
    // Offset: 0x20
    ::Fusion::Photon::Realtime::LoadBalancingClient* Client;
    // Field size check
    static_assert(sizeof(::Fusion::Photon::Realtime::LoadBalancingClient*) == 0x8);
    // public System.Boolean DisconnectAfterKeepAlive
    // Size: 0x1
    // Offset: 0x28
    bool DisconnectAfterKeepAlive;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: DisconnectAfterKeepAlive and: KeepAliveInBackground
    char __padding1[0x3] = {};
    // public System.Int32 KeepAliveInBackground
    // Size: 0x4
    // Offset: 0x2C
    int KeepAliveInBackground;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 <CountSendAcksOnly>k__BackingField
    // Size: 0x4
    // Offset: 0x30
    int CountSendAcksOnly;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Boolean ApplyDontDestroyOnLoad
    // Size: 0x1
    // Offset: 0x34
    bool ApplyDontDestroyOnLoad;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Byte fallbackThreadId
    // Size: 0x1
    // Offset: 0x35
    uint8_t fallbackThreadId;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Boolean didSendAcks
    // Size: 0x1
    // Offset: 0x36
    bool didSendAcks;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: didSendAcks and: backgroundStopwatch
    char __padding6[0x1] = {};
    // private readonly System.Diagnostics.Stopwatch backgroundStopwatch
    // Size: 0x8
    // Offset: 0x38
    ::System::Diagnostics::Stopwatch* backgroundStopwatch;
    // Field size check
    static_assert(sizeof(::System::Diagnostics::Stopwatch*) == 0x8);
    public:
    // Get static field: static public System.Boolean AppQuits
    static bool _get_AppQuits();
    // Set static field: static public System.Boolean AppQuits
    static void _set_AppQuits(bool value);
    // Get instance field reference: private Fusion.Photon.Realtime.LoadBalancingClient <Client>k__BackingField
    [[deprecated("Use field access instead!")]] ::Fusion::Photon::Realtime::LoadBalancingClient*& dyn_$Client$k__BackingField();
    // Get instance field reference: public System.Boolean DisconnectAfterKeepAlive
    [[deprecated("Use field access instead!")]] bool& dyn_DisconnectAfterKeepAlive();
    // Get instance field reference: public System.Int32 KeepAliveInBackground
    [[deprecated("Use field access instead!")]] int& dyn_KeepAliveInBackground();
    // Get instance field reference: private System.Int32 <CountSendAcksOnly>k__BackingField
    [[deprecated("Use field access instead!")]] int& dyn_$CountSendAcksOnly$k__BackingField();
    // Get instance field reference: public System.Boolean ApplyDontDestroyOnLoad
    [[deprecated("Use field access instead!")]] bool& dyn_ApplyDontDestroyOnLoad();
    // Get instance field reference: private System.Byte fallbackThreadId
    [[deprecated("Use field access instead!")]] uint8_t& dyn_fallbackThreadId();
    // Get instance field reference: private System.Boolean didSendAcks
    [[deprecated("Use field access instead!")]] bool& dyn_didSendAcks();
    // Get instance field reference: private readonly System.Diagnostics.Stopwatch backgroundStopwatch
    [[deprecated("Use field access instead!")]] ::System::Diagnostics::Stopwatch*& dyn_backgroundStopwatch();
    // public Fusion.Photon.Realtime.LoadBalancingClient get_Client()
    // Offset: 0x2ADFD0C
    ::Fusion::Photon::Realtime::LoadBalancingClient* get_Client();
    // public System.Void set_Client(Fusion.Photon.Realtime.LoadBalancingClient value)
    // Offset: 0x2ADFD14
    void set_Client(::Fusion::Photon::Realtime::LoadBalancingClient* value);
    // public System.Int32 get_CountSendAcksOnly()
    // Offset: 0x2ADFD1C
    int get_CountSendAcksOnly();
    // private System.Void set_CountSendAcksOnly(System.Int32 value)
    // Offset: 0x2ADFD24
    void set_CountSendAcksOnly(int value);
    // public System.Boolean get_FallbackThreadRunning()
    // Offset: 0x2ADFD2C
    bool get_FallbackThreadRunning();
    // static private System.Void StaticReset()
    // Offset: 0x2ADFD3C
    static void StaticReset();
    // protected System.Void OnApplicationQuit()
    // Offset: 0x2ADFD84
    void OnApplicationQuit();
    // protected System.Void Awake()
    // Offset: 0x2ADFDD0
    void Awake();
    // protected System.Void OnDisable()
    // Offset: 0x2ADFE50
    void OnDisable();
    // public System.Void StartFallbackSendAckThread()
    // Offset: 0x2AE0214
    void StartFallbackSendAckThread();
    // public System.Void StopFallbackSendAckThread()
    // Offset: 0x2ADFF24
    void StopFallbackSendAckThread();
    // public System.Boolean RealtimeFallbackThread()
    // Offset: 0x2AE031C
    bool RealtimeFallbackThread();
    // public System.Void .ctor()
    // Offset: 0x2AE0428
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static ConnectionHandler* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::Fusion::Photon::Realtime::ConnectionHandler::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<ConnectionHandler*, creationType>()));
    }
  }; // Fusion.Photon.Realtime.ConnectionHandler
  #pragma pack(pop)
  static check_size<sizeof(ConnectionHandler), 56 + sizeof(::System::Diagnostics::Stopwatch*)> __Fusion_Photon_Realtime_ConnectionHandlerSizeCheck;
  static_assert(sizeof(ConnectionHandler) == 0x40);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Fusion::Photon::Realtime::ConnectionHandler::get_Client
// Il2CppName: get_Client
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::Fusion::Photon::Realtime::LoadBalancingClient* (Fusion::Photon::Realtime::ConnectionHandler::*)()>(&Fusion::Photon::Realtime::ConnectionHandler::get_Client)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Fusion::Photon::Realtime::ConnectionHandler*), "get_Client", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Fusion::Photon::Realtime::ConnectionHandler::set_Client
// Il2CppName: set_Client
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Fusion::Photon::Realtime::ConnectionHandler::*)(::Fusion::Photon::Realtime::LoadBalancingClient*)>(&Fusion::Photon::Realtime::ConnectionHandler::set_Client)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("Fusion.Photon.Realtime", "LoadBalancingClient")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Fusion::Photon::Realtime::ConnectionHandler*), "set_Client", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: Fusion::Photon::Realtime::ConnectionHandler::get_CountSendAcksOnly
// Il2CppName: get_CountSendAcksOnly
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<int (Fusion::Photon::Realtime::ConnectionHandler::*)()>(&Fusion::Photon::Realtime::ConnectionHandler::get_CountSendAcksOnly)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Fusion::Photon::Realtime::ConnectionHandler*), "get_CountSendAcksOnly", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Fusion::Photon::Realtime::ConnectionHandler::set_CountSendAcksOnly
// Il2CppName: set_CountSendAcksOnly
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Fusion::Photon::Realtime::ConnectionHandler::*)(int)>(&Fusion::Photon::Realtime::ConnectionHandler::set_CountSendAcksOnly)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("System", "Int32")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Fusion::Photon::Realtime::ConnectionHandler*), "set_CountSendAcksOnly", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: Fusion::Photon::Realtime::ConnectionHandler::get_FallbackThreadRunning
// Il2CppName: get_FallbackThreadRunning
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (Fusion::Photon::Realtime::ConnectionHandler::*)()>(&Fusion::Photon::Realtime::ConnectionHandler::get_FallbackThreadRunning)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Fusion::Photon::Realtime::ConnectionHandler*), "get_FallbackThreadRunning", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Fusion::Photon::Realtime::ConnectionHandler::StaticReset
// Il2CppName: StaticReset
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (*)()>(&Fusion::Photon::Realtime::ConnectionHandler::StaticReset)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Fusion::Photon::Realtime::ConnectionHandler*), "StaticReset", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Fusion::Photon::Realtime::ConnectionHandler::OnApplicationQuit
// Il2CppName: OnApplicationQuit
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Fusion::Photon::Realtime::ConnectionHandler::*)()>(&Fusion::Photon::Realtime::ConnectionHandler::OnApplicationQuit)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Fusion::Photon::Realtime::ConnectionHandler*), "OnApplicationQuit", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Fusion::Photon::Realtime::ConnectionHandler::Awake
// Il2CppName: Awake
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Fusion::Photon::Realtime::ConnectionHandler::*)()>(&Fusion::Photon::Realtime::ConnectionHandler::Awake)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Fusion::Photon::Realtime::ConnectionHandler*), "Awake", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Fusion::Photon::Realtime::ConnectionHandler::OnDisable
// Il2CppName: OnDisable
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Fusion::Photon::Realtime::ConnectionHandler::*)()>(&Fusion::Photon::Realtime::ConnectionHandler::OnDisable)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Fusion::Photon::Realtime::ConnectionHandler*), "OnDisable", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Fusion::Photon::Realtime::ConnectionHandler::StartFallbackSendAckThread
// Il2CppName: StartFallbackSendAckThread
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Fusion::Photon::Realtime::ConnectionHandler::*)()>(&Fusion::Photon::Realtime::ConnectionHandler::StartFallbackSendAckThread)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Fusion::Photon::Realtime::ConnectionHandler*), "StartFallbackSendAckThread", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Fusion::Photon::Realtime::ConnectionHandler::StopFallbackSendAckThread
// Il2CppName: StopFallbackSendAckThread
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Fusion::Photon::Realtime::ConnectionHandler::*)()>(&Fusion::Photon::Realtime::ConnectionHandler::StopFallbackSendAckThread)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Fusion::Photon::Realtime::ConnectionHandler*), "StopFallbackSendAckThread", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Fusion::Photon::Realtime::ConnectionHandler::RealtimeFallbackThread
// Il2CppName: RealtimeFallbackThread
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (Fusion::Photon::Realtime::ConnectionHandler::*)()>(&Fusion::Photon::Realtime::ConnectionHandler::RealtimeFallbackThread)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Fusion::Photon::Realtime::ConnectionHandler*), "RealtimeFallbackThread", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Fusion::Photon::Realtime::ConnectionHandler::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
