// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Net.NetworkStreamWrapper
#include "System/Net/NetworkStreamWrapper.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Net
namespace System::Net {
  // Forward declaring type: WebRequest
  class WebRequest;
  // Forward declaring type: ResponseDescription
  class ResponseDescription;
  // Forward declaring type: WebExceptionStatus
  struct WebExceptionStatus;
  // Forward declaring type: FtpStatusCode
  struct FtpStatusCode;
  // Forward declaring type: ReceiveState
  class ReceiveState;
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: Encoding
  class Encoding;
  // Forward declaring type: Decoder
  class Decoder;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: AsyncCallback
  class AsyncCallback;
  // Forward declaring type: Exception
  class Exception;
  // Forward declaring type: IAsyncResult
  class IAsyncResult;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Skipping declaration: Stream because it is already included!
}
// Forward declaring namespace: System::Net::Sockets
namespace System::Net::Sockets {
  // Forward declaring type: TcpClient
  class TcpClient;
}
// Completed forward declares
// Type namespace: System.Net
namespace System::Net {
  // Forward declaring type: CommandStream
  class CommandStream;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Net::CommandStream);
DEFINE_IL2CPP_ARG_TYPE(::System::Net::CommandStream*, "System.Net", "CommandStream");
// Type namespace: System.Net
namespace System::Net {
  // Size: 0x88
  #pragma pack(push, 1)
  // Autogenerated type: System.Net.CommandStream
  // [TokenAttribute] Offset: FFFFFFFF
  class CommandStream : public ::System::Net::NetworkStreamWrapper {
    public:
    // Nested type: ::System::Net::CommandStream::PipelineInstruction
    struct PipelineInstruction;
    // Nested type: ::System::Net::CommandStream::PipelineEntryFlags
    struct PipelineEntryFlags;
    // Nested type: ::System::Net::CommandStream::PipelineEntry
    class PipelineEntry;
    public:
    // private System.Boolean _recoverableFailure
    // Size: 0x1
    // Offset: 0x38
    bool recoverableFailure;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: recoverableFailure and: request
    char __padding0[0x7] = {};
    // protected System.Net.WebRequest _request
    // Size: 0x8
    // Offset: 0x40
    ::System::Net::WebRequest* request;
    // Field size check
    static_assert(sizeof(::System::Net::WebRequest*) == 0x8);
    // protected System.Boolean _isAsync
    // Size: 0x1
    // Offset: 0x48
    bool isAsync;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _aborted
    // Size: 0x1
    // Offset: 0x49
    bool aborted;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: aborted and: commands
    char __padding3[0x6] = {};
    // protected System.Net.CommandStream/PipelineEntry[] _commands
    // Size: 0x8
    // Offset: 0x50
    ::ArrayW<::System::Net::CommandStream::PipelineEntry*> commands;
    // Field size check
    static_assert(sizeof(::ArrayW<::System::Net::CommandStream::PipelineEntry*>) == 0x8);
    // protected System.Int32 _index
    // Size: 0x4
    // Offset: 0x58
    int index;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean _doRead
    // Size: 0x1
    // Offset: 0x5C
    bool doRead;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _doSend
    // Size: 0x1
    // Offset: 0x5D
    bool doSend;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: doSend and: currentResponseDescription
    char __padding7[0x2] = {};
    // private System.Net.ResponseDescription _currentResponseDescription
    // Size: 0x8
    // Offset: 0x60
    ::System::Net::ResponseDescription* currentResponseDescription;
    // Field size check
    static_assert(sizeof(::System::Net::ResponseDescription*) == 0x8);
    // protected System.String _abortReason
    // Size: 0x8
    // Offset: 0x68
    ::StringW abortReason;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String _buffer
    // Size: 0x8
    // Offset: 0x70
    ::StringW buffer;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Text.Encoding _encoding
    // Size: 0x8
    // Offset: 0x78
    ::System::Text::Encoding* encoding;
    // Field size check
    static_assert(sizeof(::System::Text::Encoding*) == 0x8);
    // private System.Text.Decoder _decoder
    // Size: 0x8
    // Offset: 0x80
    ::System::Text::Decoder* decoder;
    // Field size check
    static_assert(sizeof(::System::Text::Decoder*) == 0x8);
    public:
    // Get static field: static private readonly System.AsyncCallback s_writeCallbackDelegate
    static ::System::AsyncCallback* _get_s_writeCallbackDelegate();
    // Set static field: static private readonly System.AsyncCallback s_writeCallbackDelegate
    static void _set_s_writeCallbackDelegate(::System::AsyncCallback* value);
    // Get static field: static private readonly System.AsyncCallback s_readCallbackDelegate
    static ::System::AsyncCallback* _get_s_readCallbackDelegate();
    // Set static field: static private readonly System.AsyncCallback s_readCallbackDelegate
    static void _set_s_readCallbackDelegate(::System::AsyncCallback* value);
    // static field const value: static private System.Int32 WaitingForPipeline
    static constexpr const int WaitingForPipeline = 1;
