// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Net.CommandStream
#include "System/Net/CommandStream.hpp"
// Including type: System.DateTime
#include "System/DateTime.hpp"
// Including type: System.Net.FtpLoginState
#include "System/Net/FtpLoginState.hpp"
// Including type: System.Net.FtpStatusCode
#include "System/Net/FtpStatusCode.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Net
namespace System::Net {
  // Forward declaring type: IPEndPoint
  class IPEndPoint;
  // Forward declaring type: TlsStream
  class TlsStream;
  // Forward declaring type: NetworkCredential
  class NetworkCredential;
  // Forward declaring type: ResponseDescription
  class ResponseDescription;
  // Forward declaring type: IPAddress
  class IPAddress;
  // Forward declaring type: FtpWebRequest
  class FtpWebRequest;
  // Forward declaring type: TriState
  struct TriState;
  // Forward declaring type: WebRequest
  class WebRequest;
}
// Forward declaring namespace: System::Net::Sockets
namespace System::Net::Sockets {
  // Forward declaring type: Socket
  class Socket;
  // Forward declaring type: TcpClient
  class TcpClient;
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: StringBuilder
  class StringBuilder;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: WeakReference
  class WeakReference;
  // Forward declaring type: Uri
  class Uri;
  // Forward declaring type: AsyncCallback
  class AsyncCallback;
  // Forward declaring type: IAsyncResult
  class IAsyncResult;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Skipping declaration: Stream because it is already included!
}
// Completed forward declares
// Type namespace: System.Net
namespace System::Net {
  // Forward declaring type: FtpControlStream
  class FtpControlStream;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Net::FtpControlStream);
DEFINE_IL2CPP_ARG_TYPE(::System::Net::FtpControlStream*, "System.Net", "FtpControlStream");
// Type namespace: System.Net
namespace System::Net {
  // Size: 0x110
  #pragma pack(push, 1)
  // Autogenerated type: System.Net.FtpControlStream
  // [TokenAttribute] Offset: FFFFFFFF
  class FtpControlStream : public ::System::Net::CommandStream {
    public:
    // Nested type: ::System::Net::FtpControlStream::GetPathOption
    struct GetPathOption;
    // Nested type: ::System::Net::FtpControlStream::$$c__DisplayClass31_0
    class $$c__DisplayClass31_0;
    public:
    // private System.Net.Sockets.Socket _dataSocket
    // Size: 0x8
    // Offset: 0x88
    ::System::Net::Sockets::Socket* dataSocket;
    // Field size check
    static_assert(sizeof(::System::Net::Sockets::Socket*) == 0x8);
    // private System.Net.IPEndPoint _passiveEndPoint
    // Size: 0x8
    // Offset: 0x90
    ::System::Net::IPEndPoint* passiveEndPoint;
    // Field size check
    static_assert(sizeof(::System::Net::IPEndPoint*) == 0x8);
    // private System.Net.TlsStream _tlsStream
    // Size: 0x8
    // Offset: 0x98
    ::System::Net::TlsStream* tlsStream;
    // Field size check
    static_assert(sizeof(::System::Net::TlsStream*) == 0x8);
    // private System.Text.StringBuilder _bannerMessage
    // Size: 0x8
    // Offset: 0xA0
    ::System::Text::StringBuilder* bannerMessage;
    // Field size check
    static_assert(sizeof(::System::Text::StringBuilder*) == 0x8);
    // private System.Text.StringBuilder _welcomeMessage
    // Size: 0x8
    // Offset: 0xA8
    ::System::Text::StringBuilder* welcomeMessage;
    // Field size check
    static_assert(sizeof(::System::Text::StringBuilder*) == 0x8);
    // private System.Text.StringBuilder _exitMessage
    // Size: 0x8
    // Offset: 0xB0
    ::System::Text::StringBuilder* exitMessage;
    // Field size check
    static_assert(sizeof(::System::Text::StringBuilder*) == 0x8);
    // private System.WeakReference _credentials
    // Size: 0x8
    // Offset: 0xB8
    ::System::WeakReference* credentials;
    // Field size check
    static_assert(sizeof(::System::WeakReference*) == 0x8);
    // private System.String _currentTypeSetting
    // Size: 0x8
    // Offset: 0xC0
    ::StringW currentTypeSetting;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Int64 _contentLength
    // Size: 0x8
    // Offset: 0xC8
    int64_t contentLength;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private System.DateTime _lastModified
    // Size: 0x8
    // Offset: 0xD0
    ::System::DateTime lastModified;
    // Field size check
    static_assert(sizeof(::System::DateTime) == 0x8);
    // private System.Boolean _dataHandshakeStarted
    // Size: 0x1
    // Offset: 0xD8
    bool dataHandshakeStarted;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: dataHandshakeStarted and: loginDirectory
    char __padding10[0x7] = {};
    // private System.String _loginDirectory
    // Size: 0x8
    // Offset: 0xE0
    ::StringW loginDirectory;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String _establishedServerDirectory
    // Size: 0x8
    // Offset: 0xE8
    ::StringW establishedServerDirectory;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String _requestedServerDirectory
    // Size: 0x8
    // Offset: 0xF0
    ::StringW requestedServerDirectory;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Uri _responseUri
    // Size: 0x8
    // Offset: 0xF8
    ::System::Uri* responseUri;
    // Field size check
    static_assert(sizeof(::System::Uri*) == 0x8);
    // private System.Net.FtpLoginState _loginState
    // Size: 0x1
    // Offset: 0x100
    ::System::Net::FtpLoginState loginState;
    // Field size check
    static_assert(sizeof(::System::Net::FtpLoginState) == 0x1);
    // Padding between fields: loginState and: StatusCode
    char __padding15[0x3] = {};
    // System.Net.FtpStatusCode StatusCode
    // Size: 0x4
    // Offset: 0x104
    ::System::Net::FtpStatusCode StatusCode;
    // Field size check
    static_assert(sizeof(::System::Net::FtpStatusCode) == 0x4);
    // System.String StatusLine
    // Size: 0x8
    // Offset: 0x108
    ::StringW StatusLine;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Get static field: static private readonly System.AsyncCallback s_acceptCallbackDelegate
    static ::System::AsyncCallback* _get_s_acceptCallbackDelegate();
    // Set static field: static private readonly System.AsyncCallback s_acceptCallbackDelegate
    static void _set_s_acceptCallbackDelegate(::System::AsyncCallback* value);
    // Get static field: static private readonly System.AsyncCallback s_connectCallbackDelegate
    static ::System::AsyncCallback* _get_s_connectCallbackDelegate();
    // Set static field: static private readonly System.AsyncCallback s_connectCallbackDelegate
    static void _set_s_connectCallbackDelegate(::System::AsyncCallback* value);
    // Get static field: static private readonly System.AsyncCallback s_SSLHandshakeCallback
    static ::System::AsyncCallback* _get_s_SSLHandshakeCallback();
