// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Net.WebRequest
#include "System/Net/WebRequest.hpp"
// Including type: System.DateTime
#include "System/DateTime.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Net
namespace System::Net {
  // Forward declaring type: WebHeaderCollection
  class WebHeaderCollection;
  // Forward declaring type: ICredentials
  class ICredentials;
  // Forward declaring type: FtpMethodInfo
  class FtpMethodInfo;
  // Forward declaring type: ServicePoint
  class ServicePoint;
  // Forward declaring type: FtpControlStream
  class FtpControlStream;
  // Forward declaring type: FtpWebResponse
  class FtpWebResponse;
  // Forward declaring type: ContextAwareResult
  class ContextAwareResult;
  // Forward declaring type: LazyAsyncResult
  class LazyAsyncResult;
  // Forward declaring type: NetworkCredential
  class NetworkCredential;
  // Skipping declaration: RequestStage because it is already included!
  // Forward declaring type: CloseExState
  struct CloseExState;
  // Forward declaring type: IWebProxy
  class IWebProxy;
  // Forward declaring type: WebResponse
  class WebResponse;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Uri
  class Uri;
  // Forward declaring type: Exception
  class Exception;
  // Forward declaring type: IAsyncResult
  class IAsyncResult;
  // Forward declaring type: AsyncCallback
  class AsyncCallback;
}
// Forward declaring namespace: System::Security::Cryptography::X509Certificates
namespace System::Security::Cryptography::X509Certificates {
  // Forward declaring type: X509CertificateCollection
  class X509CertificateCollection;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: Stream
  class Stream;
}
// Forward declaring namespace: System::Net::Cache
namespace System::Net::Cache {
  // Forward declaring type: RequestCachePolicy
  class RequestCachePolicy;
}
// Completed forward declares
// Type namespace: System.Net
namespace System::Net {
  // Forward declaring type: FtpWebRequest
  class FtpWebRequest;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Net::FtpWebRequest);
DEFINE_IL2CPP_ARG_TYPE(::System::Net::FtpWebRequest*, "System.Net", "FtpWebRequest");
// Type namespace: System.Net
namespace System::Net {
  // Size: 0x118
  #pragma pack(push, 1)
  // Autogenerated type: System.Net.FtpWebRequest
  // [TokenAttribute] Offset: FFFFFFFF
  class FtpWebRequest : public ::System::Net::WebRequest {
    public:
    // Nested type: ::System::Net::FtpWebRequest::RequestStage
    struct RequestStage;
    // Nested type: ::System::Net::FtpWebRequest::$CreateConnectionAsync$d__86
    struct $CreateConnectionAsync$d__86;
    // Nested type: ::System::Net::FtpWebRequest::$$c
    class $$c;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: System.Net.FtpWebRequest/RequestStage
    // [TokenAttribute] Offset: FFFFFFFF
    struct RequestStage/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: RequestStage
      constexpr RequestStage(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public System.Net.FtpWebRequest/RequestStage CheckForError
      static constexpr const int CheckForError = 0;
      // Get static field: static public System.Net.FtpWebRequest/RequestStage CheckForError
      static ::System::Net::FtpWebRequest::RequestStage _get_CheckForError();
      // Set static field: static public System.Net.FtpWebRequest/RequestStage CheckForError
      static void _set_CheckForError(::System::Net::FtpWebRequest::RequestStage value);
      // static field const value: static public System.Net.FtpWebRequest/RequestStage RequestStarted
      static constexpr const int RequestStarted = 1;
      // Get static field: static public System.Net.FtpWebRequest/RequestStage RequestStarted
      static ::System::Net::FtpWebRequest::RequestStage _get_RequestStarted();
      // Set static field: static public System.Net.FtpWebRequest/RequestStage RequestStarted
      static void _set_RequestStarted(::System::Net::FtpWebRequest::RequestStage value);
      // static field const value: static public System.Net.FtpWebRequest/RequestStage WriteReady
      static constexpr const int WriteReady = 2;
      // Get static field: static public System.Net.FtpWebRequest/RequestStage WriteReady
      static ::System::Net::FtpWebRequest::RequestStage _get_WriteReady();
      // Set static field: static public System.Net.FtpWebRequest/RequestStage WriteReady
      static void _set_WriteReady(::System::Net::FtpWebRequest::RequestStage value);
      // static field const value: static public System.Net.FtpWebRequest/RequestStage ReadReady
      static constexpr const int ReadReady = 3;
      // Get static field: static public System.Net.FtpWebRequest/RequestStage ReadReady
      static ::System::Net::FtpWebRequest::RequestStage _get_ReadReady();
      // Set static field: static public System.Net.FtpWebRequest/RequestStage ReadReady
      static void _set_ReadReady(::System::Net::FtpWebRequest::RequestStage value);
      // static field const value: static public System.Net.FtpWebRequest/RequestStage ReleaseConnection
      static constexpr const int ReleaseConnection = 4;
      // Get static field: static public System.Net.FtpWebRequest/RequestStage ReleaseConnection
      static ::System::Net::FtpWebRequest::RequestStage _get_ReleaseConnection();
      // Set static field: static public System.Net.FtpWebRequest/RequestStage ReleaseConnection
      static void _set_ReleaseConnection(::System::Net::FtpWebRequest::RequestStage value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // System.Net.FtpWebRequest/RequestStage
    #pragma pack(pop)
    static check_size<sizeof(FtpWebRequest::RequestStage), 0 + sizeof(int)> __System_Net_FtpWebRequest_RequestStageSizeCheck;
    static_assert(sizeof(FtpWebRequest::RequestStage) == 0x4);
    public:
    // private System.Object _syncObject
    // Size: 0x8
    // Offset: 0x38
    ::Il2CppObject* syncObject;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Net.ICredentials _authInfo
    // Size: 0x8
    // Offset: 0x40
    ::System::Net::ICredentials* authInfo;
    // Field size check
    static_assert(sizeof(::System::Net::ICredentials*) == 0x8);
    // private readonly System.Uri _uri
    // Size: 0x8
    // Offset: 0x48
    ::System::Uri* uri;
    // Field size check
    static_assert(sizeof(::System::Uri*) == 0x8);
    // private System.Net.FtpMethodInfo _methodInfo
    // Size: 0x8
    // Offset: 0x50
    ::System::Net::FtpMethodInfo* methodInfo;
    // Field size check
    static_assert(sizeof(::System::Net::FtpMethodInfo*) == 0x8);
    // private System.String _renameTo
    // Size: 0x8
    // Offset: 0x58
    ::StringW renameTo;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean _getRequestStreamStarted
    // Size: 0x1
    // Offset: 0x60
    bool getRequestStreamStarted;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _getResponseStarted
    // Size: 0x1
    // Offset: 0x61
    bool getResponseStarted;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: getResponseStarted and: startTime
    char __padding6[0x6] = {};
    // private System.DateTime _startTime
    // Size: 0x8
    // Offset: 0x68
    ::System::DateTime startTime;
    // Field size check
    static_assert(sizeof(::System::DateTime) == 0x8);
    // private System.Int32 _timeout
    // Size: 0x4
    // Offset: 0x70
    int timeout;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _remainingTimeout
    // Size: 0x4
    // Offset: 0x74
    int remainingTimeout;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int64 _contentLength
    // Size: 0x8
    // Offset: 0x78
    int64_t contentLength;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private System.Int64 _contentOffset
    // Size: 0x8
    // Offset: 0x80
    int64_t contentOffset;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private System.Security.Cryptography.X509Certificates.X509CertificateCollection _clientCertificates
    // Size: 0x8
    // Offset: 0x88
    ::System::Security::Cryptography::X509Certificates::X509CertificateCollection* clientCertificates;
    // Field size check
    static_assert(sizeof(::System::Security::Cryptography::X509Certificates::X509CertificateCollection*) == 0x8);
    // private System.Boolean _passive
    // Size: 0x1
    // Offset: 0x90
    bool passive;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _binary
    // Size: 0x1
    // Offset: 0x91
    bool binary;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: binary and: connectionGroupName
    char __padding14[0x6] = {};
    // private System.String _connectionGroupName
    // Size: 0x8
    // Offset: 0x98
    ::StringW connectionGroupName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Net.ServicePoint _servicePoint
    // Size: 0x8
    // Offset: 0xA0
    ::System::Net::ServicePoint* servicePoint;
    // Field size check
    static_assert(sizeof(::System::Net::ServicePoint*) == 0x8);
    // private System.Boolean _async
    // Size: 0x1
    // Offset: 0xA8
    bool async;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _aborted
    // Size: 0x1
    // Offset: 0xA9
    bool aborted;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _timedOut
    // Size: 0x1
    // Offset: 0xAA
    bool timedOut;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: timedOut and: exception
    char __padding19[0x5] = {};
    // private System.Exception _exception
    // Size: 0x8
    // Offset: 0xB0
    ::System::Exception* exception;
    // Field size check
    static_assert(sizeof(::System::Exception*) == 0x8);
    // private System.Net.TimerThread/Queue _timerQueue
    // Size: 0x8
    // Offset: 0xB8
    ::System::Net::TimerThread::Queue* timerQueue;
    // Field size check
    static_assert(sizeof(::System::Net::TimerThread::Queue*) == 0x8);
    // private System.Net.TimerThread/Callback _timerCallback
    // Size: 0x8
    // Offset: 0xC0
    ::System::Net::TimerThread::Callback* timerCallback;
    // Field size check
    static_assert(sizeof(::System::Net::TimerThread::Callback*) == 0x8);
    // private System.Boolean _enableSsl
    // Size: 0x1
    // Offset: 0xC8
    bool enableSsl;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: enableSsl and: connection
    char __padding23[0x7] = {};
    // private System.Net.FtpControlStream _connection
    // Size: 0x8
    // Offset: 0xD0
    ::System::Net::FtpControlStream* connection;
    // Field size check
    static_assert(sizeof(::System::Net::FtpControlStream*) == 0x8);
    // private System.IO.Stream _stream
    // Size: 0x8
    // Offset: 0xD8
    ::System::IO::Stream* stream;
    // Field size check
    static_assert(sizeof(::System::IO::Stream*) == 0x8);
    // private System.Net.FtpWebRequest/RequestStage _requestStage
    // Size: 0x4
    // Offset: 0xE0
    ::System::Net::FtpWebRequest::RequestStage requestStage;
    // Field size check
    static_assert(sizeof(::System::Net::FtpWebRequest::RequestStage) == 0x4);
    // private System.Boolean _onceFailed
    // Size: 0x1
    // Offset: 0xE4
    bool onceFailed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: onceFailed and: ftpRequestHeaders
    char __padding27[0x3] = {};
    // private System.Net.WebHeaderCollection _ftpRequestHeaders
    // Size: 0x8
    // Offset: 0xE8
    ::System::Net::WebHeaderCollection* ftpRequestHeaders;
    // Field size check
    static_assert(sizeof(::System::Net::WebHeaderCollection*) == 0x8);
    // private System.Net.FtpWebResponse _ftpWebResponse
    // Size: 0x8
    // Offset: 0xF0
    ::System::Net::FtpWebResponse* ftpWebResponse;
    // Field size check
    static_assert(sizeof(::System::Net::FtpWebResponse*) == 0x8);
    // private System.Int32 _readWriteTimeout
    // Size: 0x4
    // Offset: 0xF8
    int readWriteTimeout;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: readWriteTimeout and: writeAsyncResult
    char __padding30[0x4] = {};
    // private System.Net.ContextAwareResult _writeAsyncResult
    // Size: 0x8
    // Offset: 0x100
    ::System::Net::ContextAwareResult* writeAsyncResult;
    // Field size check
    static_assert(sizeof(::System::Net::ContextAwareResult*) == 0x8);
    // private System.Net.LazyAsyncResult _readAsyncResult
    // Size: 0x8
    // Offset: 0x108
    ::System::Net::LazyAsyncResult* readAsyncResult;
    // Field size check
    static_assert(sizeof(::System::Net::LazyAsyncResult*) == 0x8);
    // private System.Net.LazyAsyncResult _requestCompleteAsyncResult
    // Size: 0x8
    // Offset: 0x110
    ::System::Net::LazyAsyncResult* requestCompleteAsyncResult;
    // Field size check
    static_assert(sizeof(::System::Net::LazyAsyncResult*) == 0x8);
    public:
    // Get static field: static private readonly System.Net.NetworkCredential s_defaultFtpNetworkCredential
    static ::System::Net::NetworkCredential* _get_s_defaultFtpNetworkCredential();
    // Set static field: static private readonly System.Net.NetworkCredential s_defaultFtpNetworkCredential
    static void _set_s_defaultFtpNetworkCredential(::System::Net::NetworkCredential* value);
    // static field const value: static private System.Int32 s_DefaultTimeout
    static constexpr const int s_DefaultTimeout = 100000;
    // Get static field: static private System.Int32 s_DefaultTimeout
    static int _get_s_DefaultTimeout();
    // Set static field: static private System.Int32 s_DefaultTimeout
    static void _set_s_DefaultTimeout(int value);
