// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: StringBuilder
  class StringBuilder;
}
// Forward declaring namespace: System::Net
namespace System::Net {
  // Forward declaring type: WebHeaderCollection
  class WebHeaderCollection;
  // Skipping declaration: State because it is already included!
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
}
// Completed forward declares
// Type namespace: System.Net
namespace System::Net {
  // Forward declaring type: MonoChunkParser
  class MonoChunkParser;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Net::MonoChunkParser);
DEFINE_IL2CPP_ARG_TYPE(::System::Net::MonoChunkParser*, "System.Net", "MonoChunkParser");
// Type namespace: System.Net
namespace System::Net {
  // Size: 0x40
  #pragma pack(push, 1)
  // Autogenerated type: System.Net.MonoChunkParser
  // [TokenAttribute] Offset: FFFFFFFF
  class MonoChunkParser : public ::Il2CppObject {
    public:
    // Nested type: ::System::Net::MonoChunkParser::State
    struct State;
    // Nested type: ::System::Net::MonoChunkParser::Chunk
    class Chunk;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: System.Net.MonoChunkParser/State
    // [TokenAttribute] Offset: FFFFFFFF
    struct State/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: State
      constexpr State(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public System.Net.MonoChunkParser/State None
      static constexpr const int None = 0;
      // Get static field: static public System.Net.MonoChunkParser/State None
      static ::System::Net::MonoChunkParser::State _get_None();
      // Set static field: static public System.Net.MonoChunkParser/State None
      static void _set_None(::System::Net::MonoChunkParser::State value);
      // static field const value: static public System.Net.MonoChunkParser/State PartialSize
      static constexpr const int PartialSize = 1;
      // Get static field: static public System.Net.MonoChunkParser/State PartialSize
      static ::System::Net::MonoChunkParser::State _get_PartialSize();
      // Set static field: static public System.Net.MonoChunkParser/State PartialSize
      static void _set_PartialSize(::System::Net::MonoChunkParser::State value);
      // static field const value: static public System.Net.MonoChunkParser/State Body
      static constexpr const int Body = 2;
      // Get static field: static public System.Net.MonoChunkParser/State Body
      static ::System::Net::MonoChunkParser::State _get_Body();
      // Set static field: static public System.Net.MonoChunkParser/State Body
      static void _set_Body(::System::Net::MonoChunkParser::State value);
      // static field const value: static public System.Net.MonoChunkParser/State BodyFinished
      static constexpr const int BodyFinished = 3;
      // Get static field: static public System.Net.MonoChunkParser/State BodyFinished
      static ::System::Net::MonoChunkParser::State _get_BodyFinished();
      // Set static field: static public System.Net.MonoChunkParser/State BodyFinished
      static void _set_BodyFinished(::System::Net::MonoChunkParser::State value);
      // static field const value: static public System.Net.MonoChunkParser/State Trailer
      static constexpr const int Trailer = 4;
      // Get static field: static public System.Net.MonoChunkParser/State Trailer
      static ::System::Net::MonoChunkParser::State _get_Trailer();
      // Set static field: static public System.Net.MonoChunkParser/State Trailer
      static void _set_Trailer(::System::Net::MonoChunkParser::State value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // System.Net.MonoChunkParser/State
    #pragma pack(pop)
    static check_size<sizeof(MonoChunkParser::State), 0 + sizeof(int)> __System_Net_MonoChunkParser_StateSizeCheck;
    static_assert(sizeof(MonoChunkParser::State) == 0x4);
    public:
    // private System.Net.WebHeaderCollection headers
    // Size: 0x8
    // Offset: 0x10
    ::System::Net::WebHeaderCollection* headers;
    // Field size check
    static_assert(sizeof(::System::Net::WebHeaderCollection*) == 0x8);
    // private System.Int32 chunkSize
    // Size: 0x4
    // Offset: 0x18
    int chunkSize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 chunkRead
    // Size: 0x4
    // Offset: 0x1C
    int chunkRead;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 totalWritten
    // Size: 0x4
    // Offset: 0x20
    int totalWritten;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Net.MonoChunkParser/State state
    // Size: 0x4
    // Offset: 0x24
    ::System::Net::MonoChunkParser::State state;
    // Field size check
    static_assert(sizeof(::System::Net::MonoChunkParser::State) == 0x4);
    // private System.Text.StringBuilder saved
    // Size: 0x8
    // Offset: 0x28
    ::System::Text::StringBuilder* saved;
    // Field size check
    static_assert(sizeof(::System::Text::StringBuilder*) == 0x8);
    // private System.Boolean sawCR
    // Size: 0x1
    // Offset: 0x30
    bool sawCR;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean gotit
    // Size: 0x1
    // Offset: 0x31
    bool gotit;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: gotit and: trailerState
    char __padding7[0x2] = {};
    // private System.Int32 trailerState
    // Size: 0x4
    // Offset: 0x34
    int trailerState;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Collections.ArrayList chunks
    // Size: 0x8
    // Offset: 0x38
    ::System::Collections::ArrayList* chunks;
    // Field size check
    static_assert(sizeof(::System::Collections::ArrayList*) == 0x8);
    public:
    // Get instance field reference: private System.Net.WebHeaderCollection headers
    [[deprecated("Use field access instead!")]] ::System::Net::WebHeaderCollection*& dyn_headers();
    // Get instance field reference: private System.Int32 chunkSize
    [[deprecated("Use field access instead!")]] int& dyn_chunkSize();
    // Get instance field reference: private System.Int32 chunkRead
    [[deprecated("Use field access instead!")]] int& dyn_chunkRead();
    // Get instance field reference: private System.Int32 totalWritten
    [[deprecated("Use field access instead!")]] int& dyn_totalWritten();
    // Get instance field reference: private System.Net.MonoChunkParser/State state
    [[deprecated("Use field access instead!")]] ::System::Net::MonoChunkParser::State& dyn_state();
    // Get instance field reference: private System.Text.StringBuilder saved
    [[deprecated("Use field access instead!")]] ::System::Text::StringBuilder*& dyn_saved();
    // Get instance field reference: private System.Boolean sawCR
    [[deprecated("Use field access instead!")]] bool& dyn_sawCR();
    // Get instance field reference: private System.Boolean gotit
    [[deprecated("Use field access instead!")]] bool& dyn_gotit();
    // Get instance field reference: private System.Int32 trailerState
    [[deprecated("Use field access instead!")]] int& dyn_trailerState();
    // Get instance field reference: private System.Collections.ArrayList chunks
    [[deprecated("Use field access instead!")]] ::System::Collections::ArrayList*& dyn_chunks();
    // public System.Void .ctor(System.Net.WebHeaderCollection headers)
    // Offset: 0x4EAA14C
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static MonoChunkParser* New_ctor(::System::Net::WebHeaderCollection* headers) {
      static auto ___internal__logger = ::Logger::get().WithContext("::System::Net::MonoChunkParser::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<MonoChunkParser*, creationType>(headers)));
    }
    // public System.Void WriteAndReadBack(System.Byte[] buffer, System.Int32 offset, System.Int32 size, ref System.Int32 read)
    // Offset: 0x4EAA21C
    void WriteAndReadBack(::ArrayW<uint8_t> buffer, int offset, int size, ByRef<int> read);
    // public System.Int32 Read(System.Byte[] buffer, System.Int32 offset, System.Int32 size)
    // Offset: 0x4EAA2B8
    int Read(::ArrayW<uint8_t> buffer, int offset, int size);
    // private System.Int32 ReadFromChunks(System.Byte[] buffer, System.Int32 offset, System.Int32 size)
    // Offset: 0x4EAA2BC
    int ReadFromChunks(::ArrayW<uint8_t> buffer, int offset, int size);
    // public System.Void Write(System.Byte[] buffer, System.Int32 offset, System.Int32 size)
    // Offset: 0x4EAA298
    void Write(::ArrayW<uint8_t> buffer, int offset, int size);
    // private System.Void InternalWrite(System.Byte[] buffer, ref System.Int32 offset, System.Int32 size)
    // Offset: 0x4EAA63C
    void InternalWrite(::ArrayW<uint8_t> buffer, ByRef<int> offset, int size);
    // public System.Boolean get_WantMore()
    // Offset: 0x4EAAF68
    bool get_WantMore();
    // public System.Boolean get_DataAvailable()
    // Offset: 0x4EAAF8C
    bool get_DataAvailable();
    // public System.Int32 get_TotalDataSize()
    // Offset: 0x4EAB08C
    int get_TotalDataSize();
    // public System.Int32 get_ChunkLeft()
    // Offset: 0x4EAB094
    int get_ChunkLeft();
    // private System.Net.MonoChunkParser/State ReadBody(System.Byte[] buffer, ref System.Int32 offset, System.Int32 size)
    // Offset: 0x4EAAA70
    ::System::Net::MonoChunkParser::State ReadBody(::ArrayW<uint8_t> buffer, ByRef<int> offset, int size);
    // private System.Net.MonoChunkParser/State GetChunkSize(System.Byte[] buffer, ref System.Int32 offset, System.Int32 size)
    // Offset: 0x4EAA778
    ::System::Net::MonoChunkParser::State GetChunkSize(::ArrayW<uint8_t> buffer, ByRef<int> offset, int size);
    // static private System.String RemoveChunkExtension(System.String input)
    // Offset: 0x4EAB120
    static ::StringW RemoveChunkExtension(::StringW input);
    // private System.Net.MonoChunkParser/State ReadCRLF(System.Byte[] buffer, ref System.Int32 offset, System.Int32 size)
    // Offset: 0x4EAABB0
    ::System::Net::MonoChunkParser::State ReadCRLF(::ArrayW<uint8_t> buffer, ByRef<int> offset, int size);
    // private System.Net.MonoChunkParser/State ReadTrailer(System.Byte[] buffer, ref System.Int32 offset, System.Int32 size)
    // Offset: 0x4EAACB0
    ::System::Net::MonoChunkParser::State ReadTrailer(::ArrayW<uint8_t> buffer, ByRef<int> offset, int size);
    // static private System.Void ThrowProtocolViolation(System.String message)
    // Offset: 0x4EAB0D0
    static void ThrowProtocolViolation(::StringW message);
  }; // System.Net.MonoChunkParser
  #pragma pack(pop)
  static check_size<sizeof(MonoChunkParser), 56 + sizeof(::System::Collections::ArrayList*)> __System_Net_MonoChunkParserSizeCheck;
  static_assert(sizeof(MonoChunkParser) == 0x40);
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::System::Net::MonoChunkParser::State, "System.Net", "MonoChunkParser/State");
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: System::Net::MonoChunkParser::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: System::Net::MonoChunkParser::WriteAndReadBack
// Il2CppName: WriteAndReadBack
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (System::Net::MonoChunkParser::*)(::ArrayW<uint8_t>, int, int, ByRef<int>)>(&System::Net::MonoChunkParser::WriteAndReadBack)> {
  static const MethodInfo* get() {
    static auto* buffer = &il2cpp_functions::array_class_get(::il2cpp_utils::GetClassFromName("System", "Byte"), 1)->byval_arg;
    static auto* offset = &::il2cpp_utils::GetClassFromName("System", "Int32")->byval_arg;
    static auto* size = &::il2cpp_utils::GetClassFromName("System", "Int32")->byval_arg;
    static auto* read = &::il2cpp_utils::GetClassFromName("System", "Int32")->this_arg;
    return ::il2cpp_utils::FindMethod(classof(System::Net::MonoChunkParser*), "WriteAndReadBack", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{buffer, offset, size, read});
  }
};
// Writing MetadataGetter for method: System::Net::MonoChunkParser::Read
// Il2CppName: Read
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<int (System::Net::MonoChunkParser::*)(::ArrayW<uint8_t>, int, int)>(&System::Net::MonoChunkParser::Read)> {
  static const MethodInfo* get() {
    static auto* buffer = &il2cpp_functions::array_class_get(::il2cpp_utils::GetClassFromName("System", "Byte"), 1)->byval_arg;
    static auto* offset = &::il2cpp_utils::GetClassFromName("System", "Int32")->byval_arg;
    static auto* size = &::il2cpp_utils::GetClassFromName("System", "Int32")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(System::Net::MonoChunkParser*), "Read", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{buffer, offset, size});
  }
};
// Writing MetadataGetter for method: System::Net::MonoChunkParser::ReadFromChunks
// Il2CppName: ReadFromChunks
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<int (System::Net::MonoChunkParser::*)(::ArrayW<uint8_t>, int, int)>(&System::Net::MonoChunkParser::ReadFromChunks)> {
  static const MethodInfo* get() {
    static auto* buffer = &il2cpp_functions::array_class_get(::il2cpp_utils::GetClassFromName("System", "Byte"), 1)->byval_arg;
    static auto* offset = &::il2cpp_utils::GetClassFromName("System", "Int32")->byval_arg;
    static auto* size = &::il2cpp_utils::GetClassFromName("System", "Int32")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(System::Net::MonoChunkParser*), "ReadFromChunks", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{buffer, offset, size});
  }
};
// Writing MetadataGetter for method: System::Net::MonoChunkParser::Write
// Il2CppName: Write
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (System::Net::MonoChunkParser::*)(::ArrayW<uint8_t>, int, int)>(&System::Net::MonoChunkParser::Write)> {
  static const MethodInfo* get() {
    static auto* buffer = &il2cpp_functions::array_class_get(::il2cpp_utils::GetClassFromName("System", "Byte"), 1)->byval_arg;
    static auto* offset = &::il2cpp_utils::GetClassFromName("System", "Int32")->byval_arg;
    static auto* size = &::il2cpp_utils::GetClassFromName("System", "Int32")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(System::Net::MonoChunkParser*), "Write", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{buffer, offset, size});
  }
};
// Writing MetadataGetter for method: System::Net::MonoChunkParser::InternalWrite
// Il2CppName: InternalWrite
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (System::Net::MonoChunkParser::*)(::ArrayW<uint8_t>, ByRef<int>, int)>(&System::Net::MonoChunkParser::InternalWrite)> {
  static const MethodInfo* get() {
    static auto* buffer = &il2cpp_functions::array_class_get(::il2cpp_utils::GetClassFromName("System", "Byte"), 1)->byval_arg;
    static auto* offset = &::il2cpp_utils::GetClassFromName("System", "Int32")->this_arg;
    static auto* size = &::il2cpp_utils::GetClassFromName("System", "Int32")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(System::Net::MonoChunkParser*), "InternalWrite", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{buffer, offset, size});
  }
};
// Writing MetadataGetter for method: System::Net::MonoChunkParser::get_WantMore
// Il2CppName: get_WantMore
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (System::Net::MonoChunkParser::*)()>(&System::Net::MonoChunkParser::get_WantMore)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(System::Net::MonoChunkParser*), "get_WantMore", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: System::Net::MonoChunkParser::get_DataAvailable
// Il2CppName: get_DataAvailable
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (System::Net::MonoChunkParser::*)()>(&System::Net::MonoChunkParser::get_DataAvailable)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(System::Net::MonoChunkParser*), "get_DataAvailable", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: System::Net::MonoChunkParser::get_TotalDataSize
// Il2CppName: get_TotalDataSize
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<int (System::Net::MonoChunkParser::*)()>(&System::Net::MonoChunkParser::get_TotalDataSize)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(System::Net::MonoChunkParser*), "get_TotalDataSize", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: System::Net::MonoChunkParser::get_ChunkLeft
// Il2CppName: get_ChunkLeft
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<int (System::Net::MonoChunkParser::*)()>(&System::Net::MonoChunkParser::get_ChunkLeft)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(System::Net::MonoChunkParser*), "get_ChunkLeft", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: System::Net::MonoChunkParser::ReadBody
// Il2CppName: ReadBody
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::System::Net::MonoChunkParser::State (System::Net::MonoChunkParser::*)(::ArrayW<uint8_t>, ByRef<int>, int)>(&System::Net::MonoChunkParser::ReadBody)> {
  static const MethodInfo* get() {
    static auto* buffer = &il2cpp_functions::array_class_get(::il2cpp_utils::GetClassFromName("System", "Byte"), 1)->byval_arg;
    static auto* offset = &::il2cpp_utils::GetClassFromName("System", "Int32")->this_arg;
    static auto* size = &::il2cpp_utils::GetClassFromName("System", "Int32")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(System::Net::MonoChunkParser*), "ReadBody", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{buffer, offset, size});
  }
};
// Writing MetadataGetter for method: System::Net::MonoChunkParser::GetChunkSize
// Il2CppName: GetChunkSize
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::System::Net::MonoChunkParser::State (System::Net::MonoChunkParser::*)(::ArrayW<uint8_t>, ByRef<int>, int)>(&System::Net::MonoChunkParser::GetChunkSize)> {
  static const MethodInfo* get() {
    static auto* buffer = &il2cpp_functions::array_class_get(::il2cpp_utils::GetClassFromName("System", "Byte"), 1)->byval_arg;
    static auto* offset = &::il2cpp_utils::GetClassFromName("System", "Int32")->this_arg;
    static auto* size = &::il2cpp_utils::GetClassFromName("System", "Int32")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(System::Net::MonoChunkParser*), "GetChunkSize", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{buffer, offset, size});
  }
};
// Writing MetadataGetter for method: System::Net::MonoChunkParser::RemoveChunkExtension
// Il2CppName: RemoveChunkExtension
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::StringW (*)(::StringW)>(&System::Net::MonoChunkParser::RemoveChunkExtension)> {
  static const MethodInfo* get() {
    static auto* input = &::il2cpp_utils::GetClassFromName("System", "String")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(System::Net::MonoChunkParser*), "RemoveChunkExtension", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{input});
  }
};
// Writing MetadataGetter for method: System::Net::MonoChunkParser::ReadCRLF
// Il2CppName: ReadCRLF
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::System::Net::MonoChunkParser::State (System::Net::MonoChunkParser::*)(::ArrayW<uint8_t>, ByRef<int>, int)>(&System::Net::MonoChunkParser::ReadCRLF)> {
  static const MethodInfo* get() {
    static auto* buffer = &il2cpp_functions::array_class_get(::il2cpp_utils::GetClassFromName("System", "Byte"), 1)->byval_arg;
    static auto* offset = &::il2cpp_utils::GetClassFromName("System", "Int32")->this_arg;
    static auto* size = &::il2cpp_utils::GetClassFromName("System", "Int32")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(System::Net::MonoChunkParser*), "ReadCRLF", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{buffer, offset, size});
  }
};
// Writing MetadataGetter for method: System::Net::MonoChunkParser::ReadTrailer
// Il2CppName: ReadTrailer
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::System::Net::MonoChunkParser::State (System::Net::MonoChunkParser::*)(::ArrayW<uint8_t>, ByRef<int>, int)>(&System::Net::MonoChunkParser::ReadTrailer)> {
  static const MethodInfo* get() {
    static auto* buffer = &il2cpp_functions::array_class_get(::il2cpp_utils::GetClassFromName("System", "Byte"), 1)->byval_arg;
    static auto* offset = &::il2cpp_utils::GetClassFromName("System", "Int32")->this_arg;
    static auto* size = &::il2cpp_utils::GetClassFromName("System", "Int32")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(System::Net::MonoChunkParser*), "ReadTrailer", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{buffer, offset, size});
  }
};
// Writing MetadataGetter for method: System::Net::MonoChunkParser::ThrowProtocolViolation
// Il2CppName: ThrowProtocolViolation
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (*)(::StringW)>(&System::Net::MonoChunkParser::ThrowProtocolViolation)> {
  static const MethodInfo* get() {
    static auto* message = &::il2cpp_utils::GetClassFromName("System", "String")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(System::Net::MonoChunkParser*), "ThrowProtocolViolation", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{message});
  }
};
