// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.DateTime
#include "System/DateTime.hpp"
// Including type: System.Net.ServicePointManager
#include "System/Net/ServicePointManager.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Uri
  class Uri;
  // Forward declaring type: Version
  class Version;
}
// Forward declaring namespace: System::Net
namespace System::Net {
  // Forward declaring type: IPHostEntry
  class IPHostEntry;
  // Forward declaring type: BindIPEndPoint
  class BindIPEndPoint;
  // Forward declaring type: ServicePointScheduler
  class ServicePointScheduler;
  // Forward declaring type: WebOperation
  class WebOperation;
  // Forward declaring type: IPEndPoint
  class IPEndPoint;
}
// Forward declaring namespace: System::Net::Sockets
namespace System::Net::Sockets {
  // Forward declaring type: Socket
  class Socket;
}
// Forward declaring namespace: System::Security::Cryptography::X509Certificates
namespace System::Security::Cryptography::X509Certificates {
  // Forward declaring type: X509Certificate
  class X509Certificate;
}
// Completed forward declares
// Type namespace: System.Net
namespace System::Net {
  // Forward declaring type: ServicePoint
  class ServicePoint;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Net::ServicePoint);
DEFINE_IL2CPP_ARG_TYPE(::System::Net::ServicePoint*, "System.Net", "ServicePoint");
// Type namespace: System.Net
namespace System::Net {
  // Size: 0x90
  #pragma pack(push, 1)
  // Autogenerated type: System.Net.ServicePoint
  // [TokenAttribute] Offset: FFFFFFFF
  class ServicePoint : public ::Il2CppObject {
    public:
    public:
    // private readonly System.Uri uri
    // Size: 0x8
    // Offset: 0x10
    ::System::Uri* uri;
    // Field size check
    static_assert(sizeof(::System::Uri*) == 0x8);
    // private System.DateTime lastDnsResolve
    // Size: 0x8
    // Offset: 0x18
    ::System::DateTime lastDnsResolve;
    // Field size check
    static_assert(sizeof(::System::DateTime) == 0x8);
    // private System.Version protocolVersion
    // Size: 0x8
    // Offset: 0x20
    ::System::Version* protocolVersion;
    // Field size check
    static_assert(sizeof(::System::Version*) == 0x8);
    // private System.Net.IPHostEntry host
    // Size: 0x8
    // Offset: 0x28
    ::System::Net::IPHostEntry* host;
    // Field size check
    static_assert(sizeof(::System::Net::IPHostEntry*) == 0x8);
    // private System.Boolean usesProxy
    // Size: 0x1
    // Offset: 0x30
    bool usesProxy;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean sendContinue
    // Size: 0x1
    // Offset: 0x31
    bool sendContinue;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean useConnect
    // Size: 0x1
    // Offset: 0x32
    bool useConnect;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: useConnect and: hostE
    char __padding6[0x5] = {};
    // private System.Object hostE
    // Size: 0x8
    // Offset: 0x38
    ::Il2CppObject* hostE;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Boolean useNagle
    // Size: 0x1
    // Offset: 0x40
    bool useNagle;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: useNagle and: endPointCallback
    char __padding8[0x7] = {};
    // private System.Net.BindIPEndPoint endPointCallback
    // Size: 0x8
    // Offset: 0x48
    ::System::Net::BindIPEndPoint* endPointCallback;
    // Field size check
    static_assert(sizeof(::System::Net::BindIPEndPoint*) == 0x8);
    // private System.Boolean tcp_keepalive
    // Size: 0x1
    // Offset: 0x50
    bool tcp_keepalive;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: tcp_keepalive and: tcp_keepalive_time
    char __padding10[0x3] = {};
    // private System.Int32 tcp_keepalive_time
    // Size: 0x4
    // Offset: 0x54
    int tcp_keepalive_time;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 tcp_keepalive_interval
    // Size: 0x4
    // Offset: 0x58
    int tcp_keepalive_interval;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean disposed
    // Size: 0x1
    // Offset: 0x5C
    bool disposed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: disposed and: connectionLeaseTimeout
    char __padding13[0x3] = {};
    // private System.Int32 connectionLeaseTimeout
    // Size: 0x4
    // Offset: 0x60
    int connectionLeaseTimeout;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 receiveBufferSize
    // Size: 0x4
    // Offset: 0x64
    int receiveBufferSize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private readonly System.Net.ServicePointManager/SPKey <Key>k__BackingField
    // Size: 0x8
    // Offset: 0x68
    ::System::Net::ServicePointManager::SPKey* Key;
    // Field size check
    static_assert(sizeof(::System::Net::ServicePointManager::SPKey*) == 0x8);
    // private System.Net.ServicePointScheduler <Scheduler>k__BackingField
    // Size: 0x8
    // Offset: 0x70
    ::System::Net::ServicePointScheduler* Scheduler;
    // Field size check
    static_assert(sizeof(::System::Net::ServicePointScheduler*) == 0x8);
    // private System.Int32 connectionLimit
    // Size: 0x4
    // Offset: 0x78
    int connectionLimit;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 maxIdleTime
    // Size: 0x4
    // Offset: 0x7C
    int maxIdleTime;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Object m_ServerCertificateOrBytes
    // Size: 0x8
    // Offset: 0x80
    ::Il2CppObject* m_ServerCertificateOrBytes;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Object m_ClientCertificateOrBytes
    // Size: 0x8
    // Offset: 0x88
    ::Il2CppObject* m_ClientCertificateOrBytes;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    public:
    // Get instance field reference: private readonly System.Uri uri
    [[deprecated("Use field access instead!")]] ::System::Uri*& dyn_uri();
    // Get instance field reference: private System.DateTime lastDnsResolve
    [[deprecated("Use field access instead!")]] ::System::DateTime& dyn_lastDnsResolve();
    // Get instance field reference: private System.Version protocolVersion
    [[deprecated("Use field access instead!")]] ::System::Version*& dyn_protocolVersion();
    // Get instance field reference: private System.Net.IPHostEntry host
    [[deprecated("Use field access instead!")]] ::System::Net::IPHostEntry*& dyn_host();
    // Get instance field reference: private System.Boolean usesProxy
    [[deprecated("Use field access instead!")]] bool& dyn_usesProxy();
