// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ComponentModel.Component
#include "System/ComponentModel/Component.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Net
namespace System::Net {
  // Forward declaring type: ICredentials
  class ICredentials;
  // Forward declaring type: WebHeaderCollection
  class WebHeaderCollection;
  // Forward declaring type: WebResponse
  class WebResponse;
  // Forward declaring type: WebRequest
  class WebRequest;
  // Forward declaring type: IWebProxy
  class IWebProxy;
  // Forward declaring type: DownloadStringCompletedEventHandler
  class DownloadStringCompletedEventHandler;
  // Forward declaring type: DownloadDataCompletedEventHandler
  class DownloadDataCompletedEventHandler;

  class UploadProgressChangedEventArgs;
  // Forward declaring type: OpenReadCompletedEventArgs
  class OpenReadCompletedEventArgs;
  // Forward declaring type: OpenWriteCompletedEventArgs
  class OpenWriteCompletedEventArgs;
  // Forward declaring type: WriteStreamClosedEventHandler
  class WriteStreamClosedEventHandler;
  // Forward declaring type: WriteStreamClosedEventArgs
  class WriteStreamClosedEventArgs;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Uri
  class Uri;
  // Forward declaring type: String
  class String;
  // Forward declaring type: IAsyncResult
  class IAsyncResult;
  // Forward declaring type: Action`3<T1, T2, T3>
  template<typename T1, typename T2, typename T3>
  class Action_3;
  // Forward declaring type: Exception
  class Exception;
  // Forward declaring type: Func`2<T, TResult>
  template<typename T, typename TResult>
  class Func_2;
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
}
// Forward declaring namespace: System::Collections::Specialized
namespace System::Collections::Specialized {
  // Forward declaring type: NameValueCollection
  class NameValueCollection;
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: Encoding
  class Encoding;
}
// Forward declaring namespace: System::ComponentModel
namespace System::ComponentModel {
  // Forward declaring type: AsyncOperation
  class AsyncOperation;
  // Forward declaring type: AsyncCompletedEventHandler
  class AsyncCompletedEventHandler;
  // Forward declaring type: AsyncCompletedEventArgs
  class AsyncCompletedEventArgs;
}
// Forward declaring namespace: System::Threading
namespace System::Threading {
  // Forward declaring type: SendOrPostCallback
  class SendOrPostCallback;
}
// Forward declaring namespace: System::Net::Cache
namespace System::Net::Cache {
  // Forward declaring type: RequestCachePolicy
  class RequestCachePolicy;
}
// Forward declaring namespace: System::Threading::Tasks
namespace System::Threading::Tasks {
  // Forward declaring type: Task`1<TResult>
  template<typename TResult>
  class Task_1;
  // Forward declaring type: Task
  class Task;
  // Forward declaring type: TaskCompletionSource`1<TResult>
  template<typename TResult>
  class TaskCompletionSource_1;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: Stream
  class Stream;
  // Forward declaring type: FileStream
  class FileStream;
}
// Completed forward declares
// Type namespace: System.Net
namespace System::Net {
  // Forward declaring type: WebClient
  class WebClient;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Net::WebClient);
DEFINE_IL2CPP_ARG_TYPE(::System::Net::WebClient*, "System.Net", "WebClient");
// Type namespace: System.Net
namespace System::Net {
  // Size: 0x152
  #pragma pack(push, 1)
  // Autogenerated type: System.Net.WebClient
  // [TokenAttribute] Offset: FFFFFFFF
  class WebClient : public ::System::ComponentModel::Component {
    public:
    // Nested type: ::System::Net::WebClient::ProgressData
    class ProgressData;
    // Nested type: ::System::Net::WebClient::WebClientWriteStream
    class WebClientWriteStream;
    // Nested type: ::System::Net::WebClient::$GetWebResponseTaskAsync$d__112
    struct $GetWebResponseTaskAsync$d__112;
    // Nested type: ::System::Net::WebClient::$DownloadBitsAsync$d__150
    struct $DownloadBitsAsync$d__150;
    // Nested type: ::System::Net::WebClient::$UploadBitsAsync$d__152
    struct $UploadBitsAsync$d__152;
    // Nested type: ::System::Net::WebClient::$$c__DisplayClass164_0
    class $$c__DisplayClass164_0;
    // Nested type: ::System::Net::WebClient::$$c__DisplayClass167_0
    class $$c__DisplayClass167_0;
    // Nested type: ::System::Net::WebClient::$$c__DisplayClass182_0
    class $$c__DisplayClass182_0;
    // Nested type: ::System::Net::WebClient::$$c__DisplayClass185_0
    class $$c__DisplayClass185_0;
    // Nested type: ::System::Net::WebClient::$$c__DisplayClass188_0
    class $$c__DisplayClass188_0;
    // Nested type: ::System::Net::WebClient::$$c__DisplayClass192_0
    class $$c__DisplayClass192_0;
    // Nested type: ::System::Net::WebClient::$$c
    class $$c;
    // Nested type: ::System::Net::WebClient::$$c__DisplayClass194_0
    class $$c__DisplayClass194_0;
    // Nested type: ::System::Net::WebClient::$$c__DisplayClass198_0
    class $$c__DisplayClass198_0;
    // Nested type: ::System::Net::WebClient::$$c__DisplayClass202_0
    class $$c__DisplayClass202_0;
    // Nested type: ::System::Net::WebClient::$$c__DisplayClass204_0
    class $$c__DisplayClass204_0;
    // Nested type: ::System::Net::WebClient::$$c__DisplayClass206_0
    class $$c__DisplayClass206_0;
    // Nested type: ::System::Net::WebClient::$$c__DisplayClass210_0
    class $$c__DisplayClass210_0;
    // Nested type: ::System::Net::WebClient::$$c__DisplayClass214_0
    class $$c__DisplayClass214_0;
    // Nested type: ::System::Net::WebClient::$$c__DisplayClass218_0
    class $$c__DisplayClass218_0;
    public:
    // private System.Uri _baseAddress
    // Size: 0x8
    // Offset: 0x28
    ::System::Uri* baseAddress;
    // Field size check
    static_assert(sizeof(::System::Uri*) == 0x8);
    // private System.Net.ICredentials _credentials
    // Size: 0x8
    // Offset: 0x30
    ::System::Net::ICredentials* credentials;
    // Field size check
    static_assert(sizeof(::System::Net::ICredentials*) == 0x8);
    // private System.Net.WebHeaderCollection _headers
    // Size: 0x8
    // Offset: 0x38
    ::System::Net::WebHeaderCollection* headers;
    // Field size check
    static_assert(sizeof(::System::Net::WebHeaderCollection*) == 0x8);
    // private System.Collections.Specialized.NameValueCollection _requestParameters
    // Size: 0x8
    // Offset: 0x40
    ::System::Collections::Specialized::NameValueCollection* requestParameters;
    // Field size check
    static_assert(sizeof(::System::Collections::Specialized::NameValueCollection*) == 0x8);
    // private System.Net.WebResponse _webResponse
    // Size: 0x8
    // Offset: 0x48
    ::System::Net::WebResponse* webResponse;
    // Field size check
    static_assert(sizeof(::System::Net::WebResponse*) == 0x8);
    // private System.Net.WebRequest _webRequest
    // Size: 0x8
    // Offset: 0x50
    ::System::Net::WebRequest* webRequest;
    // Field size check
    static_assert(sizeof(::System::Net::WebRequest*) == 0x8);
    // private System.Text.Encoding _encoding
    // Size: 0x8
    // Offset: 0x58
    ::System::Text::Encoding* encoding;
    // Field size check
    static_assert(sizeof(::System::Text::Encoding*) == 0x8);
    // private System.String _method
    // Size: 0x8
    // Offset: 0x60
    ::StringW method;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Int64 _contentLength
    // Size: 0x8
    // Offset: 0x68
    int64_t contentLength;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private System.Boolean _initWebClientAsync
    // Size: 0x1
    // Offset: 0x70
    bool initWebClientAsync;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _canceled
    // Size: 0x1
    // Offset: 0x71
    bool canceled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: canceled and: progress
    char __padding10[0x6] = {};
    // private System.Net.WebClient/ProgressData _progress
    // Size: 0x8
    // Offset: 0x78
    ::System::Net::WebClient::ProgressData* progress;
    // Field size check
    static_assert(sizeof(::System::Net::WebClient::ProgressData*) == 0x8);
    // private System.Net.IWebProxy _proxy
    // Size: 0x8
    // Offset: 0x80
    ::System::Net::IWebProxy* proxy;
    // Field size check
    static_assert(sizeof(::System::Net::IWebProxy*) == 0x8);
    // private System.Boolean _proxySet
    // Size: 0x1
    // Offset: 0x88
    bool proxySet;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: proxySet and: callNesting
    char __padding13[0x3] = {};
    // private System.Int32 _callNesting
    // Size: 0x4
    // Offset: 0x8C
    int callNesting;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.ComponentModel.AsyncOperation _asyncOp
    // Size: 0x8
    // Offset: 0x90
    ::System::ComponentModel::AsyncOperation* asyncOp;
    // Field size check
    static_assert(sizeof(::System::ComponentModel::AsyncOperation*) == 0x8);
    // private System.Threading.SendOrPostCallback _downloadDataOperationCompleted
    // Size: 0x8
    // Offset: 0x98
    ::System::Threading::SendOrPostCallback* downloadDataOperationCompleted;
    // Field size check
    static_assert(sizeof(::System::Threading::SendOrPostCallback*) == 0x8);
    // private System.Threading.SendOrPostCallback _openReadOperationCompleted
    // Size: 0x8
    // Offset: 0xA0
    ::System::Threading::SendOrPostCallback* openReadOperationCompleted;
    // Field size check
    static_assert(sizeof(::System::Threading::SendOrPostCallback*) == 0x8);
    // private System.Threading.SendOrPostCallback _openWriteOperationCompleted
    // Size: 0x8
    // Offset: 0xA8
    ::System::Threading::SendOrPostCallback* openWriteOperationCompleted;
    // Field size check
    static_assert(sizeof(::System::Threading::SendOrPostCallback*) == 0x8);
    // private System.Threading.SendOrPostCallback _downloadStringOperationCompleted
    // Size: 0x8
    // Offset: 0xB0
    ::System::Threading::SendOrPostCallback* downloadStringOperationCompleted;
    // Field size check
    static_assert(sizeof(::System::Threading::SendOrPostCallback*) == 0x8);
    // private System.Threading.SendOrPostCallback _downloadFileOperationCompleted
    // Size: 0x8
    // Offset: 0xB8
    ::System::Threading::SendOrPostCallback* downloadFileOperationCompleted;
    // Field size check
    static_assert(sizeof(::System::Threading::SendOrPostCallback*) == 0x8);
    // private System.Threading.SendOrPostCallback _uploadStringOperationCompleted
    // Size: 0x8
    // Offset: 0xC0
    ::System::Threading::SendOrPostCallback* uploadStringOperationCompleted;
    // Field size check
    static_assert(sizeof(::System::Threading::SendOrPostCallback*) == 0x8);
    // private System.Threading.SendOrPostCallback _uploadDataOperationCompleted
    // Size: 0x8
    // Offset: 0xC8
    ::System::Threading::SendOrPostCallback* uploadDataOperationCompleted;
    // Field size check
    static_assert(sizeof(::System::Threading::SendOrPostCallback*) == 0x8);
    // private System.Threading.SendOrPostCallback _uploadFileOperationCompleted
    // Size: 0x8
    // Offset: 0xD0
    ::System::Threading::SendOrPostCallback* uploadFileOperationCompleted;
    // Field size check
    static_assert(sizeof(::System::Threading::SendOrPostCallback*) == 0x8);
    // private System.Threading.SendOrPostCallback _uploadValuesOperationCompleted
    // Size: 0x8
    // Offset: 0xD8
    ::System::Threading::SendOrPostCallback* uploadValuesOperationCompleted;
    // Field size check
    static_assert(sizeof(::System::Threading::SendOrPostCallback*) == 0x8);
    // private System.Threading.SendOrPostCallback _reportDownloadProgressChanged
    // Size: 0x8
    // Offset: 0xE0
    ::System::Threading::SendOrPostCallback* reportDownloadProgressChanged;
    // Field size check
    static_assert(sizeof(::System::Threading::SendOrPostCallback*) == 0x8);
    // private System.Threading.SendOrPostCallback _reportUploadProgressChanged
    // Size: 0x8
    // Offset: 0xE8
    ::System::Threading::SendOrPostCallback* reportUploadProgressChanged;
    // Field size check
    static_assert(sizeof(::System::Threading::SendOrPostCallback*) == 0x8);
    // private System.Net.DownloadStringCompletedEventHandler DownloadStringCompleted
    // Size: 0x8
    // Offset: 0xF0
    ::System::Net::DownloadStringCompletedEventHandler* DownloadStringCompleted;
    // Field size check
    static_assert(sizeof(::System::Net::DownloadStringCompletedEventHandler*) == 0x8);
    // private System.Net.DownloadDataCompletedEventHandler DownloadDataCompleted
    // Size: 0x8
    // Offset: 0xF8
    ::System::Net::DownloadDataCompletedEventHandler* DownloadDataCompleted;
    // Field size check
    static_assert(sizeof(::System::Net::DownloadDataCompletedEventHandler*) == 0x8);
    // private System.ComponentModel.AsyncCompletedEventHandler DownloadFileCompleted
    // Size: 0x8
    // Offset: 0x100
    ::System::ComponentModel::AsyncCompletedEventHandler* DownloadFileCompleted;
    // Field size check
    static_assert(sizeof(::System::ComponentModel::AsyncCompletedEventHandler*) == 0x8);
    // private System.Net.UploadStringCompletedEventHandler UploadStringCompleted
    // Size: 0x8
    // Offset: 0x108
    ::System::Net::UploadStringCompletedEventHandler* UploadStringCompleted;
    // Field size check
    static_assert(sizeof(::System::Net::UploadStringCompletedEventHandler*) == 0x8);
    // private System.Net.UploadDataCompletedEventHandler UploadDataCompleted
    // Size: 0x8
    // Offset: 0x110
    ::System::Net::UploadDataCompletedEventHandler* UploadDataCompleted;
    // Field size check
    static_assert(sizeof(::System::Net::UploadDataCompletedEventHandler*) == 0x8);
    // private System.Net.UploadFileCompletedEventHandler UploadFileCompleted
    // Size: 0x8
    // Offset: 0x118
    ::System::Net::UploadFileCompletedEventHandler* UploadFileCompleted;
    // Field size check
    static_assert(sizeof(::System::Net::UploadFileCompletedEventHandler*) == 0x8);
    // private System.Net.UploadValuesCompletedEventHandler UploadValuesCompleted
    // Size: 0x8
    // Offset: 0x120
    ::System::Net::UploadValuesCompletedEventHandler* UploadValuesCompleted;
    // Field size check
    static_assert(sizeof(::System::Net::UploadValuesCompletedEventHandler*) == 0x8);
    // private System.Net.OpenReadCompletedEventHandler OpenReadCompleted
    // Size: 0x8
    // Offset: 0x128
    ::System::Net::OpenReadCompletedEventHandler* OpenReadCompleted;
    // Field size check
    static_assert(sizeof(::System::Net::OpenReadCompletedEventHandler*) == 0x8);
    // private System.Net.OpenWriteCompletedEventHandler OpenWriteCompleted
    // Size: 0x8
    // Offset: 0x130
    ::System::Net::OpenWriteCompletedEventHandler* OpenWriteCompleted;
    // Field size check
    static_assert(sizeof(::System::Net::OpenWriteCompletedEventHandler*) == 0x8);
    // private System.Net.DownloadProgressChangedEventHandler DownloadProgressChanged
    // Size: 0x8
    // Offset: 0x138
    ::System::Net::DownloadProgressChangedEventHandler* DownloadProgressChanged;
    // Field size check
    static_assert(sizeof(::System::Net::DownloadProgressChangedEventHandler*) == 0x8);
    // private System.Net.UploadProgressChangedEventHandler UploadProgressChanged
    // Size: 0x8
    // Offset: 0x140
    ::System::Net::UploadProgressChangedEventHandler* UploadProgressChanged;
    // Field size check
    static_assert(sizeof(::System::Net::UploadProgressChangedEventHandler*) == 0x8);
    // private System.Net.Cache.RequestCachePolicy <CachePolicy>k__BackingField
    // Size: 0x8
    // Offset: 0x148
    ::System::Net::Cache::RequestCachePolicy* CachePolicy;
    // Field size check
    static_assert(sizeof(::System::Net::Cache::RequestCachePolicy*) == 0x8);
    // private System.Boolean <AllowReadStreamBuffering>k__BackingField
    // Size: 0x1
    // Offset: 0x150
    bool AllowReadStreamBuffering;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <AllowWriteStreamBuffering>k__BackingField
    // Size: 0x1
    // Offset: 0x151
    bool AllowWriteStreamBuffering;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // static field const value: static private System.Int32 DefaultCopyBufferLength
    static constexpr const int DefaultCopyBufferLength = 8192;
    // Get static field: static private System.Int32 DefaultCopyBufferLength
    static int _get_DefaultCopyBufferLength();
    // Set static field: static private System.Int32 DefaultCopyBufferLength
    static void _set_DefaultCopyBufferLength(int value);
    // static field const value: static private System.Int32 DefaultDownloadBufferLength
    static constexpr const int DefaultDownloadBufferLength = 65536;
    // Get static field: static private System.Int32 DefaultDownloadBufferLength
    static int _get_DefaultDownloadBufferLength();
    // Set static field: static private System.Int32 DefaultDownloadBufferLength
    static void _set_DefaultDownloadBufferLength(int value);
