// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueTuple`2
#include "System/ValueTuple_2.hpp"
// Including type: System.Threading.CancellationToken
#include "System/Threading/CancellationToken.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Net
namespace System::Net {
  // Forward declaring type: HttpWebRequest
  class HttpWebRequest;
  // Forward declaring type: WebConnection
  class WebConnection;
  // Forward declaring type: ServicePoint
  class ServicePoint;
  // Forward declaring type: BufferOffsetSize
  class BufferOffsetSize;
  // Forward declaring type: WebCompletionSource`1<T>
  template<typename T>
  class WebCompletionSource_1;
  // Forward declaring type: WebRequestStream
  class WebRequestStream;
  // Forward declaring type: WebResponseStream
  class WebResponseStream;
}
// Forward declaring namespace: System::Threading
namespace System::Threading {
  // Forward declaring type: CancellationTokenSource
  class CancellationTokenSource;
}
// Forward declaring namespace: System::Runtime::ExceptionServices
namespace System::Runtime::ExceptionServices {
  // Forward declaring type: ExceptionDispatchInfo
  class ExceptionDispatchInfo;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Exception
  class Exception;
}
// Forward declaring namespace: System::Threading::Tasks
namespace System::Threading::Tasks {
  // Forward declaring type: Task`1<TResult>
  template<typename TResult>
  class Task_1;
  // Forward declaring type: Task
  class Task;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: Stream
  class Stream;
}
// Completed forward declares
// Type namespace: System.Net
namespace System::Net {
  // Forward declaring type: WebOperation
  class WebOperation;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Net::WebOperation);
DEFINE_IL2CPP_ARG_TYPE(::System::Net::WebOperation*, "System.Net", "WebOperation");
// Type namespace: System.Net
namespace System::Net {
  // Size: 0x90
  #pragma pack(push, 1)
  // Autogenerated type: System.Net.WebOperation
  // [TokenAttribute] Offset: FFFFFFFF
  class WebOperation : public ::Il2CppObject {
    public:
    // Nested type: ::System::Net::WebOperation::$GetRequestStream$d__50
    struct $GetRequestStream$d__50;
    // Nested type: ::System::Net::WebOperation::$Run$d__58
    struct $Run$d__58;
    public:
    // private readonly System.Net.HttpWebRequest <Request>k__BackingField
    // Size: 0x8
    // Offset: 0x10
    ::System::Net::HttpWebRequest* Request;
    // Field size check
    static_assert(sizeof(::System::Net::HttpWebRequest*) == 0x8);
    // private System.Net.WebConnection <Connection>k__BackingField
    // Size: 0x8
    // Offset: 0x18
    ::System::Net::WebConnection* Connection;
    // Field size check
    static_assert(sizeof(::System::Net::WebConnection*) == 0x8);
    // private System.Net.ServicePoint <ServicePoint>k__BackingField
    // Size: 0x8
    // Offset: 0x20
    ::System::Net::ServicePoint* ServicePoint;
    // Field size check
    static_assert(sizeof(::System::Net::ServicePoint*) == 0x8);
    // private readonly System.Net.BufferOffsetSize <WriteBuffer>k__BackingField
    // Size: 0x8
    // Offset: 0x28
    ::System::Net::BufferOffsetSize* WriteBuffer;
    // Field size check
    static_assert(sizeof(::System::Net::BufferOffsetSize*) == 0x8);
    // private readonly System.Boolean <IsNtlmChallenge>k__BackingField
    // Size: 0x1
    // Offset: 0x30
    bool IsNtlmChallenge;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: IsNtlmChallenge and: _ID
    char __padding4[0x3] = {};
    // readonly System.Int32 ID
    // Size: 0x4
    // Offset: 0x34
    int _ID;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Threading.CancellationTokenSource cts
    // Size: 0x8
    // Offset: 0x38
    ::System::Threading::CancellationTokenSource* cts;
    // Field size check
    static_assert(sizeof(::System::Threading::CancellationTokenSource*) == 0x8);
    // private System.Net.WebCompletionSource`1<System.Net.WebRequestStream> requestTask
    // Size: 0x8
    // Offset: 0x40
    ::System::Net::WebCompletionSource_1<::System::Net::WebRequestStream*>* requestTask;
    // Field size check
    static_assert(sizeof(::System::Net::WebCompletionSource_1<::System::Net::WebRequestStream*>*) == 0x8);
    // private System.Net.WebCompletionSource`1<System.Net.WebRequestStream> requestWrittenTask
    // Size: 0x8
    // Offset: 0x48
    ::System::Net::WebCompletionSource_1<::System::Net::WebRequestStream*>* requestWrittenTask;
    // Field size check
    static_assert(sizeof(::System::Net::WebCompletionSource_1<::System::Net::WebRequestStream*>*) == 0x8);
    // private System.Net.WebCompletionSource`1<System.Net.WebResponseStream> responseTask
    // Size: 0x8
    // Offset: 0x50
    ::System::Net::WebCompletionSource_1<::System::Net::WebResponseStream*>* responseTask;
    // Field size check
    static_assert(sizeof(::System::Net::WebCompletionSource_1<::System::Net::WebResponseStream*>*) == 0x8);
    // private System.Net.WebCompletionSource`1<System.ValueTuple`2<System.Boolean,System.Net.WebOperation>> finishedTask
    // Size: 0x8
    // Offset: 0x58
    ::System::Net::WebCompletionSource_1<::System::ValueTuple_2<bool, ::System::Net::WebOperation*>>* finishedTask;
    // Field size check
    static_assert(sizeof(::System::Net::WebCompletionSource_1<::System::ValueTuple_2<bool, ::System::Net::WebOperation*>>*) == 0x8);
    // private System.Net.WebRequestStream writeStream
    // Size: 0x8
    // Offset: 0x60
    ::System::Net::WebRequestStream* writeStream;
    // Field size check
    static_assert(sizeof(::System::Net::WebRequestStream*) == 0x8);
    // private System.Net.WebResponseStream responseStream
    // Size: 0x8
    // Offset: 0x68
    ::System::Net::WebResponseStream* responseStream;
    // Field size check
    static_assert(sizeof(::System::Net::WebResponseStream*) == 0x8);
    // private System.Runtime.ExceptionServices.ExceptionDispatchInfo disposedInfo
    // Size: 0x8
    // Offset: 0x70
    ::System::Runtime::ExceptionServices::ExceptionDispatchInfo* disposedInfo;
    // Field size check
    static_assert(sizeof(::System::Runtime::ExceptionServices::ExceptionDispatchInfo*) == 0x8);
    // private System.Runtime.ExceptionServices.ExceptionDispatchInfo closedInfo
    // Size: 0x8
    // Offset: 0x78
    ::System::Runtime::ExceptionServices::ExceptionDispatchInfo* closedInfo;
    // Field size check
    static_assert(sizeof(::System::Runtime::ExceptionServices::ExceptionDispatchInfo*) == 0x8);
    // private System.Net.WebOperation priorityRequest
    // Size: 0x8
    // Offset: 0x80
    ::System::Net::WebOperation* priorityRequest;
    // Field size check
    static_assert(sizeof(::System::Net::WebOperation*) == 0x8);
    // private System.Int32 requestSent
    // Size: 0x4
    // Offset: 0x88
    int requestSent;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 finished
    // Size: 0x4
    // Offset: 0x8C
    int finished;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Get instance field reference: private readonly System.Net.HttpWebRequest <Request>k__BackingField
    [[deprecated("Use field access instead!")]] ::System::Net::HttpWebRequest*& dyn_$Request$k__BackingField();
    // Get instance field reference: private System.Net.WebConnection <Connection>k__BackingField
    [[deprecated("Use field access instead!")]] ::System::Net::WebConnection*& dyn_$Connection$k__BackingField();
    // Get instance field reference: private System.Net.ServicePoint <ServicePoint>k__BackingField
    [[deprecated("Use field access instead!")]] ::System::Net::ServicePoint*& dyn_$ServicePoint$k__BackingField();
    // Get instance field reference: private readonly System.Net.BufferOffsetSize <WriteBuffer>k__BackingField
    [[deprecated("Use field access instead!")]] ::System::Net::BufferOffsetSize*& dyn_$WriteBuffer$k__BackingField();
