// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Net.WebConnectionStream
#include "System/Net/WebConnectionStream.hpp"
// Including type: System.Net.HttpStatusCode
#include "System/Net/HttpStatusCode.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Net
namespace System::Net {
  // Forward declaring type: WebReadStream
  class WebReadStream;
  // Forward declaring type: WebCompletionSource
  class WebCompletionSource;
  // Forward declaring type: WebRequestStream
  class WebRequestStream;
  // Forward declaring type: WebHeaderCollection
  class WebHeaderCollection;
  // Forward declaring type: BufferOffsetSize
  class BufferOffsetSize;
  // Forward declaring type: WebException
  class WebException;
  // Forward declaring type: WebExceptionStatus
  struct WebExceptionStatus;
  // Forward declaring type: ReadState
  struct ReadState;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Version
  class Version;
  // Forward declaring type: Exception
  class Exception;
}
// Forward declaring namespace: System::Threading::Tasks
namespace System::Threading::Tasks {
  // Forward declaring type: Task`1<TResult>
  template<typename TResult>
  class Task_1;
  // Forward declaring type: Task
  class Task;
}
// Forward declaring namespace: System::Threading
namespace System::Threading {
  // Forward declaring type: CancellationToken
  struct CancellationToken;
}
// Completed forward declares
// Type namespace: System.Net
namespace System::Net {
  // Forward declaring type: WebResponseStream
  class WebResponseStream;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Net::WebResponseStream);
DEFINE_IL2CPP_ARG_TYPE(::System::Net::WebResponseStream*, "System.Net", "WebResponseStream");
// Type namespace: System.Net
namespace System::Net {
  // Size: 0xC1
  #pragma pack(push, 1)
  // Autogenerated type: System.Net.WebResponseStream
  // [TokenAttribute] Offset: FFFFFFFF
  class WebResponseStream : public ::System::Net::WebConnectionStream {
    public:
    // Nested type: ::System::Net::WebResponseStream::$ReadAsync$d__40
    struct $ReadAsync$d__40;
    // Nested type: ::System::Net::WebResponseStream::$$c__DisplayClass41_0
    class $$c__DisplayClass41_0;
    // Nested type: ::System::Net::WebResponseStream::$ReadAllAsyncInner$d__47
    struct $ReadAllAsyncInner$d__47;
    // Nested type: ::System::Net::WebResponseStream::$ReadAllAsync$d__48
    struct $ReadAllAsync$d__48;
    // Nested type: ::System::Net::WebResponseStream::$InitReadAsync$d__52
    struct $InitReadAsync$d__52;
    public:
    // private System.Net.WebReadStream innerStream
    // Size: 0x8
    // Offset: 0x60
    ::System::Net::WebReadStream* innerStream;
    // Field size check
    static_assert(sizeof(::System::Net::WebReadStream*) == 0x8);
    // private System.Boolean nextReadCalled
    // Size: 0x1
    // Offset: 0x68
    bool nextReadCalled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean bufferedEntireContent
    // Size: 0x1
    // Offset: 0x69
    bool bufferedEntireContent;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: bufferedEntireContent and: pendingRead
    char __padding2[0x6] = {};
    // private System.Net.WebCompletionSource pendingRead
    // Size: 0x8
    // Offset: 0x70
    ::System::Net::WebCompletionSource* pendingRead;
    // Field size check
    static_assert(sizeof(::System::Net::WebCompletionSource*) == 0x8);
    // private System.Object locker
    // Size: 0x8
    // Offset: 0x78
    ::Il2CppObject* locker;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Int32 nestedRead
    // Size: 0x4
    // Offset: 0x80
    int nestedRead;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean read_eof
    // Size: 0x1
    // Offset: 0x84
    bool read_eof;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: read_eof and: RequestStream
    char __padding6[0x3] = {};
    // private readonly System.Net.WebRequestStream <RequestStream>k__BackingField
    // Size: 0x8
    // Offset: 0x88
    ::System::Net::WebRequestStream* RequestStream;
    // Field size check
    static_assert(sizeof(::System::Net::WebRequestStream*) == 0x8);
    // private System.Net.WebHeaderCollection <Headers>k__BackingField
    // Size: 0x8
    // Offset: 0x90
    ::System::Net::WebHeaderCollection* Headers;
    // Field size check
    static_assert(sizeof(::System::Net::WebHeaderCollection*) == 0x8);
    // private System.Net.HttpStatusCode <StatusCode>k__BackingField
    // Size: 0x4
    // Offset: 0x98
    ::System::Net::HttpStatusCode StatusCode;
    // Field size check
    static_assert(sizeof(::System::Net::HttpStatusCode) == 0x4);
    // Padding between fields: StatusCode and: StatusDescription
    char __padding9[0x4] = {};
    // private System.String <StatusDescription>k__BackingField
    // Size: 0x8
    // Offset: 0xA0
    ::StringW StatusDescription;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Version <Version>k__BackingField
    // Size: 0x8
    // Offset: 0xA8
    ::System::Version* Version;
    // Field size check
    static_assert(sizeof(::System::Version*) == 0x8);
    // private System.Boolean <KeepAlive>k__BackingField
    // Size: 0x1
    // Offset: 0xB0
    bool KeepAlive;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: KeepAlive and: ME
    char __padding12[0x7] = {};
    // readonly System.String ME
    // Size: 0x8
    // Offset: 0xB8
    ::StringW ME;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean <ChunkedRead>k__BackingField
    // Size: 0x1
    // Offset: 0xC0
    bool ChunkedRead;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get instance field reference: private System.Net.WebReadStream innerStream
    [[deprecated("Use field access instead!")]] ::System::Net::WebReadStream*& dyn_innerStream();
    // Get instance field reference: private System.Boolean nextReadCalled
    [[deprecated("Use field access instead!")]] bool& dyn_nextReadCalled();
    // Get instance field reference: private System.Boolean bufferedEntireContent
    [[deprecated("Use field access instead!")]] bool& dyn_bufferedEntireContent();
    // Get instance field reference: private System.Net.WebCompletionSource pendingRead
    [[deprecated("Use field access instead!")]] ::System::Net::WebCompletionSource*& dyn_pendingRead();
    // Get instance field reference: private System.Object locker
    [[deprecated("Use field access instead!")]] ::Il2CppObject*& dyn_locker();
