// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: Unity.Collections.FixedBytes16Align8
#include "Unity/Collections/FixedBytes16Align8.hpp"
// Completed includes
// Type namespace: Unity.Collections
namespace Unity::Collections {
  // Forward declaring type: FixedBytes512Align8
  struct FixedBytes512Align8;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::Unity::Collections::FixedBytes512Align8, "Unity.Collections", "FixedBytes512Align8");
// Type namespace: Unity.Collections
namespace Unity::Collections {
  // Size: 0x200
  #pragma pack(push, 1)
  // WARNING Layout: Explicit may not be correctly taken into account!
  // Autogenerated type: Unity.Collections.FixedBytes512Align8
  // [TokenAttribute] Offset: FFFFFFFF
  // [GenerateTestsForBurstCompatibilityAttribute] Offset: FFFFFFFF
  struct FixedBytes512Align8/*, public ::System::ValueType*/ {
    public:
    public:
    // Unity.Collections.FixedBytes16Align8 offset0000
    // Size: 0x10
    // Offset: 0x0
    ::Unity::Collections::FixedBytes16Align8 offset0000;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0016
    // Size: 0x10
    // Offset: 0x10
    ::Unity::Collections::FixedBytes16Align8 offset0016;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0032
    // Size: 0x10
    // Offset: 0x20
    ::Unity::Collections::FixedBytes16Align8 offset0032;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0048
    // Size: 0x10
    // Offset: 0x30
    ::Unity::Collections::FixedBytes16Align8 offset0048;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0064
    // Size: 0x10
    // Offset: 0x40
    ::Unity::Collections::FixedBytes16Align8 offset0064;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0080
    // Size: 0x10
    // Offset: 0x50
    ::Unity::Collections::FixedBytes16Align8 offset0080;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0096
    // Size: 0x10
    // Offset: 0x60
    ::Unity::Collections::FixedBytes16Align8 offset0096;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0112
    // Size: 0x10
    // Offset: 0x70
    ::Unity::Collections::FixedBytes16Align8 offset0112;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0128
    // Size: 0x10
    // Offset: 0x80
    ::Unity::Collections::FixedBytes16Align8 offset0128;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0144
    // Size: 0x10
    // Offset: 0x90
    ::Unity::Collections::FixedBytes16Align8 offset0144;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0160
    // Size: 0x10
    // Offset: 0xA0
    ::Unity::Collections::FixedBytes16Align8 offset0160;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0176
    // Size: 0x10
    // Offset: 0xB0
    ::Unity::Collections::FixedBytes16Align8 offset0176;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0192
    // Size: 0x10
    // Offset: 0xC0
    ::Unity::Collections::FixedBytes16Align8 offset0192;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0208
    // Size: 0x10
    // Offset: 0xD0
    ::Unity::Collections::FixedBytes16Align8 offset0208;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0224
    // Size: 0x10
    // Offset: 0xE0
    ::Unity::Collections::FixedBytes16Align8 offset0224;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0240
    // Size: 0x10
    // Offset: 0xF0
    ::Unity::Collections::FixedBytes16Align8 offset0240;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0256
    // Size: 0x10
    // Offset: 0x100
    ::Unity::Collections::FixedBytes16Align8 offset0256;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0272
    // Size: 0x10
    // Offset: 0x110
    ::Unity::Collections::FixedBytes16Align8 offset0272;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0288
    // Size: 0x10
    // Offset: 0x120
    ::Unity::Collections::FixedBytes16Align8 offset0288;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0304
    // Size: 0x10
    // Offset: 0x130
    ::Unity::Collections::FixedBytes16Align8 offset0304;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0320
    // Size: 0x10
    // Offset: 0x140
    ::Unity::Collections::FixedBytes16Align8 offset0320;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0336
    // Size: 0x10
    // Offset: 0x150
    ::Unity::Collections::FixedBytes16Align8 offset0336;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0352
    // Size: 0x10
    // Offset: 0x160
    ::Unity::Collections::FixedBytes16Align8 offset0352;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0368
    // Size: 0x10
    // Offset: 0x170
    ::Unity::Collections::FixedBytes16Align8 offset0368;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0384
    // Size: 0x10
    // Offset: 0x180
    ::Unity::Collections::FixedBytes16Align8 offset0384;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0400
    // Size: 0x10
    // Offset: 0x190
    ::Unity::Collections::FixedBytes16Align8 offset0400;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0416
    // Size: 0x10
    // Offset: 0x1A0
    ::Unity::Collections::FixedBytes16Align8 offset0416;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0432
    // Size: 0x10
    // Offset: 0x1B0
    ::Unity::Collections::FixedBytes16Align8 offset0432;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0448
    // Size: 0x10
    // Offset: 0x1C0
    ::Unity::Collections::FixedBytes16Align8 offset0448;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0464
    // Size: 0x10
    // Offset: 0x1D0
    ::Unity::Collections::FixedBytes16Align8 offset0464;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0480
    // Size: 0x10
    // Offset: 0x1E0
    ::Unity::Collections::FixedBytes16Align8 offset0480;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0496
    // Size: 0x10
    // Offset: 0x1F0
    ::Unity::Collections::FixedBytes16Align8 offset0496;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    public:
    // Creating value type constructor for type: FixedBytes512Align8
    constexpr FixedBytes512Align8(::Unity::Collections::FixedBytes16Align8 offset0000_ = {}, ::Unity::Collections::FixedBytes16Align8 offset0016_ = {}, ::Unity::Collections::FixedBytes16Align8 offset0032_ = {}, ::Unity::Collections::FixedBytes16Align8 offset0048_ = {}, ::Unity::Collections::FixedBytes16Align8 offset0064_ = {}, ::Unity::Collections::FixedBytes16Align8 offset0080_ = {}, ::Unity::Collections::FixedBytes16Align8 offset0096_ = {}, ::Unity::Collections::FixedBytes16Align8 offset0112_ = {}, ::Unity::Collections::FixedBytes16Align8 offset0128_ = {}, ::Unity::Collections::FixedBytes16Align8 offset0144_ = {}, ::Unity::Collections::FixedBytes16Align8 offset0160_ = {}, ::Unity::Collections::FixedBytes16Align8 offset0176_ = {}, ::Unity::Collections::FixedBytes16Align8 offset0192_ = {}, ::Unity::Collections::FixedBytes16Align8 offset0208_ = {}, ::Unity::Collections::FixedBytes16Align8 offset0224_ = {}, ::Unity::Collections::FixedBytes16Align8 offset0240_ = {}, ::Unity::Collections::FixedBytes16Align8 offset0256_ = {}, ::Unity::Collections::FixedBytes16Align8 offset0272_ = {}, ::Unity::Collections::FixedBytes16Align8 offset0288_ = {}, ::Unity::Collections::FixedBytes16Align8 offset0304_ = {}, ::Unity::Collections::FixedBytes16Align8 offset0320_ = {}, ::Unity::Collections::FixedBytes16Align8 offset0336_ = {}, ::Unity::Collections::FixedBytes16Align8 offset0352_ = {}, ::Unity::Collections::FixedBytes16Align8 offset0368_ = {}, ::Unity::Collections::FixedBytes16Align8 offset0384_ = {}, ::Unity::Collections::FixedBytes16Align8 offset0400_ = {}, ::Unity::Collections::FixedBytes16Align8 offset0416_ = {}, ::Unity::Collections::FixedBytes16Align8 offset0432_ = {}, ::Unity::Collections::FixedBytes16Align8 offset0448_ = {}, ::Unity::Collections::FixedBytes16Align8 offset0464_ = {}, ::Unity::Collections::FixedBytes16Align8 offset0480_ = {}, ::Unity::Collections::FixedBytes16Align8 offset0496_ = {}) noexcept : offset0000{offset0000_}, offset0016{offset0016_}, offset0032{offset0032_}, offset0048{offset0048_}, offset0064{offset0064_}, offset0080{offset0080_}, offset0096{offset0096_}, offset0112{offset0112_}, offset0128{offset0128_}, offset0144{offset0144_}, offset0160{offset0160_}, offset0176{offset0176_}, offset0192{offset0192_}, offset0208{offset0208_}, offset0224{offset0224_}, offset0240{offset0240_}, offset0256{offset0256_}, offset0272{offset0272_}, offset0288{offset0288_}, offset0304{offset0304_}, offset0320{offset0320_}, offset0336{offset0336_}, offset0352{offset0352_}, offset0368{offset0368_}, offset0384{offset0384_}, offset0400{offset0400_}, offset0416{offset0416_}, offset0432{offset0432_}, offset0448{offset0448_}, offset0464{offset0464_}, offset0480{offset0480_}, offset0496{offset0496_} {}
    // Creating interface conversion operator: operator ::System::ValueType
    operator ::System::ValueType() noexcept {
      return *reinterpret_cast<::System::ValueType*>(this);
    }
    // Get instance field reference: Unity.Collections.FixedBytes16Align8 offset0000
    [[deprecated("Use field access instead!")]] ::Unity::Collections::FixedBytes16Align8& dyn_offset0000();
    // Get instance field reference: Unity.Collections.FixedBytes16Align8 offset0016
    [[deprecated("Use field access instead!")]] ::Unity::Collections::FixedBytes16Align8& dyn_offset0016();
    // Get instance field reference: Unity.Collections.FixedBytes16Align8 offset0032
    [[deprecated("Use field access instead!")]] ::Unity::Collections::FixedBytes16Align8& dyn_offset0032();
    // Get instance field reference: Unity.Collections.FixedBytes16Align8 offset0048
    [[deprecated("Use field access instead!")]] ::Unity::Collections::FixedBytes16Align8& dyn_offset0048();
    // Get instance field reference: Unity.Collections.FixedBytes16Align8 offset0064
    [[deprecated("Use field access instead!")]] ::Unity::Collections::FixedBytes16Align8& dyn_offset0064();
    // Get instance field reference: Unity.Collections.FixedBytes16Align8 offset0080
    [[deprecated("Use field access instead!")]] ::Unity::Collections::FixedBytes16Align8& dyn_offset0080();
    // Get instance field reference: Unity.Collections.FixedBytes16Align8 offset0096
    [[deprecated("Use field access instead!")]] ::Unity::Collections::FixedBytes16Align8& dyn_offset0096();
    // Get instance field reference: Unity.Collections.FixedBytes16Align8 offset0112
    [[deprecated("Use field access instead!")]] ::Unity::Collections::FixedBytes16Align8& dyn_offset0112();
    // Get instance field reference: Unity.Collections.FixedBytes16Align8 offset0128
    [[deprecated("Use field access instead!")]] ::Unity::Collections::FixedBytes16Align8& dyn_offset0128();
    // Get instance field reference: Unity.Collections.FixedBytes16Align8 offset0144
    [[deprecated("Use field access instead!")]] ::Unity::Collections::FixedBytes16Align8& dyn_offset0144();
    // Get instance field reference: Unity.Collections.FixedBytes16Align8 offset0160
    [[deprecated("Use field access instead!")]] ::Unity::Collections::FixedBytes16Align8& dyn_offset0160();
    // Get instance field reference: Unity.Collections.FixedBytes16Align8 offset0176
    [[deprecated("Use field access instead!")]] ::Unity::Collections::FixedBytes16Align8& dyn_offset0176();
    // Get instance field reference: Unity.Collections.FixedBytes16Align8 offset0192
    [[deprecated("Use field access instead!")]] ::Unity::Collections::FixedBytes16Align8& dyn_offset0192();
    // Get instance field reference: Unity.Collections.FixedBytes16Align8 offset0208
    [[deprecated("Use field access instead!")]] ::Unity::Collections::FixedBytes16Align8& dyn_offset0208();
    // Get instance field reference: Unity.Collections.FixedBytes16Align8 offset0224
    [[deprecated("Use field access instead!")]] ::Unity::Collections::FixedBytes16Align8& dyn_offset0224();
    // Get instance field reference: Unity.Collections.FixedBytes16Align8 offset0240
    [[deprecated("Use field access instead!")]] ::Unity::Collections::FixedBytes16Align8& dyn_offset0240();
    // Get instance field reference: Unity.Collections.FixedBytes16Align8 offset0256
    [[deprecated("Use field access instead!")]] ::Unity::Collections::FixedBytes16Align8& dyn_offset0256();
    // Get instance field reference: Unity.Collections.FixedBytes16Align8 offset0272
    [[deprecated("Use field access instead!")]] ::Unity::Collections::FixedBytes16Align8& dyn_offset0272();
    // Get instance field reference: Unity.Collections.FixedBytes16Align8 offset0288
    [[deprecated("Use field access instead!")]] ::Unity::Collections::FixedBytes16Align8& dyn_offset0288();
    // Get instance field reference: Unity.Collections.FixedBytes16Align8 offset0304
    [[deprecated("Use field access instead!")]] ::Unity::Collections::FixedBytes16Align8& dyn_offset0304();
    // Get instance field reference: Unity.Collections.FixedBytes16Align8 offset0320
    [[deprecated("Use field access instead!")]] ::Unity::Collections::FixedBytes16Align8& dyn_offset0320();
    // Get instance field reference: Unity.Collections.FixedBytes16Align8 offset0336
    [[deprecated("Use field access instead!")]] ::Unity::Collections::FixedBytes16Align8& dyn_offset0336();
    // Get instance field reference: Unity.Collections.FixedBytes16Align8 offset0352
    [[deprecated("Use field access instead!")]] ::Unity::Collections::FixedBytes16Align8& dyn_offset0352();
    // Get instance field reference: Unity.Collections.FixedBytes16Align8 offset0368
    [[deprecated("Use field access instead!")]] ::Unity::Collections::FixedBytes16Align8& dyn_offset0368();
    // Get instance field reference: Unity.Collections.FixedBytes16Align8 offset0384
    [[deprecated("Use field access instead!")]] ::Unity::Collections::FixedBytes16Align8& dyn_offset0384();
    // Get instance field reference: Unity.Collections.FixedBytes16Align8 offset0400
    [[deprecated("Use field access instead!")]] ::Unity::Collections::FixedBytes16Align8& dyn_offset0400();
    // Get instance field reference: Unity.Collections.FixedBytes16Align8 offset0416
    [[deprecated("Use field access instead!")]] ::Unity::Collections::FixedBytes16Align8& dyn_offset0416();
    // Get instance field reference: Unity.Collections.FixedBytes16Align8 offset0432
    [[deprecated("Use field access instead!")]] ::Unity::Collections::FixedBytes16Align8& dyn_offset0432();
    // Get instance field reference: Unity.Collections.FixedBytes16Align8 offset0448
    [[deprecated("Use field access instead!")]] ::Unity::Collections::FixedBytes16Align8& dyn_offset0448();
    // Get instance field reference: Unity.Collections.FixedBytes16Align8 offset0464
    [[deprecated("Use field access instead!")]] ::Unity::Collections::FixedBytes16Align8& dyn_offset0464();
    // Get instance field reference: Unity.Collections.FixedBytes16Align8 offset0480
    [[deprecated("Use field access instead!")]] ::Unity::Collections::FixedBytes16Align8& dyn_offset0480();
    // Get instance field reference: Unity.Collections.FixedBytes16Align8 offset0496
    [[deprecated("Use field access instead!")]] ::Unity::Collections::FixedBytes16Align8& dyn_offset0496();
  }; // Unity.Collections.FixedBytes512Align8
  #pragma pack(pop)
  static check_size<sizeof(FixedBytes512Align8), 496 + sizeof(::Unity::Collections::FixedBytes16Align8)> __Unity_Collections_FixedBytes512Align8SizeCheck;
  static_assert(sizeof(FixedBytes512Align8) == 0x200);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
