// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: Unity.Collections.FixedBytes16Align8
#include "Unity/Collections/FixedBytes16Align8.hpp"
// Completed includes
// Type namespace: Unity.Collections
namespace Unity::Collections {
  // Forward declaring type: FixedBytes4096Align8
  struct FixedBytes4096Align8;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::Unity::Collections::FixedBytes4096Align8, "Unity.Collections", "FixedBytes4096Align8");
// Type namespace: Unity.Collections
namespace Unity::Collections {
  // Size: 0x1000
  #pragma pack(push, 1)
  // WARNING Layout: Explicit may not be correctly taken into account!
  // Autogenerated type: Unity.Collections.FixedBytes4096Align8
  // [TokenAttribute] Offset: FFFFFFFF
  // [GenerateTestsForBurstCompatibilityAttribute] Offset: FFFFFFFF
  struct FixedBytes4096Align8/*, public ::System::ValueType*/ {
    public:
    public:
    // Unity.Collections.FixedBytes16Align8 offset0000
    // Size: 0x10
    // Offset: 0x0
    ::Unity::Collections::FixedBytes16Align8 offset0000;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0016
    // Size: 0x10
    // Offset: 0x10
    ::Unity::Collections::FixedBytes16Align8 offset0016;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0032
    // Size: 0x10
    // Offset: 0x20
    ::Unity::Collections::FixedBytes16Align8 offset0032;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0048
    // Size: 0x10
    // Offset: 0x30
    ::Unity::Collections::FixedBytes16Align8 offset0048;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0064
    // Size: 0x10
    // Offset: 0x40
    ::Unity::Collections::FixedBytes16Align8 offset0064;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0080
    // Size: 0x10
    // Offset: 0x50
    ::Unity::Collections::FixedBytes16Align8 offset0080;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0096
    // Size: 0x10
    // Offset: 0x60
    ::Unity::Collections::FixedBytes16Align8 offset0096;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0112
    // Size: 0x10
    // Offset: 0x70
    ::Unity::Collections::FixedBytes16Align8 offset0112;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0128
    // Size: 0x10
    // Offset: 0x80
    ::Unity::Collections::FixedBytes16Align8 offset0128;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0144
    // Size: 0x10
    // Offset: 0x90
    ::Unity::Collections::FixedBytes16Align8 offset0144;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0160
    // Size: 0x10
    // Offset: 0xA0
    ::Unity::Collections::FixedBytes16Align8 offset0160;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0176
    // Size: 0x10
    // Offset: 0xB0
    ::Unity::Collections::FixedBytes16Align8 offset0176;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0192
    // Size: 0x10
    // Offset: 0xC0
    ::Unity::Collections::FixedBytes16Align8 offset0192;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0208
    // Size: 0x10
    // Offset: 0xD0
    ::Unity::Collections::FixedBytes16Align8 offset0208;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0224
    // Size: 0x10
    // Offset: 0xE0
    ::Unity::Collections::FixedBytes16Align8 offset0224;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0240
    // Size: 0x10
    // Offset: 0xF0
    ::Unity::Collections::FixedBytes16Align8 offset0240;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0256
    // Size: 0x10
    // Offset: 0x100
    ::Unity::Collections::FixedBytes16Align8 offset0256;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0272
    // Size: 0x10
    // Offset: 0x110
    ::Unity::Collections::FixedBytes16Align8 offset0272;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0288
    // Size: 0x10
    // Offset: 0x120
    ::Unity::Collections::FixedBytes16Align8 offset0288;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0304
    // Size: 0x10
    // Offset: 0x130
    ::Unity::Collections::FixedBytes16Align8 offset0304;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0320
    // Size: 0x10
    // Offset: 0x140
    ::Unity::Collections::FixedBytes16Align8 offset0320;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0336
    // Size: 0x10
    // Offset: 0x150
    ::Unity::Collections::FixedBytes16Align8 offset0336;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0352
    // Size: 0x10
    // Offset: 0x160
    ::Unity::Collections::FixedBytes16Align8 offset0352;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0368
    // Size: 0x10
    // Offset: 0x170
    ::Unity::Collections::FixedBytes16Align8 offset0368;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0384
    // Size: 0x10
    // Offset: 0x180
    ::Unity::Collections::FixedBytes16Align8 offset0384;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0400
    // Size: 0x10
    // Offset: 0x190
    ::Unity::Collections::FixedBytes16Align8 offset0400;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0416
    // Size: 0x10
    // Offset: 0x1A0
    ::Unity::Collections::FixedBytes16Align8 offset0416;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0432
    // Size: 0x10
    // Offset: 0x1B0
    ::Unity::Collections::FixedBytes16Align8 offset0432;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0448
    // Size: 0x10
    // Offset: 0x1C0
    ::Unity::Collections::FixedBytes16Align8 offset0448;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0464
    // Size: 0x10
    // Offset: 0x1D0
    ::Unity::Collections::FixedBytes16Align8 offset0464;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0480
    // Size: 0x10
    // Offset: 0x1E0
    ::Unity::Collections::FixedBytes16Align8 offset0480;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0496
    // Size: 0x10
    // Offset: 0x1F0
    ::Unity::Collections::FixedBytes16Align8 offset0496;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0512
    // Size: 0x10
    // Offset: 0x200
    ::Unity::Collections::FixedBytes16Align8 offset0512;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0528
    // Size: 0x10
    // Offset: 0x210
    ::Unity::Collections::FixedBytes16Align8 offset0528;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0544
    // Size: 0x10
    // Offset: 0x220
    ::Unity::Collections::FixedBytes16Align8 offset0544;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0560
    // Size: 0x10
    // Offset: 0x230
    ::Unity::Collections::FixedBytes16Align8 offset0560;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0576
    // Size: 0x10
    // Offset: 0x240
    ::Unity::Collections::FixedBytes16Align8 offset0576;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0592
    // Size: 0x10
    // Offset: 0x250
    ::Unity::Collections::FixedBytes16Align8 offset0592;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0608
    // Size: 0x10
    // Offset: 0x260
    ::Unity::Collections::FixedBytes16Align8 offset0608;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0624
    // Size: 0x10
    // Offset: 0x270
    ::Unity::Collections::FixedBytes16Align8 offset0624;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0640
    // Size: 0x10
    // Offset: 0x280
    ::Unity::Collections::FixedBytes16Align8 offset0640;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0656
    // Size: 0x10
    // Offset: 0x290
    ::Unity::Collections::FixedBytes16Align8 offset0656;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0672
    // Size: 0x10
    // Offset: 0x2A0
    ::Unity::Collections::FixedBytes16Align8 offset0672;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0688
    // Size: 0x10
    // Offset: 0x2B0
    ::Unity::Collections::FixedBytes16Align8 offset0688;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0704
    // Size: 0x10
    // Offset: 0x2C0
    ::Unity::Collections::FixedBytes16Align8 offset0704;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0720
    // Size: 0x10
    // Offset: 0x2D0
    ::Unity::Collections::FixedBytes16Align8 offset0720;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0736
    // Size: 0x10
    // Offset: 0x2E0
    ::Unity::Collections::FixedBytes16Align8 offset0736;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0752
    // Size: 0x10
    // Offset: 0x2F0
    ::Unity::Collections::FixedBytes16Align8 offset0752;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0768
    // Size: 0x10
    // Offset: 0x300
    ::Unity::Collections::FixedBytes16Align8 offset0768;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0784
    // Size: 0x10
    // Offset: 0x310
    ::Unity::Collections::FixedBytes16Align8 offset0784;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0800
    // Size: 0x10
    // Offset: 0x320
    ::Unity::Collections::FixedBytes16Align8 offset0800;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0816
    // Size: 0x10
    // Offset: 0x330
    ::Unity::Collections::FixedBytes16Align8 offset0816;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0832
    // Size: 0x10
    // Offset: 0x340
    ::Unity::Collections::FixedBytes16Align8 offset0832;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0848
    // Size: 0x10
    // Offset: 0x350
    ::Unity::Collections::FixedBytes16Align8 offset0848;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0864
    // Size: 0x10
    // Offset: 0x360
    ::Unity::Collections::FixedBytes16Align8 offset0864;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0880
    // Size: 0x10
    // Offset: 0x370
    ::Unity::Collections::FixedBytes16Align8 offset0880;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0896
    // Size: 0x10
    // Offset: 0x380
    ::Unity::Collections::FixedBytes16Align8 offset0896;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0912
    // Size: 0x10
    // Offset: 0x390
    ::Unity::Collections::FixedBytes16Align8 offset0912;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0928
    // Size: 0x10
    // Offset: 0x3A0
    ::Unity::Collections::FixedBytes16Align8 offset0928;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0944
    // Size: 0x10
    // Offset: 0x3B0
    ::Unity::Collections::FixedBytes16Align8 offset0944;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0960
    // Size: 0x10
    // Offset: 0x3C0
    ::Unity::Collections::FixedBytes16Align8 offset0960;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0976
    // Size: 0x10
    // Offset: 0x3D0
    ::Unity::Collections::FixedBytes16Align8 offset0976;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0992
    // Size: 0x10
    // Offset: 0x3E0
    ::Unity::Collections::FixedBytes16Align8 offset0992;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1008
    // Size: 0x10
    // Offset: 0x3F0
    ::Unity::Collections::FixedBytes16Align8 offset1008;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1024
    // Size: 0x10
    // Offset: 0x400
    ::Unity::Collections::FixedBytes16Align8 offset1024;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1040
    // Size: 0x10
    // Offset: 0x410
    ::Unity::Collections::FixedBytes16Align8 offset1040;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1056
    // Size: 0x10
    // Offset: 0x420
    ::Unity::Collections::FixedBytes16Align8 offset1056;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1072
    // Size: 0x10
    // Offset: 0x430
    ::Unity::Collections::FixedBytes16Align8 offset1072;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1088
    // Size: 0x10
    // Offset: 0x440
    ::Unity::Collections::FixedBytes16Align8 offset1088;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1104
    // Size: 0x10
    // Offset: 0x450
    ::Unity::Collections::FixedBytes16Align8 offset1104;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1120
    // Size: 0x10
    // Offset: 0x460
    ::Unity::Collections::FixedBytes16Align8 offset1120;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1136
    // Size: 0x10
    // Offset: 0x470
    ::Unity::Collections::FixedBytes16Align8 offset1136;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1152
    // Size: 0x10
    // Offset: 0x480
    ::Unity::Collections::FixedBytes16Align8 offset1152;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1168
    // Size: 0x10
    // Offset: 0x490
    ::Unity::Collections::FixedBytes16Align8 offset1168;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1184
    // Size: 0x10
    // Offset: 0x4A0
    ::Unity::Collections::FixedBytes16Align8 offset1184;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1200
    // Size: 0x10
    // Offset: 0x4B0
    ::Unity::Collections::FixedBytes16Align8 offset1200;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1216
    // Size: 0x10
    // Offset: 0x4C0
    ::Unity::Collections::FixedBytes16Align8 offset1216;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1232
    // Size: 0x10
    // Offset: 0x4D0
    ::Unity::Collections::FixedBytes16Align8 offset1232;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1248
    // Size: 0x10
    // Offset: 0x4E0
    ::Unity::Collections::FixedBytes16Align8 offset1248;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1264
    // Size: 0x10
    // Offset: 0x4F0
    ::Unity::Collections::FixedBytes16Align8 offset1264;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1280
    // Size: 0x10
    // Offset: 0x500
    ::Unity::Collections::FixedBytes16Align8 offset1280;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1296
    // Size: 0x10
    // Offset: 0x510
    ::Unity::Collections::FixedBytes16Align8 offset1296;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1312
    // Size: 0x10
    // Offset: 0x520
    ::Unity::Collections::FixedBytes16Align8 offset1312;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1328
    // Size: 0x10
    // Offset: 0x530
    ::Unity::Collections::FixedBytes16Align8 offset1328;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1344
    // Size: 0x10
    // Offset: 0x540
    ::Unity::Collections::FixedBytes16Align8 offset1344;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1360
    // Size: 0x10
    // Offset: 0x550
    ::Unity::Collections::FixedBytes16Align8 offset1360;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1376
    // Size: 0x10
    // Offset: 0x560
    ::Unity::Collections::FixedBytes16Align8 offset1376;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1392
    // Size: 0x10
    // Offset: 0x570
    ::Unity::Collections::FixedBytes16Align8 offset1392;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1408
    // Size: 0x10
    // Offset: 0x580
    ::Unity::Collections::FixedBytes16Align8 offset1408;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1424
    // Size: 0x10
    // Offset: 0x590
    ::Unity::Collections::FixedBytes16Align8 offset1424;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1440
    // Size: 0x10
    // Offset: 0x5A0
    ::Unity::Collections::FixedBytes16Align8 offset1440;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1456
    // Size: 0x10
    // Offset: 0x5B0
    ::Unity::Collections::FixedBytes16Align8 offset1456;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1472
    // Size: 0x10
    // Offset: 0x5C0
    ::Unity::Collections::FixedBytes16Align8 offset1472;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1488
    // Size: 0x10
    // Offset: 0x5D0
    ::Unity::Collections::FixedBytes16Align8 offset1488;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1504
    // Size: 0x10
    // Offset: 0x5E0
    ::Unity::Collections::FixedBytes16Align8 offset1504;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1520
    // Size: 0x10
    // Offset: 0x5F0
    ::Unity::Collections::FixedBytes16Align8 offset1520;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1536
    // Size: 0x10
    // Offset: 0x600
    ::Unity::Collections::FixedBytes16Align8 offset1536;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1552
    // Size: 0x10
    // Offset: 0x610
    ::Unity::Collections::FixedBytes16Align8 offset1552;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1568
    // Size: 0x10
    // Offset: 0x620
    ::Unity::Collections::FixedBytes16Align8 offset1568;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1584
    // Size: 0x10
    // Offset: 0x630
    ::Unity::Collections::FixedBytes16Align8 offset1584;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1600
    // Size: 0x10
    // Offset: 0x640
    ::Unity::Collections::FixedBytes16Align8 offset1600;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1616
    // Size: 0x10
    // Offset: 0x650
    ::Unity::Collections::FixedBytes16Align8 offset1616;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1632
    // Size: 0x10
    // Offset: 0x660
    ::Unity::Collections::FixedBytes16Align8 offset1632;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1648
    // Size: 0x10
    // Offset: 0x670
    ::Unity::Collections::FixedBytes16Align8 offset1648;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1664
    // Size: 0x10
    // Offset: 0x680
    ::Unity::Collections::FixedBytes16Align8 offset1664;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1680
    // Size: 0x10
    // Offset: 0x690
    ::Unity::Collections::FixedBytes16Align8 offset1680;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1696
    // Size: 0x10
    // Offset: 0x6A0
    ::Unity::Collections::FixedBytes16Align8 offset1696;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1712
    // Size: 0x10
    // Offset: 0x6B0
    ::Unity::Collections::FixedBytes16Align8 offset1712;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1728
    // Size: 0x10
    // Offset: 0x6C0
    ::Unity::Collections::FixedBytes16Align8 offset1728;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1744
    // Size: 0x10
    // Offset: 0x6D0
    ::Unity::Collections::FixedBytes16Align8 offset1744;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1760
    // Size: 0x10
    // Offset: 0x6E0
    ::Unity::Collections::FixedBytes16Align8 offset1760;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1776
    // Size: 0x10
    // Offset: 0x6F0
    ::Unity::Collections::FixedBytes16Align8 offset1776;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1792
    // Size: 0x10
    // Offset: 0x700
    ::Unity::Collections::FixedBytes16Align8 offset1792;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1808
    // Size: 0x10
    // Offset: 0x710
    ::Unity::Collections::FixedBytes16Align8 offset1808;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1824
    // Size: 0x10
    // Offset: 0x720
    ::Unity::Collections::FixedBytes16Align8 offset1824;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1840
    // Size: 0x10
    // Offset: 0x730
    ::Unity::Collections::FixedBytes16Align8 offset1840;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1856
    // Size: 0x10
    // Offset: 0x740
    ::Unity::Collections::FixedBytes16Align8 offset1856;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1872
    // Size: 0x10
    // Offset: 0x750
    ::Unity::Collections::FixedBytes16Align8 offset1872;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1888
    // Size: 0x10
    // Offset: 0x760
    ::Unity::Collections::FixedBytes16Align8 offset1888;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1904
    // Size: 0x10
    // Offset: 0x770
    ::Unity::Collections::FixedBytes16Align8 offset1904;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1920
    // Size: 0x10
    // Offset: 0x780
    ::Unity::Collections::FixedBytes16Align8 offset1920;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1936
    // Size: 0x10
    // Offset: 0x790
    ::Unity::Collections::FixedBytes16Align8 offset1936;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1952
    // Size: 0x10
    // Offset: 0x7A0
    ::Unity::Collections::FixedBytes16Align8 offset1952;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1968
    // Size: 0x10
    // Offset: 0x7B0
    ::Unity::Collections::FixedBytes16Align8 offset1968;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset1984
    // Size: 0x10
    // Offset: 0x7C0
    ::Unity::Collections::FixedBytes16Align8 offset1984;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2000
    // Size: 0x10
    // Offset: 0x7D0
    ::Unity::Collections::FixedBytes16Align8 offset2000;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2016
    // Size: 0x10
    // Offset: 0x7E0
    ::Unity::Collections::FixedBytes16Align8 offset2016;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2032
    // Size: 0x10
    // Offset: 0x7F0
    ::Unity::Collections::FixedBytes16Align8 offset2032;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2048
    // Size: 0x10
    // Offset: 0x800
    ::Unity::Collections::FixedBytes16Align8 offset2048;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2064
    // Size: 0x10
    // Offset: 0x810
    ::Unity::Collections::FixedBytes16Align8 offset2064;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2080
    // Size: 0x10
    // Offset: 0x820
    ::Unity::Collections::FixedBytes16Align8 offset2080;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2096
    // Size: 0x10
    // Offset: 0x830
    ::Unity::Collections::FixedBytes16Align8 offset2096;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2112
    // Size: 0x10
    // Offset: 0x840
    ::Unity::Collections::FixedBytes16Align8 offset2112;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2128
    // Size: 0x10
    // Offset: 0x850
    ::Unity::Collections::FixedBytes16Align8 offset2128;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2144
    // Size: 0x10
    // Offset: 0x860
    ::Unity::Collections::FixedBytes16Align8 offset2144;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2160
    // Size: 0x10
    // Offset: 0x870
    ::Unity::Collections::FixedBytes16Align8 offset2160;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2176
    // Size: 0x10
    // Offset: 0x880
    ::Unity::Collections::FixedBytes16Align8 offset2176;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2192
    // Size: 0x10
    // Offset: 0x890
    ::Unity::Collections::FixedBytes16Align8 offset2192;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2208
    // Size: 0x10
    // Offset: 0x8A0
    ::Unity::Collections::FixedBytes16Align8 offset2208;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2224
    // Size: 0x10
    // Offset: 0x8B0
    ::Unity::Collections::FixedBytes16Align8 offset2224;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2240
    // Size: 0x10
    // Offset: 0x8C0
    ::Unity::Collections::FixedBytes16Align8 offset2240;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2256
    // Size: 0x10
    // Offset: 0x8D0
    ::Unity::Collections::FixedBytes16Align8 offset2256;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2272
    // Size: 0x10
    // Offset: 0x8E0
    ::Unity::Collections::FixedBytes16Align8 offset2272;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2288
    // Size: 0x10
    // Offset: 0x8F0
    ::Unity::Collections::FixedBytes16Align8 offset2288;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2304
    // Size: 0x10
    // Offset: 0x900
    ::Unity::Collections::FixedBytes16Align8 offset2304;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2320
    // Size: 0x10
    // Offset: 0x910
    ::Unity::Collections::FixedBytes16Align8 offset2320;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2336
    // Size: 0x10
    // Offset: 0x920
    ::Unity::Collections::FixedBytes16Align8 offset2336;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2352
    // Size: 0x10
    // Offset: 0x930
    ::Unity::Collections::FixedBytes16Align8 offset2352;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2368
    // Size: 0x10
    // Offset: 0x940
    ::Unity::Collections::FixedBytes16Align8 offset2368;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2384
    // Size: 0x10
    // Offset: 0x950
    ::Unity::Collections::FixedBytes16Align8 offset2384;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2400
    // Size: 0x10
    // Offset: 0x960
    ::Unity::Collections::FixedBytes16Align8 offset2400;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2416
    // Size: 0x10
    // Offset: 0x970
    ::Unity::Collections::FixedBytes16Align8 offset2416;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2432
    // Size: 0x10
    // Offset: 0x980
    ::Unity::Collections::FixedBytes16Align8 offset2432;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2448
    // Size: 0x10
    // Offset: 0x990
    ::Unity::Collections::FixedBytes16Align8 offset2448;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2464
    // Size: 0x10
    // Offset: 0x9A0
    ::Unity::Collections::FixedBytes16Align8 offset2464;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2480
    // Size: 0x10
    // Offset: 0x9B0
    ::Unity::Collections::FixedBytes16Align8 offset2480;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2496
    // Size: 0x10
    // Offset: 0x9C0
    ::Unity::Collections::FixedBytes16Align8 offset2496;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2512
    // Size: 0x10
    // Offset: 0x9D0
    ::Unity::Collections::FixedBytes16Align8 offset2512;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2528
    // Size: 0x10
    // Offset: 0x9E0
    ::Unity::Collections::FixedBytes16Align8 offset2528;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2544
    // Size: 0x10
    // Offset: 0x9F0
    ::Unity::Collections::FixedBytes16Align8 offset2544;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2560
    // Size: 0x10
    // Offset: 0xA00
    ::Unity::Collections::FixedBytes16Align8 offset2560;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2576
    // Size: 0x10
    // Offset: 0xA10
    ::Unity::Collections::FixedBytes16Align8 offset2576;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2592
    // Size: 0x10
    // Offset: 0xA20
    ::Unity::Collections::FixedBytes16Align8 offset2592;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2608
    // Size: 0x10
    // Offset: 0xA30
    ::Unity::Collections::FixedBytes16Align8 offset2608;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2624
    // Size: 0x10
    // Offset: 0xA40
    ::Unity::Collections::FixedBytes16Align8 offset2624;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2640
    // Size: 0x10
    // Offset: 0xA50
    ::Unity::Collections::FixedBytes16Align8 offset2640;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2656
    // Size: 0x10
    // Offset: 0xA60
    ::Unity::Collections::FixedBytes16Align8 offset2656;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2672
    // Size: 0x10
    // Offset: 0xA70
    ::Unity::Collections::FixedBytes16Align8 offset2672;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2688
    // Size: 0x10
    // Offset: 0xA80
    ::Unity::Collections::FixedBytes16Align8 offset2688;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2704
    // Size: 0x10
    // Offset: 0xA90
    ::Unity::Collections::FixedBytes16Align8 offset2704;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2720
    // Size: 0x10
    // Offset: 0xAA0
    ::Unity::Collections::FixedBytes16Align8 offset2720;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2736
    // Size: 0x10
    // Offset: 0xAB0
    ::Unity::Collections::FixedBytes16Align8 offset2736;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2752
    // Size: 0x10
    // Offset: 0xAC0
    ::Unity::Collections::FixedBytes16Align8 offset2752;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2768
    // Size: 0x10
    // Offset: 0xAD0
    ::Unity::Collections::FixedBytes16Align8 offset2768;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2784
    // Size: 0x10
    // Offset: 0xAE0
    ::Unity::Collections::FixedBytes16Align8 offset2784;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2800
    // Size: 0x10
    // Offset: 0xAF0
    ::Unity::Collections::FixedBytes16Align8 offset2800;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2816
    // Size: 0x10
    // Offset: 0xB00
    ::Unity::Collections::FixedBytes16Align8 offset2816;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2832
    // Size: 0x10
    // Offset: 0xB10
    ::Unity::Collections::FixedBytes16Align8 offset2832;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2848
    // Size: 0x10
    // Offset: 0xB20
    ::Unity::Collections::FixedBytes16Align8 offset2848;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2864
    // Size: 0x10
    // Offset: 0xB30
    ::Unity::Collections::FixedBytes16Align8 offset2864;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2880
    // Size: 0x10
    // Offset: 0xB40
    ::Unity::Collections::FixedBytes16Align8 offset2880;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2896
    // Size: 0x10
    // Offset: 0xB50
    ::Unity::Collections::FixedBytes16Align8 offset2896;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2912
    // Size: 0x10
    // Offset: 0xB60
    ::Unity::Collections::FixedBytes16Align8 offset2912;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2928
    // Size: 0x10
    // Offset: 0xB70
    ::Unity::Collections::FixedBytes16Align8 offset2928;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2944
    // Size: 0x10
    // Offset: 0xB80
    ::Unity::Collections::FixedBytes16Align8 offset2944;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2960
    // Size: 0x10
    // Offset: 0xB90
    ::Unity::Collections::FixedBytes16Align8 offset2960;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2976
    // Size: 0x10
    // Offset: 0xBA0
    ::Unity::Collections::FixedBytes16Align8 offset2976;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset2992
    // Size: 0x10
    // Offset: 0xBB0
    ::Unity::Collections::FixedBytes16Align8 offset2992;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset3008
    // Size: 0x10
    // Offset: 0xBC0
    ::Unity::Collections::FixedBytes16Align8 offset3008;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset3024
    // Size: 0x10
    // Offset: 0xBD0
    ::Unity::Collections::FixedBytes16Align8 offset3024;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset3040
    // Size: 0x10
    // Offset: 0xBE0
    ::Unity::Collections::FixedBytes16Align8 offset3040;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset3056
    // Size: 0x10
    // Offset: 0xBF0
    ::Unity::Collections::FixedBytes16Align8 offset3056;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset3072
    // Size: 0x10
    // Offset: 0xC00
    ::Unity::Collections::FixedBytes16Align8 offset3072;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset3088
    // Size: 0x10
    // Offset: 0xC10
    ::Unity::Collections::FixedBytes16Align8 offset3088;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset3104
    // Size: 0x10
    // Offset: 0xC20
    ::Unity::Collections::FixedBytes16Align8 offset3104;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset3120
    // Size: 0x10
    // Offset: 0xC30
    ::Unity::Collections::FixedBytes16Align8 offset3120;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset3136
    // Size: 0x10
    // Offset: 0xC40
    ::Unity::Collections::FixedBytes16Align8 offset3136;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset3152
    // Size: 0x10
    // Offset: 0xC50
    ::Unity::Collections::FixedBytes16Align8 offset3152;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset3168
    // Size: 0x10
    // Offset: 0xC60
    ::Unity::Collections::FixedBytes16Align8 offset3168;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset3184
    // Size: 0x10
    // Offset: 0xC70
    ::Unity::Collections::FixedBytes16Align8 offset3184;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset3200
    // Size: 0x10
    // Offset: 0xC80
    ::Unity::Collections::FixedBytes16Align8 offset3200;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset3216
    // Size: 0x10
    // Offset: 0xC90
    ::Unity::Collections::FixedBytes16Align8 offset3216;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset3232
    // Size: 0x10
    // Offset: 0xCA0
    ::Unity::Collections::FixedBytes16Align8 offset3232;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset3248
    // Size: 0x10
    // Offset: 0xCB0
    ::Unity::Collections::FixedBytes16Align8 offset3248;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset3264
    // Size: 0x10
    // Offset: 0xCC0
    ::Unity::Collections::FixedBytes16Align8 offset3264;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset3280
    // Size: 0x10
    // Offset: 0xCD0
    ::Unity::Collections::FixedBytes16Align8 offset3280;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset3296
    // Size: 0x10
    // Offset: 0xCE0
    ::Unity::Collections::FixedBytes16Align8 offset3296;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset3312
    // Size: 0x10
    // Offset: 0xCF0
    ::Unity::Collections::FixedBytes16Align8 offset3312;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset3328
    // Size: 0x10
    // Offset: 0xD00
    ::Unity::Collections::FixedBytes16Align8 offset3328;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset3344
    // Size: 0x10
    // Offset: 0xD10
    ::Unity::Collections::FixedBytes16Align8 offset3344;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset3360
    // Size: 0x10
    // Offset: 0xD20
    ::Unity::Collections::FixedBytes16Align8 offset3360;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset3376
    // Size: 0x10
    // Offset: 0xD30
    ::Unity::Collections::FixedBytes16Align8 offset3376;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset3392
    // Size: 0x10
    // Offset: 0xD40
    ::Unity::Collections::FixedBytes16Align8 offset3392;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset3408
    // Size: 0x10
    // Offset: 0xD50
    ::Unity::Collections::FixedBytes16Align8 offset3408;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset3424
    // Size: 0x10
    // Offset: 0xD60
    ::Unity::Collections::FixedBytes16Align8 offset3424;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset3440
    // Size: 0x10
    // Offset: 0xD70
    ::Unity::Collections::FixedBytes16Align8 offset3440;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset3456
    // Size: 0x10
    // Offset: 0xD80
    ::Unity::Collections::FixedBytes16Align8 offset3456;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset3472
    // Size: 0x10
    // Offset: 0xD90
    ::Unity::Collections::FixedBytes16Align8 offset3472;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset3488
    // Size: 0x10
    // Offset: 0xDA0
    ::Unity::Collections::FixedBytes16Align8 offset3488;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset3504
    // Size: 0x10
    // Offset: 0xDB0
    ::Unity::Collections::FixedBytes16Align8 offset3504;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset3520
    // Size: 0x10
    // Offset: 0xDC0
    ::Unity::Collections::FixedBytes16Align8 offset3520;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset3536
    // Size: 0x10
    // Offset: 0xDD0
    ::Unity::Collections::FixedBytes16Align8 offset3536;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset3552
    // Size: 0x10
    // Offset: 0xDE0
    ::Unity::Collections::FixedBytes16Align8 offset3552;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset3568
    // Size: 0x10
    // Offset: 0xDF0
    ::Unity::Collections::FixedBytes16Align8 offset3568;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset3584
    // Size: 0x10
    // Offset: 0xE00
    ::Unity::Collections::FixedBytes16Align8 offset3584;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset3600
    // Size: 0x10
    // Offset: 0xE10
    ::Unity::Collections::FixedBytes16Align8 offset3600;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset3616
    // Size: 0x10
    // Offset: 0xE20
    ::Unity::Collections::FixedBytes16Align8 offset3616;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset3632
    // Size: 0x10
    // Offset: 0xE30
    ::Unity::Collections::FixedBytes16Align8 offset3632;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset3648
    // Size: 0x10
    // Offset: 0xE40
    ::Unity::Collections::FixedBytes16Align8 offset3648;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset3664
    // Size: 0x10
    // Offset: 0xE50
    ::Unity::Collections::FixedBytes16Align8 offset3664;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset3680
    // Size: 0x10
    // Offset: 0xE60
    ::Unity::Collections::FixedBytes16Align8 offset3680;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset3696
    // Size: 0x10
    // Offset: 0xE70
    ::Unity::Collections::FixedBytes16Align8 offset3696;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset3712
    // Size: 0x10
    // Offset: 0xE80
    ::Unity::Collections::FixedBytes16Align8 offset3712;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset3728
    // Size: 0x10
    // Offset: 0xE90
