// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: Unity.Collections.FixedBytes16Align8
#include "Unity/Collections/FixedBytes16Align8.hpp"
// Completed includes
// Type namespace: Unity.Collections
namespace Unity::Collections {
  // Forward declaring type: FixedBytes128Align8
  struct FixedBytes128Align8;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::Unity::Collections::FixedBytes128Align8, "Unity.Collections", "FixedBytes128Align8");
// Type namespace: Unity.Collections
namespace Unity::Collections {
  // Size: 0x80
  #pragma pack(push, 1)
  // WARNING Layout: Explicit may not be correctly taken into account!
  // Autogenerated type: Unity.Collections.FixedBytes128Align8
  // [TokenAttribute] Offset: FFFFFFFF
  // [GenerateTestsForBurstCompatibilityAttribute] Offset: FFFFFFFF
  struct FixedBytes128Align8/*, public ::System::ValueType*/ {
    public:
    public:
    // Unity.Collections.FixedBytes16Align8 offset0000
    // Size: 0x10
    // Offset: 0x0
    ::Unity::Collections::FixedBytes16Align8 offset0000;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0016
    // Size: 0x10
    // Offset: 0x10
    ::Unity::Collections::FixedBytes16Align8 offset0016;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0032
    // Size: 0x10
    // Offset: 0x20
    ::Unity::Collections::FixedBytes16Align8 offset0032;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0048
    // Size: 0x10
    // Offset: 0x30
    ::Unity::Collections::FixedBytes16Align8 offset0048;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0064
    // Size: 0x10
    // Offset: 0x40
    ::Unity::Collections::FixedBytes16Align8 offset0064;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0080
    // Size: 0x10
    // Offset: 0x50
    ::Unity::Collections::FixedBytes16Align8 offset0080;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0096
    // Size: 0x10
    // Offset: 0x60
    ::Unity::Collections::FixedBytes16Align8 offset0096;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    // Unity.Collections.FixedBytes16Align8 offset0112
    // Size: 0x10
    // Offset: 0x70
    ::Unity::Collections::FixedBytes16Align8 offset0112;
    // Field size check
    static_assert(sizeof(::Unity::Collections::FixedBytes16Align8) == 0x10);
    public:
    // Creating value type constructor for type: FixedBytes128Align8
    constexpr FixedBytes128Align8(::Unity::Collections::FixedBytes16Align8 offset0000_ = {}, ::Unity::Collections::FixedBytes16Align8 offset0016_ = {}, ::Unity::Collections::FixedBytes16Align8 offset0032_ = {}, ::Unity::Collections::FixedBytes16Align8 offset0048_ = {}, ::Unity::Collections::FixedBytes16Align8 offset0064_ = {}, ::Unity::Collections::FixedBytes16Align8 offset0080_ = {}, ::Unity::Collections::FixedBytes16Align8 offset0096_ = {}, ::Unity::Collections::FixedBytes16Align8 offset0112_ = {}) noexcept : offset0000{offset0000_}, offset0016{offset0016_}, offset0032{offset0032_}, offset0048{offset0048_}, offset0064{offset0064_}, offset0080{offset0080_}, offset0096{offset0096_}, offset0112{offset0112_} {}
    // Creating interface conversion operator: operator ::System::ValueType
    operator ::System::ValueType() noexcept {
      return *reinterpret_cast<::System::ValueType*>(this);
    }
    // Get instance field reference: Unity.Collections.FixedBytes16Align8 offset0000
    [[deprecated("Use field access instead!")]] ::Unity::Collections::FixedBytes16Align8& dyn_offset0000();
    // Get instance field reference: Unity.Collections.FixedBytes16Align8 offset0016
    [[deprecated("Use field access instead!")]] ::Unity::Collections::FixedBytes16Align8& dyn_offset0016();
    // Get instance field reference: Unity.Collections.FixedBytes16Align8 offset0032
    [[deprecated("Use field access instead!")]] ::Unity::Collections::FixedBytes16Align8& dyn_offset0032();
    // Get instance field reference: Unity.Collections.FixedBytes16Align8 offset0048
    [[deprecated("Use field access instead!")]] ::Unity::Collections::FixedBytes16Align8& dyn_offset0048();
    // Get instance field reference: Unity.Collections.FixedBytes16Align8 offset0064
    [[deprecated("Use field access instead!")]] ::Unity::Collections::FixedBytes16Align8& dyn_offset0064();
    // Get instance field reference: Unity.Collections.FixedBytes16Align8 offset0080
    [[deprecated("Use field access instead!")]] ::Unity::Collections::FixedBytes16Align8& dyn_offset0080();
    // Get instance field reference: Unity.Collections.FixedBytes16Align8 offset0096
    [[deprecated("Use field access instead!")]] ::Unity::Collections::FixedBytes16Align8& dyn_offset0096();
    // Get instance field reference: Unity.Collections.FixedBytes16Align8 offset0112
    [[deprecated("Use field access instead!")]] ::Unity::Collections::FixedBytes16Align8& dyn_offset0112();
  }; // Unity.Collections.FixedBytes128Align8
  #pragma pack(pop)
  static check_size<sizeof(FixedBytes128Align8), 112 + sizeof(::Unity::Collections::FixedBytes16Align8)> __Unity_Collections_FixedBytes128Align8SizeCheck;
  static_assert(sizeof(FixedBytes128Align8) == 0x80);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
