// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: Fusion.Sockets.INetBitWriteStream
#include "Fusion/Sockets/INetBitWriteStream.hpp"
// Including type: Fusion.ILogBuilder
#include "Fusion/ILogBuilder.hpp"
// Including type: Fusion.Sockets.NetAddress
#include "Fusion/Sockets/NetAddress.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
// Including type: System.UInt64
#include "System/UInt64.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Fusion::Sockets
namespace Fusion::Sockets {
  // Forward declaring type: NetBitBufferBlock
  struct NetBitBufferBlock;
  // Forward declaring type: NetPacketType
  struct NetPacketType;
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: StringBuilder
  class StringBuilder;
}
// Forward declaring namespace: Fusion
namespace Fusion {
  // Forward declaring type: LogOptions
  struct LogOptions;
}
// Completed forward declares
// Type namespace: Fusion.Sockets
namespace Fusion::Sockets {
  // Forward declaring type: NetBitBuffer
  struct NetBitBuffer;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::Fusion::Sockets::NetBitBuffer, "Fusion.Sockets", "NetBitBuffer");
// Type namespace: Fusion.Sockets
namespace Fusion::Sockets {
  // Size: 0x64
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: Fusion.Sockets.NetBitBuffer
  // [TokenAttribute] Offset: FFFFFFFF
  struct NetBitBuffer/*, public ::System::ValueType, public ::Fusion::Sockets::INetBitWriteStream, public ::Fusion::ILogBuilder*/ {
    public:
    public:
    // public Fusion.Sockets.NetAddress Address
    // Size: 0x18
    // Offset: 0x0
    ::Fusion::Sockets::NetAddress Address;
    // Field size check
    static_assert(sizeof(::Fusion::Sockets::NetAddress) == 0x18);
    // System.Int32 Mtu
    // Size: 0x4
    // Offset: 0x18
    int Mtu;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: Mtu and: Prev
    char __padding1[0x4] = {};
    // Fusion.Sockets.NetBitBuffer* Prev
    // Size: 0x8
    // Offset: 0x20
    ::Fusion::Sockets::NetBitBuffer* Prev;
    // Field size check
    static_assert(sizeof(::Fusion::Sockets::NetBitBuffer*) == 0x8);
    // Fusion.Sockets.NetBitBuffer* Next
    // Size: 0x8
    // Offset: 0x28
    ::Fusion::Sockets::NetBitBuffer* Next;
    // Field size check
    static_assert(sizeof(::Fusion::Sockets::NetBitBuffer*) == 0x8);
    // Fusion.Sockets.NetBitBufferBlock* _block
    // Size: 0x8
    // Offset: 0x30
    ::Fusion::Sockets::NetBitBufferBlock* block;
    // Field size check
    static_assert(sizeof(::Fusion::Sockets::NetBitBufferBlock*) == 0x8);
    // Fusion.Sockets.NetBitBuffer* _allocNext
    // Size: 0x8
    // Offset: 0x38
    ::Fusion::Sockets::NetBitBuffer* allocNext;
    // Field size check
    static_assert(sizeof(::Fusion::Sockets::NetBitBuffer*) == 0x8);
    // private System.Int32 _group
    // Size: 0x4
    // Offset: 0x40
    int group;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: group and: data
    char __padding6[0x4] = {};
    // private System.UInt64* _data
    // Size: 0x8
    // Offset: 0x48
    uint64_t* data;
    // Field size check
    static_assert(sizeof(uint64_t*) == 0x8);
    // private System.UInt64* _dataBlockOriginal
    // Size: 0x8
    // Offset: 0x50
    uint64_t* dataBlockOriginal;
    // Field size check
    static_assert(sizeof(uint64_t*) == 0x8);
    // private System.Int32 _offsetBits
    // Size: 0x4
    // Offset: 0x58
    int offsetBits;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _lengthBits
    // Size: 0x4
    // Offset: 0x5C
    int lengthBits;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _lengthBytes
    // Size: 0x4
    // Offset: 0x60
    int lengthBytes;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Creating value type constructor for type: NetBitBuffer
    constexpr NetBitBuffer(::Fusion::Sockets::NetAddress Address_ = {}, int Mtu_ = {}, ::Fusion::Sockets::NetBitBuffer* Prev_ = {}, ::Fusion::Sockets::NetBitBuffer* Next_ = {}, ::Fusion::Sockets::NetBitBufferBlock* block_ = {}, ::Fusion::Sockets::NetBitBuffer* allocNext_ = {}, int group_ = {}, uint64_t* data_ = {}, uint64_t* dataBlockOriginal_ = {}, int offsetBits_ = {}, int lengthBits_ = {}, int lengthBytes_ = {}) noexcept : Address{Address_}, Mtu{Mtu_}, Prev{Prev_}, Next{Next_}, block{block_}, allocNext{allocNext_}, group{group_}, data{data_}, dataBlockOriginal{dataBlockOriginal_}, offsetBits{offsetBits_}, lengthBits{lengthBits_}, lengthBytes{lengthBytes_} {}
    // Creating interface conversion operator: operator ::System::ValueType
    operator ::System::ValueType() noexcept {
