// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: Fusion.Sockets.NetConnectionMap/EntryState
#include "Fusion/Sockets/NetConnectionMap_EntryState.hpp"
// Including type: Fusion.Sockets.NetConnectionId
#include "Fusion/Sockets/NetConnectionId.hpp"
// Including type: Fusion.Sockets.NetAddress
#include "Fusion/Sockets/NetAddress.hpp"
// Including type: Fusion.Sockets.NetConnectionStatus
#include "Fusion/Sockets/NetConnectionStatus.hpp"
// Including type: Fusion.Sockets.NetSendEnvelopeRingBuffer
#include "Fusion/Sockets/NetSendEnvelopeRingBuffer.hpp"
// Including type: Fusion.Sockets.NetSequencer
#include "Fusion/Sockets/NetSequencer.hpp"
// Including type: Fusion.Sockets.ReliableBuffer
#include "Fusion/Sockets/ReliableBuffer.hpp"
// Including type: Fusion.TimerDelta
#include "Fusion/TimerDelta.hpp"
// Including type: Fusion.Sockets.NetConnectionStats
#include "Fusion/Sockets/NetConnectionStats.hpp"
// Including type: System.Byte
#include "System/Byte.hpp"
// Including type: Fusion.Sockets.NetDisconnectReason
#include "Fusion/Sockets/NetDisconnectReason.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Fusion::Sockets
namespace Fusion::Sockets {
  // Forward declaring type: NetConfig
  struct NetConfig;
}
// Completed forward declares
// Type namespace: Fusion.Sockets
namespace Fusion::Sockets {
  // Forward declaring type: NetConnection
  struct NetConnection;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::Fusion::Sockets::NetConnection, "Fusion.Sockets", "NetConnection");
// Type namespace: Fusion.Sockets
namespace Fusion::Sockets {
  // Size: 0x1B8
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: Fusion.Sockets.NetConnection
  // [TokenAttribute] Offset: FFFFFFFF
  struct NetConnection/*, public ::System::ValueType*/ {
    public:
    // Nested type: ::Fusion::Sockets::NetConnection::StateConnectingData
    struct StateConnectingData;
    // Nested type: ::Fusion::Sockets::NetConnection::StateShutdownData
    struct StateShutdownData;
    // Nested type: ::Fusion::Sockets::NetConnection::StateDisconnectedData
    struct StateDisconnectedData;
    // Size: 0x10
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: Fusion.Sockets.NetConnection/StateConnectingData
    // [TokenAttribute] Offset: FFFFFFFF
    struct StateConnectingData/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.Int32 Attempts
      // Size: 0x4
      // Offset: 0x0
      int Attempts;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // Padding between fields: Attempts and: AttemptTimeout
      char __padding0[0x4] = {};
      // public System.Double AttemptTimeout
      // Size: 0x8
      // Offset: 0x8
      double AttemptTimeout;
      // Field size check
      static_assert(sizeof(double) == 0x8);
      public:
      // Creating value type constructor for type: StateConnectingData
      constexpr StateConnectingData(int Attempts_ = {}, double AttemptTimeout_ = {}) noexcept : Attempts{Attempts_}, AttemptTimeout{AttemptTimeout_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public System.Int32 Attempts
      [[deprecated("Use field access instead!")]] int& dyn_Attempts();
      // Get instance field reference: public System.Double AttemptTimeout
      [[deprecated("Use field access instead!")]] double& dyn_AttemptTimeout();
    }; // Fusion.Sockets.NetConnection/StateConnectingData
    #pragma pack(pop)
    static check_size<sizeof(NetConnection::StateConnectingData), 8 + sizeof(double)> __Fusion_Sockets_NetConnection_StateConnectingDataSizeCheck;
    static_assert(sizeof(NetConnection::StateConnectingData) == 0x10);
    // Size: 0xC
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: Fusion.Sockets.NetConnection/StateShutdownData
    // [TokenAttribute] Offset: FFFFFFFF
    struct StateShutdownData/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.Double Timeout
      // Size: 0x8
      // Offset: 0x0
      double Timeout;
      // Field size check
      static_assert(sizeof(double) == 0x8);
      // public System.Int32 Unmapped
      // Size: 0x4
      // Offset: 0x8
      int Unmapped;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: StateShutdownData
      constexpr StateShutdownData(double Timeout_ = {}, int Unmapped_ = {}) noexcept : Timeout{Timeout_}, Unmapped{Unmapped_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public System.Double Timeout
      [[deprecated("Use field access instead!")]] double& dyn_Timeout();
      // Get instance field reference: public System.Int32 Unmapped
      [[deprecated("Use field access instead!")]] int& dyn_Unmapped();
    }; // Fusion.Sockets.NetConnection/StateShutdownData
    #pragma pack(pop)
    static check_size<sizeof(NetConnection::StateShutdownData), 8 + sizeof(int)> __Fusion_Sockets_NetConnection_StateShutdownDataSizeCheck;
    static_assert(sizeof(NetConnection::StateShutdownData) == 0xC);
    // Size: 0xC
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: Fusion.Sockets.NetConnection/StateDisconnectedData
    // [TokenAttribute] Offset: FFFFFFFF
    struct StateDisconnectedData/*, public ::System::ValueType*/ {
      public:
      public:
      // public Fusion.Sockets.NetDisconnectReason Reason
      // Size: 0x1
      // Offset: 0x0
      ::Fusion::Sockets::NetDisconnectReason Reason;
      // Field size check
      static_assert(sizeof(::Fusion::Sockets::NetDisconnectReason) == 0x1);
      // Padding between fields: Reason and: CallbackInvoked
      char __padding0[0x3] = {};
      // public System.Int32 CallbackInvoked
      // Size: 0x4
      // Offset: 0x4
      int CallbackInvoked;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Int32 SentDisconnectCommand
      // Size: 0x4
      // Offset: 0x8
      int SentDisconnectCommand;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: StateDisconnectedData
      constexpr StateDisconnectedData(::Fusion::Sockets::NetDisconnectReason Reason_ = {}, int CallbackInvoked_ = {}, int SentDisconnectCommand_ = {}) noexcept : Reason{Reason_}, CallbackInvoked{CallbackInvoked_}, SentDisconnectCommand{SentDisconnectCommand_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public Fusion.Sockets.NetDisconnectReason Reason
      [[deprecated("Use field access instead!")]] ::Fusion::Sockets::NetDisconnectReason& dyn_Reason();
      // Get instance field reference: public System.Int32 CallbackInvoked
      [[deprecated("Use field access instead!")]] int& dyn_CallbackInvoked();
      // Get instance field reference: public System.Int32 SentDisconnectCommand
      [[deprecated("Use field access instead!")]] int& dyn_SentDisconnectCommand();
    }; // Fusion.Sockets.NetConnection/StateDisconnectedData
    #pragma pack(pop)
    static check_size<sizeof(NetConnection::StateDisconnectedData), 8 + sizeof(int)> __Fusion_Sockets_NetConnection_StateDisconnectedDataSizeCheck;
    static_assert(sizeof(NetConnection::StateDisconnectedData) == 0xC);
    public:
    // System.UInt64 MapHash
    // Size: 0x8
    // Offset: 0x0
    uint64_t MapHash;
    // Field size check
    static_assert(sizeof(uint64_t) == 0x8);
    // Fusion.Sockets.NetConnection* MapNext
    // Size: 0x8
    // Offset: 0x8
    ::Fusion::Sockets::NetConnection* MapNext;
    // Field size check
    static_assert(sizeof(::Fusion::Sockets::NetConnection*) == 0x8);
    // Fusion.Sockets.NetConnectionMap/EntryState MapState
    // Size: 0x4
    // Offset: 0x10
    ::Fusion::Sockets::NetConnectionMap::EntryState MapState;
    // Field size check
    static_assert(sizeof(::Fusion::Sockets::NetConnectionMap::EntryState) == 0x4);
    // Padding between fields: MapState and: LocalId
    char __padding2[0x4] = {};
    // Fusion.Sockets.NetConnectionId LocalId
    // Size: 0x8
    // Offset: 0x18
    ::Fusion::Sockets::NetConnectionId LocalId;
    // Field size check
    static_assert(sizeof(::Fusion::Sockets::NetConnectionId) == 0x8);
    // Fusion.Sockets.NetConnectionId RemoteId
    // Size: 0x8
    // Offset: 0x20
    ::Fusion::Sockets::NetConnectionId RemoteId;
    // Field size check
    static_assert(sizeof(::Fusion::Sockets::NetConnectionId) == 0x8);
    // Fusion.Sockets.NetAddress Address
    // Size: 0x18
    // Offset: 0x28
    ::Fusion::Sockets::NetAddress Address;
    // Field size check
    static_assert(sizeof(::Fusion::Sockets::NetAddress) == 0x18);
    // Fusion.Sockets.NetConnectionStatus Status
    // Size: 0x4
    // Offset: 0x40
    ::Fusion::Sockets::NetConnectionStatus Status;
    // Field size check
    static_assert(sizeof(::Fusion::Sockets::NetConnectionStatus) == 0x4);
    // Padding between fields: Status and: Rtt
    char __padding6[0x4] = {};
    // System.Double Rtt
    // Size: 0x8
    // Offset: 0x48
    double Rtt;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // System.Double SendTime
    // Size: 0x8
    // Offset: 0x50
    double SendTime;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // System.Double RecvTime
    // Size: 0x8
    // Offset: 0x58
    double RecvTime;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // Fusion.Sockets.NetConnection/StateConnectingData StateConnecting
    // Size: 0x10
    // Offset: 0x60
    ::Fusion::Sockets::NetConnection::StateConnectingData StateConnecting;
    // Field size check
    static_assert(sizeof(::Fusion::Sockets::NetConnection::StateConnectingData) == 0x10);
    // Fusion.Sockets.NetConnection/StateDisconnectedData StateDisconnected
    // Size: 0xC
    // Offset: 0x70
    ::Fusion::Sockets::NetConnection::StateDisconnectedData StateDisconnected;
    // Field size check
    static_assert(sizeof(::Fusion::Sockets::NetConnection::StateDisconnectedData) == 0xC);
    // Padding between fields: StateDisconnected and: StateShutdown
    char __padding11[0x4] = {};
    // Fusion.Sockets.NetConnection/StateShutdownData StateShutdown
    // Size: 0xC
    // Offset: 0x80
    ::Fusion::Sockets::NetConnection::StateShutdownData StateShutdown;
    // Field size check
    static_assert(sizeof(::Fusion::Sockets::NetConnection::StateShutdownData) == 0xC);
    // Padding between fields: StateShutdown and: NotifySendWindow
    char __padding12[0x4] = {};
    // Fusion.Sockets.NetSendEnvelopeRingBuffer NotifySendWindow
    // Size: 0x18
    // Offset: 0x90
    ::Fusion::Sockets::NetSendEnvelopeRingBuffer NotifySendWindow;
    // Field size check
    static_assert(sizeof(::Fusion::Sockets::NetSendEnvelopeRingBuffer) == 0x18);
    // Fusion.Sockets.NetSequencer NotifySendSequencer
    // Size: 0x18
    // Offset: 0xA8
    ::Fusion::Sockets::NetSequencer NotifySendSequencer;
    // Field size check
    static_assert(sizeof(::Fusion::Sockets::NetSequencer) == 0x18);
    // System.Double NotifySendTime
    // Size: 0x8
    // Offset: 0xC0
    double NotifySendTime;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // System.Double NotifyRecvAckTime
    // Size: 0x8
    // Offset: 0xC8
    double NotifyRecvAckTime;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // System.Int32 NotifyRecvAckOutdatedCount
    // Size: 0x4
    // Offset: 0xD0
    int NotifyRecvAckOutdatedCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: NotifyRecvAckOutdatedCount and: NotifyRecvTime
    char __padding17[0x4] = {};
    // System.Double NotifyRecvTime
    // Size: 0x8
    // Offset: 0xD8
    double NotifyRecvTime;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // System.UInt64 NotifyRecvMask
    // Size: 0x8
    // Offset: 0xE0
    uint64_t NotifyRecvMask;
    // Field size check
    static_assert(sizeof(uint64_t) == 0x8);
    // System.UInt16 NotifyRecvSequence
    // Size: 0x2
    // Offset: 0xE8
    uint16_t NotifyRecvSequence;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // Padding between fields: NotifyRecvSequence and: NotifyRecvUnackedCount
    char __padding20[0x2] = {};
    // System.Int32 NotifyRecvUnackedCount
    // Size: 0x4
    // Offset: 0xEC
    int NotifyRecvUnackedCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 NotifyRecvFragment
    // Size: 0x4
    // Offset: 0xF0
    int NotifyRecvFragment;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: NotifyRecvFragment and: NotifyRecvFragmentBuffer
    char __padding22[0x4] = {};
    // System.Byte* NotifyRecvFragmentBuffer
    // Size: 0x8
    // Offset: 0xF8
    uint8_t* NotifyRecvFragmentBuffer;
    // Field size check
    static_assert(sizeof(uint8_t*) == 0x8);
    // System.Int32 NotifyRecvFragmentBufferLength
    // Size: 0x4
    // Offset: 0x100
    int NotifyRecvFragmentBufferLength;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 NotifyRecvFragmentSequenceDistance
    // Size: 0x4
    // Offset: 0x104
    int NotifyRecvFragmentSequenceDistance;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Byte* ConnectionToken
    // Size: 0x8
    // Offset: 0x108
    uint8_t* ConnectionToken;
    // Field size check
    static_assert(sizeof(uint8_t*) == 0x8);
    // System.Int32 ConnectionTokenLength
    // Size: 0x4
    // Offset: 0x110
    int ConnectionTokenLength;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: ConnectionTokenLength and: UniqueIdHash
    char __padding27[0x4] = {};
    // System.Int64 UniqueIdHash
    // Size: 0x8
    // Offset: 0x118
    int64_t UniqueIdHash;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // System.Byte* UniqueId
    // Size: 0x8
    // Offset: 0x120
    uint8_t* UniqueId;
    // Field size check
    static_assert(sizeof(uint8_t*) == 0x8);
    // System.Int32 Mtu
    // Size: 0x4
    // Offset: 0x128
    int Mtu;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.UInt32 Counter
    // Size: 0x4
    // Offset: 0x12C
    uint Counter;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // Fusion.Sockets.ReliableBuffer ReliableBuffer
    // Size: 0x38
    // Offset: 0x130
    ::Fusion::Sockets::ReliableBuffer ReliableBuffer;
    // Field size check
    static_assert(sizeof(::Fusion::Sockets::ReliableBuffer) == 0x38);
    // Fusion.Sockets.ReliableList ReliableSendList
    // Size: 0x18
    // Offset: 0x168
    ::Fusion::Sockets::ReliableList ReliableSendList;
    // Field size check
    static_assert(sizeof(::Fusion::Sockets::ReliableList) == 0x18);
    // Fusion.TimerDelta ReliableSendTimer
    // Size: 0x20
    // Offset: 0x180
    ::Fusion::TimerDelta ReliableSendTimer;
    // Field size check
    static_assert(sizeof(::Fusion::TimerDelta) == 0x20);
    // public Fusion.Sockets.NetConnectionStats StatsRoundTripTime
    // Size: 0x8
    // Offset: 0x1A0
    ::Fusion::Sockets::NetConnectionStats StatsRoundTripTime;
    // Field size check
    static_assert(sizeof(::Fusion::Sockets::NetConnectionStats) == 0x8);
    // public Fusion.Sockets.NetConnectionStats StatsSentPacketSizes
    // Size: 0x8
    // Offset: 0x1A8
    ::Fusion::Sockets::NetConnectionStats StatsSentPacketSizes;
    // Field size check
    static_assert(sizeof(::Fusion::Sockets::NetConnectionStats) == 0x8);
    // public Fusion.Sockets.NetConnectionStats StatsReceivedPacketSizes
    // Size: 0x8
    // Offset: 0x1B0
    ::Fusion::Sockets::NetConnectionStats StatsReceivedPacketSizes;
    // Field size check
    static_assert(sizeof(::Fusion::Sockets::NetConnectionStats) == 0x8);
    public:
    // Creating value type constructor for type: NetConnection
