// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: Fusion.Timer
#include "Fusion/Timer.hpp"
// Including type: Fusion.Sockets.NetConfig
#include "Fusion/Sockets/NetConfig.hpp"
// Including type: System.IntPtr
#include "System/IntPtr.hpp"
// Including type: Fusion.Sockets.NetBitBufferStack
#include "Fusion/Sockets/NetBitBufferStack.hpp"
// Including type: System.Double
#include "System/Double.hpp"
// Including type: Fusion.Sockets.NetConnectionMap
#include "Fusion/Sockets/NetConnectionMap.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Fusion::Sockets
namespace Fusion::Sockets {
  // Forward declaring type: NetPeer
  struct NetPeer;
  // Forward declaring type: NetBitBufferBlock
  struct NetBitBufferBlock;
  // Forward declaring type: NetConnectionStatus
  struct NetConnectionStatus;
  // Forward declaring type: INetPeerGroupCallbacks
  class INetPeerGroupCallbacks;
  // Forward declaring type: NetConnection
  struct NetConnection;
  // Forward declaring type: NetDisconnectReason
  struct NetDisconnectReason;
  // Forward declaring type: NetBitBuffer
  struct NetBitBuffer;
  // Forward declaring type: NetNotifyHeader
  struct NetNotifyHeader;
  // Forward declaring type: NetSendEnvelope
  struct NetSendEnvelope;
  // Forward declaring type: NetCommandRefused
  struct NetCommandRefused;
  // Forward declaring type: NetCommandDisconnect
  struct NetCommandDisconnect;
  // Forward declaring type: NetCommandConnect
  struct NetCommandConnect;
  // Forward declaring type: NetCommandAccepted
  struct NetCommandAccepted;
}
// Completed forward declares
// Type namespace: Fusion.Sockets
namespace Fusion::Sockets {
  // Forward declaring type: NetPeerGroup
  struct NetPeerGroup;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::Fusion::Sockets::NetPeerGroup, "Fusion.Sockets", "NetPeerGroup");
// Type namespace: Fusion.Sockets
namespace Fusion::Sockets {
  // Size: 0x160
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: Fusion.Sockets.NetPeerGroup
  // [TokenAttribute] Offset: FFFFFFFF
  struct NetPeerGroup/*, public ::System::ValueType*/ {
    public:
    public:
    // private Fusion.Sockets.NetPeer* _peer
    // Size: 0x8
    // Offset: 0x0
    ::Fusion::Sockets::NetPeer* peer;
    // Field size check
    static_assert(sizeof(::Fusion::Sockets::NetPeer*) == 0x8);
    // private System.Int16 _group
    // Size: 0x2
    // Offset: 0x8
    int16_t group;
    // Field size check
    static_assert(sizeof(int16_t) == 0x2);
    // Padding between fields: group and: clock
    char __padding1[0x6] = {};
    // private Fusion.Timer _clock
    // Size: 0x11
    // Offset: 0x10
    ::Fusion::Timer clock;
    // Field size check
    static_assert(sizeof(::Fusion::Timer) == 0x11);
    // Padding between fields: clock and: config
    char __padding2[0x7] = {};
    // private Fusion.Sockets.NetConfig _config
    // Size: 0xF8
    // Offset: 0x28
    ::Fusion::Sockets::NetConfig config;
    // Field size check
    static_assert(sizeof(::Fusion::Sockets::NetConfig) == 0xF8);
    // private System.UInt32 _counter
    // Size: 0x4
    // Offset: 0x120
    uint counter;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // Padding between fields: counter and: sendHead
    char __padding4[0x4] = {};
    // private System.IntPtr _sendHead
    // Size: 0x8
    // Offset: 0x128
    ::System::IntPtr sendHead;
    // Field size check
    static_assert(sizeof(::System::IntPtr) == 0x8);
    // private System.IntPtr _recvHead
    // Size: 0x8
    // Offset: 0x130
    ::System::IntPtr recvHead;
    // Field size check
    static_assert(sizeof(::System::IntPtr) == 0x8);
    // private Fusion.Sockets.NetBitBufferStack _recvStack
    // Size: 0x14
    // Offset: 0x138
    ::Fusion::Sockets::NetBitBufferStack recvStack;
    // Field size check
    static_assert(sizeof(::Fusion::Sockets::NetBitBufferStack) == 0x14);
    // Padding between fields: recvStack and: sendBlock
    char __padding7[0x4] = {};
    // private Fusion.Sockets.NetBitBufferBlock* _sendBlock
    // Size: 0x8
    // Offset: 0x150
    ::Fusion::Sockets::NetBitBufferBlock* sendBlock;
    // Field size check
    static_assert(sizeof(::Fusion::Sockets::NetBitBufferBlock*) == 0x8);
    // private Fusion.Sockets.NetConnectionMap* _connectionsMap
    // Size: 0x8
    // Offset: 0x158
    ::Fusion::Sockets::NetConnectionMap* connectionsMap;
    // Field size check
    static_assert(sizeof(::Fusion::Sockets::NetConnectionMap*) == 0x8);
    public:
    // Creating value type constructor for type: NetPeerGroup
    constexpr NetPeerGroup(::Fusion::Sockets::NetPeer* peer_ = {}, int16_t group_ = {}, ::Fusion::Timer clock_ = {}, ::Fusion::Sockets::NetConfig config_ = {}, uint counter_ = {}, ::System::IntPtr sendHead_ = {}, ::System::IntPtr recvHead_ = {}, ::Fusion::Sockets::NetBitBufferStack recvStack_ = {}, ::Fusion::Sockets::NetBitBufferBlock* sendBlock_ = {}, ::Fusion::Sockets::NetConnectionMap* connectionsMap_ = {}) noexcept : peer{peer_}, group{group_}, clock{clock_}, config{config_}, counter{counter_}, sendHead{sendHead_}, recvHead{recvHead_}, recvStack{recvStack_}, sendBlock{sendBlock_}, connectionsMap{connectionsMap_} {}
    // Creating interface conversion operator: operator ::System::ValueType
    operator ::System::ValueType() noexcept {
