// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: Fusion.Sockets.NetConfig
#include "Fusion/Sockets/NetConfig.hpp"
// Including type: Fusion.Timer
#include "Fusion/Timer.hpp"
// Including type: Fusion.Sockets.NetSocket
#include "Fusion/Sockets/NetSocket.hpp"
// Including type: Fusion.Sockets.NetBitBufferStack
#include "Fusion/Sockets/NetBitBufferStack.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
// Including type: System.Byte
#include "System/Byte.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Fusion::Sockets
namespace Fusion::Sockets {
  // Forward declaring type: NetPeerGroup
  struct NetPeerGroup;
  // Forward declaring type: NetPeerGroupMap
  struct NetPeerGroupMap;
  // Forward declaring type: NetCommandRefused
  struct NetCommandRefused;
  // Forward declaring type: NetBitBuffer
  struct NetBitBuffer;
  // Forward declaring type: NetBitBufferBlock
  struct NetBitBufferBlock;
  // Forward declaring type: INetSocket
  class INetSocket;
  // Forward declaring type: INetPeerGroupCallbacks
  class INetPeerGroupCallbacks;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Random
  class Random;
}
// Forward declaring namespace: Fusion::Profiling
namespace Fusion::Profiling {
  // Forward declaring type: FusionSampler
  class FusionSampler;
}
// Completed forward declares
// Type namespace: Fusion.Sockets
namespace Fusion::Sockets {
  // Forward declaring type: NetPeer
  struct NetPeer;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::Fusion::Sockets::NetPeer, "Fusion.Sockets", "NetPeer");
// Type namespace: Fusion.Sockets
namespace Fusion::Sockets {
  // WARNING Size may be invalid!
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: Fusion.Sockets.NetPeer
  // [TokenAttribute] Offset: FFFFFFFF
  struct NetPeer/*, public ::System::ValueType*/ {
    public:
    public:
    // private System.Int32 _state
    // Size: 0x4
    // Offset: 0x0
    int state;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private Fusion.Sockets.NetConfig _config
    // Size: 0xF8
    // Offset: 0x8
    ::Fusion::Sockets::NetConfig config;
    // Field size check
    static_assert(sizeof(::Fusion::Sockets::NetConfig) == 0xF8);
    // private Fusion.Timer _recvTimer
    // Size: 0x11
    // Offset: 0x100
    ::Fusion::Timer recvTimer;
    // Field size check
    static_assert(sizeof(::Fusion::Timer) == 0x11);
    // private System.Byte* _fragmentBuffer
    // Size: 0x8
    // Offset: 0x118
    uint8_t* fragmentBuffer;
    // Field size check
    static_assert(sizeof(uint8_t*) == 0x8);
    // Fusion.Sockets.NetSocket _socket
    // Size: 0xFFFFFFFF
    // Offset: 0x120
    ::Fusion::Sockets::NetSocket socket;
    // private Fusion.Sockets.NetAddress _address
    // Size: 0x18
    // Offset: 0x128
    ::Fusion::Sockets::NetAddress address;
    // Field size check
    static_assert(sizeof(::Fusion::Sockets::NetAddress) == 0x18);
    // private Fusion.Sockets.NetBitBufferStack _sendStack
    // Size: 0x14
    // Offset: 0x140
    ::Fusion::Sockets::NetBitBufferStack sendStack;
    // Field size check
    static_assert(sizeof(::Fusion::Sockets::NetBitBufferStack) == 0x14);
    // private Fusion.Sockets.NetPeerGroup* _groups
    // Size: 0x8
    // Offset: 0x158
    ::Fusion::Sockets::NetPeerGroup* groups;
    // Field size check
    static_assert(sizeof(::Fusion::Sockets::NetPeerGroup*) == 0x8);
    // private Fusion.Sockets.NetPeerGroupMap* _groupsMap
    // Size: 0x8
    // Offset: 0x160
    ::Fusion::Sockets::NetPeerGroupMap* groupsMap;
    // Field size check
    static_assert(sizeof(::Fusion::Sockets::NetPeerGroupMap*) == 0x8);
    // private System.Int32* _groupsAssigned
    // Size: 0x8
    // Offset: 0x168
    int* groupsAssigned;
    // Field size check
    static_assert(sizeof(int*) == 0x8);
    // private Fusion.Sockets.NetCommandRefused* _refusedCommand
    // Size: 0x8
    // Offset: 0x170
    ::Fusion::Sockets::NetCommandRefused* refusedCommand;
    // Field size check
    static_assert(sizeof(::Fusion::Sockets::NetCommandRefused*) == 0x8);
    // private Fusion.Sockets.NetBitBuffer* _recv
    // Size: 0x8
    // Offset: 0x178
    ::Fusion::Sockets::NetBitBuffer* recv;
    // Field size check
    static_assert(sizeof(::Fusion::Sockets::NetBitBuffer*) == 0x8);
    // private Fusion.Sockets.NetBitBufferBlock* _recvBlock
    // Size: 0x8
    // Offset: 0x180
    ::Fusion::Sockets::NetBitBufferBlock* recvBlock;
    // Field size check
    static_assert(sizeof(::Fusion::Sockets::NetBitBufferBlock*) == 0x8);
    public:
    // Creating value type constructor for type: NetPeer
