// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.UIElements.Experimental.IValueAnimationUpdate
#include "UnityEngine/UIElements/Experimental/IValueAnimationUpdate.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::UIElements::Experimental
namespace UnityEngine::UIElements::Experimental {
  // Skipping declaration: <>c because it is already included!
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Func`2<T, TResult>
  template<typename T, typename TResult>
  class Func_2;
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
  // Forward declaring type: Func`4<T1, T2, T3, TResult>
  template<typename T1, typename T2, typename T3, typename TResult>
  class Func_4;
}
// Forward declaring namespace: UnityEngine::UIElements
namespace UnityEngine::UIElements {
  // Forward declaring type: VisualElement
  class VisualElement;
  // Forward declaring type: ObjectPool`1<T>
  template<typename T>
  class ObjectPool_1;
}
// Completed forward declares
// Type namespace: UnityEngine.UIElements.Experimental
namespace UnityEngine::UIElements::Experimental {
  // Forward declaring type: ValueAnimation`1<T>
  template<typename T>
  class ValueAnimation_1;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE_GENERIC_CLASS(::UnityEngine::UIElements::Experimental::ValueAnimation_1, "UnityEngine.UIElements.Experimental", "ValueAnimation`1");
// Type namespace: UnityEngine.UIElements.Experimental
namespace UnityEngine::UIElements::Experimental {
  // WARNING Size may be invalid!
  // Autogenerated type: UnityEngine.UIElements.Experimental.ValueAnimation`1
  // [TokenAttribute] Offset: FFFFFFFF
  template<typename T>
  class ValueAnimation_1 : public ::Il2CppObject/*, public ::UnityEngine::UIElements::Experimental::IValueAnimationUpdate*/ {
    public:
    // Nested type: ::UnityEngine::UIElements::Experimental::ValueAnimation_1::$$c<T>
    class $$c;
    // WARNING Size may be invalid!
    // Autogenerated type: UnityEngine.UIElements.Experimental.ValueAnimation`1/<>c
    // [TokenAttribute] Offset: FFFFFFFF
    // [CompilerGeneratedAttribute] Offset: FFFFFFFF
    class $$c : public ::il2cpp_utils::il2cpp_type_check::NestedType, public ::Il2CppObject {
      public:
      using declaring_type = ValueAnimation_1<T>*;
      static constexpr std::string_view NESTED_NAME = "<>c";
      static constexpr bool IS_VALUE_TYPE = false;
      // Autogenerated static field getter
      // Get static field: static public readonly UnityEngine.UIElements.Experimental.ValueAnimation`1/<>c<T> <>9
      static typename ::UnityEngine::UIElements::Experimental::ValueAnimation_1<T>::$$c* _get_$$9() {
        static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::UIElements::Experimental::ValueAnimation_1::$$c::_get_$$9");
        return THROW_UNLESS((il2cpp_utils::GetFieldValue<typename ::UnityEngine::UIElements::Experimental::ValueAnimation_1<T>::$$c*>(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename ValueAnimation_1<T>::$$c*>::get(), "<>9")));
      }
      // Autogenerated static field setter
      // Set static field: static public readonly UnityEngine.UIElements.Experimental.ValueAnimation`1/<>c<T> <>9
      static void _set_$$9(typename ::UnityEngine::UIElements::Experimental::ValueAnimation_1<T>::$$c* value) {
        static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::UIElements::Experimental::ValueAnimation_1::$$c::_set_$$9");
        THROW_UNLESS((il2cpp_utils::SetFieldValue(il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename ValueAnimation_1<T>::$$c*>::get(), "<>9", value)));
      }
      // static private System.Void .cctor()
      // Offset: 0xFFFFFFFFFFFFFFFF
      static void _cctor() {
        static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::UIElements::Experimental::ValueAnimation_1::$$c::.cctor");
        static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(::il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<typename ValueAnimation_1<T>::$$c*>::get(), ".cctor", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{})));
        ::il2cpp_utils::RunMethodRethrow<void, false>(static_cast<Il2CppObject*>(nullptr), ___internal__method);
      }
      // public System.Void .ctor()
      // Offset: 0xFFFFFFFFFFFFFFFF
      template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
      static typename ValueAnimation_1<T>::$$c* New_ctor() {
        static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::UIElements::Experimental::ValueAnimation_1::$$c::.ctor");
        return THROW_UNLESS((::il2cpp_utils::New<typename ValueAnimation_1<T>::$$c*, creationType>()));
      }
      // UnityEngine.UIElements.Experimental.ValueAnimation`1<T> <.cctor>b__67_0()
      // Offset: 0xFFFFFFFFFFFFFFFF
      ::UnityEngine::UIElements::Experimental::ValueAnimation_1<T>* $_cctor$b__67_0() {
        static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::UIElements::Experimental::ValueAnimation_1::$$c::<.cctor>b__67_0");
        static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(this, "<.cctor>b__67_0", std::vector<Il2CppClass*>{}, ::std::vector<const Il2CppType*>{})));
        return ::il2cpp_utils::RunMethodRethrow<::UnityEngine::UIElements::Experimental::ValueAnimation_1<T>*, false>(this, ___internal__method);
      }
    }; // UnityEngine.UIElements.Experimental.ValueAnimation`1/<>c
    // Could not write size check! Type: UnityEngine.UIElements.Experimental.ValueAnimation`1/<>c is generic, or has no fields that are valid for size checks!
    public:
    // private System.Int64 m_StartTimeMs
    // Size: 0x8
    // Offset: 0x0
    int64_t m_StartTimeMs;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private System.Int32 m_DurationMs
    // Size: 0x4
    // Offset: 0x0
    int m_DurationMs;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Func`2<System.Single,System.Single> <easingCurve>k__BackingField
    // Size: 0x8
    // Offset: 0x0
    ::System::Func_2<float, float>* easingCurve;
    // Field size check
    static_assert(sizeof(::System::Func_2<float, float>*) == 0x8);
    // private System.Boolean <isRunning>k__BackingField
    // Size: 0x1
    // Offset: 0x0
    bool isRunning;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Action <onAnimationCompleted>k__BackingField
    // Size: 0x8
    // Offset: 0x0
    ::System::Action* onAnimationCompleted;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private System.Boolean <autoRecycle>k__BackingField
    // Size: 0x1
    // Offset: 0x0
    bool autoRecycle;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <recycled>k__BackingField
    // Size: 0x1
    // Offset: 0x0
    bool recycled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private UnityEngine.UIElements.VisualElement <owner>k__BackingField
    // Size: 0x8
    // Offset: 0x0
    ::UnityEngine::UIElements::VisualElement* owner;
    // Field size check
    static_assert(sizeof(::UnityEngine::UIElements::VisualElement*) == 0x8);
    // private System.Action`2<UnityEngine.UIElements.VisualElement,T> <valueUpdated>k__BackingField
    // Size: 0x8
    // Offset: 0x0
    ::System::Action_2<::UnityEngine::UIElements::VisualElement*, T>* valueUpdated;
    // Field size check
    static_assert(sizeof(::System::Action_2<::UnityEngine::UIElements::VisualElement*, T>*) == 0x8);
    // private System.Func`2<UnityEngine.UIElements.VisualElement,T> <initialValue>k__BackingField
    // Size: 0x8
    // Offset: 0x0
    ::System::Func_2<::UnityEngine::UIElements::VisualElement*, T>* initialValue;
    // Field size check
    static_assert(sizeof(::System::Func_2<::UnityEngine::UIElements::VisualElement*, T>*) == 0x8);
    // private System.Func`4<T,T,System.Single,T> <interpolator>k__BackingField
    // Size: 0x8
    // Offset: 0x0
    ::System::Func_4<T, T, float, T>* interpolator;
    // Field size check
    static_assert(sizeof(::System::Func_4<T, T, float, T>*) == 0x8);
    // private T _from
    // Size: 0xFFFFFFFF
    // Offset: 0x0
    T from;
    // private System.Boolean fromValueSet
    // Size: 0x1
    // Offset: 0x0
    bool fromValueSet;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private T <to>k__BackingField
    // Size: 0xFFFFFFFF
    // Offset: 0x0
    T to;
    public:
    // Creating interface conversion operator: operator ::UnityEngine::UIElements::Experimental::IValueAnimationUpdate
    operator ::UnityEngine::UIElements::Experimental::IValueAnimationUpdate() noexcept {
      return *reinterpret_cast<::UnityEngine::UIElements::Experimental::IValueAnimationUpdate*>(this);
    }
    // Autogenerated static field getter
    // Get static field: static private UnityEngine.UIElements.ObjectPool`1<UnityEngine.UIElements.Experimental.ValueAnimation`1<T>> sObjectPool
    static ::UnityEngine::UIElements::ObjectPool_1<::UnityEngine::UIElements::Experimental::ValueAnimation_1<T>*>* _get_sObjectPool() {
      static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::UIElements::Experimental::ValueAnimation_1::_get_sObjectPool");
