// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Pathfinding.RVO.IAgent
#include "Pathfinding/RVO/IAgent.hpp"
// Including type: Pathfinding.RVO.RVOLayer
#include "Pathfinding/RVO/RVOLayer.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
// Including type: Pathfinding.RVO.Simulator
#include "Pathfinding/RVO/Simulator.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Pathfinding::RVO::Sampled
namespace Pathfinding::RVO::Sampled {
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Color
  struct Color;
  // Forward declaring type: Vector3
  struct Vector3;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: Pathfinding::RVO
namespace Pathfinding::RVO {
  // Forward declaring type: ObstacleVertex
  class ObstacleVertex;
}
// Completed forward declares
// Type namespace: Pathfinding.RVO.Sampled
namespace Pathfinding::RVO::Sampled {
  // Forward declaring type: Agent
  class Agent;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Pathfinding::RVO::Sampled::Agent);
DEFINE_IL2CPP_ARG_TYPE(::Pathfinding::RVO::Sampled::Agent*, "Pathfinding.RVO.Sampled", "Agent");
// Type namespace: Pathfinding.RVO.Sampled
namespace Pathfinding::RVO::Sampled {
  // Size: 0x100
  #pragma pack(push, 1)
  // Autogenerated type: Pathfinding.RVO.Sampled.Agent
  // [TokenAttribute] Offset: FFFFFFFF
  class Agent : public ::Il2CppObject/*, public ::Pathfinding::RVO::IAgent*/ {
    public:
    // Nested type: ::Pathfinding::RVO::Sampled::Agent::VO
    struct VO;
    // Nested type: ::Pathfinding::RVO::Sampled::Agent::VOBuffer
    class VOBuffer;
    public:
    // System.Single radius
    // Size: 0x4
    // Offset: 0x10
    float radius;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // System.Single height
    // Size: 0x4
    // Offset: 0x14
    float height;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // System.Single desiredSpeed
    // Size: 0x4
    // Offset: 0x18
    float desiredSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // System.Single maxSpeed
    // Size: 0x4
    // Offset: 0x1C
    float maxSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // System.Single agentTimeHorizon
    // Size: 0x4
    // Offset: 0x20
    float agentTimeHorizon;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // System.Single obstacleTimeHorizon
    // Size: 0x4
    // Offset: 0x24
    float obstacleTimeHorizon;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // System.Boolean locked
    // Size: 0x1
    // Offset: 0x28
    bool locked;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: locked and: layer
    char __padding6[0x3] = {};
    // private Pathfinding.RVO.RVOLayer layer
    // Size: 0x4
    // Offset: 0x2C
    ::Pathfinding::RVO::RVOLayer layer;
    // Field size check
    static_assert(sizeof(::Pathfinding::RVO::RVOLayer) == 0x4);
    // private Pathfinding.RVO.RVOLayer collidesWith
    // Size: 0x4
    // Offset: 0x30
    ::Pathfinding::RVO::RVOLayer collidesWith;
    // Field size check
    static_assert(sizeof(::Pathfinding::RVO::RVOLayer) == 0x4);
    // private System.Int32 maxNeighbours
    // Size: 0x4
    // Offset: 0x34
    int maxNeighbours;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // UnityEngine.Vector2 position
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::Vector2 position;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private System.Single elevationCoordinate
    // Size: 0x4
    // Offset: 0x40
    float elevationCoordinate;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector2 currentVelocity
    // Size: 0x8
    // Offset: 0x44
    ::UnityEngine::Vector2 currentVelocity;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private UnityEngine.Vector2 desiredTargetPointInVelocitySpace
    // Size: 0x8
    // Offset: 0x4C
    ::UnityEngine::Vector2 desiredTargetPointInVelocitySpace;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private UnityEngine.Vector2 desiredVelocity
    // Size: 0x8
    // Offset: 0x54
    ::UnityEngine::Vector2 desiredVelocity;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private UnityEngine.Vector2 nextTargetPoint
    // Size: 0x8
    // Offset: 0x5C
    ::UnityEngine::Vector2 nextTargetPoint;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private System.Single nextDesiredSpeed
    // Size: 0x4
    // Offset: 0x64
    float nextDesiredSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single nextMaxSpeed
    // Size: 0x4
    // Offset: 0x68
    float nextMaxSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector2 collisionNormal
    // Size: 0x8
    // Offset: 0x6C
    ::UnityEngine::Vector2 collisionNormal;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private System.Boolean manuallyControlled
    // Size: 0x1
    // Offset: 0x74
    bool manuallyControlled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean debugDraw
    // Size: 0x1
    // Offset: 0x75
    bool debugDraw;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: debugDraw and: Position
    char __padding20[0x2] = {};
    // private UnityEngine.Vector2 <Position>k__BackingField
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::Vector2 Position;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private System.Single <ElevationCoordinate>k__BackingField
    // Size: 0x4
    // Offset: 0x80
    float ElevationCoordinate;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector2 <CalculatedTargetPoint>k__BackingField
    // Size: 0x8
    // Offset: 0x84
    ::UnityEngine::Vector2 CalculatedTargetPoint;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private System.Single <CalculatedSpeed>k__BackingField
    // Size: 0x4
    // Offset: 0x8C
    float CalculatedSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean <Locked>k__BackingField
    // Size: 0x1
    // Offset: 0x90
    bool Locked;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: Locked and: Radius
    char __padding25[0x3] = {};
    // private System.Single <Radius>k__BackingField
    // Size: 0x4
    // Offset: 0x94
    float Radius;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <Height>k__BackingField
    // Size: 0x4
    // Offset: 0x98
    float Height;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <AgentTimeHorizon>k__BackingField
    // Size: 0x4
    // Offset: 0x9C
    float AgentTimeHorizon;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <ObstacleTimeHorizon>k__BackingField
    // Size: 0x4
    // Offset: 0xA0
    float ObstacleTimeHorizon;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 <MaxNeighbours>k__BackingField
    // Size: 0x4
    // Offset: 0xA4
    int MaxNeighbours;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 <NeighbourCount>k__BackingField
    // Size: 0x4
    // Offset: 0xA8
    int NeighbourCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private Pathfinding.RVO.RVOLayer <Layer>k__BackingField
    // Size: 0x4
    // Offset: 0xAC
    ::Pathfinding::RVO::RVOLayer Layer;
    // Field size check
    static_assert(sizeof(::Pathfinding::RVO::RVOLayer) == 0x4);
    // private Pathfinding.RVO.RVOLayer <CollidesWith>k__BackingField
    // Size: 0x4
    // Offset: 0xB0
    ::Pathfinding::RVO::RVOLayer CollidesWith;
    // Field size check
    static_assert(sizeof(::Pathfinding::RVO::RVOLayer) == 0x4);
    // private System.Single <Priority>k__BackingField
    // Size: 0x4
    // Offset: 0xB4
    float Priority;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Action <PreCalculationCallback>k__BackingField
    // Size: 0x8
    // Offset: 0xB8
    ::System::Action* PreCalculationCallback;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // Pathfinding.RVO.Sampled.Agent next
    // Size: 0x8
    // Offset: 0xC0
    ::Pathfinding::RVO::Sampled::Agent* next;
    // Field size check
    static_assert(sizeof(::Pathfinding::RVO::Sampled::Agent*) == 0x8);
    // private System.Single calculatedSpeed
    // Size: 0x4
    // Offset: 0xC8
    float calculatedSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector2 calculatedTargetPoint
    // Size: 0x8
    // Offset: 0xCC
    ::UnityEngine::Vector2 calculatedTargetPoint;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // Padding between fields: calculatedTargetPoint and: simulator
    char __padding38[0x4] = {};
    // Pathfinding.RVO.Simulator simulator
    // Size: 0x8
    // Offset: 0xD8
    ::Pathfinding::RVO::Simulator* simulator;
    // Field size check
    static_assert(sizeof(::Pathfinding::RVO::Simulator*) == 0x8);
    // private System.Collections.Generic.List`1<Pathfinding.RVO.Sampled.Agent> neighbours
    // Size: 0x8
    // Offset: 0xE0
    ::System::Collections::Generic::List_1<::Pathfinding::RVO::Sampled::Agent*>* neighbours;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Pathfinding::RVO::Sampled::Agent*>*) == 0x8);
    // private System.Collections.Generic.List`1<System.Single> neighbourDists
    // Size: 0x8
    // Offset: 0xE8
    ::System::Collections::Generic::List_1<float>* neighbourDists;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<float>*) == 0x8);
    // private System.Collections.Generic.List`1<Pathfinding.RVO.ObstacleVertex> obstaclesBuffered
    // Size: 0x8
    // Offset: 0xF0
    ::System::Collections::Generic::List_1<::Pathfinding::RVO::ObstacleVertex*>* obstaclesBuffered;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Pathfinding::RVO::ObstacleVertex*>*) == 0x8);
    // private System.Collections.Generic.List`1<Pathfinding.RVO.ObstacleVertex> obstacles
    // Size: 0x8
    // Offset: 0xF8
    ::System::Collections::Generic::List_1<::Pathfinding::RVO::ObstacleVertex*>* obstacles;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Pathfinding::RVO::ObstacleVertex*>*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::Pathfinding::RVO::IAgent
    operator ::Pathfinding::RVO::IAgent() noexcept {
      return *reinterpret_cast<::Pathfinding::RVO::IAgent*>(this);
    }
    // static field const value: static private System.Single DesiredVelocityWeight
    static constexpr const float DesiredVelocityWeight = 0.1;
    // Get static field: static private System.Single DesiredVelocityWeight
    static float _get_DesiredVelocityWeight();
    // Set static field: static private System.Single DesiredVelocityWeight
    static void _set_DesiredVelocityWeight(float value);
    // static field const value: static private System.Single WallWeight
    static constexpr const float WallWeight = 5;
