// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.IEquatable`1
#include "System/IEquatable_1.hpp"
// Including type: System.Runtime.Serialization.ISerializable
#include "System/Runtime/Serialization/ISerializable.hpp"
// Including type: System.Runtime.Serialization.IDeserializationCallback
#include "System/Runtime/Serialization/IDeserializationCallback.hpp"
// Including type: System.TimeSpan
#include "System/TimeSpan.hpp"
// Including type: System.DateTime
#include "System/DateTime.hpp"
// Including type: Interop/Sys
#include "GlobalNamespace/Interop_Sys.hpp"
// Including type: System.Runtime.Serialization.StreamingContext
#include "System/Runtime/Serialization/StreamingContext.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Predicate`1<T>
  template<typename T>
  class Predicate_1;
  // Skipping declaration: TZifType because it is already included!
  // Forward declaring type: Nullable`1<T>
  template<typename T>
  struct Nullable_1;
  // Forward declaring type: DayOfWeek
  struct DayOfWeek;
  // Forward declaring type: Func`2<T, TResult>
  template<typename T, typename TResult>
  class Func_2;
  // Forward declaring type: TimeZoneInfoOptions
  struct TimeZoneInfoOptions;
}
// Forward declaring namespace: System::Runtime::Serialization
namespace System::Runtime::Serialization {
  // Forward declaring type: SerializationInfo
  class SerializationInfo;
}
// Forward declaring namespace: System::Globalization
namespace System::Globalization {
  // Forward declaring type: DaylightTimeStruct
  struct DaylightTimeStruct;
}
// Completed forward declares
// Type namespace: System
namespace System {
  // Forward declaring type: TimeZoneInfo
  class TimeZoneInfo;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::TimeZoneInfo);
DEFINE_IL2CPP_ARG_TYPE(::System::TimeZoneInfo*, "System", "TimeZoneInfo");
// Type namespace: System
namespace System {
  // Size: 0x48
  #pragma pack(push, 1)
  // Autogenerated type: System.TimeZoneInfo
  // [TokenAttribute] Offset: FFFFFFFF
  // [TypeForwardedFromAttribute] Offset: FFFFFFFF
  class TimeZoneInfo : public ::Il2CppObject/*, public ::System::IEquatable_1<::System::TimeZoneInfo*>, public ::System::Runtime::Serialization::ISerializable, public ::System::Runtime::Serialization::IDeserializationCallback*/ {
    public:
    // Nested type: ::System::TimeZoneInfo::TZifType
    struct TZifType;
    // Nested type: ::System::TimeZoneInfo::TZifHead
    struct TZifHead;
    // Nested type: ::System::TimeZoneInfo::TZVersion
    struct TZVersion;
    // Nested type: ::System::TimeZoneInfo::AdjustmentRule
    class AdjustmentRule;
    // Nested type: ::System::TimeZoneInfo::TransitionTime
    struct TransitionTime;
    // Nested type: ::System::TimeZoneInfo::CachedData
    class CachedData;
    // Nested type: ::System::TimeZoneInfo::$$c__DisplayClass16_0
    class $$c__DisplayClass16_0;
    // Nested type: ::System::TimeZoneInfo::$$c
    class $$c;
    // Size: 0xA
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: System.TimeZoneInfo/TZifType
    // [TokenAttribute] Offset: FFFFFFFF
    struct TZifType/*, public ::System::ValueType*/ {
      public:
      public:
      // public readonly System.TimeSpan UtcOffset
      // Size: 0x8
      // Offset: 0x0
      ::System::TimeSpan UtcOffset;
      // Field size check
      static_assert(sizeof(::System::TimeSpan) == 0x8);
      // public readonly System.Boolean IsDst
      // Size: 0x1
      // Offset: 0x8
      bool IsDst;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // public readonly System.Byte AbbreviationIndex
      // Size: 0x1
      // Offset: 0x9
      uint8_t AbbreviationIndex;
      // Field size check
      static_assert(sizeof(uint8_t) == 0x1);
      public:
      // Creating value type constructor for type: TZifType
      constexpr TZifType(::System::TimeSpan UtcOffset_ = {}, bool IsDst_ = {}, uint8_t AbbreviationIndex_ = {}) noexcept : UtcOffset{UtcOffset_}, IsDst{IsDst_}, AbbreviationIndex{AbbreviationIndex_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public readonly System.TimeSpan UtcOffset
      [[deprecated("Use field access instead!")]] ::System::TimeSpan& dyn_UtcOffset();
      // Get instance field reference: public readonly System.Boolean IsDst
      [[deprecated("Use field access instead!")]] bool& dyn_IsDst();
      // Get instance field reference: public readonly System.Byte AbbreviationIndex
      [[deprecated("Use field access instead!")]] uint8_t& dyn_AbbreviationIndex();
      // public System.Void .ctor(System.Byte[] data, System.Int32 index)
      // Offset: 0x45B1548
      TZifType(::ArrayW<uint8_t> data, int index);
    }; // System.TimeZoneInfo/TZifType
    #pragma pack(pop)
    static check_size<sizeof(TimeZoneInfo::TZifType), 9 + sizeof(uint8_t)> __System_TimeZoneInfo_TZifTypeSizeCheck;
    static_assert(sizeof(TimeZoneInfo::TZifType) == 0xA);
    public:
    // private readonly System.String _id
    // Size: 0x8
    // Offset: 0x10
    ::StringW id;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private readonly System.String _displayName
    // Size: 0x8
    // Offset: 0x18
    ::StringW displayName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private readonly System.String _standardDisplayName
    // Size: 0x8
    // Offset: 0x20
    ::StringW standardDisplayName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private readonly System.String _daylightDisplayName
    // Size: 0x8
    // Offset: 0x28
    ::StringW daylightDisplayName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private readonly System.TimeSpan _baseUtcOffset
    // Size: 0x8
    // Offset: 0x30
    ::System::TimeSpan baseUtcOffset;
    // Field size check
    static_assert(sizeof(::System::TimeSpan) == 0x8);
    // private readonly System.Boolean _supportsDaylightSavingTime
    // Size: 0x1
    // Offset: 0x38
    bool supportsDaylightSavingTime;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: supportsDaylightSavingTime and: adjustmentRules
    char __padding5[0x7] = {};
    // private readonly System.TimeZoneInfo/AdjustmentRule[] _adjustmentRules
    // Size: 0x8
    // Offset: 0x40
    ::ArrayW<::System::TimeZoneInfo::AdjustmentRule*> adjustmentRules;
    // Field size check
    static_assert(sizeof(::ArrayW<::System::TimeZoneInfo::AdjustmentRule*>) == 0x8);
    public:
    // Creating interface conversion operator: operator ::System::IEquatable_1<::System::TimeZoneInfo*>
    operator ::System::IEquatable_1<::System::TimeZoneInfo*>() noexcept {
      return *reinterpret_cast<::System::IEquatable_1<::System::TimeZoneInfo*>*>(this);
    }
    // Creating interface conversion operator: operator ::System::Runtime::Serialization::ISerializable
    operator ::System::Runtime::Serialization::ISerializable() noexcept {
      return *reinterpret_cast<::System::Runtime::Serialization::ISerializable*>(this);
    }
    // Creating interface conversion operator: operator ::System::Runtime::Serialization::IDeserializationCallback
    operator ::System::Runtime::Serialization::IDeserializationCallback() noexcept {
