// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: System.Buffers.StandardFormat
#include "System/Buffers/StandardFormat.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
// Completed includes
// Type namespace: Cysharp.Text
namespace Cysharp::Text {
  // Forward declaring type: Utf8FormatSegment
  struct Utf8FormatSegment;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::Cysharp::Text::Utf8FormatSegment, "Cysharp.Text", "Utf8FormatSegment");
// Type namespace: Cysharp.Text
namespace Cysharp::Text {
  // Size: 0x14
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: Cysharp.Text.Utf8FormatSegment
  // [TokenAttribute] Offset: FFFFFFFF
  // [IsReadOnlyAttribute] Offset: FFFFFFFF
  struct Utf8FormatSegment/*, public ::System::ValueType*/ {
    public:
    public:
    // public readonly System.Int32 Offset
    // Size: 0x4
    // Offset: 0x0
    int Offset;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public readonly System.Int32 Count
    // Size: 0x4
    // Offset: 0x4
    int Count;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public readonly System.Int32 FormatIndex
    // Size: 0x4
    // Offset: 0x8
    int FormatIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public readonly System.Buffers.StandardFormat StandardFormat
    // Size: 0x2
    // Offset: 0xC
    ::System::Buffers::StandardFormat StandardFormat;
    // Field size check
    static_assert(sizeof(::System::Buffers::StandardFormat) == 0x2);
    // Padding between fields: StandardFormat and: Alignment
    char __padding3[0x2] = {};
    // public readonly System.Int32 Alignment
    // Size: 0x4
    // Offset: 0x10
    int Alignment;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Creating value type constructor for type: Utf8FormatSegment
    constexpr Utf8FormatSegment(int Offset_ = {}, int Count_ = {}, int FormatIndex_ = {}, ::System::Buffers::StandardFormat StandardFormat_ = {}, int Alignment_ = {}) noexcept : Offset{Offset_}, Count{Count_}, FormatIndex{FormatIndex_}, StandardFormat{StandardFormat_}, Alignment{Alignment_} {}
    // Creating interface conversion operator: operator ::System::ValueType
    operator ::System::ValueType() noexcept {
      return *reinterpret_cast<::System::ValueType*>(this);
    }
    // static field const value: static public System.Int32 NotFormatIndex
    static constexpr const int NotFormatIndex = -1;
    // Get static field: static public System.Int32 NotFormatIndex
    static int _get_NotFormatIndex();
    // Set static field: static public System.Int32 NotFormatIndex
    static void _set_NotFormatIndex(int value);
    // Get instance field reference: public readonly System.Int32 Offset
    [[deprecated("Use field access instead!")]] int& dyn_Offset();
    // Get instance field reference: public readonly System.Int32 Count
    [[deprecated("Use field access instead!")]] int& dyn_Count();
    // Get instance field reference: public readonly System.Int32 FormatIndex
    [[deprecated("Use field access instead!")]] int& dyn_FormatIndex();
    // Get instance field reference: public readonly System.Buffers.StandardFormat StandardFormat
    [[deprecated("Use field access instead!")]] ::System::Buffers::StandardFormat& dyn_StandardFormat();
    // Get instance field reference: public readonly System.Int32 Alignment
    [[deprecated("Use field access instead!")]] int& dyn_Alignment();
    // public System.Boolean get_IsFormatArgument()
    // Offset: 0x576139C
    bool get_IsFormatArgument();
    // public System.Void .ctor(System.Int32 offset, System.Int32 count, System.Int32 formatIndex, System.Buffers.StandardFormat format, System.Int32 alignment)
    // Offset: 0x5761388
    // ABORTED: conflicts with another method.  Utf8FormatSegment(int offset, int count, int formatIndex, ::System::Buffers::StandardFormat format, int alignment);
  }; // Cysharp.Text.Utf8FormatSegment
  #pragma pack(pop)
  static check_size<sizeof(Utf8FormatSegment), 16 + sizeof(int)> __Cysharp_Text_Utf8FormatSegmentSizeCheck;
  static_assert(sizeof(Utf8FormatSegment) == 0x14);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Cysharp::Text::Utf8FormatSegment::get_IsFormatArgument
// Il2CppName: get_IsFormatArgument
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (Cysharp::Text::Utf8FormatSegment::*)()>(&Cysharp::Text::Utf8FormatSegment::get_IsFormatArgument)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Cysharp::Text::Utf8FormatSegment), "get_IsFormatArgument", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Cysharp::Text::Utf8FormatSegment::Utf8FormatSegment
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
