// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: VYaml.Emitter.EmitState
#include "VYaml/Emitter/EmitState.hpp"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Buffers
namespace System::Buffers {
  // Forward declaring type: IBufferWriter`1<T>
  template<typename T>
  class IBufferWriter_1;
}
// Forward declaring namespace: VYaml::Emitter
namespace VYaml::Emitter {
  // Forward declaring type: YamlEmitOptions
  class YamlEmitOptions;
  // Forward declaring type: SequenceStyle
  struct SequenceStyle;
  // Forward declaring type: MappingStyle
  struct MappingStyle;
  // Forward declaring type: ScalarStyle
  struct ScalarStyle;
}
// Forward declaring namespace: VYaml::Internal
namespace VYaml::Internal {
  // Forward declaring type: ExpandBuffer`1<T>
  template<typename T>
  class ExpandBuffer_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: ReadOnlySpan`1<T>
  template<typename T>
  struct ReadOnlySpan_1;
  // Forward declaring type: Span`1<T>
  template<typename T>
  struct Span_1;
}
// Completed forward declares
// Type namespace: VYaml.Emitter
namespace VYaml::Emitter {
  // Forward declaring type: Utf8YamlEmitter
  struct Utf8YamlEmitter;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::VYaml::Emitter::Utf8YamlEmitter, "VYaml.Emitter", "Utf8YamlEmitter");
// Type namespace: VYaml.Emitter
namespace VYaml::Emitter {
  // Size: 0x38
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: VYaml.Emitter.Utf8YamlEmitter
  // [TokenAttribute] Offset: FFFFFFFF
  // [IsByRefLikeAttribute] Offset: FFFFFFFF
  // [ObsoleteAttribute] Offset: FFFFFFFF
  // [NullableContextAttribute] Offset: FFFFFFFF
  // [NullableAttribute] Offset: FFFFFFFF
  struct Utf8YamlEmitter/*, public ::System::ValueType*/ {
    public:
    public:
    // private readonly System.Buffers.IBufferWriter`1<System.Byte> writer
    // Size: 0x8
    // Offset: 0x0
    ::System::Buffers::IBufferWriter_1<uint8_t>* writer;
    // Field size check
    static_assert(sizeof(::System::Buffers::IBufferWriter_1<uint8_t>*) == 0x8);
    // private readonly VYaml.Emitter.YamlEmitOptions options
    // Size: 0x8
    // Offset: 0x8
    ::VYaml::Emitter::YamlEmitOptions* options;
    // Field size check
    static_assert(sizeof(::VYaml::Emitter::YamlEmitOptions*) == 0x8);
    // private readonly VYaml.Internal.ExpandBuffer`1<System.Char> stringBuffer
    // Size: 0x8
    // Offset: 0x10
    ::VYaml::Internal::ExpandBuffer_1<::Il2CppChar>* stringBuffer;
    // Field size check
    static_assert(sizeof(::VYaml::Internal::ExpandBuffer_1<::Il2CppChar>*) == 0x8);
    // private readonly VYaml.Internal.ExpandBuffer`1<VYaml.Emitter.EmitState> stateStack
    // Size: 0x8
    // Offset: 0x18
    ::VYaml::Internal::ExpandBuffer_1<::VYaml::Emitter::EmitState>* stateStack;
    // Field size check
    static_assert(sizeof(::VYaml::Internal::ExpandBuffer_1<::VYaml::Emitter::EmitState>*) == 0x8);
    // private readonly VYaml.Internal.ExpandBuffer`1<System.Int32> elementCountStack
    // Size: 0x8
    // Offset: 0x20
    ::VYaml::Internal::ExpandBuffer_1<int>* elementCountStack;
    // Field size check
    static_assert(sizeof(::VYaml::Internal::ExpandBuffer_1<int>*) == 0x8);
    // private readonly VYaml.Internal.ExpandBuffer`1<System.String> tagStack
    // Size: 0x8
    // Offset: 0x28
    ::VYaml::Internal::ExpandBuffer_1<::StringW>* tagStack;
    // Field size check
    static_assert(sizeof(::VYaml::Internal::ExpandBuffer_1<::StringW>*) == 0x8);
    // private System.Int32 currentIndentLevel
    // Size: 0x4
    // Offset: 0x30
    int currentIndentLevel;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 currentElementCount
    // Size: 0x4
    // Offset: 0x34
    int currentElementCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Creating value type constructor for type: Utf8YamlEmitter
    constexpr Utf8YamlEmitter(::System::Buffers::IBufferWriter_1<uint8_t>* writer_ = {}, ::VYaml::Emitter::YamlEmitOptions* options_ = {}, ::VYaml::Internal::ExpandBuffer_1<::Il2CppChar>* stringBuffer_ = {}, ::VYaml::Internal::ExpandBuffer_1<::VYaml::Emitter::EmitState>* stateStack_ = {}, ::VYaml::Internal::ExpandBuffer_1<int>* elementCountStack_ = {}, ::VYaml::Internal::ExpandBuffer_1<::StringW>* tagStack_ = {}, int currentIndentLevel_ = {}, int currentElementCount_ = {}) noexcept : writer{writer_}, options{options_}, stringBuffer{stringBuffer_}, stateStack{stateStack_}, elementCountStack{elementCountStack_}, tagStack{tagStack_}, currentIndentLevel{currentIndentLevel_}, currentElementCount{currentElementCount_} {}
    // Creating interface conversion operator: operator ::System::ValueType
