// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.RenderTextureDescriptor
#include "UnityEngine/RenderTextureDescriptor.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: UnityEngine.Matrix4x4
#include "UnityEngine/Matrix4x4.hpp"
// Including type: UnityEngine.Rendering.Universal.CameraRenderType
#include "UnityEngine/Rendering/Universal/CameraRenderType.hpp"
// Including type: UnityEngine.Rect
#include "UnityEngine/Rect.hpp"
// Including type: UnityEngine.Vector4
#include "UnityEngine/Vector4.hpp"
// Including type: UnityEngine.Rendering.Universal.ImageScalingMode
#include "UnityEngine/Rendering/Universal/ImageScalingMode.hpp"
// Including type: UnityEngine.Rendering.Universal.ImageUpscalingFilter
#include "UnityEngine/Rendering/Universal/ImageUpscalingFilter.hpp"
// Including type: UnityEngine.Rendering.Universal.HDRColorBufferPrecision
#include "UnityEngine/Rendering/Universal/HDRColorBufferPrecision.hpp"
// Including type: UnityEngine.CameraType
#include "UnityEngine/CameraType.hpp"
// Including type: UnityEngine.Rendering.SortingCriteria
#include "UnityEngine/Rendering/SortingCriteria.hpp"
// Including type: UnityEngine.Rendering.RenderTargetIdentifier
#include "UnityEngine/Rendering/RenderTargetIdentifier.hpp"
// Including type: UnityEngine.LayerMask
#include "UnityEngine/LayerMask.hpp"
// Including type: UnityEngine.Rendering.Universal.AntialiasingMode
#include "UnityEngine/Rendering/Universal/AntialiasingMode.hpp"
// Including type: UnityEngine.Rendering.Universal.AntialiasingQuality
#include "UnityEngine/Rendering/Universal/AntialiasingQuality.hpp"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: UnityEngine.Rendering.Universal.TemporalAA/Settings
#include "UnityEngine/Rendering/Universal/TemporalAA_Settings.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Camera
  class Camera;
  // Forward declaring type: RenderTexture
  class RenderTexture;
  // Forward declaring type: Transform
  class Transform;
}
// Forward declaring namespace: UnityEngine::Experimental::Rendering
namespace UnityEngine::Experimental::Rendering {
  // Forward declaring type: XRPass
  class XRPass;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: IEnumerator`1<T>
  template<typename T>
  class IEnumerator_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
}
// Forward declaring namespace: UnityEngine::Rendering
namespace UnityEngine::Rendering {
  // Forward declaring type: CommandBuffer
  class CommandBuffer;
  // Forward declaring type: RTHandle
  class RTHandle;
}
// Forward declaring namespace: UnityEngine::Rendering::Universal
namespace UnityEngine::Rendering::Universal {
  // Forward declaring type: ScriptableRenderer
  class ScriptableRenderer;
  // Forward declaring type: TaaPersistentData
  class TaaPersistentData;
  // Forward declaring type: XRPassUniversal
  class XRPassUniversal;
}
// Completed forward declares
// Type namespace: UnityEngine.Rendering.Universal
namespace UnityEngine::Rendering::Universal {
  // Forward declaring type: CameraData
  struct CameraData;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::Rendering::Universal::CameraData, "UnityEngine.Rendering.Universal", "CameraData");
// Type namespace: UnityEngine.Rendering.Universal
namespace UnityEngine::Rendering::Universal {
  // Size: 0x210
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: UnityEngine.Rendering.Universal.CameraData
  // [TokenAttribute] Offset: FFFFFFFF
  struct CameraData/*, public ::System::ValueType*/ {
    public:
    public:
    // private UnityEngine.Matrix4x4 m_ViewMatrix
    // Size: 0x40
    // Offset: 0x0
    ::UnityEngine::Matrix4x4 m_ViewMatrix;
    // Field size check
    static_assert(sizeof(::UnityEngine::Matrix4x4) == 0x40);
    // private UnityEngine.Matrix4x4 m_ProjectionMatrix
    // Size: 0x40
    // Offset: 0x40
    ::UnityEngine::Matrix4x4 m_ProjectionMatrix;
    // Field size check
    static_assert(sizeof(::UnityEngine::Matrix4x4) == 0x40);
    // private UnityEngine.Matrix4x4 m_JitterMatrix
    // Size: 0x40
    // Offset: 0x80
    ::UnityEngine::Matrix4x4 m_JitterMatrix;
    // Field size check
    static_assert(sizeof(::UnityEngine::Matrix4x4) == 0x40);
    // public UnityEngine.Camera camera
    // Size: 0x8
    // Offset: 0xC0
    ::UnityEngine::Camera* camera;
    // Field size check
    static_assert(sizeof(::UnityEngine::Camera*) == 0x8);
    // public UnityEngine.Rendering.Universal.CameraRenderType renderType
    // Size: 0x4
    // Offset: 0xC8
    ::UnityEngine::Rendering::Universal::CameraRenderType renderType;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::CameraRenderType) == 0x4);
    // Padding between fields: renderType and: targetTexture
    char __padding4[0x4] = {};
    // public UnityEngine.RenderTexture targetTexture
    // Size: 0x8
    // Offset: 0xD0
    ::UnityEngine::RenderTexture* targetTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::RenderTexture*) == 0x8);
    // public UnityEngine.RenderTextureDescriptor cameraTargetDescriptor
    // Size: 0x34
    // Offset: 0xD8
    ::UnityEngine::RenderTextureDescriptor cameraTargetDescriptor;
    // Field size check
    static_assert(sizeof(::UnityEngine::RenderTextureDescriptor) == 0x34);
    // UnityEngine.Rect pixelRect
    // Size: 0x10
    // Offset: 0x10C
    ::UnityEngine::Rect pixelRect;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rect) == 0x10);
    // System.Boolean useScreenCoordOverride
    // Size: 0x1
    // Offset: 0x11C
    bool useScreenCoordOverride;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: useScreenCoordOverride and: screenSizeOverride
    char __padding8[0x3] = {};
    // UnityEngine.Vector4 screenSizeOverride
    // Size: 0x10
    // Offset: 0x120
    ::UnityEngine::Vector4 screenSizeOverride;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector4) == 0x10);
    // UnityEngine.Vector4 screenCoordScaleBias
    // Size: 0x10
    // Offset: 0x130
    ::UnityEngine::Vector4 screenCoordScaleBias;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector4) == 0x10);
    // System.Int32 pixelWidth
    // Size: 0x4
    // Offset: 0x140
    int pixelWidth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 pixelHeight
    // Size: 0x4
    // Offset: 0x144
    int pixelHeight;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Single aspectRatio
    // Size: 0x4
    // Offset: 0x148
    float aspectRatio;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single renderScale
    // Size: 0x4
    // Offset: 0x14C
    float renderScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // UnityEngine.Rendering.Universal.ImageScalingMode imageScalingMode
    // Size: 0x4
    // Offset: 0x150
    ::UnityEngine::Rendering::Universal::ImageScalingMode imageScalingMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::ImageScalingMode) == 0x4);
    // UnityEngine.Rendering.Universal.ImageUpscalingFilter upscalingFilter
    // Size: 0x4
    // Offset: 0x154
    ::UnityEngine::Rendering::Universal::ImageUpscalingFilter upscalingFilter;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::ImageUpscalingFilter) == 0x4);
    // System.Boolean fsrOverrideSharpness
    // Size: 0x1
    // Offset: 0x158
    bool fsrOverrideSharpness;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: fsrOverrideSharpness and: fsrSharpness
    char __padding17[0x3] = {};
    // System.Single fsrSharpness
    // Size: 0x4
    // Offset: 0x15C
    float fsrSharpness;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // UnityEngine.Rendering.Universal.HDRColorBufferPrecision hdrColorBufferPrecision
    // Size: 0x4
    // Offset: 0x160
    ::UnityEngine::Rendering::Universal::HDRColorBufferPrecision hdrColorBufferPrecision;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::HDRColorBufferPrecision) == 0x4);
    // public System.Boolean clearDepth
    // Size: 0x1
    // Offset: 0x164
    bool clearDepth;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: clearDepth and: cameraType
    char __padding20[0x3] = {};
    // public UnityEngine.CameraType cameraType
    // Size: 0x4
    // Offset: 0x168
    ::UnityEngine::CameraType cameraType;
    // Field size check
    static_assert(sizeof(::UnityEngine::CameraType) == 0x4);
    // public System.Boolean isDefaultViewport
    // Size: 0x1
    // Offset: 0x16C
    bool isDefaultViewport;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean isHdrEnabled
    // Size: 0x1
    // Offset: 0x16D
    bool isHdrEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean allowHDROutput
    // Size: 0x1
    // Offset: 0x16E
    bool allowHDROutput;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean requiresDepthTexture
    // Size: 0x1
    // Offset: 0x16F
    bool requiresDepthTexture;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean requiresOpaqueTexture
    // Size: 0x1
    // Offset: 0x170
    bool requiresOpaqueTexture;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean postProcessingRequiresDepthTexture
    // Size: 0x1
    // Offset: 0x171
    bool postProcessingRequiresDepthTexture;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean xrRendering
    // Size: 0x1
    // Offset: 0x172
    bool xrRendering;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: xrRendering and: defaultOpaqueSortFlags
    char __padding28[0x1] = {};
    // public UnityEngine.Rendering.SortingCriteria defaultOpaqueSortFlags
    // Size: 0x4
    // Offset: 0x174
    ::UnityEngine::Rendering::SortingCriteria defaultOpaqueSortFlags;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::SortingCriteria) == 0x4);
    // private UnityEngine.Experimental.Rendering.XRPass <xr>k__BackingField
    // Size: 0x8
    // Offset: 0x178
    ::UnityEngine::Experimental::Rendering::XRPass* xr;
    // Field size check
    static_assert(sizeof(::UnityEngine::Experimental::Rendering::XRPass*) == 0x8);
    // public System.Boolean isStereoEnabled
    // Size: 0x1
    // Offset: 0x180
    bool isStereoEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isStereoEnabled and: maxShadowDistance
    char __padding31[0x3] = {};
    // public System.Single maxShadowDistance
    // Size: 0x4
    // Offset: 0x184
    float maxShadowDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean postProcessEnabled
    // Size: 0x1
    // Offset: 0x188
    bool postProcessEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: postProcessEnabled and: captureActions
    char __padding33[0x7] = {};
    // public System.Collections.Generic.IEnumerator`1<System.Action`2<UnityEngine.Rendering.RenderTargetIdentifier,UnityEngine.Rendering.CommandBuffer>> captureActions
    // Size: 0x8
    // Offset: 0x190
    ::System::Collections::Generic::IEnumerator_1<::System::Action_2<::UnityEngine::Rendering::RenderTargetIdentifier, ::UnityEngine::Rendering::CommandBuffer*>*>* captureActions;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::IEnumerator_1<::System::Action_2<::UnityEngine::Rendering::RenderTargetIdentifier, ::UnityEngine::Rendering::CommandBuffer*>*>*) == 0x8);
    // public UnityEngine.LayerMask volumeLayerMask
    // Size: 0x4
    // Offset: 0x198
    ::UnityEngine::LayerMask volumeLayerMask;
    // Field size check
    static_assert(sizeof(::UnityEngine::LayerMask) == 0x4);
    // Padding between fields: volumeLayerMask and: volumeTrigger
    char __padding35[0x4] = {};
    // public UnityEngine.Transform volumeTrigger
    // Size: 0x8
    // Offset: 0x1A0
    ::UnityEngine::Transform* volumeTrigger;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public System.Boolean isStopNaNEnabled
    // Size: 0x1
    // Offset: 0x1A8
    bool isStopNaNEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean isDitheringEnabled
    // Size: 0x1
    // Offset: 0x1A9
    bool isDitheringEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isDitheringEnabled and: antialiasing
    char __padding38[0x2] = {};
    // public UnityEngine.Rendering.Universal.AntialiasingMode antialiasing
    // Size: 0x4
    // Offset: 0x1AC
    ::UnityEngine::Rendering::Universal::AntialiasingMode antialiasing;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::AntialiasingMode) == 0x4);
    // public UnityEngine.Rendering.Universal.AntialiasingQuality antialiasingQuality
    // Size: 0x4
    // Offset: 0x1B0
    ::UnityEngine::Rendering::Universal::AntialiasingQuality antialiasingQuality;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::AntialiasingQuality) == 0x4);
    // Padding between fields: antialiasingQuality and: renderer
    char __padding40[0x4] = {};
    // public UnityEngine.Rendering.Universal.ScriptableRenderer renderer
    // Size: 0x8
    // Offset: 0x1B8
    ::UnityEngine::Rendering::Universal::ScriptableRenderer* renderer;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::ScriptableRenderer*) == 0x8);
    // public System.Boolean resolveFinalTarget
    // Size: 0x1
    // Offset: 0x1C0
    bool resolveFinalTarget;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: resolveFinalTarget and: worldSpaceCameraPos
    char __padding42[0x3] = {};
    // public UnityEngine.Vector3 worldSpaceCameraPos
    // Size: 0xC
    // Offset: 0x1C4
    ::UnityEngine::Vector3 worldSpaceCameraPos;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Color backgroundColor
    // Size: 0x10
    // Offset: 0x1D0
    ::UnityEngine::Color backgroundColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // UnityEngine.Rendering.Universal.TaaPersistentData taaPersistentData
    // Size: 0x8
    // Offset: 0x1E0
    ::UnityEngine::Rendering::Universal::TaaPersistentData* taaPersistentData;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::TaaPersistentData*) == 0x8);
    // UnityEngine.Rendering.Universal.TemporalAA/Settings taaSettings
    // Size: 0x20
    // Offset: 0x1E8
    ::UnityEngine::Rendering::Universal::TemporalAA::Settings taaSettings;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::TemporalAA::Settings) == 0x20);
    // public UnityEngine.Camera baseCamera
    // Size: 0x8
    // Offset: 0x208
    ::UnityEngine::Camera* baseCamera;
    // Field size check
    static_assert(sizeof(::UnityEngine::Camera*) == 0x8);
    public:
    // Creating value type constructor for type: CameraData
