// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.Rendering.Universal.ClipperBase
#include "UnityEngine/Rendering/Universal/ClipperBase.hpp"
// Including type: UnityEngine.Rendering.Universal.ClipType
#include "UnityEngine/Rendering/Universal/ClipType.hpp"
// Including type: UnityEngine.Rendering.Universal.PolyFillType
#include "UnityEngine/Rendering/Universal/PolyFillType.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::Rendering::Universal
namespace UnityEngine::Rendering::Universal {
  // Forward declaring type: Maxima
  class Maxima;
  // Forward declaring type: TEdge
  class TEdge;
  // Forward declaring type: IntersectNode
  class IntersectNode;
  // Forward declaring type: Join
  class Join;
  // Forward declaring type: PolyTree
  class PolyTree;
  // Forward declaring type: OutRec
  class OutRec;
  // Forward declaring type: OutPt
  class OutPt;
  // Forward declaring type: Direction
  struct Direction;
  // Forward declaring type: PolyNode
  class PolyNode;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: IComparer`1<T>
  template<typename T>
  class IComparer_1;
}
// Completed forward declares
// Type namespace: UnityEngine.Rendering.Universal
namespace UnityEngine::Rendering::Universal {
  // Forward declaring type: Clipper
  class Clipper;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::Rendering::Universal::Clipper);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::Rendering::Universal::Clipper*, "UnityEngine.Rendering.Universal", "Clipper");
// Type namespace: UnityEngine.Rendering.Universal
namespace UnityEngine::Rendering::Universal {
  // Size: 0x92
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.Rendering.Universal.Clipper
  // [TokenAttribute] Offset: FFFFFFFF
  class Clipper : public ::UnityEngine::Rendering::Universal::ClipperBase {
    public:
    // Writing base type padding for base size: 0x43 to desired offset: 0x44
    char ___base_padding[0x1] = {};
    // Nested type: ::UnityEngine::Rendering::Universal::Clipper::NodeType
    struct NodeType;
    public:
    // private UnityEngine.Rendering.Universal.ClipType m_ClipType
    // Size: 0x4
    // Offset: 0x44
    ::UnityEngine::Rendering::Universal::ClipType m_ClipType;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::ClipType) == 0x4);
    // private UnityEngine.Rendering.Universal.Maxima m_Maxima
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::Rendering::Universal::Maxima* m_Maxima;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::Maxima*) == 0x8);
    // private UnityEngine.Rendering.Universal.TEdge m_SortedEdges
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::Rendering::Universal::TEdge* m_SortedEdges;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::TEdge*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.Rendering.Universal.IntersectNode> m_IntersectList
    // Size: 0x8
    // Offset: 0x58
    ::System::Collections::Generic::List_1<::UnityEngine::Rendering::Universal::IntersectNode*>* m_IntersectList;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Rendering::Universal::IntersectNode*>*) == 0x8);
    // private System.Collections.Generic.IComparer`1<UnityEngine.Rendering.Universal.IntersectNode> m_IntersectNodeComparer
    // Size: 0x8
    // Offset: 0x60
    ::System::Collections::Generic::IComparer_1<::UnityEngine::Rendering::Universal::IntersectNode*>* m_IntersectNodeComparer;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::IComparer_1<::UnityEngine::Rendering::Universal::IntersectNode*>*) == 0x8);
    // private System.Boolean m_ExecuteLocked
    // Size: 0x1
    // Offset: 0x68
    bool m_ExecuteLocked;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_ExecuteLocked and: m_ClipFillType
    char __padding5[0x3] = {};
    // private UnityEngine.Rendering.Universal.PolyFillType m_ClipFillType
    // Size: 0x4
    // Offset: 0x6C
    ::UnityEngine::Rendering::Universal::PolyFillType m_ClipFillType;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::PolyFillType) == 0x4);
    // private UnityEngine.Rendering.Universal.PolyFillType m_SubjFillType
    // Size: 0x4
    // Offset: 0x70
    ::UnityEngine::Rendering::Universal::PolyFillType m_SubjFillType;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::PolyFillType) == 0x4);
    // Padding between fields: m_SubjFillType and: m_Joins
    char __padding7[0x4] = {};
    // private System.Collections.Generic.List`1<UnityEngine.Rendering.Universal.Join> m_Joins
    // Size: 0x8
    // Offset: 0x78
    ::System::Collections::Generic::List_1<::UnityEngine::Rendering::Universal::Join*>* m_Joins;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Rendering::Universal::Join*>*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.Rendering.Universal.Join> m_GhostJoins
    // Size: 0x8
    // Offset: 0x80
    ::System::Collections::Generic::List_1<::UnityEngine::Rendering::Universal::Join*>* m_GhostJoins;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Rendering::Universal::Join*>*) == 0x8);
    // private System.Boolean m_UsingPolyTree
    // Size: 0x1
    // Offset: 0x88
    bool m_UsingPolyTree;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_UsingPolyTree and: LastIndex
    char __padding10[0x3] = {};
    // private System.Int32 <LastIndex>k__BackingField
    // Size: 0x4
    // Offset: 0x8C
    int LastIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean <ReverseSolution>k__BackingField
    // Size: 0x1
    // Offset: 0x90
    bool ReverseSolution;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <StrictlySimple>k__BackingField
    // Size: 0x1
    // Offset: 0x91
    bool StrictlySimple;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // static field const value: static public System.Int32 ioReverseSolution
    static constexpr const int ioReverseSolution = 1;
    // Get static field: static public System.Int32 ioReverseSolution
    static int _get_ioReverseSolution();
    // Set static field: static public System.Int32 ioReverseSolution
    static void _set_ioReverseSolution(int value);
    // static field const value: static public System.Int32 ioStrictlySimple
    static constexpr const int ioStrictlySimple = 2;
    // Get static field: static public System.Int32 ioStrictlySimple
    static int _get_ioStrictlySimple();
    // Set static field: static public System.Int32 ioStrictlySimple
    static void _set_ioStrictlySimple(int value);
    // static field const value: static public System.Int32 ioPreserveCollinear
    static constexpr const int ioPreserveCollinear = 4;
