// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Double
#include "System/Double.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
// Including type: System.Int64
#include "System/Int64.hpp"
// Including type: UnityEngine.Rendering.Universal.IntPoint
#include "UnityEngine/Rendering/Universal/IntPoint.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::Rendering::Universal
namespace UnityEngine::Rendering::Universal {
  // Forward declaring type: LocalMinima
  class LocalMinima;
  // Forward declaring type: TEdge
  class TEdge;
  // Forward declaring type: Scanbeam
  class Scanbeam;
  // Forward declaring type: OutRec
  class OutRec;
  // Forward declaring type: IntRect
  struct IntRect;
  // Forward declaring type: OutPt
  class OutPt;
  // Forward declaring type: PolyType
  struct PolyType;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: UnityEngine.Rendering.Universal
namespace UnityEngine::Rendering::Universal {
  // Forward declaring type: ClipperBase
  class ClipperBase;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::Rendering::Universal::ClipperBase);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::Rendering::Universal::ClipperBase*, "UnityEngine.Rendering.Universal", "ClipperBase");
// Type namespace: UnityEngine.Rendering.Universal
namespace UnityEngine::Rendering::Universal {
  // Size: 0x43
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.Rendering.Universal.ClipperBase
  // [TokenAttribute] Offset: FFFFFFFF
  class ClipperBase : public ::Il2CppObject {
    public:
    public:
    // UnityEngine.Rendering.Universal.LocalMinima m_MinimaList
    // Size: 0x8
    // Offset: 0x10
    ::UnityEngine::Rendering::Universal::LocalMinima* m_MinimaList;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::LocalMinima*) == 0x8);
    // UnityEngine.Rendering.Universal.LocalMinima m_CurrentLM
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::Rendering::Universal::LocalMinima* m_CurrentLM;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::LocalMinima*) == 0x8);
    // System.Collections.Generic.List`1<System.Collections.Generic.List`1<UnityEngine.Rendering.Universal.TEdge>> m_edges
    // Size: 0x8
    // Offset: 0x20
    ::System::Collections::Generic::List_1<::System::Collections::Generic::List_1<::UnityEngine::Rendering::Universal::TEdge*>*>* m_edges;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::System::Collections::Generic::List_1<::UnityEngine::Rendering::Universal::TEdge*>*>*) == 0x8);
    // UnityEngine.Rendering.Universal.Scanbeam m_Scanbeam
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::Rendering::Universal::Scanbeam* m_Scanbeam;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::Scanbeam*) == 0x8);
    // System.Collections.Generic.List`1<UnityEngine.Rendering.Universal.OutRec> m_PolyOuts
    // Size: 0x8
    // Offset: 0x30
    ::System::Collections::Generic::List_1<::UnityEngine::Rendering::Universal::OutRec*>* m_PolyOuts;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Rendering::Universal::OutRec*>*) == 0x8);
    // UnityEngine.Rendering.Universal.TEdge m_ActiveEdges
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::Rendering::Universal::TEdge* m_ActiveEdges;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::TEdge*) == 0x8);
    // System.Boolean m_UseFullRange
    // Size: 0x1
    // Offset: 0x40
    bool m_UseFullRange;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // System.Boolean m_HasOpenPaths
    // Size: 0x1
    // Offset: 0x41
    bool m_HasOpenPaths;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <PreserveCollinear>k__BackingField
    // Size: 0x1
    // Offset: 0x42
    bool PreserveCollinear;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // static field const value: static System.Double horizontal
    static constexpr const double horizontal = -3.4e+38;
    // Get static field: static System.Double horizontal
    static double _get_horizontal();
    // Set static field: static System.Double horizontal
    static void _set_horizontal(double value);
    // static field const value: static System.Int32 Skip
    static constexpr const int Skip = -2;
    // Get static field: static System.Int32 Skip
    static int _get_Skip();
    // Set static field: static System.Int32 Skip
    static void _set_Skip(int value);
    // static field const value: static System.Int32 Unassigned
    static constexpr const int Unassigned = -1;
    // Get static field: static System.Int32 Unassigned
    static int _get_Unassigned();
    // Set static field: static System.Int32 Unassigned
