// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.Rendering.IDebugDisplaySettingsData
#include "UnityEngine/Rendering/IDebugDisplaySettingsData.hpp"
// Including type: UnityEngine.Rendering.Universal.DebugWireframeMode
#include "UnityEngine/Rendering/Universal/DebugWireframeMode.hpp"
// Including type: UnityEngine.Rendering.Universal.DebugOverdrawMode
#include "UnityEngine/Rendering/Universal/DebugOverdrawMode.hpp"
// Including type: UnityEngine.Rendering.Universal.DebugFullScreenMode
#include "UnityEngine/Rendering/Universal/DebugFullScreenMode.hpp"
// Including type: UnityEngine.Rendering.Universal.DebugSceneOverrideMode
#include "UnityEngine/Rendering/Universal/DebugSceneOverrideMode.hpp"
// Including type: UnityEngine.Rendering.Universal.DebugMipInfoMode
#include "UnityEngine/Rendering/Universal/DebugMipInfoMode.hpp"
// Including type: UnityEngine.Rendering.Universal.DebugPostProcessingMode
#include "UnityEngine/Rendering/Universal/DebugPostProcessingMode.hpp"
// Including type: UnityEngine.Rendering.Universal.DebugValidationMode
#include "UnityEngine/Rendering/Universal/DebugValidationMode.hpp"
// Including type: UnityEngine.Rendering.Universal.PixelValidationChannels
#include "UnityEngine/Rendering/Universal/PixelValidationChannels.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::Rendering::Universal
namespace UnityEngine::Rendering::Universal {
  // Skipping declaration: TaaDebugMode because it is already included!
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Color
  struct Color;
}
// Forward declaring namespace: UnityEngine::Rendering
namespace UnityEngine::Rendering {
  // Forward declaring type: IDebugDisplaySettingsPanelDisposable
  class IDebugDisplaySettingsPanelDisposable;
}
// Completed forward declares
// Type namespace: UnityEngine.Rendering.Universal
namespace UnityEngine::Rendering::Universal {
  // Forward declaring type: DebugDisplaySettingsRendering
  class DebugDisplaySettingsRendering;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::Rendering::Universal::DebugDisplaySettingsRendering);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::Rendering::Universal::DebugDisplaySettingsRendering*, "UnityEngine.Rendering.Universal", "DebugDisplaySettingsRendering");
// Type namespace: UnityEngine.Rendering.Universal
namespace UnityEngine::Rendering::Universal {
  // Size: 0x4C
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.Rendering.Universal.DebugDisplaySettingsRendering
  // [TokenAttribute] Offset: FFFFFFFF
  class DebugDisplaySettingsRendering : public ::Il2CppObject/*, public ::UnityEngine::Rendering::IDebugDisplaySettingsData*/ {
    public:
    // Nested type: ::UnityEngine::Rendering::Universal::DebugDisplaySettingsRendering::TaaDebugMode
    struct TaaDebugMode;
    // Nested type: ::UnityEngine::Rendering::Universal::DebugDisplaySettingsRendering::Strings
    class Strings;
    // Nested type: ::UnityEngine::Rendering::Universal::DebugDisplaySettingsRendering::WidgetFactory
    class WidgetFactory;
    // Nested type: ::UnityEngine::Rendering::Universal::DebugDisplaySettingsRendering::SettingsPanel
    class SettingsPanel;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.Rendering.Universal.DebugDisplaySettingsRendering/TaaDebugMode
    // [TokenAttribute] Offset: FFFFFFFF
    struct TaaDebugMode/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: TaaDebugMode
      constexpr TaaDebugMode(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.Rendering.Universal.DebugDisplaySettingsRendering/TaaDebugMode None
      static constexpr const int None = 0;
      // Get static field: static public UnityEngine.Rendering.Universal.DebugDisplaySettingsRendering/TaaDebugMode None
      static ::UnityEngine::Rendering::Universal::DebugDisplaySettingsRendering::TaaDebugMode _get_None();
      // Set static field: static public UnityEngine.Rendering.Universal.DebugDisplaySettingsRendering/TaaDebugMode None
      static void _set_None(::UnityEngine::Rendering::Universal::DebugDisplaySettingsRendering::TaaDebugMode value);
      // static field const value: static public UnityEngine.Rendering.Universal.DebugDisplaySettingsRendering/TaaDebugMode ShowRawFrame
      static constexpr const int ShowRawFrame = 1;
      // Get static field: static public UnityEngine.Rendering.Universal.DebugDisplaySettingsRendering/TaaDebugMode ShowRawFrame
      static ::UnityEngine::Rendering::Universal::DebugDisplaySettingsRendering::TaaDebugMode _get_ShowRawFrame();
      // Set static field: static public UnityEngine.Rendering.Universal.DebugDisplaySettingsRendering/TaaDebugMode ShowRawFrame
      static void _set_ShowRawFrame(::UnityEngine::Rendering::Universal::DebugDisplaySettingsRendering::TaaDebugMode value);
      // static field const value: static public UnityEngine.Rendering.Universal.DebugDisplaySettingsRendering/TaaDebugMode ShowRawFrameNoJitter
      static constexpr const int ShowRawFrameNoJitter = 2;
      // Get static field: static public UnityEngine.Rendering.Universal.DebugDisplaySettingsRendering/TaaDebugMode ShowRawFrameNoJitter
      static ::UnityEngine::Rendering::Universal::DebugDisplaySettingsRendering::TaaDebugMode _get_ShowRawFrameNoJitter();
      // Set static field: static public UnityEngine.Rendering.Universal.DebugDisplaySettingsRendering/TaaDebugMode ShowRawFrameNoJitter
      static void _set_ShowRawFrameNoJitter(::UnityEngine::Rendering::Universal::DebugDisplaySettingsRendering::TaaDebugMode value);
      // static field const value: static public UnityEngine.Rendering.Universal.DebugDisplaySettingsRendering/TaaDebugMode ShowClampedHistory
      static constexpr const int ShowClampedHistory = 3;
      // Get static field: static public UnityEngine.Rendering.Universal.DebugDisplaySettingsRendering/TaaDebugMode ShowClampedHistory
      static ::UnityEngine::Rendering::Universal::DebugDisplaySettingsRendering::TaaDebugMode _get_ShowClampedHistory();
      // Set static field: static public UnityEngine.Rendering.Universal.DebugDisplaySettingsRendering/TaaDebugMode ShowClampedHistory
      static void _set_ShowClampedHistory(::UnityEngine::Rendering::Universal::DebugDisplaySettingsRendering::TaaDebugMode value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.Rendering.Universal.DebugDisplaySettingsRendering/TaaDebugMode
    #pragma pack(pop)
    static check_size<sizeof(DebugDisplaySettingsRendering::TaaDebugMode), 0 + sizeof(int)> __UnityEngine_Rendering_Universal_DebugDisplaySettingsRendering_TaaDebugModeSizeCheck;
    static_assert(sizeof(DebugDisplaySettingsRendering::TaaDebugMode) == 0x4);
    public:
    // private UnityEngine.Rendering.Universal.DebugWireframeMode m_WireframeMode
    // Size: 0x4
    // Offset: 0x10
    ::UnityEngine::Rendering::Universal::DebugWireframeMode m_WireframeMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::DebugWireframeMode) == 0x4);
    // private System.Boolean m_Overdraw
    // Size: 0x1
    // Offset: 0x14
    bool m_Overdraw;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_Overdraw and: m_OverdrawMode
    char __padding1[0x3] = {};
    // private UnityEngine.Rendering.Universal.DebugOverdrawMode m_OverdrawMode
    // Size: 0x4
    // Offset: 0x18
    ::UnityEngine::Rendering::Universal::DebugOverdrawMode m_OverdrawMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::DebugOverdrawMode) == 0x4);
    // private System.Int32 <maxOverdrawCount>k__BackingField
    // Size: 0x4
    // Offset: 0x1C
    int maxOverdrawCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.Rendering.Universal.DebugFullScreenMode <fullScreenDebugMode>k__BackingField
    // Size: 0x4
    // Offset: 0x20
    ::UnityEngine::Rendering::Universal::DebugFullScreenMode fullScreenDebugMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::DebugFullScreenMode) == 0x4);
    // private System.Int32 <fullScreenDebugModeOutputSizeScreenPercent>k__BackingField
    // Size: 0x4
    // Offset: 0x24
    int fullScreenDebugModeOutputSizeScreenPercent;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.Rendering.Universal.DebugSceneOverrideMode <sceneOverrideMode>k__BackingField
    // Size: 0x4
    // Offset: 0x28
    ::UnityEngine::Rendering::Universal::DebugSceneOverrideMode sceneOverrideMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::DebugSceneOverrideMode) == 0x4);
    // private UnityEngine.Rendering.Universal.DebugMipInfoMode <mipInfoMode>k__BackingField
    // Size: 0x4
    // Offset: 0x2C
    ::UnityEngine::Rendering::Universal::DebugMipInfoMode mipInfoMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::DebugMipInfoMode) == 0x4);
    // private UnityEngine.Rendering.Universal.DebugPostProcessingMode <postProcessingDebugMode>k__BackingField
    // Size: 0x4
    // Offset: 0x30
    ::UnityEngine::Rendering::Universal::DebugPostProcessingMode postProcessingDebugMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::DebugPostProcessingMode) == 0x4);
    // private System.Boolean <enableMsaa>k__BackingField
    // Size: 0x1
    // Offset: 0x34
    bool enableMsaa;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <enableHDR>k__BackingField
    // Size: 0x1
    // Offset: 0x35
    bool enableHDR;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: enableHDR and: taaDebugMode
    char __padding10[0x2] = {};
    // private UnityEngine.Rendering.Universal.DebugDisplaySettingsRendering/TaaDebugMode <taaDebugMode>k__BackingField
    // Size: 0x4
    // Offset: 0x38
    ::UnityEngine::Rendering::Universal::DebugDisplaySettingsRendering::TaaDebugMode taaDebugMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::DebugDisplaySettingsRendering::TaaDebugMode) == 0x4);
    // private UnityEngine.Rendering.Universal.DebugValidationMode <validationMode>k__BackingField
    // Size: 0x4
    // Offset: 0x3C
    ::UnityEngine::Rendering::Universal::DebugValidationMode validationMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::DebugValidationMode) == 0x4);
    // private UnityEngine.Rendering.Universal.PixelValidationChannels <validationChannels>k__BackingField
    // Size: 0x4
    // Offset: 0x40
    ::UnityEngine::Rendering::Universal::PixelValidationChannels validationChannels;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::PixelValidationChannels) == 0x4);
    // private System.Single <validationRangeMin>k__BackingField
    // Size: 0x4
    // Offset: 0x44
    float validationRangeMin;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single <validationRangeMax>k__BackingField
    // Size: 0x4
    // Offset: 0x48
    float validationRangeMax;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Creating interface conversion operator: operator ::UnityEngine::Rendering::IDebugDisplaySettingsData
    operator ::UnityEngine::Rendering::IDebugDisplaySettingsData() noexcept {
      return *reinterpret_cast<::UnityEngine::Rendering::IDebugDisplaySettingsData*>(this);
    }
    // Get instance field reference: private UnityEngine.Rendering.Universal.DebugWireframeMode m_WireframeMode
    [[deprecated("Use field access instead!")]] ::UnityEngine::Rendering::Universal::DebugWireframeMode& dyn_m_WireframeMode();
    // Get instance field reference: private System.Boolean m_Overdraw
    [[deprecated("Use field access instead!")]] bool& dyn_m_Overdraw();
    // Get instance field reference: private UnityEngine.Rendering.Universal.DebugOverdrawMode m_OverdrawMode
