// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.Rendering.IDebugDisplaySettingsQuery
#include "UnityEngine/Rendering/IDebugDisplaySettingsQuery.hpp"
// Including type: UnityEngine.Vector4
#include "UnityEngine/Vector4.hpp"
// Including type: UnityEngine.Rendering.RenderTargetIdentifier
#include "UnityEngine/Rendering/RenderTargetIdentifier.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::Rendering::Universal
namespace UnityEngine::Rendering::Universal {
  // Forward declaring type: HDRDebugViewPass
  class HDRDebugViewPass;
  // Forward declaring type: UniversalRenderPipelineDebugDisplaySettings
  class UniversalRenderPipelineDebugDisplaySettings;
  // Forward declaring type: DebugDisplaySettingsLighting
  class DebugDisplaySettingsLighting;
  // Forward declaring type: DebugDisplaySettingsMaterial
  class DebugDisplaySettingsMaterial;
  // Forward declaring type: DebugDisplaySettingsRendering
  class DebugDisplaySettingsRendering;
  // Forward declaring type: CameraData
  struct CameraData;
  // Forward declaring type: ScriptableRendererData
  class ScriptableRendererData;
  // Forward declaring type: DebugFullScreenMode
  struct DebugFullScreenMode;
  // Forward declaring type: RenderingData
  struct RenderingData;
  // Forward declaring type: DebugRenderSetup
  class DebugRenderSetup;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: Color
  struct Color;
  // Forward declaring type: Rect
  struct Rect;
}
// Forward declaring namespace: UnityEngine::Rendering
namespace UnityEngine::Rendering {
  // Forward declaring type: RTHandle
  class RTHandle;
  // Forward declaring type: CommandBuffer
  class CommandBuffer;
  // Forward declaring type: ScriptableRenderContext
  struct ScriptableRenderContext;
  // Forward declaring type: FilteringSettings
  struct FilteringSettings;
  // Forward declaring type: DrawingSettings
  struct DrawingSettings;
  // Forward declaring type: RenderStateBlock
  struct RenderStateBlock;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: IEnumerable`1<T>
  template<typename T>
  class IEnumerable_1;
}
// Completed forward declares
// Type namespace: UnityEngine.Rendering.Universal
namespace UnityEngine::Rendering::Universal {
  // Forward declaring type: DebugHandler
  class DebugHandler;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::Rendering::Universal::DebugHandler);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::Rendering::Universal::DebugHandler*, "UnityEngine.Rendering.Universal", "DebugHandler");
// Type namespace: UnityEngine.Rendering.Universal
namespace UnityEngine::Rendering::Universal {
  // Size: 0x78
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.Rendering.Universal.DebugHandler
  // [TokenAttribute] Offset: FFFFFFFF
  class DebugHandler : public ::Il2CppObject/*, public ::UnityEngine::Rendering::IDebugDisplaySettingsQuery*/ {
    public:
    // Nested type: ::UnityEngine::Rendering::Universal::DebugHandler::DebugRenderPassEnumerable
    class DebugRenderPassEnumerable;
    // Nested type: ::UnityEngine::Rendering::Universal::DebugHandler::DrawFunction
    class DrawFunction;
    public:
    // private readonly UnityEngine.Material m_ReplacementMaterial
    // Size: 0x8
    // Offset: 0x10
    ::UnityEngine::Material* m_ReplacementMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private readonly UnityEngine.Material m_HDRDebugViewMaterial
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::Material* m_HDRDebugViewMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private UnityEngine.Rendering.Universal.HDRDebugViewPass m_HDRDebugViewPass
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::Rendering::Universal::HDRDebugViewPass* m_HDRDebugViewPass;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::HDRDebugViewPass*) == 0x8);
    // private UnityEngine.Rendering.RTHandle m_DebugScreenTextureHandle
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::Rendering::RTHandle* m_DebugScreenTextureHandle;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::RTHandle*) == 0x8);
    // private System.Boolean m_HasDebugRenderTarget
    // Size: 0x1
    // Offset: 0x30
    bool m_HasDebugRenderTarget;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_DebugRenderTargetSupportsStereo
    // Size: 0x1
    // Offset: 0x31
    bool m_DebugRenderTargetSupportsStereo;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_DebugRenderTargetSupportsStereo and: m_DebugRenderTargetPixelRect
    char __padding5[0x2] = {};
    // private UnityEngine.Vector4 m_DebugRenderTargetPixelRect
    // Size: 0x10
    // Offset: 0x34
    ::UnityEngine::Vector4 m_DebugRenderTargetPixelRect;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector4) == 0x10);
    // Padding between fields: m_DebugRenderTargetPixelRect and: m_DebugRenderTargetIdentifier
    char __padding6[0x4] = {};
    // private UnityEngine.Rendering.RenderTargetIdentifier m_DebugRenderTargetIdentifier
    // Size: 0x24
    // Offset: 0x48
    ::UnityEngine::Rendering::RenderTargetIdentifier m_DebugRenderTargetIdentifier;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::RenderTargetIdentifier) == 0x24);
    // Padding between fields: m_DebugRenderTargetIdentifier and: m_DebugDisplaySettings
    char __padding7[0x4] = {};
    // private readonly UnityEngine.Rendering.Universal.UniversalRenderPipelineDebugDisplaySettings m_DebugDisplaySettings
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::Rendering::Universal::UniversalRenderPipelineDebugDisplaySettings* m_DebugDisplaySettings;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::UniversalRenderPipelineDebugDisplaySettings*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::UnityEngine::Rendering::IDebugDisplaySettingsQuery
    operator ::UnityEngine::Rendering::IDebugDisplaySettingsQuery() noexcept {
      return *reinterpret_cast<::UnityEngine::Rendering::IDebugDisplaySettingsQuery*>(this);
    }
    // Get static field: static private readonly System.Int32 k_DebugColorInvalidModePropertyId
    static int _get_k_DebugColorInvalidModePropertyId();
    // Set static field: static private readonly System.Int32 k_DebugColorInvalidModePropertyId
    static void _set_k_DebugColorInvalidModePropertyId(int value);
    // Get static field: static private readonly System.Int32 k_DebugColorPropertyId
