// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Rendering.Universal.DecalEntity
#include "UnityEngine/Rendering/Universal/DecalEntity.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
// Including type: UnityEngine.Rendering.Universal.DecalScaleMode
#include "UnityEngine/Rendering/Universal/DecalScaleMode.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::Rendering::Universal
namespace UnityEngine::Rendering::Universal {
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: Vector4
  struct Vector4;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
}
// Completed forward declares
// Type namespace: UnityEngine.Rendering.Universal
namespace UnityEngine::Rendering::Universal {
  // Forward declaring type: DecalProjector
  class DecalProjector;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::Rendering::Universal::DecalProjector);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::Rendering::Universal::DecalProjector*, "UnityEngine.Rendering.Universal", "DecalProjector");
// Type namespace: UnityEngine.Rendering.Universal
namespace UnityEngine::Rendering::Universal {
  // Size: 0x80
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.Rendering.Universal.DecalProjector
  // [TokenAttribute] Offset: FFFFFFFF
  // [ExecuteAlways] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: FFFFFFFF
  class DecalProjector : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::UnityEngine::Rendering::Universal::DecalProjector::DecalProjectorAction
    class DecalProjectorAction;
    public:
    // private UnityEngine.Rendering.Universal.DecalEntity <decalEntity>k__BackingField
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::Rendering::Universal::DecalEntity decalEntity;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::DecalEntity) == 0x8);
    // private UnityEngine.Material m_Material
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::Material* m_Material;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private System.Single m_DrawDistance
    // Size: 0x4
    // Offset: 0x30
    float m_DrawDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_FadeScale
    // Size: 0x4
    // Offset: 0x34
    float m_FadeScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_StartAngleFade
    // Size: 0x4
    // Offset: 0x38
    float m_StartAngleFade;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_EndAngleFade
    // Size: 0x4
    // Offset: 0x3C
    float m_EndAngleFade;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector2 m_UVScale
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::Vector2 m_UVScale;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private UnityEngine.Vector2 m_UVBias
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::Vector2 m_UVBias;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private System.UInt32 m_DecalLayerMask
    // Size: 0x4
    // Offset: 0x50
    uint m_DecalLayerMask;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private UnityEngine.Rendering.Universal.DecalScaleMode m_ScaleMode
    // Size: 0x4
    // Offset: 0x54
    ::UnityEngine::Rendering::Universal::DecalScaleMode m_ScaleMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::DecalScaleMode) == 0x4);
    // UnityEngine.Vector3 m_Offset
    // Size: 0xC
    // Offset: 0x58
    ::UnityEngine::Vector3 m_Offset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // UnityEngine.Vector3 m_Size
    // Size: 0xC
    // Offset: 0x64
    ::UnityEngine::Vector3 m_Size;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Single m_FadeFactor
    // Size: 0x4
    // Offset: 0x70
    float m_FadeFactor;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: m_FadeFactor and: m_OldMaterial
    char __padding12[0x4] = {};
    // private UnityEngine.Material m_OldMaterial
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::Material* m_OldMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    public:
    // Get static field: static private UnityEngine.Rendering.Universal.DecalProjector/DecalProjectorAction onDecalAdd
    static ::UnityEngine::Rendering::Universal::DecalProjector::DecalProjectorAction* _get_onDecalAdd();
    // Set static field: static private UnityEngine.Rendering.Universal.DecalProjector/DecalProjectorAction onDecalAdd
    static void _set_onDecalAdd(::UnityEngine::Rendering::Universal::DecalProjector::DecalProjectorAction* value);
    // Get static field: static private UnityEngine.Rendering.Universal.DecalProjector/DecalProjectorAction onDecalRemove
    static ::UnityEngine::Rendering::Universal::DecalProjector::DecalProjectorAction* _get_onDecalRemove();
    // Set static field: static private UnityEngine.Rendering.Universal.DecalProjector/DecalProjectorAction onDecalRemove
