// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.Rendering.Universal.ScriptableRendererFeature
#include "UnityEngine/Rendering/Universal/ScriptableRendererFeature.hpp"
// Including type: UnityEngine.Rendering.Universal.DecalTechnique
#include "UnityEngine/Rendering/Universal/DecalTechnique.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::Rendering::Universal
namespace UnityEngine::Rendering::Universal {
  // Forward declaring type: DecalSettings
  class DecalSettings;
  // Forward declaring type: DBufferSettings
  class DBufferSettings;
  // Forward declaring type: DecalScreenSpaceSettings
  class DecalScreenSpaceSettings;
  // Forward declaring type: DecalPreviewPass
  class DecalPreviewPass;
  // Forward declaring type: DecalEntityManager
  class DecalEntityManager;
  // Forward declaring type: DecalUpdateCachedSystem
  class DecalUpdateCachedSystem;
  // Forward declaring type: DecalUpdateCullingGroupSystem
  class DecalUpdateCullingGroupSystem;
  // Forward declaring type: DecalUpdateCulledSystem
  class DecalUpdateCulledSystem;
  // Forward declaring type: DecalCreateDrawCallSystem
  class DecalCreateDrawCallSystem;
  // Forward declaring type: DecalDrawErrorSystem
  class DecalDrawErrorSystem;
  // Forward declaring type: DBufferRenderPass
  class DBufferRenderPass;
  // Forward declaring type: DecalForwardEmissivePass
  class DecalForwardEmissivePass;
  // Forward declaring type: DecalDrawDBufferSystem
  class DecalDrawDBufferSystem;
  // Forward declaring type: DecalDrawFowardEmissiveSystem
  class DecalDrawFowardEmissiveSystem;
  // Forward declaring type: DecalScreenSpaceRenderPass
  class DecalScreenSpaceRenderPass;
  // Forward declaring type: DecalDrawScreenSpaceSystem
  class DecalDrawScreenSpaceSystem;
  // Forward declaring type: DecalSkipCulledSystem
  class DecalSkipCulledSystem;
  // Forward declaring type: DecalGBufferRenderPass
  class DecalGBufferRenderPass;
  // Forward declaring type: DecalDrawGBufferSystem
  class DecalDrawGBufferSystem;
  // Forward declaring type: SharedDecalEntityManager
  class SharedDecalEntityManager;
  // Forward declaring type: ScriptableRendererData
  class ScriptableRendererData;
  // Forward declaring type: ScriptableRenderer
  class ScriptableRenderer;
  // Forward declaring type: CameraData
  struct CameraData;
  // Forward declaring type: RenderingData
  struct RenderingData;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Shader
  class Shader;
  // Forward declaring type: Material
  class Material;
}
// Forward declaring namespace: UnityEngine::Rendering::Universal::Internal
namespace UnityEngine::Rendering::Universal::Internal {
  // Forward declaring type: CopyDepthPass
  class CopyDepthPass;
  // Forward declaring type: DeferredLights
  class DeferredLights;
}
// Completed forward declares
// Type namespace: UnityEngine.Rendering.Universal
namespace UnityEngine::Rendering::Universal {
  // Forward declaring type: DecalRendererFeature
  class DecalRendererFeature;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::Rendering::Universal::DecalRendererFeature);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::Rendering::Universal::DecalRendererFeature*, "UnityEngine.Rendering.Universal", "DecalRendererFeature");
// Type namespace: UnityEngine.Rendering.Universal
namespace UnityEngine::Rendering::Universal {
  // Size: 0xF8
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.Rendering.Universal.DecalRendererFeature
  // [TokenAttribute] Offset: FFFFFFFF
  // [DisallowMultipleRendererFeature] Offset: FFFFFFFF
  // [TooltipAttribute] Offset: FFFFFFFF
  class DecalRendererFeature : public ::UnityEngine::Rendering::Universal::ScriptableRendererFeature {
    public:
    // Writing base type padding for base size: 0x19 to desired offset: 0x20
    char ___base_padding[0x7] = {};
    public:
    // private UnityEngine.Rendering.Universal.DecalSettings m_Settings
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::Rendering::Universal::DecalSettings* m_Settings;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::DecalSettings*) == 0x8);
    // private UnityEngine.Shader m_CopyDepthPS
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::Shader* m_CopyDepthPS;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // private UnityEngine.Shader m_DBufferClear
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Shader* m_DBufferClear;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // private UnityEngine.Rendering.Universal.DecalTechnique m_Technique
    // Size: 0x4
    // Offset: 0x38
    ::UnityEngine::Rendering::Universal::DecalTechnique m_Technique;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::DecalTechnique) == 0x4);
    // Padding between fields: m_Technique and: m_DBufferSettings
    char __padding3[0x4] = {};
    // private UnityEngine.Rendering.Universal.DBufferSettings m_DBufferSettings
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::Rendering::Universal::DBufferSettings* m_DBufferSettings;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::DBufferSettings*) == 0x8);
    // private UnityEngine.Rendering.Universal.DecalScreenSpaceSettings m_ScreenSpaceSettings
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::Rendering::Universal::DecalScreenSpaceSettings* m_ScreenSpaceSettings;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::DecalScreenSpaceSettings*) == 0x8);
    // private System.Boolean m_RecreateSystems
    // Size: 0x1
    // Offset: 0x50
    bool m_RecreateSystems;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_RecreateSystems and: m_CopyDepthPass
    char __padding6[0x7] = {};
    // private UnityEngine.Rendering.Universal.Internal.CopyDepthPass m_CopyDepthPass
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::Rendering::Universal::Internal::CopyDepthPass* m_CopyDepthPass;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::Internal::CopyDepthPass*) == 0x8);
    // private UnityEngine.Rendering.Universal.DecalPreviewPass m_DecalPreviewPass
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::Rendering::Universal::DecalPreviewPass* m_DecalPreviewPass;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::DecalPreviewPass*) == 0x8);
    // private UnityEngine.Material m_CopyDepthMaterial
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::Material* m_CopyDepthMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private UnityEngine.Rendering.Universal.DecalEntityManager m_DecalEntityManager
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::Rendering::Universal::DecalEntityManager* m_DecalEntityManager;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::DecalEntityManager*) == 0x8);
    // private UnityEngine.Rendering.Universal.DecalUpdateCachedSystem m_DecalUpdateCachedSystem
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::Rendering::Universal::DecalUpdateCachedSystem* m_DecalUpdateCachedSystem;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::DecalUpdateCachedSystem*) == 0x8);
    // private UnityEngine.Rendering.Universal.DecalUpdateCullingGroupSystem m_DecalUpdateCullingGroupSystem
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::Rendering::Universal::DecalUpdateCullingGroupSystem* m_DecalUpdateCullingGroupSystem;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::DecalUpdateCullingGroupSystem*) == 0x8);
    // private UnityEngine.Rendering.Universal.DecalUpdateCulledSystem m_DecalUpdateCulledSystem
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::Rendering::Universal::DecalUpdateCulledSystem* m_DecalUpdateCulledSystem;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::DecalUpdateCulledSystem*) == 0x8);
    // private UnityEngine.Rendering.Universal.DecalCreateDrawCallSystem m_DecalCreateDrawCallSystem
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::Rendering::Universal::DecalCreateDrawCallSystem* m_DecalCreateDrawCallSystem;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::DecalCreateDrawCallSystem*) == 0x8);
    // private UnityEngine.Rendering.Universal.DecalDrawErrorSystem m_DrawErrorSystem
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::Rendering::Universal::DecalDrawErrorSystem* m_DrawErrorSystem;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::DecalDrawErrorSystem*) == 0x8);
    // private UnityEngine.Rendering.Universal.DBufferRenderPass m_DBufferRenderPass
    // Size: 0x8
    // Offset: 0xA0
    ::UnityEngine::Rendering::Universal::DBufferRenderPass* m_DBufferRenderPass;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::DBufferRenderPass*) == 0x8);
    // private UnityEngine.Rendering.Universal.DecalForwardEmissivePass m_ForwardEmissivePass
    // Size: 0x8
    // Offset: 0xA8
    ::UnityEngine::Rendering::Universal::DecalForwardEmissivePass* m_ForwardEmissivePass;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::DecalForwardEmissivePass*) == 0x8);
    // private UnityEngine.Rendering.Universal.DecalDrawDBufferSystem m_DecalDrawDBufferSystem
    // Size: 0x8
    // Offset: 0xB0
    ::UnityEngine::Rendering::Universal::DecalDrawDBufferSystem* m_DecalDrawDBufferSystem;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::DecalDrawDBufferSystem*) == 0x8);
    // private UnityEngine.Rendering.Universal.DecalDrawFowardEmissiveSystem m_DecalDrawForwardEmissiveSystem
    // Size: 0x8
    // Offset: 0xB8
    ::UnityEngine::Rendering::Universal::DecalDrawFowardEmissiveSystem* m_DecalDrawForwardEmissiveSystem;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::DecalDrawFowardEmissiveSystem*) == 0x8);
    // private UnityEngine.Material m_DBufferClearMaterial
    // Size: 0x8
    // Offset: 0xC0
    ::UnityEngine::Material* m_DBufferClearMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private UnityEngine.Rendering.Universal.DecalScreenSpaceRenderPass m_ScreenSpaceDecalRenderPass
    // Size: 0x8
    // Offset: 0xC8
    ::UnityEngine::Rendering::Universal::DecalScreenSpaceRenderPass* m_ScreenSpaceDecalRenderPass;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::DecalScreenSpaceRenderPass*) == 0x8);
    // private UnityEngine.Rendering.Universal.DecalDrawScreenSpaceSystem m_DecalDrawScreenSpaceSystem
    // Size: 0x8
    // Offset: 0xD0
    ::UnityEngine::Rendering::Universal::DecalDrawScreenSpaceSystem* m_DecalDrawScreenSpaceSystem;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::DecalDrawScreenSpaceSystem*) == 0x8);
    // private UnityEngine.Rendering.Universal.DecalSkipCulledSystem m_DecalSkipCulledSystem
    // Size: 0x8
    // Offset: 0xD8
    ::UnityEngine::Rendering::Universal::DecalSkipCulledSystem* m_DecalSkipCulledSystem;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::DecalSkipCulledSystem*) == 0x8);
    // private UnityEngine.Rendering.Universal.DecalGBufferRenderPass m_GBufferRenderPass
    // Size: 0x8
    // Offset: 0xE0
    ::UnityEngine::Rendering::Universal::DecalGBufferRenderPass* m_GBufferRenderPass;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::DecalGBufferRenderPass*) == 0x8);
    // private UnityEngine.Rendering.Universal.DecalDrawGBufferSystem m_DrawGBufferSystem
    // Size: 0x8
    // Offset: 0xE8
    ::UnityEngine::Rendering::Universal::DecalDrawGBufferSystem* m_DrawGBufferSystem;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::DecalDrawGBufferSystem*) == 0x8);
    // private UnityEngine.Rendering.Universal.Internal.DeferredLights m_DeferredLights
    // Size: 0x8
    // Offset: 0xF0
    ::UnityEngine::Rendering::Universal::Internal::DeferredLights* m_DeferredLights;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::Internal::DeferredLights*) == 0x8);
    public:
    // Get static field: static private readonly UnityEngine.Rendering.Universal.SharedDecalEntityManager <sharedDecalEntityManager>k__BackingField
    static ::UnityEngine::Rendering::Universal::SharedDecalEntityManager* _get_$sharedDecalEntityManager$k__BackingField();
    // Set static field: static private readonly UnityEngine.Rendering.Universal.SharedDecalEntityManager <sharedDecalEntityManager>k__BackingField
    static void _set_$sharedDecalEntityManager$k__BackingField(::UnityEngine::Rendering::Universal::SharedDecalEntityManager* value);
    // Get instance field reference: private UnityEngine.Rendering.Universal.DecalSettings m_Settings
