// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include <stdint.h>
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Completed includes
// Begin il2cpp-utils forward declares
struct Il2CppObject;
// Completed il2cpp-utils forward declares
// Type namespace: UnityEngine.Rendering.Universal
namespace UnityEngine::Rendering::Universal {
  // Forward declaring type: IntPoint
  struct IntPoint;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::Rendering::Universal::IntPoint, "UnityEngine.Rendering.Universal", "IntPoint");
// Type namespace: UnityEngine.Rendering.Universal
namespace UnityEngine::Rendering::Universal {
  // Size: 0x30
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: UnityEngine.Rendering.Universal.IntPoint
  // [TokenAttribute] Offset: FFFFFFFF
  struct IntPoint/*, public ::System::ValueType*/ {
    public:
    public:
    // public System.Int64 N
    // Size: 0x8
    // Offset: 0x0
    int64_t N;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // public System.Int64 X
    // Size: 0x8
    // Offset: 0x8
    int64_t X;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // public System.Int64 Y
    // Size: 0x8
    // Offset: 0x10
    int64_t Y;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // public System.Int64 D
    // Size: 0x8
    // Offset: 0x18
    int64_t D;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // public System.Double NX
    // Size: 0x8
    // Offset: 0x20
    double NX;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // public System.Double NY
    // Size: 0x8
    // Offset: 0x28
    double NY;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    public:
    // Creating value type constructor for type: IntPoint
    constexpr IntPoint(int64_t N_ = {}, int64_t X_ = {}, int64_t Y_ = {}, int64_t D_ = {}, double NX_ = {}, double NY_ = {}) noexcept : N{N_}, X{X_}, Y{Y_}, D{D_}, NX{NX_}, NY{NY_} {}
    // Creating interface conversion operator: operator ::System::ValueType
    operator ::System::ValueType() noexcept {
      return *reinterpret_cast<::System::ValueType*>(this);
    }
    // Get instance field reference: public System.Int64 N
    [[deprecated("Use field access instead!")]] int64_t& dyn_N();
    // Get instance field reference: public System.Int64 X
    [[deprecated("Use field access instead!")]] int64_t& dyn_X();
    // Get instance field reference: public System.Int64 Y
    [[deprecated("Use field access instead!")]] int64_t& dyn_Y();
    // Get instance field reference: public System.Int64 D
    [[deprecated("Use field access instead!")]] int64_t& dyn_D();
    // Get instance field reference: public System.Double NX
    [[deprecated("Use field access instead!")]] double& dyn_NX();
    // Get instance field reference: public System.Double NY
    [[deprecated("Use field access instead!")]] double& dyn_NY();
    // public System.Void .ctor(System.Int64 X, System.Int64 Y)
    // Offset: 0x526CBD0
    IntPoint(int64_t X, int64_t Y);
    // public System.Void .ctor(System.Double x, System.Double y)
    // Offset: 0x526CBE4
    IntPoint(double x, double y);
    // public System.Void .ctor(UnityEngine.Rendering.Universal.IntPoint pt)
    // Offset: 0x526CC1C
    // ABORTED: is copy constructor.  IntPoint(::UnityEngine::Rendering::Universal::IntPoint pt);
    // public override System.Boolean Equals(System.Object obj)
    // Offset: 0x526CCA8
    // Implemented from: System.ValueType
    // Base method: System.Boolean ValueType::Equals(System.Object obj)
    bool Equals(::Il2CppObject* obj);
    // public override System.Int32 GetHashCode()
    // Offset: 0x526CD30
    // Implemented from: System.ValueType
    // Base method: System.Int32 ValueType::GetHashCode()
    int GetHashCode();
  }; // UnityEngine.Rendering.Universal.IntPoint
  #pragma pack(pop)
  static check_size<sizeof(IntPoint), 40 + sizeof(double)> __UnityEngine_Rendering_Universal_IntPointSizeCheck;
  static_assert(sizeof(IntPoint) == 0x30);
  // static public System.Boolean op_Equality(UnityEngine.Rendering.Universal.IntPoint a, UnityEngine.Rendering.Universal.IntPoint b)
  // Offset: 0x526CC50
  bool operator ==(const ::UnityEngine::Rendering::Universal::IntPoint& a, const ::UnityEngine::Rendering::Universal::IntPoint& b);
  // static public System.Boolean op_Inequality(UnityEngine.Rendering.Universal.IntPoint a, UnityEngine.Rendering.Universal.IntPoint b)
  // Offset: 0x526CC7C
  bool operator !=(const ::UnityEngine::Rendering::Universal::IntPoint& a, const ::UnityEngine::Rendering::Universal::IntPoint& b);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: UnityEngine::Rendering::Universal::IntPoint::IntPoint
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: UnityEngine::Rendering::Universal::IntPoint::IntPoint
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: UnityEngine::Rendering::Universal::IntPoint::IntPoint
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: UnityEngine::Rendering::Universal::IntPoint::Equals
// Il2CppName: Equals
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (UnityEngine::Rendering::Universal::IntPoint::*)(::Il2CppObject*)>(&UnityEngine::Rendering::Universal::IntPoint::Equals)> {
  static const MethodInfo* get() {
    static auto* obj = &::il2cpp_utils::GetClassFromName("System", "Object")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::Rendering::Universal::IntPoint), "Equals", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{obj});
  }
};
// Writing MetadataGetter for method: UnityEngine::Rendering::Universal::IntPoint::GetHashCode
// Il2CppName: GetHashCode
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<int (UnityEngine::Rendering::Universal::IntPoint::*)()>(&UnityEngine::Rendering::Universal::IntPoint::GetHashCode)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::Rendering::Universal::IntPoint), "GetHashCode", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: UnityEngine::Rendering::Universal::IntPoint::operator ==
// Il2CppName: op_Equality
// Cannot perform method pointer template specialization from operators!
// Writing MetadataGetter for method: UnityEngine::Rendering::Universal::IntPoint::operator !=
// Il2CppName: op_Inequality
// Cannot perform method pointer template specialization from operators!
