// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.U2D.Light2DBase
#include "UnityEngine/U2D/Light2DBase.hpp"
// Including type: UnityEngine.ISerializationCallbackReceiver
#include "UnityEngine/ISerializationCallbackReceiver.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: UnityEngine.Rendering.Universal.LightUtility/LightMeshVertex
#include "UnityEngine/Rendering/Universal/LightUtility.hpp"
// Including type: UnityEngine.Bounds
#include "UnityEngine/Bounds.hpp"
// Including type: UnityEngine.BoundingSphere
#include "UnityEngine/BoundingSphere.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::Rendering::Universal
namespace UnityEngine::Rendering::Universal {
  // Skipping declaration: LightType because it is already included!
  // Skipping declaration: OverlapOperation because it is already included!
  // Skipping declaration: NormalMapQuality because it is already included!
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Sprite
  class Sprite;
  // Forward declaring type: Mesh
  class Mesh;
}
// Completed forward declares
// Type namespace: UnityEngine.Rendering.Universal
namespace UnityEngine::Rendering::Universal {
  // Forward declaring type: Light2D
  class Light2D;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::Rendering::Universal::Light2D);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::Rendering::Universal::Light2D*, "UnityEngine.Rendering.Universal", "Light2D");
// Type namespace: UnityEngine.Rendering.Universal
namespace UnityEngine::Rendering::Universal {
  // Size: 0x130
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.Rendering.Universal.Light2D
  // [TokenAttribute] Offset: FFFFFFFF
  // [MovedFromAttribute] Offset: FFFFFFFF
  // [DisallowMultipleComponent] Offset: FFFFFFFF
  // [ExecuteAlways] Offset: FFFFFFFF
  // [HelpURLAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: FFFFFFFF
  class Light2D : public ::UnityEngine::U2D::Light2DBase/*, public ::UnityEngine::ISerializationCallbackReceiver*/ {
    public:
    // Nested type: ::UnityEngine::Rendering::Universal::Light2D::DeprecatedLightType
    struct DeprecatedLightType;
    // Nested type: ::UnityEngine::Rendering::Universal::Light2D::LightType
    struct LightType;
    // Nested type: ::UnityEngine::Rendering::Universal::Light2D::NormalMapQuality
    struct NormalMapQuality;
    // Nested type: ::UnityEngine::Rendering::Universal::Light2D::OverlapOperation
    struct OverlapOperation;
    // Nested type: ::UnityEngine::Rendering::Universal::Light2D::ComponentVersions
    struct ComponentVersions;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.Rendering.Universal.Light2D/LightType
    // [TokenAttribute] Offset: FFFFFFFF
    struct LightType/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: LightType
      constexpr LightType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.Rendering.Universal.Light2D/LightType Parametric
      static constexpr const int Parametric = 0;
      // Get static field: static public UnityEngine.Rendering.Universal.Light2D/LightType Parametric
      static ::UnityEngine::Rendering::Universal::Light2D::LightType _get_Parametric();
      // Set static field: static public UnityEngine.Rendering.Universal.Light2D/LightType Parametric
      static void _set_Parametric(::UnityEngine::Rendering::Universal::Light2D::LightType value);
      // static field const value: static public UnityEngine.Rendering.Universal.Light2D/LightType Freeform
      static constexpr const int Freeform = 1;
      // Get static field: static public UnityEngine.Rendering.Universal.Light2D/LightType Freeform
      static ::UnityEngine::Rendering::Universal::Light2D::LightType _get_Freeform();
      // Set static field: static public UnityEngine.Rendering.Universal.Light2D/LightType Freeform
      static void _set_Freeform(::UnityEngine::Rendering::Universal::Light2D::LightType value);
      // static field const value: static public UnityEngine.Rendering.Universal.Light2D/LightType Sprite
      static constexpr const int Sprite = 2;
      // Get static field: static public UnityEngine.Rendering.Universal.Light2D/LightType Sprite
      static ::UnityEngine::Rendering::Universal::Light2D::LightType _get_Sprite();
      // Set static field: static public UnityEngine.Rendering.Universal.Light2D/LightType Sprite
      static void _set_Sprite(::UnityEngine::Rendering::Universal::Light2D::LightType value);
      // static field const value: static public UnityEngine.Rendering.Universal.Light2D/LightType Point
      static constexpr const int Point = 3;
      // Get static field: static public UnityEngine.Rendering.Universal.Light2D/LightType Point
      static ::UnityEngine::Rendering::Universal::Light2D::LightType _get_Point();
      // Set static field: static public UnityEngine.Rendering.Universal.Light2D/LightType Point
      static void _set_Point(::UnityEngine::Rendering::Universal::Light2D::LightType value);
      // static field const value: static public UnityEngine.Rendering.Universal.Light2D/LightType Global
      static constexpr const int Global = 4;
      // Get static field: static public UnityEngine.Rendering.Universal.Light2D/LightType Global
      static ::UnityEngine::Rendering::Universal::Light2D::LightType _get_Global();
      // Set static field: static public UnityEngine.Rendering.Universal.Light2D/LightType Global
      static void _set_Global(::UnityEngine::Rendering::Universal::Light2D::LightType value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.Rendering.Universal.Light2D/LightType
    #pragma pack(pop)
    static check_size<sizeof(Light2D::LightType), 0 + sizeof(int)> __UnityEngine_Rendering_Universal_Light2D_LightTypeSizeCheck;
    static_assert(sizeof(Light2D::LightType) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.Rendering.Universal.Light2D/NormalMapQuality
    // [TokenAttribute] Offset: FFFFFFFF
    struct NormalMapQuality/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: NormalMapQuality
      constexpr NormalMapQuality(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.Rendering.Universal.Light2D/NormalMapQuality Disabled
      static constexpr const int Disabled = 2;
      // Get static field: static public UnityEngine.Rendering.Universal.Light2D/NormalMapQuality Disabled
      static ::UnityEngine::Rendering::Universal::Light2D::NormalMapQuality _get_Disabled();
      // Set static field: static public UnityEngine.Rendering.Universal.Light2D/NormalMapQuality Disabled
      static void _set_Disabled(::UnityEngine::Rendering::Universal::Light2D::NormalMapQuality value);
      // static field const value: static public UnityEngine.Rendering.Universal.Light2D/NormalMapQuality Fast
      static constexpr const int Fast = 0;
      // Get static field: static public UnityEngine.Rendering.Universal.Light2D/NormalMapQuality Fast
      static ::UnityEngine::Rendering::Universal::Light2D::NormalMapQuality _get_Fast();
      // Set static field: static public UnityEngine.Rendering.Universal.Light2D/NormalMapQuality Fast
      static void _set_Fast(::UnityEngine::Rendering::Universal::Light2D::NormalMapQuality value);
      // static field const value: static public UnityEngine.Rendering.Universal.Light2D/NormalMapQuality Accurate
      static constexpr const int Accurate = 1;
      // Get static field: static public UnityEngine.Rendering.Universal.Light2D/NormalMapQuality Accurate
      static ::UnityEngine::Rendering::Universal::Light2D::NormalMapQuality _get_Accurate();
      // Set static field: static public UnityEngine.Rendering.Universal.Light2D/NormalMapQuality Accurate
      static void _set_Accurate(::UnityEngine::Rendering::Universal::Light2D::NormalMapQuality value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.Rendering.Universal.Light2D/NormalMapQuality
    #pragma pack(pop)
    static check_size<sizeof(Light2D::NormalMapQuality), 0 + sizeof(int)> __UnityEngine_Rendering_Universal_Light2D_NormalMapQualitySizeCheck;
    static_assert(sizeof(Light2D::NormalMapQuality) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.Rendering.Universal.Light2D/OverlapOperation
    // [TokenAttribute] Offset: FFFFFFFF
    struct OverlapOperation/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: OverlapOperation
      constexpr OverlapOperation(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.Rendering.Universal.Light2D/OverlapOperation Additive
      static constexpr const int Additive = 0;
      // Get static field: static public UnityEngine.Rendering.Universal.Light2D/OverlapOperation Additive
      static ::UnityEngine::Rendering::Universal::Light2D::OverlapOperation _get_Additive();
      // Set static field: static public UnityEngine.Rendering.Universal.Light2D/OverlapOperation Additive
      static void _set_Additive(::UnityEngine::Rendering::Universal::Light2D::OverlapOperation value);
      // static field const value: static public UnityEngine.Rendering.Universal.Light2D/OverlapOperation AlphaBlend
      static constexpr const int AlphaBlend = 1;
      // Get static field: static public UnityEngine.Rendering.Universal.Light2D/OverlapOperation AlphaBlend
      static ::UnityEngine::Rendering::Universal::Light2D::OverlapOperation _get_AlphaBlend();
      // Set static field: static public UnityEngine.Rendering.Universal.Light2D/OverlapOperation AlphaBlend
      static void _set_AlphaBlend(::UnityEngine::Rendering::Universal::Light2D::OverlapOperation value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.Rendering.Universal.Light2D/OverlapOperation
    #pragma pack(pop)
    static check_size<sizeof(Light2D::OverlapOperation), 0 + sizeof(int)> __UnityEngine_Rendering_Universal_Light2D_OverlapOperationSizeCheck;
    static_assert(sizeof(Light2D::OverlapOperation) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.Rendering.Universal.Light2D/ComponentVersions
    // [TokenAttribute] Offset: FFFFFFFF
    struct ComponentVersions/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: ComponentVersions
      constexpr ComponentVersions(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.Rendering.Universal.Light2D/ComponentVersions Version_Unserialized
      static constexpr const int Version_Unserialized = 0;
      // Get static field: static public UnityEngine.Rendering.Universal.Light2D/ComponentVersions Version_Unserialized
      static ::UnityEngine::Rendering::Universal::Light2D::ComponentVersions _get_Version_Unserialized();
      // Set static field: static public UnityEngine.Rendering.Universal.Light2D/ComponentVersions Version_Unserialized
      static void _set_Version_Unserialized(::UnityEngine::Rendering::Universal::Light2D::ComponentVersions value);
      // static field const value: static public UnityEngine.Rendering.Universal.Light2D/ComponentVersions Version_1
      static constexpr const int Version_1 = 1;
      // Get static field: static public UnityEngine.Rendering.Universal.Light2D/ComponentVersions Version_1
      static ::UnityEngine::Rendering::Universal::Light2D::ComponentVersions _get_Version_1();
      // Set static field: static public UnityEngine.Rendering.Universal.Light2D/ComponentVersions Version_1
      static void _set_Version_1(::UnityEngine::Rendering::Universal::Light2D::ComponentVersions value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.Rendering.Universal.Light2D/ComponentVersions
    #pragma pack(pop)
    static check_size<sizeof(Light2D::ComponentVersions), 0 + sizeof(int)> __UnityEngine_Rendering_Universal_Light2D_ComponentVersionsSizeCheck;
    static_assert(sizeof(Light2D::ComponentVersions) == 0x4);
    public:
    // private UnityEngine.Rendering.Universal.Light2D/ComponentVersions m_ComponentVersion
    // Size: 0x4
    // Offset: 0x20
    ::UnityEngine::Rendering::Universal::Light2D::ComponentVersions m_ComponentVersion;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::Light2D::ComponentVersions) == 0x4);
    // private UnityEngine.Rendering.Universal.Light2D/LightType m_LightType
    // Size: 0x4
    // Offset: 0x24
    ::UnityEngine::Rendering::Universal::Light2D::LightType m_LightType;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::Light2D::LightType) == 0x4);
    // private System.Int32 m_BlendStyleIndex
    // Size: 0x4
    // Offset: 0x28
    int m_BlendStyleIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single m_FalloffIntensity
    // Size: 0x4
    // Offset: 0x2C
    float m_FalloffIntensity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Color m_Color
    // Size: 0x10
    // Offset: 0x30
    ::UnityEngine::Color m_Color;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private System.Single m_Intensity
    // Size: 0x4
    // Offset: 0x40
    float m_Intensity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_LightVolumeIntensity
    // Size: 0x4
    // Offset: 0x44
    float m_LightVolumeIntensity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_LightVolumeIntensityEnabled
    // Size: 0x1
    // Offset: 0x48
    bool m_LightVolumeIntensityEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_LightVolumeIntensityEnabled and: m_ApplyToSortingLayers
    char __padding7[0x7] = {};
    // private System.Int32[] m_ApplyToSortingLayers
    // Size: 0x8
    // Offset: 0x50
    ::ArrayW<int> m_ApplyToSortingLayers;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // private UnityEngine.Sprite m_LightCookieSprite
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::Sprite* m_LightCookieSprite;
    // Field size check
    static_assert(sizeof(::UnityEngine::Sprite*) == 0x8);
    // private UnityEngine.Sprite m_DeprecatedPointLightCookieSprite
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::Sprite* m_DeprecatedPointLightCookieSprite;
    // Field size check
    static_assert(sizeof(::UnityEngine::Sprite*) == 0x8);
    // private System.Int32 m_LightOrder
    // Size: 0x4
    // Offset: 0x68
    int m_LightOrder;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean m_AlphaBlendOnOverlap
    // Size: 0x1
    // Offset: 0x6C
    bool m_AlphaBlendOnOverlap;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_AlphaBlendOnOverlap and: m_OverlapOperation
    char __padding12[0x3] = {};
    // private UnityEngine.Rendering.Universal.Light2D/OverlapOperation m_OverlapOperation
    // Size: 0x4
    // Offset: 0x70
    ::UnityEngine::Rendering::Universal::Light2D::OverlapOperation m_OverlapOperation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::Light2D::OverlapOperation) == 0x4);
    // private System.Single m_NormalMapDistance
    // Size: 0x4
    // Offset: 0x74
    float m_NormalMapDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Rendering.Universal.Light2D/NormalMapQuality m_NormalMapQuality
    // Size: 0x4
    // Offset: 0x78
    ::UnityEngine::Rendering::Universal::Light2D::NormalMapQuality m_NormalMapQuality;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::Light2D::NormalMapQuality) == 0x4);
    // private System.Boolean m_UseNormalMap
    // Size: 0x1
    // Offset: 0x7C
    bool m_UseNormalMap;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_ShadowIntensityEnabled
    // Size: 0x1
    // Offset: 0x7D
    bool m_ShadowIntensityEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_ShadowIntensityEnabled and: m_ShadowIntensity
    char __padding17[0x2] = {};
    // private System.Single m_ShadowIntensity
    // Size: 0x4
    // Offset: 0x80
    float m_ShadowIntensity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_ShadowVolumeIntensityEnabled
    // Size: 0x1
    // Offset: 0x84
    bool m_ShadowVolumeIntensityEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_ShadowVolumeIntensityEnabled and: m_ShadowVolumeIntensity
    char __padding19[0x3] = {};
    // private System.Single m_ShadowVolumeIntensity
    // Size: 0x4
    // Offset: 0x88
    float m_ShadowVolumeIntensity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: m_ShadowVolumeIntensity and: m_Mesh
    char __padding20[0x4] = {};
    // private UnityEngine.Mesh m_Mesh
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::Mesh* m_Mesh;
    // Field size check
    static_assert(sizeof(::UnityEngine::Mesh*) == 0x8);
    // private UnityEngine.Rendering.Universal.LightUtility/LightMeshVertex[] m_Vertices
    // Size: 0x8
    // Offset: 0x98
    ::ArrayW<::UnityEngine::Rendering::Universal::LightUtility::LightMeshVertex> m_Vertices;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Rendering::Universal::LightUtility::LightMeshVertex>) == 0x8);
    // private System.UInt16[] m_Triangles
    // Size: 0x8
    // Offset: 0xA0
    ::ArrayW<uint16_t> m_Triangles;
    // Field size check
    static_assert(sizeof(::ArrayW<uint16_t>) == 0x8);
    // private System.Int32 m_PreviousLightCookieSprite
    // Size: 0x4
    // Offset: 0xA8
    int m_PreviousLightCookieSprite;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // UnityEngine.Vector3 m_CachedPosition
    // Size: 0xC
    // Offset: 0xAC
    ::UnityEngine::Vector3 m_CachedPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Bounds m_LocalBounds
    // Size: 0x18
    // Offset: 0xB8
    ::UnityEngine::Bounds m_LocalBounds;
    // Field size check
    static_assert(sizeof(::UnityEngine::Bounds) == 0x18);
    // private UnityEngine.BoundingSphere <boundingSphere>k__BackingField
    // Size: 0x10
    // Offset: 0xD0
    ::UnityEngine::BoundingSphere boundingSphere;
    // Field size check
    static_assert(sizeof(::UnityEngine::BoundingSphere) == 0x10);
    // System.Boolean forceUpdate
    // Size: 0x1
    // Offset: 0xE0
    bool forceUpdate;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: forceUpdate and: m_PointLightInnerAngle
    char __padding28[0x3] = {};
    // private System.Single m_PointLightInnerAngle
    // Size: 0x4
    // Offset: 0xE4
    float m_PointLightInnerAngle;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_PointLightOuterAngle
    // Size: 0x4
    // Offset: 0xE8
    float m_PointLightOuterAngle;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_PointLightInnerRadius
    // Size: 0x4
    // Offset: 0xEC
    float m_PointLightInnerRadius;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_PointLightOuterRadius
    // Size: 0x4
    // Offset: 0xF0
    float m_PointLightOuterRadius;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 m_ShapeLightParametricSides
    // Size: 0x4
    // Offset: 0xF4
    int m_ShapeLightParametricSides;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single m_ShapeLightParametricAngleOffset
    // Size: 0x4
    // Offset: 0xF8
    float m_ShapeLightParametricAngleOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_ShapeLightParametricRadius
    // Size: 0x4
    // Offset: 0xFC
    float m_ShapeLightParametricRadius;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_ShapeLightFalloffSize
    // Size: 0x4
    // Offset: 0x100
    float m_ShapeLightFalloffSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector2 m_ShapeLightFalloffOffset
    // Size: 0x8
    // Offset: 0x104
    ::UnityEngine::Vector2 m_ShapeLightFalloffOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // Padding between fields: m_ShapeLightFalloffOffset and: m_ShapePath
    char __padding37[0x4] = {};
    // private UnityEngine.Vector3[] m_ShapePath
    // Size: 0x8
    // Offset: 0x110
    ::ArrayW<::UnityEngine::Vector3> m_ShapePath;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector3>) == 0x8);
    // private System.Single m_PreviousShapeLightFalloffSize
    // Size: 0x4
    // Offset: 0x118
    float m_PreviousShapeLightFalloffSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 m_PreviousShapeLightParametricSides
    // Size: 0x4
    // Offset: 0x11C
    int m_PreviousShapeLightParametricSides;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single m_PreviousShapeLightParametricAngleOffset
    // Size: 0x4
    // Offset: 0x120
    float m_PreviousShapeLightParametricAngleOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_PreviousShapeLightParametricRadius
    // Size: 0x4
    // Offset: 0x124
    float m_PreviousShapeLightParametricRadius;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 m_PreviousShapePathHash
    // Size: 0x4
    // Offset: 0x128
    int m_PreviousShapePathHash;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.Rendering.Universal.Light2D/LightType m_PreviousLightType
    // Size: 0x4
    // Offset: 0x12C
    ::UnityEngine::Rendering::Universal::Light2D::LightType m_PreviousLightType;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::Light2D::LightType) == 0x4);
    public:
    // Creating interface conversion operator: operator ::UnityEngine::ISerializationCallbackReceiver
    operator ::UnityEngine::ISerializationCallbackReceiver() noexcept {
      return *reinterpret_cast<::UnityEngine::ISerializationCallbackReceiver*>(this);
    }
    // static field const value: static private UnityEngine.Rendering.Universal.Light2D/ComponentVersions k_CurrentComponentVersion
    static constexpr const int k_CurrentComponentVersion = 1;
    // Get static field: static private UnityEngine.Rendering.Universal.Light2D/ComponentVersions k_CurrentComponentVersion
    static ::UnityEngine::Rendering::Universal::Light2D::ComponentVersions _get_k_CurrentComponentVersion();
