// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.IDisposable
#include "System/IDisposable.hpp"
// Including type: UnityEngine.Matrix4x4
#include "UnityEngine/Matrix4x4.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
// Including type: UnityEngine.Vector4
#include "UnityEngine/Vector4.hpp"
// Including type: UnityEngine.Vector2Int
#include "UnityEngine/Vector2Int.hpp"
// Including type: UnityEngine.Experimental.Rendering.GraphicsFormat
#include "UnityEngine/Experimental/Rendering/GraphicsFormat.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::Rendering::Universal
namespace UnityEngine::Rendering::Universal {
  // Forward declaring type: LightData
  struct LightData;
  // Forward declaring type: UniversalAdditionalLightData
  class UniversalAdditionalLightData;
}
// Forward declaring namespace: UnityEngine::Rendering
namespace UnityEngine::Rendering {
  // Forward declaring type: ScriptableRenderContext
  struct ScriptableRenderContext;
  // Forward declaring type: Texture2DAtlas
  class Texture2DAtlas;
  // Forward declaring type: CommandBuffer
  class CommandBuffer;
  // Forward declaring type: VisibleLight
  struct VisibleLight;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Texture
  class Texture;
  // Forward declaring type: Light
  class Light;
  // Forward declaring type: Vector2
  struct Vector2;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Func`3<T1, T2, TResult>
  template<typename T1, typename T2, typename TResult>
  class Func_3;
}
// Completed forward declares
// Type namespace: UnityEngine.Rendering.Universal
namespace UnityEngine::Rendering::Universal {
  // Forward declaring type: LightCookieManager
  class LightCookieManager;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::Rendering::Universal::LightCookieManager);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::Rendering::Universal::LightCookieManager*, "UnityEngine.Rendering.Universal", "LightCookieManager");
// Type namespace: UnityEngine.Rendering.Universal
namespace UnityEngine::Rendering::Universal {
  // Size: 0x5D
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.Rendering.Universal.LightCookieManager
  // [TokenAttribute] Offset: FFFFFFFF
  class LightCookieManager : public ::Il2CppObject/*, public ::System::IDisposable*/ {
    public:
    // Nested type: ::UnityEngine::Rendering::Universal::LightCookieManager::ShaderProperty
    class ShaderProperty;
    // Nested type: ::UnityEngine::Rendering::Universal::LightCookieManager::LightCookieShaderFormat
    struct LightCookieShaderFormat;
    // Nested type: ::UnityEngine::Rendering::Universal::LightCookieManager::Settings
    struct Settings;
    // Nested type: ::UnityEngine::Rendering::Universal::LightCookieManager::Sorting
    struct Sorting;
    // Nested type: ::UnityEngine::Rendering::Universal::LightCookieManager::LightCookieMapping
    struct LightCookieMapping;
    // Nested type: ::UnityEngine::Rendering::Universal::LightCookieManager::WorkSlice_1<T>
    template<typename T>
    struct WorkSlice_1;
    // Nested type: ::UnityEngine::Rendering::Universal::LightCookieManager::WorkMemory
    class WorkMemory;
    // Nested type: ::UnityEngine::Rendering::Universal::LightCookieManager::ShaderBitArray
    struct ShaderBitArray;
    // Nested type: ::UnityEngine::Rendering::Universal::LightCookieManager::LightCookieShaderData
    class LightCookieShaderData;
    // Size: 0x19
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.Rendering.Universal.LightCookieManager/Settings
    // [TokenAttribute] Offset: FFFFFFFF
    struct Settings/*, public ::System::ValueType*/ {
      public:
      // Nested type: ::UnityEngine::Rendering::Universal::LightCookieManager::Settings::AtlasSettings
      struct AtlasSettings;
      // Size: 0xD
      #pragma pack(push, 1)
      // WARNING Layout: Sequential may not be correctly taken into account!
      // Autogenerated type: UnityEngine.Rendering.Universal.LightCookieManager/Settings/AtlasSettings
      // [TokenAttribute] Offset: FFFFFFFF
      struct AtlasSettings/*, public ::System::ValueType*/ {
        public:
        public:
        // public UnityEngine.Vector2Int resolution
        // Size: 0x8
        // Offset: 0x0
        ::UnityEngine::Vector2Int resolution;
        // Field size check
        static_assert(sizeof(::UnityEngine::Vector2Int) == 0x8);
        // public UnityEngine.Experimental.Rendering.GraphicsFormat format
        // Size: 0x4
        // Offset: 0x8
        ::UnityEngine::Experimental::Rendering::GraphicsFormat format;
        // Field size check
        static_assert(sizeof(::UnityEngine::Experimental::Rendering::GraphicsFormat) == 0x4);
        // public System.Boolean useMips
        // Size: 0x1
        // Offset: 0xC
        bool useMips;
        // Field size check
        static_assert(sizeof(bool) == 0x1);
        public:
        // Creating value type constructor for type: AtlasSettings
        constexpr AtlasSettings(::UnityEngine::Vector2Int resolution_ = {}, ::UnityEngine::Experimental::Rendering::GraphicsFormat format_ = {}, bool useMips_ = {}) noexcept : resolution{resolution_}, format{format_}, useMips{useMips_} {}
        // Creating interface conversion operator: operator ::System::ValueType
        operator ::System::ValueType() noexcept {
          return *reinterpret_cast<::System::ValueType*>(this);
        }
        // Get instance field reference: public UnityEngine.Vector2Int resolution
        [[deprecated("Use field access instead!")]] ::UnityEngine::Vector2Int& dyn_resolution();
        // Get instance field reference: public UnityEngine.Experimental.Rendering.GraphicsFormat format
        [[deprecated("Use field access instead!")]] ::UnityEngine::Experimental::Rendering::GraphicsFormat& dyn_format();
        // Get instance field reference: public System.Boolean useMips
        [[deprecated("Use field access instead!")]] bool& dyn_useMips();
        // public System.Boolean get_isPow2()
        // Offset: 0x52BC824
        bool get_isPow2();
        // public System.Boolean get_isSquare()
        // Offset: 0x52BF308
        bool get_isSquare();
      }; // UnityEngine.Rendering.Universal.LightCookieManager/Settings/AtlasSettings
      #pragma pack(pop)
      static check_size<sizeof(LightCookieManager::Settings::AtlasSettings), 12 + sizeof(bool)> __UnityEngine_Rendering_Universal_LightCookieManager_Settings_AtlasSettingsSizeCheck;
      static_assert(sizeof(LightCookieManager::Settings::AtlasSettings) == 0xD);
      public:
      // public UnityEngine.Rendering.Universal.LightCookieManager/Settings/AtlasSettings atlas
      // Size: 0xD
      // Offset: 0x0
      ::UnityEngine::Rendering::Universal::LightCookieManager::Settings::AtlasSettings atlas;
      // Field size check
      static_assert(sizeof(::UnityEngine::Rendering::Universal::LightCookieManager::Settings::AtlasSettings) == 0xD);
      // Padding between fields: atlas and: maxAdditionalLights
      char __padding0[0x3] = {};
      // public System.Int32 maxAdditionalLights
      // Size: 0x4
      // Offset: 0x10
      int maxAdditionalLights;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Single cubeOctahedralSizeScale
      // Size: 0x4
      // Offset: 0x14
      float cubeOctahedralSizeScale;
      // Field size check
      static_assert(sizeof(float) == 0x4);
      // public System.Boolean useStructuredBuffer
      // Size: 0x1
      // Offset: 0x18
      bool useStructuredBuffer;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      public:
      // Creating value type constructor for type: Settings
      constexpr Settings(::UnityEngine::Rendering::Universal::LightCookieManager::Settings::AtlasSettings atlas_ = {}, int maxAdditionalLights_ = {}, float cubeOctahedralSizeScale_ = {}, bool useStructuredBuffer_ = {}) noexcept : atlas{atlas_}, maxAdditionalLights{maxAdditionalLights_}, cubeOctahedralSizeScale{cubeOctahedralSizeScale_}, useStructuredBuffer{useStructuredBuffer_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public UnityEngine.Rendering.Universal.LightCookieManager/Settings/AtlasSettings atlas
      [[deprecated("Use field access instead!")]] ::UnityEngine::Rendering::Universal::LightCookieManager::Settings::AtlasSettings& dyn_atlas();
      // Get instance field reference: public System.Int32 maxAdditionalLights
      [[deprecated("Use field access instead!")]] int& dyn_maxAdditionalLights();
      // Get instance field reference: public System.Single cubeOctahedralSizeScale
      [[deprecated("Use field access instead!")]] float& dyn_cubeOctahedralSizeScale();
      // Get instance field reference: public System.Boolean useStructuredBuffer
      [[deprecated("Use field access instead!")]] bool& dyn_useStructuredBuffer();
      // static public UnityEngine.Rendering.Universal.LightCookieManager/Settings Create()
      // Offset: 0x52BF220
      static ::UnityEngine::Rendering::Universal::LightCookieManager::Settings Create();
    }; // UnityEngine.Rendering.Universal.LightCookieManager/Settings
    #pragma pack(pop)
    static check_size<sizeof(LightCookieManager::Settings), 24 + sizeof(bool)> __UnityEngine_Rendering_Universal_LightCookieManager_SettingsSizeCheck;
    static_assert(sizeof(LightCookieManager::Settings) == 0x19);
    // Size: 0x10
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.Rendering.Universal.LightCookieManager/LightCookieMapping
    // [TokenAttribute] Offset: FFFFFFFF
    struct LightCookieMapping/*, public ::System::ValueType*/ {
      public:
      // Nested type: ::UnityEngine::Rendering::Universal::LightCookieManager::LightCookieMapping::$$c
      class $$c;
      public:
      // public System.UInt16 visibleLightIndex
      // Size: 0x2
      // Offset: 0x0
      uint16_t visibleLightIndex;
      // Field size check
      static_assert(sizeof(uint16_t) == 0x2);
      // public System.UInt16 lightBufferIndex
      // Size: 0x2
      // Offset: 0x2
      uint16_t lightBufferIndex;
      // Field size check
      static_assert(sizeof(uint16_t) == 0x2);
      // Padding between fields: lightBufferIndex and: light
      char __padding1[0x4] = {};
      // public UnityEngine.Light light
      // Size: 0x8
      // Offset: 0x8
      ::UnityEngine::Light* light;
      // Field size check
      static_assert(sizeof(::UnityEngine::Light*) == 0x8);
      public:
      // Creating value type constructor for type: LightCookieMapping
      constexpr LightCookieMapping(uint16_t visibleLightIndex_ = {}, uint16_t lightBufferIndex_ = {}, ::UnityEngine::Light* light_ = {}) noexcept : visibleLightIndex{visibleLightIndex_}, lightBufferIndex{lightBufferIndex_}, light{light_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get static field: static public System.Func`3<UnityEngine.Rendering.Universal.LightCookieManager/LightCookieMapping,UnityEngine.Rendering.Universal.LightCookieManager/LightCookieMapping,System.Int32> s_CompareByCookieSize
      static ::System::Func_3<::UnityEngine::Rendering::Universal::LightCookieManager::LightCookieMapping, ::UnityEngine::Rendering::Universal::LightCookieManager::LightCookieMapping, int>* _get_s_CompareByCookieSize();
      // Set static field: static public System.Func`3<UnityEngine.Rendering.Universal.LightCookieManager/LightCookieMapping,UnityEngine.Rendering.Universal.LightCookieManager/LightCookieMapping,System.Int32> s_CompareByCookieSize
      static void _set_s_CompareByCookieSize(::System::Func_3<::UnityEngine::Rendering::Universal::LightCookieManager::LightCookieMapping, ::UnityEngine::Rendering::Universal::LightCookieManager::LightCookieMapping, int>* value);
      // Get static field: static public System.Func`3<UnityEngine.Rendering.Universal.LightCookieManager/LightCookieMapping,UnityEngine.Rendering.Universal.LightCookieManager/LightCookieMapping,System.Int32> s_CompareByBufferIndex
      static ::System::Func_3<::UnityEngine::Rendering::Universal::LightCookieManager::LightCookieMapping, ::UnityEngine::Rendering::Universal::LightCookieManager::LightCookieMapping, int>* _get_s_CompareByBufferIndex();
      // Set static field: static public System.Func`3<UnityEngine.Rendering.Universal.LightCookieManager/LightCookieMapping,UnityEngine.Rendering.Universal.LightCookieManager/LightCookieMapping,System.Int32> s_CompareByBufferIndex
      static void _set_s_CompareByBufferIndex(::System::Func_3<::UnityEngine::Rendering::Universal::LightCookieManager::LightCookieMapping, ::UnityEngine::Rendering::Universal::LightCookieManager::LightCookieMapping, int>* value);
      // Get instance field reference: public System.UInt16 visibleLightIndex
      [[deprecated("Use field access instead!")]] uint16_t& dyn_visibleLightIndex();
      // Get instance field reference: public System.UInt16 lightBufferIndex
      [[deprecated("Use field access instead!")]] uint16_t& dyn_lightBufferIndex();
      // Get instance field reference: public UnityEngine.Light light
      [[deprecated("Use field access instead!")]] ::UnityEngine::Light*& dyn_light();
      // static private System.Void .cctor()
      // Offset: 0x52BF318
      static void _cctor();
    }; // UnityEngine.Rendering.Universal.LightCookieManager/LightCookieMapping
    #pragma pack(pop)
    static check_size<sizeof(LightCookieManager::LightCookieMapping), 8 + sizeof(::UnityEngine::Light*)> __UnityEngine_Rendering_Universal_LightCookieManager_LightCookieMappingSizeCheck;
    static_assert(sizeof(LightCookieManager::LightCookieMapping) == 0x10);
    public:
    // private UnityEngine.Rendering.Texture2DAtlas m_AdditionalLightsCookieAtlas
    // Size: 0x8
    // Offset: 0x10
    ::UnityEngine::Rendering::Texture2DAtlas* m_AdditionalLightsCookieAtlas;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Texture2DAtlas*) == 0x8);
    // private UnityEngine.Rendering.Universal.LightCookieManager/LightCookieShaderData m_AdditionalLightsCookieShaderData
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::Rendering::Universal::LightCookieManager::LightCookieShaderData* m_AdditionalLightsCookieShaderData;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::LightCookieManager::LightCookieShaderData*) == 0x8);
    // private readonly UnityEngine.Rendering.Universal.LightCookieManager/Settings m_Settings
    // Size: 0x19
    // Offset: 0x20
    ::UnityEngine::Rendering::Universal::LightCookieManager::Settings m_Settings;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::LightCookieManager::Settings) == 0x19);
    // Padding between fields: m_Settings and: m_WorkMem
    char __padding2[0x7] = {};
    // private UnityEngine.Rendering.Universal.LightCookieManager/WorkMemory m_WorkMem
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::Rendering::Universal::LightCookieManager::WorkMemory* m_WorkMem;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::LightCookieManager::WorkMemory*) == 0x8);
    // private System.Int32[] m_VisibleLightIndexToShaderDataIndex
    // Size: 0x8
    // Offset: 0x48
    ::ArrayW<int> m_VisibleLightIndexToShaderDataIndex;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // private System.Int32 m_CookieSizeDivisor
    // Size: 0x4
    // Offset: 0x50
    int m_CookieSizeDivisor;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.UInt32 m_PrevCookieRequestPixelCount
    // Size: 0x4
    // Offset: 0x54
    uint m_PrevCookieRequestPixelCount;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.Int32 m_PrevWarnFrame
    // Size: 0x4
    // Offset: 0x58
    int m_PrevWarnFrame;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean <IsKeywordLightCookieEnabled>k__BackingField
    // Size: 0x1
    // Offset: 0x5C
    bool IsKeywordLightCookieEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating interface conversion operator: operator ::System::IDisposable
    operator ::System::IDisposable() noexcept {
      return *reinterpret_cast<::System::IDisposable*>(this);
    }
    // Get static field: static private readonly UnityEngine.Matrix4x4 s_DirLightProj
    static ::UnityEngine::Matrix4x4 _get_s_DirLightProj();
    // Set static field: static private readonly UnityEngine.Matrix4x4 s_DirLightProj
    static void _set_s_DirLightProj(::UnityEngine::Matrix4x4 value);
    // static field const value: static private System.Int32 k_MaxCookieSizeDivisor
    static constexpr const int k_MaxCookieSizeDivisor = 16;
    // Get static field: static private System.Int32 k_MaxCookieSizeDivisor
    static int _get_k_MaxCookieSizeDivisor();
    // Set static field: static private System.Int32 k_MaxCookieSizeDivisor
