// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::Rendering::Universal
namespace UnityEngine::Rendering::Universal {
  // Forward declaring type: TEdge
  class TEdge;
}
// Completed forward declares
// Type namespace: UnityEngine.Rendering.Universal
namespace UnityEngine::Rendering::Universal {
  // Forward declaring type: LocalMinima
  class LocalMinima;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::Rendering::Universal::LocalMinima);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::Rendering::Universal::LocalMinima*, "UnityEngine.Rendering.Universal", "LocalMinima");
// Type namespace: UnityEngine.Rendering.Universal
namespace UnityEngine::Rendering::Universal {
  // Size: 0x30
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.Rendering.Universal.LocalMinima
  // [TokenAttribute] Offset: FFFFFFFF
  class LocalMinima : public ::Il2CppObject {
    public:
    public:
    // System.Int64 Y
    // Size: 0x8
    // Offset: 0x10
    int64_t Y;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // UnityEngine.Rendering.Universal.TEdge LeftBound
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::Rendering::Universal::TEdge* LeftBound;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::TEdge*) == 0x8);
    // UnityEngine.Rendering.Universal.TEdge RightBound
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::Rendering::Universal::TEdge* RightBound;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::TEdge*) == 0x8);
    // UnityEngine.Rendering.Universal.LocalMinima Next
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::Rendering::Universal::LocalMinima* Next;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::LocalMinima*) == 0x8);
    public:
    // Get instance field reference: System.Int64 Y
    [[deprecated("Use field access instead!")]] int64_t& dyn_Y();
    // Get instance field reference: UnityEngine.Rendering.Universal.TEdge LeftBound
    [[deprecated("Use field access instead!")]] ::UnityEngine::Rendering::Universal::TEdge*& dyn_LeftBound();
    // Get instance field reference: UnityEngine.Rendering.Universal.TEdge RightBound
    [[deprecated("Use field access instead!")]] ::UnityEngine::Rendering::Universal::TEdge*& dyn_RightBound();
    // Get instance field reference: UnityEngine.Rendering.Universal.LocalMinima Next
    [[deprecated("Use field access instead!")]] ::UnityEngine::Rendering::Universal::LocalMinima*& dyn_Next();
    // public System.Void .ctor()
    // Offset: 0x526CE1C
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static LocalMinima* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::Rendering::Universal::LocalMinima::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<LocalMinima*, creationType>()));
    }
  }; // UnityEngine.Rendering.Universal.LocalMinima
  #pragma pack(pop)
  static check_size<sizeof(LocalMinima), 40 + sizeof(::UnityEngine::Rendering::Universal::LocalMinima*)> __UnityEngine_Rendering_Universal_LocalMinimaSizeCheck;
  static_assert(sizeof(LocalMinima) == 0x30);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: UnityEngine::Rendering::Universal::LocalMinima::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
