// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.Rendering.Universal.IntPoint
#include "UnityEngine/Rendering/Universal/IntPoint.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Type namespace: UnityEngine.Rendering.Universal
namespace UnityEngine::Rendering::Universal {
  // Forward declaring type: OutPt
  class OutPt;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::Rendering::Universal::OutPt);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::Rendering::Universal::OutPt*, "UnityEngine.Rendering.Universal", "OutPt");
// Type namespace: UnityEngine.Rendering.Universal
namespace UnityEngine::Rendering::Universal {
  // Size: 0x58
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.Rendering.Universal.OutPt
  // [TokenAttribute] Offset: FFFFFFFF
  class OutPt : public ::Il2CppObject {
    public:
    public:
    // System.Int32 Idx
    // Size: 0x4
    // Offset: 0x10
    int Idx;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: Idx and: Pt
    char __padding0[0x4] = {};
    // UnityEngine.Rendering.Universal.IntPoint Pt
    // Size: 0x30
    // Offset: 0x18
    ::UnityEngine::Rendering::Universal::IntPoint Pt;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::IntPoint) == 0x30);
    // UnityEngine.Rendering.Universal.OutPt Next
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::Rendering::Universal::OutPt* Next;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::OutPt*) == 0x8);
    // UnityEngine.Rendering.Universal.OutPt Prev
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::Rendering::Universal::OutPt* Prev;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::OutPt*) == 0x8);
    public:
    // Get instance field reference: System.Int32 Idx
    [[deprecated("Use field access instead!")]] int& dyn_Idx();
    // Get instance field reference: UnityEngine.Rendering.Universal.IntPoint Pt
    [[deprecated("Use field access instead!")]] ::UnityEngine::Rendering::Universal::IntPoint& dyn_Pt();
    // Get instance field reference: UnityEngine.Rendering.Universal.OutPt Next
    [[deprecated("Use field access instead!")]] ::UnityEngine::Rendering::Universal::OutPt*& dyn_Next();
    // Get instance field reference: UnityEngine.Rendering.Universal.OutPt Prev
    [[deprecated("Use field access instead!")]] ::UnityEngine::Rendering::Universal::OutPt*& dyn_Prev();
    // public System.Void .ctor()
    // Offset: 0x526CE3C
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static OutPt* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::Rendering::Universal::OutPt::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<OutPt*, creationType>()));
    }
  }; // UnityEngine.Rendering.Universal.OutPt
  #pragma pack(pop)
  static check_size<sizeof(OutPt), 80 + sizeof(::UnityEngine::Rendering::Universal::OutPt*)> __UnityEngine_Rendering_Universal_OutPtSizeCheck;
  static_assert(sizeof(OutPt) == 0x58);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: UnityEngine::Rendering::Universal::OutPt::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
