// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.Rendering.Universal.IntPoint
#include "UnityEngine/Rendering/Universal/IntPoint.hpp"
// Including type: UnityEngine.Rendering.Universal.JoinType
#include "UnityEngine/Rendering/Universal/JoinType.hpp"
// Including type: UnityEngine.Rendering.Universal.EndType
#include "UnityEngine/Rendering/Universal/EndType.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: UnityEngine.Rendering.Universal
namespace UnityEngine::Rendering::Universal {
  // Forward declaring type: PolyNode
  class PolyNode;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::Rendering::Universal::PolyNode);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::Rendering::Universal::PolyNode*, "UnityEngine.Rendering.Universal", "PolyNode");
// Type namespace: UnityEngine.Rendering.Universal
namespace UnityEngine::Rendering::Universal {
  // Size: 0x39
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.Rendering.Universal.PolyNode
  // [TokenAttribute] Offset: FFFFFFFF
  class PolyNode : public ::Il2CppObject {
    public:
    public:
    // UnityEngine.Rendering.Universal.PolyNode m_Parent
    // Size: 0x8
    // Offset: 0x10
    ::UnityEngine::Rendering::Universal::PolyNode* m_Parent;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::PolyNode*) == 0x8);
    // System.Collections.Generic.List`1<UnityEngine.Rendering.Universal.IntPoint> m_polygon
    // Size: 0x8
    // Offset: 0x18
    ::System::Collections::Generic::List_1<::UnityEngine::Rendering::Universal::IntPoint>* m_polygon;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Rendering::Universal::IntPoint>*) == 0x8);
    // System.Int32 m_Index
    // Size: 0x4
    // Offset: 0x20
    int m_Index;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // UnityEngine.Rendering.Universal.JoinType m_jointype
    // Size: 0x4
    // Offset: 0x24
    ::UnityEngine::Rendering::Universal::JoinType m_jointype;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::JoinType) == 0x4);
    // UnityEngine.Rendering.Universal.EndType m_endtype
    // Size: 0x4
    // Offset: 0x28
    ::UnityEngine::Rendering::Universal::EndType m_endtype;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::EndType) == 0x4);
    // Padding between fields: m_endtype and: m_Childs
    char __padding4[0x4] = {};
    // System.Collections.Generic.List`1<UnityEngine.Rendering.Universal.PolyNode> m_Childs
    // Size: 0x8
    // Offset: 0x30
    ::System::Collections::Generic::List_1<::UnityEngine::Rendering::Universal::PolyNode*>* m_Childs;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Rendering::Universal::PolyNode*>*) == 0x8);
    // private System.Boolean <IsOpen>k__BackingField
    // Size: 0x1
    // Offset: 0x38
    bool IsOpen;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get instance field reference: UnityEngine.Rendering.Universal.PolyNode m_Parent
    [[deprecated("Use field access instead!")]] ::UnityEngine::Rendering::Universal::PolyNode*& dyn_m_Parent();
    // Get instance field reference: System.Collections.Generic.List`1<UnityEngine.Rendering.Universal.IntPoint> m_polygon
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::UnityEngine::Rendering::Universal::IntPoint>*& dyn_m_polygon();
    // Get instance field reference: System.Int32 m_Index
    [[deprecated("Use field access instead!")]] int& dyn_m_Index();
    // Get instance field reference: UnityEngine.Rendering.Universal.JoinType m_jointype
    [[deprecated("Use field access instead!")]] ::UnityEngine::Rendering::Universal::JoinType& dyn_m_jointype();
    // Get instance field reference: UnityEngine.Rendering.Universal.EndType m_endtype
    [[deprecated("Use field access instead!")]] ::UnityEngine::Rendering::Universal::EndType& dyn_m_endtype();
    // Get instance field reference: System.Collections.Generic.List`1<UnityEngine.Rendering.Universal.PolyNode> m_Childs
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::UnityEngine::Rendering::Universal::PolyNode*>*& dyn_m_Childs();
    // Get instance field reference: private System.Boolean <IsOpen>k__BackingField
    [[deprecated("Use field access instead!")]] bool& dyn_$IsOpen$k__BackingField();
    // private System.Boolean IsHoleNode()
    // Offset: 0x526C65C
    bool IsHoleNode();
    // public System.Int32 get_ChildCount()
    // Offset: 0x526C678
    int get_ChildCount();
    // public System.Collections.Generic.List`1<UnityEngine.Rendering.Universal.IntPoint> get_Contour()
    // Offset: 0x526C6C0
    ::System::Collections::Generic::List_1<::UnityEngine::Rendering::Universal::IntPoint>* get_Contour();
    // System.Void AddChild(UnityEngine.Rendering.Universal.PolyNode Child)
    // Offset: 0x526C6C8
    void AddChild(::UnityEngine::Rendering::Universal::PolyNode* Child);
    // public UnityEngine.Rendering.Universal.PolyNode GetNext()
    // Offset: 0x526C794
    ::UnityEngine::Rendering::Universal::PolyNode* GetNext();
    // UnityEngine.Rendering.Universal.PolyNode GetNextSiblingUp()
    // Offset: 0x526C810
    ::UnityEngine::Rendering::Universal::PolyNode* GetNextSiblingUp();
    // public System.Collections.Generic.List`1<UnityEngine.Rendering.Universal.PolyNode> get_Childs()
    // Offset: 0x526C8B0
    ::System::Collections::Generic::List_1<::UnityEngine::Rendering::Universal::PolyNode*>* get_Childs();
    // public UnityEngine.Rendering.Universal.PolyNode get_Parent()
    // Offset: 0x526C8B8
    ::UnityEngine::Rendering::Universal::PolyNode* get_Parent();
    // public System.Boolean get_IsHole()
    // Offset: 0x526C8C0
    bool get_IsHole();
    // public System.Boolean get_IsOpen()
    // Offset: 0x526C8DC
    bool get_IsOpen();
    // public System.Void set_IsOpen(System.Boolean value)
    // Offset: 0x526C8E4
    void set_IsOpen(bool value);
    // public System.Void .ctor()
    // Offset: 0x526C580
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static PolyNode* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::UnityEngine::Rendering::Universal::PolyNode::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<PolyNode*, creationType>()));
    }
  }; // UnityEngine.Rendering.Universal.PolyNode
  #pragma pack(pop)
  static check_size<sizeof(PolyNode), 56 + sizeof(bool)> __UnityEngine_Rendering_Universal_PolyNodeSizeCheck;
  static_assert(sizeof(PolyNode) == 0x39);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: UnityEngine::Rendering::Universal::PolyNode::IsHoleNode
// Il2CppName: IsHoleNode
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (UnityEngine::Rendering::Universal::PolyNode::*)()>(&UnityEngine::Rendering::Universal::PolyNode::IsHoleNode)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::Rendering::Universal::PolyNode*), "IsHoleNode", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: UnityEngine::Rendering::Universal::PolyNode::get_ChildCount
// Il2CppName: get_ChildCount
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<int (UnityEngine::Rendering::Universal::PolyNode::*)()>(&UnityEngine::Rendering::Universal::PolyNode::get_ChildCount)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::Rendering::Universal::PolyNode*), "get_ChildCount", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: UnityEngine::Rendering::Universal::PolyNode::get_Contour
// Il2CppName: get_Contour
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::System::Collections::Generic::List_1<::UnityEngine::Rendering::Universal::IntPoint>* (UnityEngine::Rendering::Universal::PolyNode::*)()>(&UnityEngine::Rendering::Universal::PolyNode::get_Contour)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::Rendering::Universal::PolyNode*), "get_Contour", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: UnityEngine::Rendering::Universal::PolyNode::AddChild
// Il2CppName: AddChild
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (UnityEngine::Rendering::Universal::PolyNode::*)(::UnityEngine::Rendering::Universal::PolyNode*)>(&UnityEngine::Rendering::Universal::PolyNode::AddChild)> {
  static const MethodInfo* get() {
    static auto* Child = &::il2cpp_utils::GetClassFromName("UnityEngine.Rendering.Universal", "PolyNode")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::Rendering::Universal::PolyNode*), "AddChild", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{Child});
  }
};
// Writing MetadataGetter for method: UnityEngine::Rendering::Universal::PolyNode::GetNext
// Il2CppName: GetNext
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::Rendering::Universal::PolyNode* (UnityEngine::Rendering::Universal::PolyNode::*)()>(&UnityEngine::Rendering::Universal::PolyNode::GetNext)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::Rendering::Universal::PolyNode*), "GetNext", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: UnityEngine::Rendering::Universal::PolyNode::GetNextSiblingUp
// Il2CppName: GetNextSiblingUp
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::Rendering::Universal::PolyNode* (UnityEngine::Rendering::Universal::PolyNode::*)()>(&UnityEngine::Rendering::Universal::PolyNode::GetNextSiblingUp)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::Rendering::Universal::PolyNode*), "GetNextSiblingUp", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: UnityEngine::Rendering::Universal::PolyNode::get_Childs
// Il2CppName: get_Childs
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::System::Collections::Generic::List_1<::UnityEngine::Rendering::Universal::PolyNode*>* (UnityEngine::Rendering::Universal::PolyNode::*)()>(&UnityEngine::Rendering::Universal::PolyNode::get_Childs)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::Rendering::Universal::PolyNode*), "get_Childs", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: UnityEngine::Rendering::Universal::PolyNode::get_Parent
// Il2CppName: get_Parent
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::Rendering::Universal::PolyNode* (UnityEngine::Rendering::Universal::PolyNode::*)()>(&UnityEngine::Rendering::Universal::PolyNode::get_Parent)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::Rendering::Universal::PolyNode*), "get_Parent", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: UnityEngine::Rendering::Universal::PolyNode::get_IsHole
// Il2CppName: get_IsHole
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (UnityEngine::Rendering::Universal::PolyNode::*)()>(&UnityEngine::Rendering::Universal::PolyNode::get_IsHole)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::Rendering::Universal::PolyNode*), "get_IsHole", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: UnityEngine::Rendering::Universal::PolyNode::get_IsOpen
// Il2CppName: get_IsOpen
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (UnityEngine::Rendering::Universal::PolyNode::*)()>(&UnityEngine::Rendering::Universal::PolyNode::get_IsOpen)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::Rendering::Universal::PolyNode*), "get_IsOpen", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: UnityEngine::Rendering::Universal::PolyNode::set_IsOpen
// Il2CppName: set_IsOpen
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (UnityEngine::Rendering::Universal::PolyNode::*)(bool)>(&UnityEngine::Rendering::Universal::PolyNode::set_IsOpen)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("System", "Boolean")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(UnityEngine::Rendering::Universal::PolyNode*), "set_IsOpen", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: UnityEngine::Rendering::Universal::PolyNode::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
