// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.RenderTextureDescriptor
#include "UnityEngine/RenderTextureDescriptor.hpp"
// Including type: UnityEngine.Rendering.Universal.ScriptableRenderPass
#include "UnityEngine/Rendering/Universal/ScriptableRenderPass.hpp"
// Including type: UnityEngine.Vector4
#include "UnityEngine/Vector4.hpp"
// Including type: UnityEngine.Rendering.Universal.PostProcessParams
#include "UnityEngine/Rendering/Universal/PostProcessParams.hpp"
// Including type: UnityEngine.Rendering.HDROutputUtils
#include "UnityEngine/Rendering/HDROutputUtils.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::Rendering::Universal
namespace UnityEngine::Rendering::Universal {
  // Forward declaring type: PostProcessData
  class PostProcessData;
  // Forward declaring type: DepthOfField
  class DepthOfField;
  // Forward declaring type: MotionBlur
  class MotionBlur;
  // Forward declaring type: PaniniProjection
  class PaniniProjection;
  // Forward declaring type: Bloom
  class Bloom;
  // Forward declaring type: LensDistortion
  class LensDistortion;
  // Forward declaring type: ChromaticAberration
  class ChromaticAberration;
  // Forward declaring type: Vignette
  class Vignette;
  // Forward declaring type: ColorLookup
  class ColorLookup;
  // Forward declaring type: ColorAdjustments
  class ColorAdjustments;
  // Forward declaring type: Tonemapping
  class Tonemapping;
  // Forward declaring type: FilmGrain
  class FilmGrain;
  // Forward declaring type: CameraData
  struct CameraData;
  // Forward declaring type: RenderingData
  struct RenderingData;
  // Forward declaring type: ScriptableRenderer
  class ScriptableRenderer;
}
// Forward declaring namespace: UnityEngine::Rendering
namespace UnityEngine::Rendering {
  // Forward declaring type: RTHandle
  class RTHandle;
  // Forward declaring type: ProfilingSampler
  class ProfilingSampler;
  // Forward declaring type: DepthBits
  struct DepthBits;
  // Forward declaring type: CommandBuffer
  class CommandBuffer;
  // Forward declaring type: ScriptableRenderContext
  struct ScriptableRenderContext;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: Camera
  class Camera;
  // Forward declaring type: Rect
  struct Rect;
  // Forward declaring type: Light
  class Light;
  // Forward declaring type: Vector3
  struct Vector3;
  // Forward declaring type: Vector2
  struct Vector2;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
}
// Forward declaring namespace: UnityEngine::Experimental::Rendering
namespace UnityEngine::Experimental::Rendering {
  // Forward declaring type: XRPass
  class XRPass;
}
// Completed forward declares
// Type namespace: UnityEngine.Rendering.Universal
namespace UnityEngine::Rendering::Universal {
  // Forward declaring type: PostProcessPass
  class PostProcessPass;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::Rendering::Universal::PostProcessPass);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::Rendering::Universal::PostProcessPass*, "UnityEngine.Rendering.Universal", "PostProcessPass");
// Type namespace: UnityEngine.Rendering.Universal
namespace UnityEngine::Rendering::Universal {
  // WARNING Size may be invalid!
  // Autogenerated type: UnityEngine.Rendering.Universal.PostProcessPass
  // [TokenAttribute] Offset: FFFFFFFF
  class PostProcessPass : public ::UnityEngine::Rendering::Universal::ScriptableRenderPass {
    public:
    // Nested type: ::UnityEngine::Rendering::Universal::PostProcessPass::MaterialLibrary
    class MaterialLibrary;
    // Nested type: ::UnityEngine::Rendering::Universal::PostProcessPass::ShaderConstants
    class ShaderConstants;
    // Nested type: ::UnityEngine::Rendering::Universal::PostProcessPass::$$c
    class $$c;
    // Nested type: ::UnityEngine::Rendering::Universal::PostProcessPass::$$c__DisplayClass69_0
    struct $$c__DisplayClass69_0;
    public:
    // private UnityEngine.RenderTextureDescriptor m_Descriptor
    // Size: 0x34
    // Offset: 0xE0
    ::UnityEngine::RenderTextureDescriptor m_Descriptor;
    // Field size check
    static_assert(sizeof(::UnityEngine::RenderTextureDescriptor) == 0x34);
    // private UnityEngine.Rendering.RTHandle m_Source
    // Size: 0x8
    // Offset: 0x118
    ::UnityEngine::Rendering::RTHandle* m_Source;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::RTHandle*) == 0x8);
    // private UnityEngine.Rendering.RTHandle m_Destination
    // Size: 0x8
    // Offset: 0x120
    ::UnityEngine::Rendering::RTHandle* m_Destination;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::RTHandle*) == 0x8);
    // private UnityEngine.Rendering.RTHandle m_Depth
    // Size: 0x8
    // Offset: 0x128
    ::UnityEngine::Rendering::RTHandle* m_Depth;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::RTHandle*) == 0x8);
    // private UnityEngine.Rendering.RTHandle m_InternalLut
    // Size: 0x8
    // Offset: 0x130
    ::UnityEngine::Rendering::RTHandle* m_InternalLut;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::RTHandle*) == 0x8);
    // private UnityEngine.Rendering.RTHandle m_MotionVectors
    // Size: 0x8
    // Offset: 0x138
    ::UnityEngine::Rendering::RTHandle* m_MotionVectors;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::RTHandle*) == 0x8);
    // private UnityEngine.Rendering.RTHandle m_CameraTargetHandle
    // Size: 0x8
    // Offset: 0x140
    ::UnityEngine::Rendering::RTHandle* m_CameraTargetHandle;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::RTHandle*) == 0x8);
    // private UnityEngine.Rendering.RTHandle m_FullCoCTexture
    // Size: 0x8
    // Offset: 0x148
    ::UnityEngine::Rendering::RTHandle* m_FullCoCTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::RTHandle*) == 0x8);
    // private UnityEngine.Rendering.RTHandle m_HalfCoCTexture
    // Size: 0x8
    // Offset: 0x150
    ::UnityEngine::Rendering::RTHandle* m_HalfCoCTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::RTHandle*) == 0x8);
    // private UnityEngine.Rendering.RTHandle m_PingTexture
    // Size: 0x8
    // Offset: 0x158
    ::UnityEngine::Rendering::RTHandle* m_PingTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::RTHandle*) == 0x8);
    // private UnityEngine.Rendering.RTHandle m_PongTexture
    // Size: 0x8
    // Offset: 0x160
    ::UnityEngine::Rendering::RTHandle* m_PongTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::RTHandle*) == 0x8);
    // private UnityEngine.Rendering.RTHandle[] m_BloomMipDown
    // Size: 0x8
    // Offset: 0x168
    ::ArrayW<::UnityEngine::Rendering::RTHandle*> m_BloomMipDown;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Rendering::RTHandle*>) == 0x8);
    // private UnityEngine.Rendering.RTHandle[] m_BloomMipUp
    // Size: 0x8
    // Offset: 0x170
    ::ArrayW<::UnityEngine::Rendering::RTHandle*> m_BloomMipUp;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Rendering::RTHandle*>) == 0x8);
    // private UnityEngine.Rendering.RTHandle m_BlendTexture
    // Size: 0x8
    // Offset: 0x178
    ::UnityEngine::Rendering::RTHandle* m_BlendTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::RTHandle*) == 0x8);
    // private UnityEngine.Rendering.RTHandle m_EdgeColorTexture
    // Size: 0x8
    // Offset: 0x180
    ::UnityEngine::Rendering::RTHandle* m_EdgeColorTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::RTHandle*) == 0x8);
    // private UnityEngine.Rendering.RTHandle m_EdgeStencilTexture
    // Size: 0x8
    // Offset: 0x188
    ::UnityEngine::Rendering::RTHandle* m_EdgeStencilTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::RTHandle*) == 0x8);
    // private UnityEngine.Rendering.RTHandle m_TempTarget
    // Size: 0x8
    // Offset: 0x190
    ::UnityEngine::Rendering::RTHandle* m_TempTarget;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::RTHandle*) == 0x8);
    // private UnityEngine.Rendering.RTHandle m_TempTarget2
    // Size: 0x8
    // Offset: 0x198
    ::UnityEngine::Rendering::RTHandle* m_TempTarget2;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::RTHandle*) == 0x8);
    // private UnityEngine.Rendering.Universal.PostProcessPass/MaterialLibrary m_Materials
    // Size: 0x8
    // Offset: 0x1A0
    ::UnityEngine::Rendering::Universal::PostProcessPass::MaterialLibrary* m_Materials;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::PostProcessPass::MaterialLibrary*) == 0x8);
    // private UnityEngine.Rendering.Universal.PostProcessData m_Data
    // Size: 0x8
    // Offset: 0x1A8
    ::UnityEngine::Rendering::Universal::PostProcessData* m_Data;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::PostProcessData*) == 0x8);
    // private UnityEngine.Rendering.Universal.DepthOfField m_DepthOfField
    // Size: 0x8
    // Offset: 0x1B0
    ::UnityEngine::Rendering::Universal::DepthOfField* m_DepthOfField;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::DepthOfField*) == 0x8);
    // private UnityEngine.Rendering.Universal.MotionBlur m_MotionBlur
    // Size: 0x8
    // Offset: 0x1B8
    ::UnityEngine::Rendering::Universal::MotionBlur* m_MotionBlur;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::MotionBlur*) == 0x8);
    // private UnityEngine.Rendering.Universal.PaniniProjection m_PaniniProjection
    // Size: 0x8
    // Offset: 0x1C0
    ::UnityEngine::Rendering::Universal::PaniniProjection* m_PaniniProjection;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::PaniniProjection*) == 0x8);
    // private UnityEngine.Rendering.Universal.Bloom m_Bloom
    // Size: 0x8
    // Offset: 0x1C8
    ::UnityEngine::Rendering::Universal::Bloom* m_Bloom;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::Bloom*) == 0x8);
    // private UnityEngine.Rendering.Universal.LensDistortion m_LensDistortion
    // Size: 0x8
    // Offset: 0x1D0
    ::UnityEngine::Rendering::Universal::LensDistortion* m_LensDistortion;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::LensDistortion*) == 0x8);
    // private UnityEngine.Rendering.Universal.ChromaticAberration m_ChromaticAberration
    // Size: 0x8
    // Offset: 0x1D8
    ::UnityEngine::Rendering::Universal::ChromaticAberration* m_ChromaticAberration;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::ChromaticAberration*) == 0x8);
    // private UnityEngine.Rendering.Universal.Vignette m_Vignette
    // Size: 0x8
    // Offset: 0x1E0
    ::UnityEngine::Rendering::Universal::Vignette* m_Vignette;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::Vignette*) == 0x8);
    // private UnityEngine.Rendering.Universal.ColorLookup m_ColorLookup
    // Size: 0x8
    // Offset: 0x1E8
    ::UnityEngine::Rendering::Universal::ColorLookup* m_ColorLookup;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::ColorLookup*) == 0x8);
    // private UnityEngine.Rendering.Universal.ColorAdjustments m_ColorAdjustments
    // Size: 0x8
    // Offset: 0x1F0
    ::UnityEngine::Rendering::Universal::ColorAdjustments* m_ColorAdjustments;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::ColorAdjustments*) == 0x8);
    // private UnityEngine.Rendering.Universal.Tonemapping m_Tonemapping
    // Size: 0x8
    // Offset: 0x1F8
    ::UnityEngine::Rendering::Universal::Tonemapping* m_Tonemapping;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::Tonemapping*) == 0x8);
    // private UnityEngine.Rendering.Universal.FilmGrain m_FilmGrain
    // Size: 0x8
    // Offset: 0x200
    ::UnityEngine::Rendering::Universal::FilmGrain* m_FilmGrain;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::FilmGrain*) == 0x8);
    // private readonly UnityEngine.Experimental.Rendering.GraphicsFormat m_DefaultHDRFormat
    // Size: 0x4
    // Offset: 0x208
    ::UnityEngine::Experimental::Rendering::GraphicsFormat m_DefaultHDRFormat;
    // Field size check
    static_assert(sizeof(::UnityEngine::Experimental::Rendering::GraphicsFormat) == 0x4);
    // private System.Boolean m_UseRGBM
    // Size: 0x1
    // Offset: 0x20C
    bool m_UseRGBM;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private readonly UnityEngine.Experimental.Rendering.GraphicsFormat m_SMAAEdgeFormat
    // Size: 0x4
    // Offset: 0x210
    ::UnityEngine::Experimental::Rendering::GraphicsFormat m_SMAAEdgeFormat;
    // Field size check
    static_assert(sizeof(::UnityEngine::Experimental::Rendering::GraphicsFormat) == 0x4);
    // private readonly UnityEngine.Experimental.Rendering.GraphicsFormat m_GaussianCoCFormat
    // Size: 0x4
    // Offset: 0x214
    ::UnityEngine::Experimental::Rendering::GraphicsFormat m_GaussianCoCFormat;
    // Field size check
    static_assert(sizeof(::UnityEngine::Experimental::Rendering::GraphicsFormat) == 0x4);
    // private System.Int32 m_DitheringTextureIndex
    // Size: 0x4
    // Offset: 0x218
    int m_DitheringTextureIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.Rendering.RenderTargetIdentifier[] m_MRT2
    // Size: 0x8
    // Offset: 0x220
    ::ArrayW<::UnityEngine::Rendering::RenderTargetIdentifier> m_MRT2;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Rendering::RenderTargetIdentifier>) == 0x8);
    // private UnityEngine.Vector4[] m_BokehKernel
    // Size: 0x8
    // Offset: 0x228
    ::ArrayW<::UnityEngine::Vector4> m_BokehKernel;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector4>) == 0x8);
    // private System.Int32 m_BokehHash
    // Size: 0x4
    // Offset: 0x230
    int m_BokehHash;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single m_BokehMaxRadius
    // Size: 0x4
    // Offset: 0x234
    float m_BokehMaxRadius;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_BokehRCPAspect
    // Size: 0x4
    // Offset: 0x238
    float m_BokehRCPAspect;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_IsFinalPass
    // Size: 0x1
    // Offset: 0x23C
    bool m_IsFinalPass;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_HasFinalPass
    // Size: 0x1
    // Offset: 0x23D
    bool m_HasFinalPass;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_EnableColorEncodingIfNeeded
    // Size: 0x1
    // Offset: 0x23E
    bool m_EnableColorEncodingIfNeeded;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_UseFastSRGBLinearConversion
    // Size: 0x1
    // Offset: 0x23F
    bool m_UseFastSRGBLinearConversion;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_ResolveToScreen
    // Size: 0x1
    // Offset: 0x240
    bool m_ResolveToScreen;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_UseSwapBuffer
    // Size: 0x1
    // Offset: 0x241
    bool m_UseSwapBuffer;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private UnityEngine.Rendering.RTHandle m_ScalingSetupTarget
    // Size: 0x8
    // Offset: 0x248
    ::UnityEngine::Rendering::RTHandle* m_ScalingSetupTarget;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::RTHandle*) == 0x8);
    // private UnityEngine.Rendering.RTHandle m_UpscaledTarget
    // Size: 0x8
    // Offset: 0x250
    ::UnityEngine::Rendering::RTHandle* m_UpscaledTarget;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::RTHandle*) == 0x8);
    // private UnityEngine.Material m_BlitMaterial
    // Size: 0x8
    // Offset: 0x258
    ::UnityEngine::Material* m_BlitMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    public:
    // static field const value: static private System.String k_RenderPostProcessingTag
    static constexpr const char* k_RenderPostProcessingTag = "Render PostProcessing Effects";
    // Get static field: static private System.String k_RenderPostProcessingTag
    static ::StringW _get_k_RenderPostProcessingTag();
    // Set static field: static private System.String k_RenderPostProcessingTag
    static void _set_k_RenderPostProcessingTag(::StringW value);
    // static field const value: static private System.String k_RenderFinalPostProcessingTag
    static constexpr const char* k_RenderFinalPostProcessingTag = "Render Final PostProcessing Pass";
    // Get static field: static private System.String k_RenderFinalPostProcessingTag
    static ::StringW _get_k_RenderFinalPostProcessingTag();
