// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.Rendering.Universal.ScriptableRendererData
#include "UnityEngine/Rendering/Universal/ScriptableRendererData.hpp"
// Including type: UnityEngine.TransparencySortMode
#include "UnityEngine/TransparencySortMode.hpp"
// Including type: UnityEngine.Rendering.Universal.Light2DBlendStyle
#include "UnityEngine/Rendering/Universal/Light2DBlendStyle.hpp"
// Including type: UnityEngine.Rendering.Universal.Downsampling
#include "UnityEngine/Rendering/Universal/Downsampling.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::Rendering::Universal
namespace UnityEngine::Rendering::Universal {
  // Forward declaring type: PostProcessData
  class PostProcessData;
  // Forward declaring type: ILight2DCullResult
  class ILight2DCullResult;
  // Forward declaring type: ScriptableRenderer
  class ScriptableRenderer;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Shader
  class Shader;
  // Forward declaring type: Texture2D
  class Texture2D;
  // Forward declaring type: Material
  class Material;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: UnityEngine::Rendering
namespace UnityEngine::Rendering {
  // Forward declaring type: RTHandle
  class RTHandle;
}
// Completed forward declares
// Type namespace: UnityEngine.Rendering.Universal
namespace UnityEngine::Rendering::Universal {
  // Forward declaring type: Renderer2DData
  class Renderer2DData;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::Rendering::Universal::Renderer2DData);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::Rendering::Universal::Renderer2DData*, "UnityEngine.Rendering.Universal", "Renderer2DData");
// Type namespace: UnityEngine.Rendering.Universal
namespace UnityEngine::Rendering::Universal {
  // Size: 0x160
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.Rendering.Universal.Renderer2DData
  // [TokenAttribute] Offset: FFFFFFFF
  // [ExcludeFromPresetAttribute] Offset: FFFFFFFF
  // [ReloadGroupAttribute] Offset: FFFFFFFF
  // [HelpURLAttribute] Offset: FFFFFFFF
  // [MovedFromAttribute] Offset: FFFFFFFF
  class Renderer2DData : public ::UnityEngine::Rendering::Universal::ScriptableRendererData {
    public:
    // Writing base type padding for base size: 0x39 to desired offset: 0x3C
    char ___base_padding[0x3] = {};
    // Nested type: ::UnityEngine::Rendering::Universal::Renderer2DData::Renderer2DDefaultMaterialType
    struct Renderer2DDefaultMaterialType;
    public:
    // private UnityEngine.TransparencySortMode m_TransparencySortMode
    // Size: 0x4
    // Offset: 0x3C
    ::UnityEngine::TransparencySortMode m_TransparencySortMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::TransparencySortMode) == 0x4);
    // private UnityEngine.Vector3 m_TransparencySortAxis
    // Size: 0xC
    // Offset: 0x40
    ::UnityEngine::Vector3 m_TransparencySortAxis;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Single m_HDREmulationScale
    // Size: 0x4
    // Offset: 0x4C
    float m_HDREmulationScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_LightRenderTextureScale
    // Size: 0x4
    // Offset: 0x50
    float m_LightRenderTextureScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: m_LightRenderTextureScale and: m_LightBlendStyles
    char __padding3[0x4] = {};
    // private UnityEngine.Rendering.Universal.Light2DBlendStyle[] m_LightBlendStyles
    // Size: 0x8
    // Offset: 0x58
    ::ArrayW<::UnityEngine::Rendering::Universal::Light2DBlendStyle> m_LightBlendStyles;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Rendering::Universal::Light2DBlendStyle>) == 0x8);
    // private System.Boolean m_UseDepthStencilBuffer
    // Size: 0x1
    // Offset: 0x60
    bool m_UseDepthStencilBuffer;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_UseCameraSortingLayersTexture
    // Size: 0x1
    // Offset: 0x61
    bool m_UseCameraSortingLayersTexture;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_UseCameraSortingLayersTexture and: m_CameraSortingLayersTextureBound
    char __padding6[0x2] = {};
    // private System.Int32 m_CameraSortingLayersTextureBound
    // Size: 0x4
    // Offset: 0x64
    int m_CameraSortingLayersTextureBound;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.Rendering.Universal.Downsampling m_CameraSortingLayerDownsamplingMethod
    // Size: 0x4
    // Offset: 0x68
    ::UnityEngine::Rendering::Universal::Downsampling m_CameraSortingLayerDownsamplingMethod;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::Downsampling) == 0x4);
    // private System.UInt32 m_MaxLightRenderTextureCount
    // Size: 0x4
    // Offset: 0x6C
    uint m_MaxLightRenderTextureCount;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 m_MaxShadowRenderTextureCount
    // Size: 0x4
    // Offset: 0x70
    uint m_MaxShadowRenderTextureCount;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // Padding between fields: m_MaxShadowRenderTextureCount and: m_ShapeLightShader
    char __padding10[0x4] = {};
    // private UnityEngine.Shader m_ShapeLightShader
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::Shader* m_ShapeLightShader;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // private UnityEngine.Shader m_ShapeLightVolumeShader
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::Shader* m_ShapeLightVolumeShader;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // private UnityEngine.Shader m_PointLightShader
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::Shader* m_PointLightShader;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // private UnityEngine.Shader m_PointLightVolumeShader
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::Shader* m_PointLightVolumeShader;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // private UnityEngine.Shader m_CoreBlitShader
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::Shader* m_CoreBlitShader;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // private UnityEngine.Shader m_BlitHDROverlay
    // Size: 0x8
    // Offset: 0xA0
    ::UnityEngine::Shader* m_BlitHDROverlay;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // private UnityEngine.Shader m_CoreBlitColorAndDepthPS
    // Size: 0x8
    // Offset: 0xA8
    ::UnityEngine::Shader* m_CoreBlitColorAndDepthPS;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // private UnityEngine.Shader m_SamplingShader
    // Size: 0x8
    // Offset: 0xB0
    ::UnityEngine::Shader* m_SamplingShader;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // private UnityEngine.Shader m_ProjectedShadowShader
    // Size: 0x8
    // Offset: 0xB8
    ::UnityEngine::Shader* m_ProjectedShadowShader;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // private UnityEngine.Shader m_SpriteShadowShader
    // Size: 0x8
    // Offset: 0xC0
    ::UnityEngine::Shader* m_SpriteShadowShader;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // private UnityEngine.Shader m_SpriteUnshadowShader
    // Size: 0x8
    // Offset: 0xC8
    ::UnityEngine::Shader* m_SpriteUnshadowShader;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // private UnityEngine.Shader m_GeometryUnshadowShader
    // Size: 0x8
    // Offset: 0xD0
    ::UnityEngine::Shader* m_GeometryUnshadowShader;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // private UnityEngine.Shader m_FallbackErrorShader
    // Size: 0x8
    // Offset: 0xD8
    ::UnityEngine::Shader* m_FallbackErrorShader;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // private UnityEngine.Rendering.Universal.PostProcessData m_PostProcessData
    // Size: 0x8
    // Offset: 0xE0
    ::UnityEngine::Rendering::Universal::PostProcessData* m_PostProcessData;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::PostProcessData*) == 0x8);
    // private UnityEngine.Texture2D m_FallOffLookup
    // Size: 0x8
    // Offset: 0xE8
    ::UnityEngine::Texture2D* m_FallOffLookup;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture2D*) == 0x8);
    // private readonly System.Collections.Generic.Dictionary`2<System.UInt32,UnityEngine.Material> <lightMaterials>k__BackingField
    // Size: 0x8
    // Offset: 0xF0
    ::System::Collections::Generic::Dictionary_2<uint, ::UnityEngine::Material*>* lightMaterials;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<uint, ::UnityEngine::Material*>*) == 0x8);
    // private UnityEngine.Material[] <spriteSelfShadowMaterial>k__BackingField
    // Size: 0x8
    // Offset: 0xF8
    ::ArrayW<::UnityEngine::Material*> spriteSelfShadowMaterial;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Material*>) == 0x8);
    // private UnityEngine.Material[] <spriteUnshadowMaterial>k__BackingField
    // Size: 0x8
    // Offset: 0x100
    ::ArrayW<::UnityEngine::Material*> spriteUnshadowMaterial;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Material*>) == 0x8);
    // private UnityEngine.Material[] <geometryUnshadowMaterial>k__BackingField
    // Size: 0x8
    // Offset: 0x108
    ::ArrayW<::UnityEngine::Material*> geometryUnshadowMaterial;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Material*>) == 0x8);
    // private UnityEngine.Material[] <projectedShadowMaterial>k__BackingField
    // Size: 0x8
    // Offset: 0x110
    ::ArrayW<::UnityEngine::Material*> projectedShadowMaterial;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Material*>) == 0x8);
    // private UnityEngine.Material[] <stencilOnlyShadowMaterial>k__BackingField
    // Size: 0x8
    // Offset: 0x118
    ::ArrayW<::UnityEngine::Material*> stencilOnlyShadowMaterial;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Material*>) == 0x8);
    // private System.Boolean <isNormalsRenderTargetValid>k__BackingField
    // Size: 0x1
    // Offset: 0x120
    bool isNormalsRenderTargetValid;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isNormalsRenderTargetValid and: normalsRenderTargetScale
    char __padding32[0x3] = {};
    // private System.Single <normalsRenderTargetScale>k__BackingField
    // Size: 0x4
    // Offset: 0x124
    float normalsRenderTargetScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // UnityEngine.Rendering.RTHandle normalsRenderTarget
    // Size: 0x8
    // Offset: 0x128
    ::UnityEngine::Rendering::RTHandle* normalsRenderTarget;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::RTHandle*) == 0x8);
    // System.Int32 normalsRenderTargetId
    // Size: 0x4
    // Offset: 0x130
    int normalsRenderTargetId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: normalsRenderTargetId and: shadowsRenderTarget
    char __padding35[0x4] = {};
    // UnityEngine.Rendering.RTHandle shadowsRenderTarget
    // Size: 0x8
    // Offset: 0x138
    ::UnityEngine::Rendering::RTHandle* shadowsRenderTarget;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::RTHandle*) == 0x8);
    // System.Int32 shadowsRenderTargetId
    // Size: 0x4
    // Offset: 0x140
    int shadowsRenderTargetId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: shadowsRenderTargetId and: cameraSortingLayerRenderTarget
    char __padding37[0x4] = {};
    // UnityEngine.Rendering.RTHandle cameraSortingLayerRenderTarget
    // Size: 0x8
    // Offset: 0x148
    ::UnityEngine::Rendering::RTHandle* cameraSortingLayerRenderTarget;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::RTHandle*) == 0x8);
    // System.Int32 cameraSortingLayerRenderTargetId
    // Size: 0x4
    // Offset: 0x150
    int cameraSortingLayerRenderTargetId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: cameraSortingLayerRenderTargetId and: lightCullResult
    char __padding39[0x4] = {};
    // private UnityEngine.Rendering.Universal.ILight2DCullResult <lightCullResult>k__BackingField
    // Size: 0x8
    // Offset: 0x158
    ::UnityEngine::Rendering::Universal::ILight2DCullResult* lightCullResult;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::ILight2DCullResult*) == 0x8);
    public:
    // Get instance field reference: private UnityEngine.TransparencySortMode m_TransparencySortMode
    [[deprecated("Use field access instead!")]] ::UnityEngine::TransparencySortMode& dyn_m_TransparencySortMode();
    // Get instance field reference: private UnityEngine.Vector3 m_TransparencySortAxis
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_m_TransparencySortAxis();
    // Get instance field reference: private System.Single m_HDREmulationScale
    [[deprecated("Use field access instead!")]] float& dyn_m_HDREmulationScale();
    // Get instance field reference: private System.Single m_LightRenderTextureScale
    [[deprecated("Use field access instead!")]] float& dyn_m_LightRenderTextureScale();
