// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.Rendering.Universal.ScriptableRenderer
#include "UnityEngine/Rendering/Universal/ScriptableRenderer.hpp"
// Including type: UnityEngine.Rendering.Universal.PostProcessPasses
#include "UnityEngine/Rendering/Universal/PostProcessPasses.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::Rendering::Universal
namespace UnityEngine::Rendering::Universal {
  // Forward declaring type: Render2DLightingPass
  class Render2DLightingPass;
  // Forward declaring type: PixelPerfectBackgroundPass
  class PixelPerfectBackgroundPass;
  // Forward declaring type: UpscalePass
  class UpscalePass;
  // Forward declaring type: DrawScreenSpaceUIPass
  class DrawScreenSpaceUIPass;
  // Forward declaring type: Light2DCullResult
  class Light2DCullResult;
  // Forward declaring type: Renderer2DData
  class Renderer2DData;
  // Forward declaring type: PostProcessPass
  class PostProcessPass;
  // Forward declaring type: CameraData
  struct CameraData;
  // Forward declaring type: RenderingData
  struct RenderingData;
}
// Forward declaring namespace: UnityEngine::Rendering::Universal::Internal
namespace UnityEngine::Rendering::Universal::Internal {
  // Forward declaring type: FinalBlitPass
  class FinalBlitPass;
  // Forward declaring type: ColorGradingLutPass
  class ColorGradingLutPass;
}
// Forward declaring namespace: UnityEngine::Rendering
namespace UnityEngine::Rendering {
  // Forward declaring type: RTHandle
  class RTHandle;
  // Forward declaring type: ProfilingSampler
  class ProfilingSampler;
  // Forward declaring type: CommandBuffer
  class CommandBuffer;
  // Forward declaring type: ScriptableRenderContext
  struct ScriptableRenderContext;
  // Forward declaring type: ScriptableCullingParameters
  struct ScriptableCullingParameters;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: FilterMode
  struct FilterMode;
}
// Completed forward declares
// Type namespace: UnityEngine.Rendering.Universal
namespace UnityEngine::Rendering::Universal {
  // Forward declaring type: Renderer2D
  class Renderer2D;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::Rendering::Universal::Renderer2D);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::Rendering::Universal::Renderer2D*, "UnityEngine.Rendering.Universal", "Renderer2D");
// Type namespace: UnityEngine.Rendering.Universal
namespace UnityEngine::Rendering::Universal {
  // Size: 0x258
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.Rendering.Universal.Renderer2D
  // [TokenAttribute] Offset: FFFFFFFF
  class Renderer2D : public ::UnityEngine::Rendering::Universal::ScriptableRenderer {
    public:
    // Nested type: ::UnityEngine::Rendering::Universal::Renderer2D::$$c
    class $$c;
    public:
    // private UnityEngine.Rendering.Universal.Render2DLightingPass m_Render2DLightingPass
    // Size: 0x8
    // Offset: 0x1A8
    ::UnityEngine::Rendering::Universal::Render2DLightingPass* m_Render2DLightingPass;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::Render2DLightingPass*) == 0x8);
    // private UnityEngine.Rendering.Universal.PixelPerfectBackgroundPass m_PixelPerfectBackgroundPass
    // Size: 0x8
    // Offset: 0x1B0
    ::UnityEngine::Rendering::Universal::PixelPerfectBackgroundPass* m_PixelPerfectBackgroundPass;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::PixelPerfectBackgroundPass*) == 0x8);
    // private UnityEngine.Rendering.Universal.UpscalePass m_UpscalePass
    // Size: 0x8
    // Offset: 0x1B8
    ::UnityEngine::Rendering::Universal::UpscalePass* m_UpscalePass;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::UpscalePass*) == 0x8);
    // private UnityEngine.Rendering.Universal.Internal.FinalBlitPass m_FinalBlitPass
    // Size: 0x8
    // Offset: 0x1C0
    ::UnityEngine::Rendering::Universal::Internal::FinalBlitPass* m_FinalBlitPass;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::Internal::FinalBlitPass*) == 0x8);
    // private UnityEngine.Rendering.Universal.DrawScreenSpaceUIPass m_DrawOffscreenUIPass
    // Size: 0x8
    // Offset: 0x1C8
    ::UnityEngine::Rendering::Universal::DrawScreenSpaceUIPass* m_DrawOffscreenUIPass;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::DrawScreenSpaceUIPass*) == 0x8);
    // private UnityEngine.Rendering.Universal.DrawScreenSpaceUIPass m_DrawOverlayUIPass
    // Size: 0x8
    // Offset: 0x1D0
    ::UnityEngine::Rendering::Universal::DrawScreenSpaceUIPass* m_DrawOverlayUIPass;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::DrawScreenSpaceUIPass*) == 0x8);
    // private UnityEngine.Rendering.Universal.Light2DCullResult m_LightCullResult
    // Size: 0x8
    // Offset: 0x1D8
    ::UnityEngine::Rendering::Universal::Light2DCullResult* m_LightCullResult;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::Light2DCullResult*) == 0x8);
    // private System.Boolean m_UseDepthStencilBuffer
    // Size: 0x1
    // Offset: 0x1E0
    bool m_UseDepthStencilBuffer;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_CreateColorTexture
    // Size: 0x1
    // Offset: 0x1E1
    bool m_CreateColorTexture;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_CreateDepthTexture
    // Size: 0x1
    // Offset: 0x1E2
    bool m_CreateDepthTexture;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_CreateDepthTexture and: m_ColorTextureHandle
    char __padding9[0x5] = {};
    // private UnityEngine.Rendering.RTHandle m_ColorTextureHandle
    // Size: 0x8
    // Offset: 0x1E8
    ::UnityEngine::Rendering::RTHandle* m_ColorTextureHandle;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::RTHandle*) == 0x8);
    // private UnityEngine.Rendering.RTHandle m_DepthTextureHandle
    // Size: 0x8
    // Offset: 0x1F0
    ::UnityEngine::Rendering::RTHandle* m_DepthTextureHandle;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::RTHandle*) == 0x8);
    // private UnityEngine.Material m_BlitMaterial
    // Size: 0x8
    // Offset: 0x1F8
    ::UnityEngine::Material* m_BlitMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private UnityEngine.Material m_BlitHDRMaterial
    // Size: 0x8
    // Offset: 0x200
    ::UnityEngine::Material* m_BlitHDRMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private UnityEngine.Material m_SamplingMaterial
    // Size: 0x8
    // Offset: 0x208
    ::UnityEngine::Material* m_SamplingMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private UnityEngine.Rendering.Universal.Renderer2DData m_Renderer2DData
    // Size: 0x8
    // Offset: 0x210
    ::UnityEngine::Rendering::Universal::Renderer2DData* m_Renderer2DData;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::Renderer2DData*) == 0x8);
    // private UnityEngine.Rendering.Universal.PostProcessPasses m_PostProcessPasses
    // Size: 0x40
    // Offset: 0x218
    ::UnityEngine::Rendering::Universal::PostProcessPasses m_PostProcessPasses;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::PostProcessPasses) == 0x40);
    public:
    // static field const value: static System.Int32 k_DepthBufferBits
    static constexpr const int k_DepthBufferBits = 32;
    // Get static field: static System.Int32 k_DepthBufferBits
    static int _get_k_DepthBufferBits();
    // Set static field: static System.Int32 k_DepthBufferBits
    static void _set_k_DepthBufferBits(int value);
    // static field const value: static private System.Int32 k_FinalBlitPassQueueOffset
    static constexpr const int k_FinalBlitPassQueueOffset = 1;
    // Get static field: static private System.Int32 k_FinalBlitPassQueueOffset
    static int _get_k_FinalBlitPassQueueOffset();
    // Set static field: static private System.Int32 k_FinalBlitPassQueueOffset
    static void _set_k_FinalBlitPassQueueOffset(int value);
