// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.RenderTextureDescriptor
#include "UnityEngine/RenderTextureDescriptor.hpp"
// Including type: UnityEngine.Rendering.Universal.ScreenSpaceAmbientOcclusion
#include "UnityEngine/Rendering/Universal/ScreenSpaceAmbientOcclusion.hpp"
// Including type: UnityEngine.Rendering.Universal.ScriptableRenderPass
#include "UnityEngine/Rendering/Universal/ScriptableRenderPass.hpp"
// Including type: UnityEngine.Vector4
#include "UnityEngine/Vector4.hpp"
// Including type: UnityEngine.Matrix4x4
#include "UnityEngine/Matrix4x4.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::Rendering
namespace UnityEngine::Rendering {
  // Forward declaring type: ProfilingSampler
  class ProfilingSampler;
  // Forward declaring type: CommandBuffer
  class CommandBuffer;
  // Forward declaring type: RTHandle
  class RTHandle;
  // Forward declaring type: ScriptableRenderContext
  struct ScriptableRenderContext;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: Texture2D
  class Texture2D;
}
// Forward declaring namespace: UnityEngine::Rendering::Universal
namespace UnityEngine::Rendering::Universal {
  // Forward declaring type: ScriptableRenderer
  class ScriptableRenderer;
  // Forward declaring type: ScreenSpaceAmbientOcclusionSettings
  class ScreenSpaceAmbientOcclusionSettings;
  // Forward declaring type: RenderingData
  struct RenderingData;
  // Skipping declaration: ShaderPasses because it is already included!
  // Skipping declaration: BlurTypes because it is already included!
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
}
// Completed forward declares
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::Rendering::Universal::ScreenSpaceAmbientOcclusion::ScreenSpaceAmbientOcclusionPass);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::Rendering::Universal::ScreenSpaceAmbientOcclusion::ScreenSpaceAmbientOcclusionPass*, "UnityEngine.Rendering.Universal", "ScreenSpaceAmbientOcclusion/ScreenSpaceAmbientOcclusionPass");
// Type namespace: UnityEngine.Rendering.Universal
namespace UnityEngine::Rendering::Universal {
  // WARNING Size may be invalid!
  // Autogenerated type: UnityEngine.Rendering.Universal.ScreenSpaceAmbientOcclusion/ScreenSpaceAmbientOcclusionPass
  // [TokenAttribute] Offset: FFFFFFFF
  class ScreenSpaceAmbientOcclusion::ScreenSpaceAmbientOcclusionPass : public ::UnityEngine::Rendering::Universal::ScriptableRenderPass {
    public:
    // Nested type: ::UnityEngine::Rendering::Universal::ScreenSpaceAmbientOcclusion::ScreenSpaceAmbientOcclusionPass::BlurTypes
    struct BlurTypes;
    // Nested type: ::UnityEngine::Rendering::Universal::ScreenSpaceAmbientOcclusion::ScreenSpaceAmbientOcclusionPass::ShaderPasses
    struct ShaderPasses;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.Rendering.Universal.ScreenSpaceAmbientOcclusion/ScreenSpaceAmbientOcclusionPass/BlurTypes
    // [TokenAttribute] Offset: FFFFFFFF
    struct BlurTypes/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: BlurTypes
      constexpr BlurTypes(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.Rendering.Universal.ScreenSpaceAmbientOcclusion/ScreenSpaceAmbientOcclusionPass/BlurTypes Bilateral
      static constexpr const int Bilateral = 0;
      // Get static field: static public UnityEngine.Rendering.Universal.ScreenSpaceAmbientOcclusion/ScreenSpaceAmbientOcclusionPass/BlurTypes Bilateral
      static ::UnityEngine::Rendering::Universal::ScreenSpaceAmbientOcclusion::ScreenSpaceAmbientOcclusionPass::BlurTypes _get_Bilateral();
      // Set static field: static public UnityEngine.Rendering.Universal.ScreenSpaceAmbientOcclusion/ScreenSpaceAmbientOcclusionPass/BlurTypes Bilateral
      static void _set_Bilateral(::UnityEngine::Rendering::Universal::ScreenSpaceAmbientOcclusion::ScreenSpaceAmbientOcclusionPass::BlurTypes value);
      // static field const value: static public UnityEngine.Rendering.Universal.ScreenSpaceAmbientOcclusion/ScreenSpaceAmbientOcclusionPass/BlurTypes Gaussian
      static constexpr const int Gaussian = 1;
      // Get static field: static public UnityEngine.Rendering.Universal.ScreenSpaceAmbientOcclusion/ScreenSpaceAmbientOcclusionPass/BlurTypes Gaussian
      static ::UnityEngine::Rendering::Universal::ScreenSpaceAmbientOcclusion::ScreenSpaceAmbientOcclusionPass::BlurTypes _get_Gaussian();
      // Set static field: static public UnityEngine.Rendering.Universal.ScreenSpaceAmbientOcclusion/ScreenSpaceAmbientOcclusionPass/BlurTypes Gaussian
      static void _set_Gaussian(::UnityEngine::Rendering::Universal::ScreenSpaceAmbientOcclusion::ScreenSpaceAmbientOcclusionPass::BlurTypes value);
      // static field const value: static public UnityEngine.Rendering.Universal.ScreenSpaceAmbientOcclusion/ScreenSpaceAmbientOcclusionPass/BlurTypes Kawase
      static constexpr const int Kawase = 2;
      // Get static field: static public UnityEngine.Rendering.Universal.ScreenSpaceAmbientOcclusion/ScreenSpaceAmbientOcclusionPass/BlurTypes Kawase
      static ::UnityEngine::Rendering::Universal::ScreenSpaceAmbientOcclusion::ScreenSpaceAmbientOcclusionPass::BlurTypes _get_Kawase();
      // Set static field: static public UnityEngine.Rendering.Universal.ScreenSpaceAmbientOcclusion/ScreenSpaceAmbientOcclusionPass/BlurTypes Kawase
      static void _set_Kawase(::UnityEngine::Rendering::Universal::ScreenSpaceAmbientOcclusion::ScreenSpaceAmbientOcclusionPass::BlurTypes value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.Rendering.Universal.ScreenSpaceAmbientOcclusion/ScreenSpaceAmbientOcclusionPass/BlurTypes
    #pragma pack(pop)
    static check_size<sizeof(ScreenSpaceAmbientOcclusion::ScreenSpaceAmbientOcclusionPass::BlurTypes), 0 + sizeof(int)> __UnityEngine_Rendering_Universal_ScreenSpaceAmbientOcclusion_ScreenSpaceAmbientOcclusionPass_BlurTypesSizeCheck;
    static_assert(sizeof(ScreenSpaceAmbientOcclusion::ScreenSpaceAmbientOcclusionPass::BlurTypes) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.Rendering.Universal.ScreenSpaceAmbientOcclusion/ScreenSpaceAmbientOcclusionPass/ShaderPasses
    // [TokenAttribute] Offset: FFFFFFFF
    struct ShaderPasses/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: ShaderPasses
      constexpr ShaderPasses(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.Rendering.Universal.ScreenSpaceAmbientOcclusion/ScreenSpaceAmbientOcclusionPass/ShaderPasses AmbientOcclusion
      static constexpr const int AmbientOcclusion = 0;
      // Get static field: static public UnityEngine.Rendering.Universal.ScreenSpaceAmbientOcclusion/ScreenSpaceAmbientOcclusionPass/ShaderPasses AmbientOcclusion
      static ::UnityEngine::Rendering::Universal::ScreenSpaceAmbientOcclusion::ScreenSpaceAmbientOcclusionPass::ShaderPasses _get_AmbientOcclusion();
      // Set static field: static public UnityEngine.Rendering.Universal.ScreenSpaceAmbientOcclusion/ScreenSpaceAmbientOcclusionPass/ShaderPasses AmbientOcclusion
      static void _set_AmbientOcclusion(::UnityEngine::Rendering::Universal::ScreenSpaceAmbientOcclusion::ScreenSpaceAmbientOcclusionPass::ShaderPasses value);
      // static field const value: static public UnityEngine.Rendering.Universal.ScreenSpaceAmbientOcclusion/ScreenSpaceAmbientOcclusionPass/ShaderPasses BilateralBlurHorizontal
      static constexpr const int BilateralBlurHorizontal = 1;
      // Get static field: static public UnityEngine.Rendering.Universal.ScreenSpaceAmbientOcclusion/ScreenSpaceAmbientOcclusionPass/ShaderPasses BilateralBlurHorizontal
      static ::UnityEngine::Rendering::Universal::ScreenSpaceAmbientOcclusion::ScreenSpaceAmbientOcclusionPass::ShaderPasses _get_BilateralBlurHorizontal();
      // Set static field: static public UnityEngine.Rendering.Universal.ScreenSpaceAmbientOcclusion/ScreenSpaceAmbientOcclusionPass/ShaderPasses BilateralBlurHorizontal
      static void _set_BilateralBlurHorizontal(::UnityEngine::Rendering::Universal::ScreenSpaceAmbientOcclusion::ScreenSpaceAmbientOcclusionPass::ShaderPasses value);
      // static field const value: static public UnityEngine.Rendering.Universal.ScreenSpaceAmbientOcclusion/ScreenSpaceAmbientOcclusionPass/ShaderPasses BilateralBlurVertical
      static constexpr const int BilateralBlurVertical = 2;
      // Get static field: static public UnityEngine.Rendering.Universal.ScreenSpaceAmbientOcclusion/ScreenSpaceAmbientOcclusionPass/ShaderPasses BilateralBlurVertical
      static ::UnityEngine::Rendering::Universal::ScreenSpaceAmbientOcclusion::ScreenSpaceAmbientOcclusionPass::ShaderPasses _get_BilateralBlurVertical();
      // Set static field: static public UnityEngine.Rendering.Universal.ScreenSpaceAmbientOcclusion/ScreenSpaceAmbientOcclusionPass/ShaderPasses BilateralBlurVertical
      static void _set_BilateralBlurVertical(::UnityEngine::Rendering::Universal::ScreenSpaceAmbientOcclusion::ScreenSpaceAmbientOcclusionPass::ShaderPasses value);
      // static field const value: static public UnityEngine.Rendering.Universal.ScreenSpaceAmbientOcclusion/ScreenSpaceAmbientOcclusionPass/ShaderPasses BilateralBlurFinal
      static constexpr const int BilateralBlurFinal = 3;
      // Get static field: static public UnityEngine.Rendering.Universal.ScreenSpaceAmbientOcclusion/ScreenSpaceAmbientOcclusionPass/ShaderPasses BilateralBlurFinal
      static ::UnityEngine::Rendering::Universal::ScreenSpaceAmbientOcclusion::ScreenSpaceAmbientOcclusionPass::ShaderPasses _get_BilateralBlurFinal();
      // Set static field: static public UnityEngine.Rendering.Universal.ScreenSpaceAmbientOcclusion/ScreenSpaceAmbientOcclusionPass/ShaderPasses BilateralBlurFinal
      static void _set_BilateralBlurFinal(::UnityEngine::Rendering::Universal::ScreenSpaceAmbientOcclusion::ScreenSpaceAmbientOcclusionPass::ShaderPasses value);
      // static field const value: static public UnityEngine.Rendering.Universal.ScreenSpaceAmbientOcclusion/ScreenSpaceAmbientOcclusionPass/ShaderPasses BilateralAfterOpaque
      static constexpr const int BilateralAfterOpaque = 4;
      // Get static field: static public UnityEngine.Rendering.Universal.ScreenSpaceAmbientOcclusion/ScreenSpaceAmbientOcclusionPass/ShaderPasses BilateralAfterOpaque
      static ::UnityEngine::Rendering::Universal::ScreenSpaceAmbientOcclusion::ScreenSpaceAmbientOcclusionPass::ShaderPasses _get_BilateralAfterOpaque();
      // Set static field: static public UnityEngine.Rendering.Universal.ScreenSpaceAmbientOcclusion/ScreenSpaceAmbientOcclusionPass/ShaderPasses BilateralAfterOpaque
      static void _set_BilateralAfterOpaque(::UnityEngine::Rendering::Universal::ScreenSpaceAmbientOcclusion::ScreenSpaceAmbientOcclusionPass::ShaderPasses value);
      // static field const value: static public UnityEngine.Rendering.Universal.ScreenSpaceAmbientOcclusion/ScreenSpaceAmbientOcclusionPass/ShaderPasses GaussianBlurHorizontal
      static constexpr const int GaussianBlurHorizontal = 5;
      // Get static field: static public UnityEngine.Rendering.Universal.ScreenSpaceAmbientOcclusion/ScreenSpaceAmbientOcclusionPass/ShaderPasses GaussianBlurHorizontal
      static ::UnityEngine::Rendering::Universal::ScreenSpaceAmbientOcclusion::ScreenSpaceAmbientOcclusionPass::ShaderPasses _get_GaussianBlurHorizontal();
      // Set static field: static public UnityEngine.Rendering.Universal.ScreenSpaceAmbientOcclusion/ScreenSpaceAmbientOcclusionPass/ShaderPasses GaussianBlurHorizontal
      static void _set_GaussianBlurHorizontal(::UnityEngine::Rendering::Universal::ScreenSpaceAmbientOcclusion::ScreenSpaceAmbientOcclusionPass::ShaderPasses value);
      // static field const value: static public UnityEngine.Rendering.Universal.ScreenSpaceAmbientOcclusion/ScreenSpaceAmbientOcclusionPass/ShaderPasses GaussianBlurVertical
      static constexpr const int GaussianBlurVertical = 6;
      // Get static field: static public UnityEngine.Rendering.Universal.ScreenSpaceAmbientOcclusion/ScreenSpaceAmbientOcclusionPass/ShaderPasses GaussianBlurVertical
      static ::UnityEngine::Rendering::Universal::ScreenSpaceAmbientOcclusion::ScreenSpaceAmbientOcclusionPass::ShaderPasses _get_GaussianBlurVertical();
      // Set static field: static public UnityEngine.Rendering.Universal.ScreenSpaceAmbientOcclusion/ScreenSpaceAmbientOcclusionPass/ShaderPasses GaussianBlurVertical
      static void _set_GaussianBlurVertical(::UnityEngine::Rendering::Universal::ScreenSpaceAmbientOcclusion::ScreenSpaceAmbientOcclusionPass::ShaderPasses value);
      // static field const value: static public UnityEngine.Rendering.Universal.ScreenSpaceAmbientOcclusion/ScreenSpaceAmbientOcclusionPass/ShaderPasses GaussianAfterOpaque
      static constexpr const int GaussianAfterOpaque = 7;
      // Get static field: static public UnityEngine.Rendering.Universal.ScreenSpaceAmbientOcclusion/ScreenSpaceAmbientOcclusionPass/ShaderPasses GaussianAfterOpaque
      static ::UnityEngine::Rendering::Universal::ScreenSpaceAmbientOcclusion::ScreenSpaceAmbientOcclusionPass::ShaderPasses _get_GaussianAfterOpaque();
      // Set static field: static public UnityEngine.Rendering.Universal.ScreenSpaceAmbientOcclusion/ScreenSpaceAmbientOcclusionPass/ShaderPasses GaussianAfterOpaque
      static void _set_GaussianAfterOpaque(::UnityEngine::Rendering::Universal::ScreenSpaceAmbientOcclusion::ScreenSpaceAmbientOcclusionPass::ShaderPasses value);
      // static field const value: static public UnityEngine.Rendering.Universal.ScreenSpaceAmbientOcclusion/ScreenSpaceAmbientOcclusionPass/ShaderPasses KawaseBlur
      static constexpr const int KawaseBlur = 8;
      // Get static field: static public UnityEngine.Rendering.Universal.ScreenSpaceAmbientOcclusion/ScreenSpaceAmbientOcclusionPass/ShaderPasses KawaseBlur
      static ::UnityEngine::Rendering::Universal::ScreenSpaceAmbientOcclusion::ScreenSpaceAmbientOcclusionPass::ShaderPasses _get_KawaseBlur();
      // Set static field: static public UnityEngine.Rendering.Universal.ScreenSpaceAmbientOcclusion/ScreenSpaceAmbientOcclusionPass/ShaderPasses KawaseBlur
      static void _set_KawaseBlur(::UnityEngine::Rendering::Universal::ScreenSpaceAmbientOcclusion::ScreenSpaceAmbientOcclusionPass::ShaderPasses value);
      // static field const value: static public UnityEngine.Rendering.Universal.ScreenSpaceAmbientOcclusion/ScreenSpaceAmbientOcclusionPass/ShaderPasses KawaseAfterOpaque
      static constexpr const int KawaseAfterOpaque = 9;
      // Get static field: static public UnityEngine.Rendering.Universal.ScreenSpaceAmbientOcclusion/ScreenSpaceAmbientOcclusionPass/ShaderPasses KawaseAfterOpaque
      static ::UnityEngine::Rendering::Universal::ScreenSpaceAmbientOcclusion::ScreenSpaceAmbientOcclusionPass::ShaderPasses _get_KawaseAfterOpaque();
      // Set static field: static public UnityEngine.Rendering.Universal.ScreenSpaceAmbientOcclusion/ScreenSpaceAmbientOcclusionPass/ShaderPasses KawaseAfterOpaque
      static void _set_KawaseAfterOpaque(::UnityEngine::Rendering::Universal::ScreenSpaceAmbientOcclusion::ScreenSpaceAmbientOcclusionPass::ShaderPasses value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.Rendering.Universal.ScreenSpaceAmbientOcclusion/ScreenSpaceAmbientOcclusionPass/ShaderPasses
    #pragma pack(pop)
    static check_size<sizeof(ScreenSpaceAmbientOcclusion::ScreenSpaceAmbientOcclusionPass::ShaderPasses), 0 + sizeof(int)> __UnityEngine_Rendering_Universal_ScreenSpaceAmbientOcclusion_ScreenSpaceAmbientOcclusionPass_ShaderPassesSizeCheck;
    static_assert(sizeof(ScreenSpaceAmbientOcclusion::ScreenSpaceAmbientOcclusionPass::ShaderPasses) == 0x4);
    public:
    // System.String profilerTag
    // Size: 0x8
    // Offset: 0xE0
    ::StringW profilerTag;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean m_SupportsR8RenderTextureFormat
    // Size: 0x1
    // Offset: 0xE8
    bool m_SupportsR8RenderTextureFormat;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Int32 m_BlueNoiseTextureIndex
    // Size: 0x4
    // Offset: 0xEC
    int m_BlueNoiseTextureIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single m_BlurRandomOffsetX
    // Size: 0x4
    // Offset: 0xF0
    float m_BlurRandomOffsetX;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_BlurRandomOffsetY
    // Size: 0x4
    // Offset: 0xF4
    float m_BlurRandomOffsetY;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Material m_Material
    // Size: 0x8
    // Offset: 0xF8
    ::UnityEngine::Material* m_Material;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private UnityEngine.Texture2D[] m_BlueNoiseTextures
    // Size: 0x8
    // Offset: 0x100
    ::ArrayW<::UnityEngine::Texture2D*> m_BlueNoiseTextures;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Texture2D*>) == 0x8);
    // private UnityEngine.Vector4[] m_CameraTopLeftCorner
    // Size: 0x8
    // Offset: 0x108
    ::ArrayW<::UnityEngine::Vector4> m_CameraTopLeftCorner;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector4>) == 0x8);
    // private UnityEngine.Vector4[] m_CameraXExtent
    // Size: 0x8
    // Offset: 0x110
    ::ArrayW<::UnityEngine::Vector4> m_CameraXExtent;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector4>) == 0x8);
    // private UnityEngine.Vector4[] m_CameraYExtent
    // Size: 0x8
    // Offset: 0x118
    ::ArrayW<::UnityEngine::Vector4> m_CameraYExtent;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector4>) == 0x8);
    // private UnityEngine.Vector4[] m_CameraZExtent
    // Size: 0x8
    // Offset: 0x120
    ::ArrayW<::UnityEngine::Vector4> m_CameraZExtent;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector4>) == 0x8);
    // private UnityEngine.Rendering.RTHandle[] m_SSAOTextures
    // Size: 0x8
    // Offset: 0x128
    ::ArrayW<::UnityEngine::Rendering::RTHandle*> m_SSAOTextures;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Rendering::RTHandle*>) == 0x8);
    // private UnityEngine.Rendering.Universal.ScreenSpaceAmbientOcclusion/ScreenSpaceAmbientOcclusionPass/BlurTypes m_BlurType
    // Size: 0x4
    // Offset: 0x130
    ::UnityEngine::Rendering::Universal::ScreenSpaceAmbientOcclusion::ScreenSpaceAmbientOcclusionPass::BlurTypes m_BlurType;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::ScreenSpaceAmbientOcclusion::ScreenSpaceAmbientOcclusionPass::BlurTypes) == 0x4);
    // private UnityEngine.Matrix4x4[] m_CameraViewProjections
    // Size: 0x8
    // Offset: 0x138
    ::ArrayW<::UnityEngine::Matrix4x4> m_CameraViewProjections;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Matrix4x4>) == 0x8);
    // private UnityEngine.Rendering.ProfilingSampler m_ProfilingSampler
    // Size: 0x8
    // Offset: 0x140
    ::UnityEngine::Rendering::ProfilingSampler* m_ProfilingSampler;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::ProfilingSampler*) == 0x8);
    // private UnityEngine.Rendering.Universal.ScriptableRenderer m_Renderer
    // Size: 0x8
    // Offset: 0x148
    ::UnityEngine::Rendering::Universal::ScriptableRenderer* m_Renderer;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::ScriptableRenderer*) == 0x8);
    // private UnityEngine.RenderTextureDescriptor m_AOPassDescriptor
    // Size: 0x34
    // Offset: 0x150
    ::UnityEngine::RenderTextureDescriptor m_AOPassDescriptor;
    // Field size check
    static_assert(sizeof(::UnityEngine::RenderTextureDescriptor) == 0x34);
    // private UnityEngine.Rendering.Universal.ScreenSpaceAmbientOcclusionSettings m_CurrentSettings
    // Size: 0x8
    // Offset: 0x188
    ::UnityEngine::Rendering::Universal::ScreenSpaceAmbientOcclusionSettings* m_CurrentSettings;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::ScreenSpaceAmbientOcclusionSettings*) == 0x8);
    public:
    // static field const value: static private System.Int32 k_FinalTexID
    static constexpr const int k_FinalTexID = 3;
    // Get static field: static private System.Int32 k_FinalTexID
    static int _get_k_FinalTexID();
    // Set static field: static private System.Int32 k_FinalTexID
    static void _set_k_FinalTexID(int value);
    // static field const value: static private System.String k_SSAOTextureName
    static constexpr const char* k_SSAOTextureName = "_ScreenSpaceOcclusionTexture";
    // Get static field: static private System.String k_SSAOTextureName
    static ::StringW _get_k_SSAOTextureName();
    // Set static field: static private System.String k_SSAOTextureName
    static void _set_k_SSAOTextureName(::StringW value);
    // static field const value: static private System.String k_SSAOAmbientOcclusionParamName
