// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.Rendering.AttachmentDescriptor
#include "UnityEngine/Rendering/AttachmentDescriptor.hpp"
// Including type: System.IDisposable
#include "System/IDisposable.hpp"
// Including type: UnityEngine.Hash128
#include "UnityEngine/Hash128.hpp"
// Including type: UnityEngine.Rendering.GraphicsDeviceType
#include "UnityEngine/Rendering/GraphicsDeviceType.hpp"
// Including type: UnityEngine.Rendering.Universal.StoreActionsOptimization
#include "UnityEngine/Rendering/Universal/StoreActionsOptimization.hpp"
// Including type: UnityEngine.Plane
#include "UnityEngine/Plane.hpp"
// Including type: UnityEngine.Vector4
#include "UnityEngine/Vector4.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::Rendering::Universal
namespace UnityEngine::Rendering::Universal {
  // Forward declaring type: DebugHandler
  class DebugHandler;
  // Forward declaring type: ScriptableRenderPass
  class ScriptableRenderPass;
  // Forward declaring type: ScriptableRendererFeature
  class ScriptableRendererFeature;
  // Forward declaring type: CameraData
  struct CameraData;
  // Forward declaring type: RenderingData
  struct RenderingData;
  // Forward declaring type: CameraRenderType
  struct CameraRenderType;
  // Forward declaring type: ScriptableRendererData
  class ScriptableRendererData;
  // Forward declaring type: RenderPassEvent
  struct RenderPassEvent;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine::Rendering
namespace UnityEngine::Rendering {
  // Forward declaring type: ProfilingSampler
  class ProfilingSampler;
  // Forward declaring type: RTHandle
  class RTHandle;
  // Forward declaring type: ClearFlag
  struct ClearFlag;
  // Forward declaring type: ScriptableRenderContext
  struct ScriptableRenderContext;
  // Forward declaring type: CommandBuffer
  class CommandBuffer;
  // Forward declaring type: ScriptableCullingParameters
  struct ScriptableCullingParameters;
  // Forward declaring type: GizmoSubset
  struct GizmoSubset;
  // Skipping declaration: RenderBufferLoadAction because it is already included!
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: RenderTexture
  class RenderTexture;
  // Skipping declaration: Color because it is already included!
  // Forward declaring type: Matrix4x4
  struct Matrix4x4;
  // Skipping declaration: Vector3 because it is already included!
  // Forward declaring type: Camera
  class Camera;
}
// Forward declaring namespace: UnityEngine::Experimental::Rendering::RenderGraphModule
namespace UnityEngine::Experimental::Rendering::RenderGraphModule {
  // Forward declaring type: RenderGraph
  class RenderGraph;
  // Forward declaring type: TextureHandle
  struct TextureHandle;
}
// Completed forward declares
// Type namespace: UnityEngine.Rendering.Universal
namespace UnityEngine::Rendering::Universal {
  // Forward declaring type: ScriptableRenderer
  class ScriptableRenderer;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::Rendering::Universal::ScriptableRenderer);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::Rendering::Universal::ScriptableRenderer*, "UnityEngine.Rendering.Universal", "ScriptableRenderer");
// Type namespace: UnityEngine.Rendering.Universal
namespace UnityEngine::Rendering::Universal {
  // Size: 0x1A8
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.Rendering.Universal.ScriptableRenderer
  // [TokenAttribute] Offset: FFFFFFFF
  class ScriptableRenderer : public ::Il2CppObject/*, public ::System::IDisposable*/ {
    public:
    // Nested type: ::UnityEngine::Rendering::Universal::ScriptableRenderer::Profiling
    class Profiling;
    // Nested type: ::UnityEngine::Rendering::Universal::ScriptableRenderer::RenderPassDescriptor
    struct RenderPassDescriptor;
    // Nested type: ::UnityEngine::Rendering::Universal::ScriptableRenderer::RenderingFeatures
    class RenderingFeatures;
    // Nested type: ::UnityEngine::Rendering::Universal::ScriptableRenderer::RenderPassBlock
    class RenderPassBlock;
    // Nested type: ::UnityEngine::Rendering::Universal::ScriptableRenderer::RTHandleRenderTargetIdentifierCompat
    struct RTHandleRenderTargetIdentifierCompat;
    // Nested type: ::UnityEngine::Rendering::Universal::ScriptableRenderer::VFXProcessCameraPassData
    class VFXProcessCameraPassData;
    // Nested type: ::UnityEngine::Rendering::Universal::ScriptableRenderer::DrawGizmosPassData
    class DrawGizmosPassData;
    // Nested type: ::UnityEngine::Rendering::Universal::ScriptableRenderer::BeginXRPassData
    class BeginXRPassData;
    // Nested type: ::UnityEngine::Rendering::Universal::ScriptableRenderer::EndXRPassData
    class EndXRPassData;
    // Nested type: ::UnityEngine::Rendering::Universal::ScriptableRenderer::PassData
    class PassData;
    // Nested type: ::UnityEngine::Rendering::Universal::ScriptableRenderer::RenderBlocks
    struct RenderBlocks;
    // Nested type: ::UnityEngine::Rendering::Universal::ScriptableRenderer::$$c
    class $$c;
    // Size: 0x2C
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: UnityEngine.Rendering.Universal.ScriptableRenderer/RTHandleRenderTargetIdentifierCompat
    // [TokenAttribute] Offset: FFFFFFFF
    struct RTHandleRenderTargetIdentifierCompat/*, public ::System::ValueType*/ {
      public:
      public:
      // public UnityEngine.Rendering.RTHandle handle
      // Size: 0x8
      // Offset: 0x0
      ::UnityEngine::Rendering::RTHandle* handle;
      // Field size check
      static_assert(sizeof(::UnityEngine::Rendering::RTHandle*) == 0x8);
      // public UnityEngine.Rendering.RenderTargetIdentifier fallback
      // Size: 0x24
      // Offset: 0x8
      ::UnityEngine::Rendering::RenderTargetIdentifier fallback;
      // Field size check
      static_assert(sizeof(::UnityEngine::Rendering::RenderTargetIdentifier) == 0x24);
      public:
      // Creating value type constructor for type: RTHandleRenderTargetIdentifierCompat
      constexpr RTHandleRenderTargetIdentifierCompat(::UnityEngine::Rendering::RTHandle* handle_ = {}, ::UnityEngine::Rendering::RenderTargetIdentifier fallback_ = {}) noexcept : handle{handle_}, fallback{fallback_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public UnityEngine.Rendering.RTHandle handle
      [[deprecated("Use field access instead!")]] ::UnityEngine::Rendering::RTHandle*& dyn_handle();
      // Get instance field reference: public UnityEngine.Rendering.RenderTargetIdentifier fallback
      [[deprecated("Use field access instead!")]] ::UnityEngine::Rendering::RenderTargetIdentifier& dyn_fallback();
      // public System.Boolean get_useRTHandle()
      // Offset: 0x52BB478
      bool get_useRTHandle();
      // public UnityEngine.Rendering.RenderTargetIdentifier get_nameID()
      // Offset: 0x52BB488
      ::UnityEngine::Rendering::RenderTargetIdentifier get_nameID();
    }; // UnityEngine.Rendering.Universal.ScriptableRenderer/RTHandleRenderTargetIdentifierCompat
    #pragma pack(pop)
    static check_size<sizeof(ScriptableRenderer::RTHandleRenderTargetIdentifierCompat), 8 + sizeof(::UnityEngine::Rendering::RenderTargetIdentifier)> __UnityEngine_Rendering_Universal_ScriptableRenderer_RTHandleRenderTargetIdentifierCompatSizeCheck;
    static_assert(sizeof(ScriptableRenderer::RTHandleRenderTargetIdentifierCompat) == 0x2C);
    public:
    // private System.Int32 m_LastBeginSubpassPassIndex
    // Size: 0x4
    // Offset: 0x10
    int m_LastBeginSubpassPassIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: m_LastBeginSubpassPassIndex and: m_MergeableRenderPassesMap
    char __padding0[0x4] = {};
    // private System.Collections.Generic.Dictionary`2<UnityEngine.Hash128,System.Int32[]> m_MergeableRenderPassesMap
    // Size: 0x8
    // Offset: 0x18
    ::System::Collections::Generic::Dictionary_2<::UnityEngine::Hash128, ::ArrayW<int>>* m_MergeableRenderPassesMap;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::UnityEngine::Hash128, ::ArrayW<int>>*) == 0x8);
    // private System.Int32[][] m_MergeableRenderPassesMapArrays
    // Size: 0x8
    // Offset: 0x20
    ::ArrayW<::ArrayW<int>> m_MergeableRenderPassesMapArrays;
    // Field size check
    static_assert(sizeof(::ArrayW<::ArrayW<int>>) == 0x8);
    // private UnityEngine.Hash128[] m_PassIndexToPassHash
    // Size: 0x8
    // Offset: 0x28
    ::ArrayW<::UnityEngine::Hash128> m_PassIndexToPassHash;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Hash128>) == 0x8);
    // private System.Collections.Generic.Dictionary`2<UnityEngine.Hash128,System.Int32> m_RenderPassesAttachmentCount
    // Size: 0x8
    // Offset: 0x30
    ::System::Collections::Generic::Dictionary_2<::UnityEngine::Hash128, int>* m_RenderPassesAttachmentCount;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::UnityEngine::Hash128, int>*) == 0x8);
    // private UnityEngine.Rendering.AttachmentDescriptor[] m_ActiveColorAttachmentDescriptors
    // Size: 0x8
    // Offset: 0x38
    ::ArrayW<::UnityEngine::Rendering::AttachmentDescriptor> m_ActiveColorAttachmentDescriptors;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Rendering::AttachmentDescriptor>) == 0x8);
    // private UnityEngine.Rendering.AttachmentDescriptor m_ActiveDepthAttachmentDescriptor
    // Size: 0x78
    // Offset: 0x40
    ::UnityEngine::Rendering::AttachmentDescriptor m_ActiveDepthAttachmentDescriptor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::AttachmentDescriptor) == 0x78);
    // private System.Boolean[] m_IsActiveColorAttachmentTransient
    // Size: 0x8
    // Offset: 0xB8
    ::ArrayW<bool> m_IsActiveColorAttachmentTransient;
    // Field size check
    static_assert(sizeof(::ArrayW<bool>) == 0x8);
    // UnityEngine.Rendering.RenderBufferStoreAction[] m_FinalColorStoreAction
    // Size: 0x8
    // Offset: 0xC0
    ::ArrayW<::UnityEngine::Rendering::RenderBufferStoreAction> m_FinalColorStoreAction;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Rendering::RenderBufferStoreAction>) == 0x8);
    // UnityEngine.Rendering.RenderBufferStoreAction m_FinalDepthStoreAction
    // Size: 0x4
    // Offset: 0xC8
    ::UnityEngine::Rendering::RenderBufferStoreAction m_FinalDepthStoreAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::RenderBufferStoreAction) == 0x4);
    // Padding between fields: m_FinalDepthStoreAction and: profilingExecute
    char __padding9[0x4] = {};
    // private UnityEngine.Rendering.ProfilingSampler <profilingExecute>k__BackingField
    // Size: 0x8
    // Offset: 0xD0
    ::UnityEngine::Rendering::ProfilingSampler* profilingExecute;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::ProfilingSampler*) == 0x8);
    // System.Boolean hasReleasedRTs
    // Size: 0x1
    // Offset: 0xD8
    bool hasReleasedRTs;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: hasReleasedRTs and: DebugHandler
    char __padding11[0x7] = {};
    // private readonly UnityEngine.Rendering.Universal.DebugHandler <DebugHandler>k__BackingField
    // Size: 0x8
    // Offset: 0xE0
    ::UnityEngine::Rendering::Universal::DebugHandler* DebugHandler;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::DebugHandler*) == 0x8);
    // private UnityEngine.Rendering.Universal.ScriptableRenderer/RenderingFeatures <supportedRenderingFeatures>k__BackingField
    // Size: 0x8
    // Offset: 0xE8
    ::UnityEngine::Rendering::Universal::ScriptableRenderer::RenderingFeatures* supportedRenderingFeatures;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::ScriptableRenderer::RenderingFeatures*) == 0x8);
    // private UnityEngine.Rendering.GraphicsDeviceType[] <unsupportedGraphicsDeviceTypes>k__BackingField
    // Size: 0x8
    // Offset: 0xF0
    ::ArrayW<::UnityEngine::Rendering::GraphicsDeviceType> unsupportedGraphicsDeviceTypes;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Rendering::GraphicsDeviceType>) == 0x8);
    // private UnityEngine.Rendering.Universal.StoreActionsOptimization m_StoreActionsOptimizationSetting
    // Size: 0x4
    // Offset: 0xF8
    ::UnityEngine::Rendering::Universal::StoreActionsOptimization m_StoreActionsOptimizationSetting;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::StoreActionsOptimization) == 0x4);
    // Padding between fields: m_StoreActionsOptimizationSetting and: m_ActiveRenderPassQueue
    char __padding15[0x4] = {};
    // private System.Collections.Generic.List`1<UnityEngine.Rendering.Universal.ScriptableRenderPass> m_ActiveRenderPassQueue
    // Size: 0x8
    // Offset: 0x100
    ::System::Collections::Generic::List_1<::UnityEngine::Rendering::Universal::ScriptableRenderPass*>* m_ActiveRenderPassQueue;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Rendering::Universal::ScriptableRenderPass*>*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.Rendering.Universal.ScriptableRendererFeature> m_RendererFeatures
    // Size: 0x8
    // Offset: 0x108
    ::System::Collections::Generic::List_1<::UnityEngine::Rendering::Universal::ScriptableRendererFeature*>* m_RendererFeatures;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Rendering::Universal::ScriptableRendererFeature*>*) == 0x8);
    // private UnityEngine.Rendering.Universal.ScriptableRenderer/RTHandleRenderTargetIdentifierCompat m_CameraColorTarget
    // Size: 0x2C
    // Offset: 0x110
    ::UnityEngine::Rendering::Universal::ScriptableRenderer::RTHandleRenderTargetIdentifierCompat m_CameraColorTarget;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::ScriptableRenderer::RTHandleRenderTargetIdentifierCompat) == 0x2C);
    // Padding between fields: m_CameraColorTarget and: m_CameraDepthTarget
    char __padding18[0x4] = {};
    // private UnityEngine.Rendering.Universal.ScriptableRenderer/RTHandleRenderTargetIdentifierCompat m_CameraDepthTarget
    // Size: 0x2C
    // Offset: 0x140
    ::UnityEngine::Rendering::Universal::ScriptableRenderer::RTHandleRenderTargetIdentifierCompat m_CameraDepthTarget;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::ScriptableRenderer::RTHandleRenderTargetIdentifierCompat) == 0x2C);
    // Padding between fields: m_CameraDepthTarget and: m_CameraResolveTarget
    char __padding19[0x4] = {};
    // private UnityEngine.Rendering.Universal.ScriptableRenderer/RTHandleRenderTargetIdentifierCompat m_CameraResolveTarget
    // Size: 0x2C
    // Offset: 0x170
    ::UnityEngine::Rendering::Universal::ScriptableRenderer::RTHandleRenderTargetIdentifierCompat m_CameraResolveTarget;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::ScriptableRenderer::RTHandleRenderTargetIdentifierCompat) == 0x2C);
    // Padding between fields: m_CameraResolveTarget and: m_FirstTimeCameraColorTargetIsBound
    char __padding20[0x4] = {};
    // private System.Boolean m_FirstTimeCameraColorTargetIsBound
    // Size: 0x1
    // Offset: 0x1A0
    bool m_FirstTimeCameraColorTargetIsBound;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_FirstTimeCameraDepthTargetIsBound
    // Size: 0x1
    // Offset: 0x1A1
    bool m_FirstTimeCameraDepthTargetIsBound;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_IsPipelineExecuting
    // Size: 0x1
    // Offset: 0x1A2
    bool m_IsPipelineExecuting;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // System.Boolean disableNativeRenderPassInFeatures
    // Size: 0x1
    // Offset: 0x1A3
    bool disableNativeRenderPassInFeatures;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // System.Boolean useRenderPassEnabled
    // Size: 0x1
    // Offset: 0x1A4
    bool useRenderPassEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <useDepthPriming>k__BackingField
    // Size: 0x1
    // Offset: 0x1A5
    bool useDepthPriming;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <stripShadowsOffVariants>k__BackingField
    // Size: 0x1
    // Offset: 0x1A6
    bool stripShadowsOffVariants;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <stripAdditionalLightOffVariants>k__BackingField
    // Size: 0x1
    // Offset: 0x1A7
    bool stripAdditionalLightOffVariants;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating interface conversion operator: operator ::System::IDisposable
    operator ::System::IDisposable() noexcept {
      return *reinterpret_cast<::System::IDisposable*>(this);
    }
    // static field const value: static private System.Int32 kRenderPassMapSize
    static constexpr const int kRenderPassMapSize = 10;
    // Get static field: static private System.Int32 kRenderPassMapSize
    static int _get_kRenderPassMapSize();
    // Set static field: static private System.Int32 kRenderPassMapSize
    static void _set_kRenderPassMapSize(int value);
    // static field const value: static private System.Int32 kRenderPassMaxCount
    static constexpr const int kRenderPassMaxCount = 20;
    // Get static field: static private System.Int32 kRenderPassMaxCount
    static int _get_kRenderPassMaxCount();
