// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.Rendering.Universal.RenderPassEvent
#include "UnityEngine/Rendering/Universal/RenderPassEvent.hpp"
// Including type: UnityEngine.Rendering.RenderBufferStoreAction
#include "UnityEngine/Rendering/RenderBufferStoreAction.hpp"
// Including type: Unity.Collections.NativeArray`1
#include "Unity/Collections/NativeArray_1.hpp"
// Including type: UnityEngine.Experimental.Rendering.GraphicsFormat
#include "UnityEngine/Experimental/Rendering/GraphicsFormat.hpp"
// Including type: UnityEngine.Rendering.RenderTargetIdentifier
#include "UnityEngine/Rendering/RenderTargetIdentifier.hpp"
// Including type: UnityEngine.Rendering.Universal.ScriptableRenderPassInput
#include "UnityEngine/Rendering/Universal/ScriptableRenderPassInput.hpp"
// Including type: UnityEngine.Rendering.ClearFlag
#include "UnityEngine/Rendering/ClearFlag.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: UnityEngine.Rendering.ShaderTagId
#include "UnityEngine/Rendering/ShaderTagId.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::Rendering
namespace UnityEngine::Rendering {
  // Forward declaring type: ProfilingSampler
  class ProfilingSampler;
  // Forward declaring type: RTHandle
  class RTHandle;
  // Forward declaring type: CommandBuffer
  class CommandBuffer;
  // Forward declaring type: ScriptableRenderContext
  struct ScriptableRenderContext;
  // Forward declaring type: DrawingSettings
  struct DrawingSettings;
  // Forward declaring type: SortingCriteria
  struct SortingCriteria;
}
// Forward declaring namespace: UnityEngine::Rendering::Universal
namespace UnityEngine::Rendering::Universal {
  // Forward declaring type: DebugHandler
  class DebugHandler;
  // Forward declaring type: RenderingData
  struct RenderingData;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: RenderTextureDescriptor
  struct RenderTextureDescriptor;
  // Forward declaring type: Material
  class Material;
}
// Forward declaring namespace: UnityEngine::Experimental::Rendering::RenderGraphModule
namespace UnityEngine::Experimental::Rendering::RenderGraphModule {
  // Forward declaring type: RenderGraph
  class RenderGraph;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: UnityEngine.Rendering.Universal
namespace UnityEngine::Rendering::Universal {
  // Forward declaring type: ScriptableRenderPass
  class ScriptableRenderPass;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::Rendering::Universal::ScriptableRenderPass);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::Rendering::Universal::ScriptableRenderPass*, "UnityEngine.Rendering.Universal", "ScriptableRenderPass");
// Type namespace: UnityEngine.Rendering.Universal
namespace UnityEngine::Rendering::Universal {
  // WARNING Size may be invalid!
  // Autogenerated type: UnityEngine.Rendering.Universal.ScriptableRenderPass
  // [TokenAttribute] Offset: FFFFFFFF
  class ScriptableRenderPass : public ::Il2CppObject {
    public:
    public:
    // private UnityEngine.Rendering.Universal.RenderPassEvent <renderPassEvent>k__BackingField
    // Size: 0x4
    // Offset: 0x10
    ::UnityEngine::Rendering::Universal::RenderPassEvent renderPassEvent;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::RenderPassEvent) == 0x4);
    // private UnityEngine.Rendering.RenderBufferStoreAction[] m_ColorStoreActions
    // Size: 0x8
    // Offset: 0x18
    ::ArrayW<::UnityEngine::Rendering::RenderBufferStoreAction> m_ColorStoreActions;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Rendering::RenderBufferStoreAction>) == 0x8);
    // private UnityEngine.Rendering.RenderBufferStoreAction m_DepthStoreAction
    // Size: 0x4
    // Offset: 0x20
    ::UnityEngine::Rendering::RenderBufferStoreAction m_DepthStoreAction;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::RenderBufferStoreAction) == 0x4);
    // private System.Boolean[] m_OverriddenColorStoreActions
    // Size: 0x8
    // Offset: 0x28
    ::ArrayW<bool> m_OverriddenColorStoreActions;
    // Field size check
    static_assert(sizeof(::ArrayW<bool>) == 0x8);
    // private System.Boolean m_OverriddenDepthStoreAction
    // Size: 0x1
    // Offset: 0x30
    bool m_OverriddenDepthStoreAction;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private UnityEngine.Rendering.ProfilingSampler <profilingSampler>k__BackingField
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::Rendering::ProfilingSampler* profilingSampler;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::ProfilingSampler*) == 0x8);
    // private System.Boolean <overrideCameraTarget>k__BackingField
    // Size: 0x1
    // Offset: 0x40
    bool overrideCameraTarget;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <isBlitRenderPass>k__BackingField
    // Size: 0x1
    // Offset: 0x41
    bool isBlitRenderPass;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean <useNativeRenderPass>k__BackingField
    // Size: 0x1
    // Offset: 0x42
    bool useNativeRenderPass;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Int32 <renderPassQueueIndex>k__BackingField
    // Size: 0x4
    // Offset: 0x44
    int renderPassQueueIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Unity.Collections.NativeArray`1<System.Int32> m_ColorAttachmentIndices
    // Size: 0xFFFFFFFF
    // Offset: 0x48
    ::Unity::Collections::NativeArray_1<int> m_ColorAttachmentIndices;
    // Unity.Collections.NativeArray`1<System.Int32> m_InputAttachmentIndices
    // Size: 0xFFFFFFFF
    // Offset: 0x58
    ::Unity::Collections::NativeArray_1<int> m_InputAttachmentIndices;
    // private UnityEngine.Experimental.Rendering.GraphicsFormat[] <renderTargetFormat>k__BackingField
    // Size: 0x8
    // Offset: 0x68
    ::ArrayW<::UnityEngine::Experimental::Rendering::GraphicsFormat> renderTargetFormat;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Experimental::Rendering::GraphicsFormat>) == 0x8);
    // System.Boolean m_UsesRTHandles
    // Size: 0x1
    // Offset: 0x70
    bool m_UsesRTHandles;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private UnityEngine.Rendering.RTHandle[] m_ColorAttachments
    // Size: 0x8
    // Offset: 0x78
    ::ArrayW<::UnityEngine::Rendering::RTHandle*> m_ColorAttachments;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Rendering::RTHandle*>) == 0x8);
    // private UnityEngine.Rendering.RenderTargetIdentifier[] m_ColorAttachmentIds
    // Size: 0x8
    // Offset: 0x80
    ::ArrayW<::UnityEngine::Rendering::RenderTargetIdentifier> m_ColorAttachmentIds;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Rendering::RenderTargetIdentifier>) == 0x8);
    // UnityEngine.Rendering.RTHandle[] m_InputAttachments
    // Size: 0x8
    // Offset: 0x88
    ::ArrayW<::UnityEngine::Rendering::RTHandle*> m_InputAttachments;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Rendering::RTHandle*>) == 0x8);
    // System.Boolean[] m_InputAttachmentIsTransient
    // Size: 0x8
    // Offset: 0x90
    ::ArrayW<bool> m_InputAttachmentIsTransient;
    // Field size check
    static_assert(sizeof(::ArrayW<bool>) == 0x8);
    // private UnityEngine.Rendering.RTHandle m_DepthAttachment
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::Rendering::RTHandle* m_DepthAttachment;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::RTHandle*) == 0x8);
    // private UnityEngine.Rendering.RenderTargetIdentifier m_DepthAttachmentId
    // Size: 0x24
    // Offset: 0xA0
    ::UnityEngine::Rendering::RenderTargetIdentifier m_DepthAttachmentId;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::RenderTargetIdentifier) == 0x24);
    // private UnityEngine.Rendering.Universal.ScriptableRenderPassInput m_Input
    // Size: 0x4
    // Offset: 0xC8
    ::UnityEngine::Rendering::Universal::ScriptableRenderPassInput m_Input;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::ScriptableRenderPassInput) == 0x4);
    // private UnityEngine.Rendering.ClearFlag m_ClearFlag
    // Size: 0x4
    // Offset: 0xCC
    ::UnityEngine::Rendering::ClearFlag m_ClearFlag;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::ClearFlag) == 0x4);
    // private UnityEngine.Color m_ClearColor
    // Size: 0x10
    // Offset: 0xD0
    ::UnityEngine::Color m_ClearColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    public:
    // Get static field: static public UnityEngine.Rendering.RTHandle k_CameraTarget
    static ::UnityEngine::Rendering::RTHandle* _get_k_CameraTarget();
    // Set static field: static public UnityEngine.Rendering.RTHandle k_CameraTarget
    static void _set_k_CameraTarget(::UnityEngine::Rendering::RTHandle* value);
    // Get instance field reference: private UnityEngine.Rendering.Universal.RenderPassEvent <renderPassEvent>k__BackingField
    [[deprecated("Use field access instead!")]] ::UnityEngine::Rendering::Universal::RenderPassEvent& dyn_$renderPassEvent$k__BackingField();
    // Get instance field reference: private UnityEngine.Rendering.RenderBufferStoreAction[] m_ColorStoreActions
    [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::Rendering::RenderBufferStoreAction>& dyn_m_ColorStoreActions();
