// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.Rendering.Universal.ShadowCasterGroup2D
#include "UnityEngine/Rendering/Universal/ShadowCasterGroup2D.hpp"
// Including type: UnityEngine.ISerializationCallbackReceiver
#include "UnityEngine/ISerializationCallbackReceiver.hpp"
// Including type: UnityEngine.Bounds
#include "UnityEngine/Bounds.hpp"
// Including type: UnityEngine.BoundingSphere
#include "UnityEngine/BoundingSphere.hpp"
// Including type: UnityEngine.Matrix4x4
#include "UnityEngine/Matrix4x4.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Mesh
  class Mesh;
}
// Forward declaring namespace: UnityEngine::Rendering::Universal
namespace UnityEngine::Rendering::Universal {
  // Forward declaring type: Light2D
  class Light2D;
}
// Completed forward declares
// Type namespace: UnityEngine.Rendering.Universal
namespace UnityEngine::Rendering::Universal {
  // Forward declaring type: ShadowCaster2D
  class ShadowCaster2D;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::Rendering::Universal::ShadowCaster2D);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::Rendering::Universal::ShadowCaster2D*, "UnityEngine.Rendering.Universal", "ShadowCaster2D");
// Type namespace: UnityEngine.Rendering.Universal
namespace UnityEngine::Rendering::Universal {
  // Size: 0x18C
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.Rendering.Universal.ShadowCaster2D
  // [TokenAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: FFFFFFFF
  // [DisallowMultipleComponent] Offset: FFFFFFFF
  // [ExecuteInEditMode] Offset: FFFFFFFF
  // [MovedFromAttribute] Offset: FFFFFFFF
  class ShadowCaster2D : public ::UnityEngine::Rendering::Universal::ShadowCasterGroup2D/*, public ::UnityEngine::ISerializationCallbackReceiver*/ {
    public:
    // Nested type: ::UnityEngine::Rendering::Universal::ShadowCaster2D::ComponentVersions
    struct ComponentVersions;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: UnityEngine.Rendering.Universal.ShadowCaster2D/ComponentVersions
    // [TokenAttribute] Offset: FFFFFFFF
    struct ComponentVersions/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: ComponentVersions
      constexpr ComponentVersions(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public UnityEngine.Rendering.Universal.ShadowCaster2D/ComponentVersions Version_Unserialized
      static constexpr const int Version_Unserialized = 0;
      // Get static field: static public UnityEngine.Rendering.Universal.ShadowCaster2D/ComponentVersions Version_Unserialized
      static ::UnityEngine::Rendering::Universal::ShadowCaster2D::ComponentVersions _get_Version_Unserialized();
      // Set static field: static public UnityEngine.Rendering.Universal.ShadowCaster2D/ComponentVersions Version_Unserialized
      static void _set_Version_Unserialized(::UnityEngine::Rendering::Universal::ShadowCaster2D::ComponentVersions value);
      // static field const value: static public UnityEngine.Rendering.Universal.ShadowCaster2D/ComponentVersions Version_1
      static constexpr const int Version_1 = 1;
      // Get static field: static public UnityEngine.Rendering.Universal.ShadowCaster2D/ComponentVersions Version_1
      static ::UnityEngine::Rendering::Universal::ShadowCaster2D::ComponentVersions _get_Version_1();
      // Set static field: static public UnityEngine.Rendering.Universal.ShadowCaster2D/ComponentVersions Version_1
      static void _set_Version_1(::UnityEngine::Rendering::Universal::ShadowCaster2D::ComponentVersions value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // UnityEngine.Rendering.Universal.ShadowCaster2D/ComponentVersions
    #pragma pack(pop)
    static check_size<sizeof(ShadowCaster2D::ComponentVersions), 0 + sizeof(int)> __UnityEngine_Rendering_Universal_ShadowCaster2D_ComponentVersionsSizeCheck;
    static_assert(sizeof(ShadowCaster2D::ComponentVersions) == 0x4);
    public:
    // private UnityEngine.Rendering.Universal.ShadowCaster2D/ComponentVersions m_ComponentVersion
    // Size: 0x4
    // Offset: 0x30
    ::UnityEngine::Rendering::Universal::ShadowCaster2D::ComponentVersions m_ComponentVersion;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::ShadowCaster2D::ComponentVersions) == 0x4);
    // private System.Boolean m_HasRenderer
    // Size: 0x1
    // Offset: 0x34
    bool m_HasRenderer;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_UseRendererSilhouette
    // Size: 0x1
    // Offset: 0x35
    bool m_UseRendererSilhouette;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_CastsShadows
    // Size: 0x1
    // Offset: 0x36
    bool m_CastsShadows;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_SelfShadows
    // Size: 0x1
    // Offset: 0x37
    bool m_SelfShadows;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Int32[] m_ApplyToSortingLayers
    // Size: 0x8
    // Offset: 0x38
    ::ArrayW<int> m_ApplyToSortingLayers;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // private UnityEngine.Vector3[] m_ShapePath
    // Size: 0x8
    // Offset: 0x40
    ::ArrayW<::UnityEngine::Vector3> m_ShapePath;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector3>) == 0x8);
    // private System.Int32 m_ShapePathHash
    // Size: 0x4
    // Offset: 0x48
    int m_ShapePathHash;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: m_ShapePathHash and: m_Mesh
    char __padding7[0x4] = {};
    // private UnityEngine.Mesh m_Mesh
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::Mesh* m_Mesh;
    // Field size check
    static_assert(sizeof(::UnityEngine::Mesh*) == 0x8);
    // private System.Int32 m_InstanceId
    // Size: 0x4
    // Offset: 0x58
    int m_InstanceId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: m_InstanceId and: m_ShadowCasterGroup
    char __padding9[0x4] = {};
    // UnityEngine.Rendering.Universal.ShadowCasterGroup2D m_ShadowCasterGroup
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::Rendering::Universal::ShadowCasterGroup2D* m_ShadowCasterGroup;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::ShadowCasterGroup2D*) == 0x8);
    // UnityEngine.Rendering.Universal.ShadowCasterGroup2D m_PreviousShadowCasterGroup
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::Rendering::Universal::ShadowCasterGroup2D* m_PreviousShadowCasterGroup;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::ShadowCasterGroup2D*) == 0x8);
    // UnityEngine.Bounds m_LocalBounds
    // Size: 0x18
    // Offset: 0x70
    ::UnityEngine::Bounds m_LocalBounds;
    // Field size check
    static_assert(sizeof(::UnityEngine::Bounds) == 0x18);
    // UnityEngine.BoundingSphere m_BoundingSphere
    // Size: 0x10
    // Offset: 0x88
    ::UnityEngine::BoundingSphere m_BoundingSphere;
    // Field size check
    static_assert(sizeof(::UnityEngine::BoundingSphere) == 0x10);
    // private System.Int32 m_PreviousShadowGroup
    // Size: 0x4
    // Offset: 0x98
    int m_PreviousShadowGroup;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean m_PreviousCastsShadows
    // Size: 0x1
    // Offset: 0x9C
    bool m_PreviousCastsShadows;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_PreviousCastsShadows and: m_PreviousPathHash
    char __padding15[0x3] = {};
    // private System.Int32 m_PreviousPathHash
    // Size: 0x4
    // Offset: 0xA0
    int m_PreviousPathHash;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // UnityEngine.Vector3 m_CachedPosition
    // Size: 0xC
    // Offset: 0xA4
    ::UnityEngine::Vector3 m_CachedPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // UnityEngine.Vector3 m_CachedLossyScale
    // Size: 0xC
    // Offset: 0xB0
    ::UnityEngine::Vector3 m_CachedLossyScale;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // UnityEngine.Quaternion m_CachedRotation
    // Size: 0x10
    // Offset: 0xBC
    ::UnityEngine::Quaternion m_CachedRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // UnityEngine.Matrix4x4 m_CachedShadowMatrix
    // Size: 0x40
    // Offset: 0xCC
    ::UnityEngine::Matrix4x4 m_CachedShadowMatrix;
    // Field size check
    static_assert(sizeof(::UnityEngine::Matrix4x4) == 0x40);
    // UnityEngine.Matrix4x4 m_CachedInverseShadowMatrix
    // Size: 0x40
    // Offset: 0x10C
    ::UnityEngine::Matrix4x4 m_CachedInverseShadowMatrix;
    // Field size check
    static_assert(sizeof(::UnityEngine::Matrix4x4) == 0x40);
    // UnityEngine.Matrix4x4 m_CachedLocalToWorldMatrix
    // Size: 0x40
    // Offset: 0x14C
    ::UnityEngine::Matrix4x4 m_CachedLocalToWorldMatrix;
    // Field size check
    static_assert(sizeof(::UnityEngine::Matrix4x4) == 0x40);
    public:
    // Creating interface conversion operator: operator ::UnityEngine::ISerializationCallbackReceiver
    operator ::UnityEngine::ISerializationCallbackReceiver() noexcept {
      return *reinterpret_cast<::UnityEngine::ISerializationCallbackReceiver*>(this);
    }
    // static field const value: static private UnityEngine.Rendering.Universal.ShadowCaster2D/ComponentVersions k_CurrentComponentVersion
    static constexpr const int k_CurrentComponentVersion = 1;
    // Get static field: static private UnityEngine.Rendering.Universal.ShadowCaster2D/ComponentVersions k_CurrentComponentVersion
    static ::UnityEngine::Rendering::Universal::ShadowCaster2D::ComponentVersions _get_k_CurrentComponentVersion();
