// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: Unity.Jobs.IJobFor
#include "Unity/Jobs/IJobFor.hpp"
// Including type: Unity.Collections.NativeArray`1
#include "Unity/Collections/NativeArray_1.hpp"
// Including type: UnityEngine.Rendering.VisibleLight
#include "UnityEngine/Rendering/VisibleLight.hpp"
// Including type: UnityEngine.Rendering.VisibleReflectionProbe
#include "UnityEngine/Rendering/VisibleReflectionProbe.hpp"
// Including type: UnityEngine.Rendering.Universal.InclusiveRange
#include "UnityEngine/Rendering/Universal/InclusiveRange.hpp"
// Including type: UnityEngine.Rendering.Universal.Fixed2`1
#include "UnityEngine/Rendering/Universal/Fixed2_1.hpp"
// Including type: Unity.Mathematics.float4x4
#include "Unity/Mathematics/float4x4.hpp"
// Including type: Unity.Mathematics.float2
#include "Unity/Mathematics/float2.hpp"
// Including type: Unity.Mathematics.int2
#include "Unity/Mathematics/int2.hpp"
// Including type: Unity.Mathematics.float3
#include "Unity/Mathematics/float3.hpp"
// Including type: Unity.Mathematics.int4
#include "Unity/Mathematics/int4.hpp"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::Rendering::Universal
namespace UnityEngine::Rendering::Universal {
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: ValueTuple`2<T1, T2>
  template<typename T1, typename T2>
  struct ValueTuple_2;
}
// Completed forward declares
// Type namespace: UnityEngine.Rendering.Universal
namespace UnityEngine::Rendering::Universal {
  // Forward declaring type: TilingJob
  struct TilingJob;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::Rendering::Universal::TilingJob, "UnityEngine.Rendering.Universal", "TilingJob");
// Type namespace: UnityEngine.Rendering.Universal
namespace UnityEngine::Rendering::Universal {
  // WARNING Size may be invalid!
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: UnityEngine.Rendering.Universal.TilingJob
  // [TokenAttribute] Offset: FFFFFFFF
  // [BurstCompileAttribute] Offset: FFFFFFFF
  struct TilingJob/*, public ::System::ValueType, public ::Unity::Jobs::IJobFor*/ {
    public:
    // Nested type: ::UnityEngine::Rendering::Universal::TilingJob::$$c__DisplayClass19_0
    struct $$c__DisplayClass19_0;
    // Nested type: ::UnityEngine::Rendering::Universal::TilingJob::$$c__DisplayClass20_0
    struct $$c__DisplayClass20_0;
    public:
    // public Unity.Collections.NativeArray`1<UnityEngine.Rendering.VisibleLight> lights
    // Size: 0xFFFFFFFF
    // Offset: 0x0
    ::Unity::Collections::NativeArray_1<::UnityEngine::Rendering::VisibleLight> lights;
    // public Unity.Collections.NativeArray`1<UnityEngine.Rendering.VisibleReflectionProbe> reflectionProbes
    // Size: 0xFFFFFFFF
    // Offset: 0x10
    ::Unity::Collections::NativeArray_1<::UnityEngine::Rendering::VisibleReflectionProbe> reflectionProbes;
    // public Unity.Collections.NativeArray`1<UnityEngine.Rendering.Universal.InclusiveRange> tileRanges
    // Size: 0xFFFFFFFF
    // Offset: 0x20
    ::Unity::Collections::NativeArray_1<::UnityEngine::Rendering::Universal::InclusiveRange> tileRanges;
    // public System.Int32 itemsPerTile
    // Size: 0x4
    // Offset: 0x30
    int itemsPerTile;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 rangesPerItem
    // Size: 0x4
    // Offset: 0x34
    int rangesPerItem;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public UnityEngine.Rendering.Universal.Fixed2`1<Unity.Mathematics.float4x4> worldToViews
    // Size: 0xFFFFFFFF
    // Offset: 0x38
    ::UnityEngine::Rendering::Universal::Fixed2_1<::Unity::Mathematics::float4x4> worldToViews;
    // public Unity.Mathematics.float4 centerOffset
    // Size: 0x10
    // Offset: 0xB8
    ::Unity::Mathematics::float4 centerOffset;
    // Field size check
    static_assert(sizeof(::Unity::Mathematics::float4) == 0x10);
    // public Unity.Mathematics.float2 tileScale
    // Size: 0x8
    // Offset: 0xC8
    ::Unity::Mathematics::float2 tileScale;
    // Field size check
    static_assert(sizeof(::Unity::Mathematics::float2) == 0x8);
    // public Unity.Mathematics.float2 tileScaleInv
    // Size: 0x8
    // Offset: 0xD0
    ::Unity::Mathematics::float2 tileScaleInv;
    // Field size check
    static_assert(sizeof(::Unity::Mathematics::float2) == 0x8);
    // public UnityEngine.Rendering.Universal.Fixed2`1<Unity.Mathematics.float2> viewPlaneHalfSizes
    // Size: 0xFFFFFFFF
    // Offset: 0xD8
    ::UnityEngine::Rendering::Universal::Fixed2_1<::Unity::Mathematics::float2> viewPlaneHalfSizes;
    // public UnityEngine.Rendering.Universal.Fixed2`1<Unity.Mathematics.float2> viewPlaneHalfSizeInvs
    // Size: 0xFFFFFFFF
    // Offset: 0xE8
    ::UnityEngine::Rendering::Universal::Fixed2_1<::Unity::Mathematics::float2> viewPlaneHalfSizeInvs;
    // public Unity.Mathematics.int2 tileCount
    // Size: 0x8
    // Offset: 0xF8
    ::Unity::Mathematics::int2 tileCount;
    // Field size check
    static_assert(sizeof(::Unity::Mathematics::int2) == 0x8);
    // public System.Single near
    // Size: 0x4
    // Offset: 0x100
    float near;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean isOrthographic
    // Size: 0x1
    // Offset: 0x104
    bool isOrthographic;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private UnityEngine.Rendering.Universal.InclusiveRange m_TileYRange
    // Size: 0x4
    // Offset: 0x106
    ::UnityEngine::Rendering::Universal::InclusiveRange m_TileYRange;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::InclusiveRange) == 0x4);
    // private System.Int32 m_Offset
    // Size: 0x4
    // Offset: 0x10C
    int m_Offset;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_ViewIndex
    // Size: 0x4
    // Offset: 0x110
    int m_ViewIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private Unity.Mathematics.float2 m_CenterOffset
    // Size: 0x8
    // Offset: 0x114
    ::Unity::Mathematics::float2 m_CenterOffset;
    // Field size check
    static_assert(sizeof(::Unity::Mathematics::float2) == 0x8);
    public:
    // Creating value type constructor for type: TilingJob
