// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.Rendering.Universal.ScriptableRenderer
#include "UnityEngine/Rendering/Universal/ScriptableRenderer.hpp"
// Including type: UnityEngine.Rendering.Universal.RenderingMode
#include "UnityEngine/Rendering/Universal/RenderingMode.hpp"
// Including type: UnityEngine.Rendering.Universal.DepthPrimingMode
#include "UnityEngine/Rendering/Universal/DepthPrimingMode.hpp"
// Including type: UnityEngine.Rendering.Universal.CopyDepthMode
#include "UnityEngine/Rendering/Universal/CopyDepthMode.hpp"
// Including type: UnityEngine.Rendering.StencilState
#include "UnityEngine/Rendering/StencilState.hpp"
// Including type: UnityEngine.Rendering.Universal.IntermediateTextureMode
#include "UnityEngine/Rendering/Universal/IntermediateTextureMode.hpp"
// Including type: UnityEngine.Rendering.Universal.PostProcessPasses
#include "UnityEngine/Rendering/Universal/PostProcessPasses.hpp"
// Including type: UnityEngine.Rendering.ShaderTagId
#include "UnityEngine/Rendering/ShaderTagId.hpp"
// Including type: UnityEngine.Experimental.Rendering.RenderGraphModule.TextureHandle
#include "UnityEngine/Experimental/Rendering/RenderGraphModule/TextureHandle.hpp"

  // Forward declaring type: DepthOnlyPass
  class DepthOnlyPass;
  // Forward declaring type: DepthNormalOnlyPass
  class DepthNormalOnlyPass;
  // Forward declaring type: CopyDepthPass
  class CopyDepthPass;
  // Forward declaring type: MainLightShadowCasterPass
  class MainLightShadowCasterPass;
  // Forward declaring type: AdditionalLightsShadowCasterPass
  class AdditionalLightsShadowCasterPass;
  // Forward declaring type: GBufferPass
  class GBufferPass;
  // Forward declaring type: DeferredPass
  class DeferredPass;
  // Forward declaring type: DrawObjectsPass
  class DrawObjectsPass;
  // Forward declaring type: DrawObjectsWithRenderingLayersPass
  class DrawObjectsWithRenderingLayersPass;
  // Forward declaring type: CopyColorPass
  class CopyColorPass;
  // Forward declaring type: FinalBlitPass
  class FinalBlitPass;
  // Forward declaring type: RenderTargetBufferSystem
  class RenderTargetBufferSystem;
  // Forward declaring type: ForwardLights
  class ForwardLights;
  // Forward declaring type: DeferredLights
  class DeferredLights;
  // Forward declaring type: ColorGradingLutPass
  class ColorGradingLutPass;
}
// Forward declaring namespace: UnityEngine::Rendering
namespace UnityEngine::Rendering {
  // Forward declaring type: RTHandle
  class RTHandle;
  // Forward declaring type: ScriptableRenderContext
  struct ScriptableRenderContext;
  // Forward declaring type: CommandBuffer
  class CommandBuffer;
  // Forward declaring type: ScriptableCullingParameters
  struct ScriptableCullingParameters;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: RenderTextureDescriptor
  struct RenderTextureDescriptor;
  // Forward declaring type: FilterMode
  struct FilterMode;
  // Forward declaring type: TextureWrapMode
  struct TextureWrapMode;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine::Experimental::Rendering::RenderGraphModule
namespace UnityEngine::Experimental::Rendering::RenderGraphModule {
  // Forward declaring type: RenderGraph
  class RenderGraph;
}
// Completed forward declares
// Type namespace: UnityEngine.Rendering.Universal
namespace UnityEngine::Rendering::Universal {
  // Forward declaring type: UniversalRenderer
  class UniversalRenderer;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::Rendering::Universal::UniversalRenderer);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::Rendering::Universal::UniversalRenderer*, "UnityEngine.Rendering.Universal", "UniversalRenderer");
// Type namespace: UnityEngine.Rendering.Universal
namespace UnityEngine::Rendering::Universal {
  // Size: 0x398
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.Rendering.Universal.UniversalRenderer
  // [TokenAttribute] Offset: FFFFFFFF
  class UniversalRenderer : public ::UnityEngine::Rendering::Universal::ScriptableRenderer {
    public:
    // Nested type: ::UnityEngine::Rendering::Universal::UniversalRenderer::Profiling
    class Profiling;
    // Nested type: ::UnityEngine::Rendering::Universal::UniversalRenderer::RenderPassInputSummary
    struct RenderPassInputSummary;
    // Nested type: ::UnityEngine::Rendering::Universal::UniversalRenderer::RenderGraphFrameResources
    class RenderGraphFrameResources;
    // Nested type: ::UnityEngine::Rendering::Universal::UniversalRenderer::$$c
    class $$c;
    public:
    // private System.Boolean m_Clustering
    // Size: 0x1
    // Offset: 0x1A8
    bool m_Clustering;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_Clustering and: m_DepthPrepass
    char __padding0[0x7] = {};
    // private UnityEngine.Rendering.Universal.Internal.DepthOnlyPass m_DepthPrepass
    // Size: 0x8
    // Offset: 0x1B0
    ::UnityEngine::Rendering::Universal::Internal::DepthOnlyPass* m_DepthPrepass;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::Internal::DepthOnlyPass*) == 0x8);
    // private UnityEngine.Rendering.Universal.Internal.DepthNormalOnlyPass m_DepthNormalPrepass
    // Size: 0x8
    // Offset: 0x1B8
    ::UnityEngine::Rendering::Universal::Internal::DepthNormalOnlyPass* m_DepthNormalPrepass;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::Internal::DepthNormalOnlyPass*) == 0x8);
    // private UnityEngine.Rendering.Universal.Internal.CopyDepthPass m_PrimedDepthCopyPass
    // Size: 0x8
    // Offset: 0x1C0
    ::UnityEngine::Rendering::Universal::Internal::CopyDepthPass* m_PrimedDepthCopyPass;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::Internal::CopyDepthPass*) == 0x8);
    // private UnityEngine.Rendering.Universal.MotionVectorRenderPass m_MotionVectorPass
    // Size: 0x8
    // Offset: 0x1C8
    ::UnityEngine::Rendering::Universal::MotionVectorRenderPass* m_MotionVectorPass;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::MotionVectorRenderPass*) == 0x8);
    // private UnityEngine.Rendering.Universal.Internal.MainLightShadowCasterPass m_MainLightShadowCasterPass
    // Size: 0x8
    // Offset: 0x1D0
    ::UnityEngine::Rendering::Universal::Internal::MainLightShadowCasterPass* m_MainLightShadowCasterPass;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::Internal::MainLightShadowCasterPass*) == 0x8);
    // private UnityEngine.Rendering.Universal.Internal.AdditionalLightsShadowCasterPass m_AdditionalLightsShadowCasterPass
    // Size: 0x8
    // Offset: 0x1D8
    ::UnityEngine::Rendering::Universal::Internal::AdditionalLightsShadowCasterPass* m_AdditionalLightsShadowCasterPass;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::Internal::AdditionalLightsShadowCasterPass*) == 0x8);
    // private UnityEngine.Rendering.Universal.Internal.GBufferPass m_GBufferPass
    // Size: 0x8
    // Offset: 0x1E0
    ::UnityEngine::Rendering::Universal::Internal::GBufferPass* m_GBufferPass;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::Internal::GBufferPass*) == 0x8);
    // private UnityEngine.Rendering.Universal.Internal.CopyDepthPass m_GBufferCopyDepthPass
    // Size: 0x8
    // Offset: 0x1E8
    ::UnityEngine::Rendering::Universal::Internal::CopyDepthPass* m_GBufferCopyDepthPass;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::Internal::CopyDepthPass*) == 0x8);
    // private UnityEngine.Rendering.Universal.Internal.DeferredPass m_DeferredPass
    // Size: 0x8
    // Offset: 0x1F0
    ::UnityEngine::Rendering::Universal::Internal::DeferredPass* m_DeferredPass;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::Internal::DeferredPass*) == 0x8);
    // private UnityEngine.Rendering.Universal.Internal.DrawObjectsPass m_RenderOpaqueForwardOnlyPass
    // Size: 0x8
    // Offset: 0x1F8
    ::UnityEngine::Rendering::Universal::Internal::DrawObjectsPass* m_RenderOpaqueForwardOnlyPass;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::Internal::DrawObjectsPass*) == 0x8);
    // private UnityEngine.Rendering.Universal.Internal.DrawObjectsPass m_RenderOpaqueForwardPass
    // Size: 0x8
    // Offset: 0x200
    ::UnityEngine::Rendering::Universal::Internal::DrawObjectsPass* m_RenderOpaqueForwardPass;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::Internal::DrawObjectsPass*) == 0x8);
    // private UnityEngine.Rendering.Universal.Internal.DrawObjectsWithRenderingLayersPass m_RenderOpaqueForwardWithRenderingLayersPass
    // Size: 0x8
    // Offset: 0x208
    ::UnityEngine::Rendering::Universal::Internal::DrawObjectsWithRenderingLayersPass* m_RenderOpaqueForwardWithRenderingLayersPass;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::Internal::DrawObjectsWithRenderingLayersPass*) == 0x8);
    // private UnityEngine.Rendering.Universal.DrawSkyboxPass m_DrawSkyboxPass
    // Size: 0x8
    // Offset: 0x210
    ::UnityEngine::Rendering::Universal::DrawSkyboxPass* m_DrawSkyboxPass;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::DrawSkyboxPass*) == 0x8);
    // private UnityEngine.Rendering.Universal.Internal.CopyDepthPass m_CopyDepthPass
    // Size: 0x8
    // Offset: 0x218
    ::UnityEngine::Rendering::Universal::Internal::CopyDepthPass* m_CopyDepthPass;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::Internal::CopyDepthPass*) == 0x8);
    // private UnityEngine.Rendering.Universal.Internal.CopyColorPass m_CopyColorPass
    // Size: 0x8
    // Offset: 0x220
    ::UnityEngine::Rendering::Universal::Internal::CopyColorPass* m_CopyColorPass;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::Internal::CopyColorPass*) == 0x8);
    // private UnityEngine.Rendering.Universal.TransparentSettingsPass m_TransparentSettingsPass
    // Size: 0x8
    // Offset: 0x228
    ::UnityEngine::Rendering::Universal::TransparentSettingsPass* m_TransparentSettingsPass;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::TransparentSettingsPass*) == 0x8);
    // private UnityEngine.Rendering.Universal.Internal.DrawObjectsPass m_RenderTransparentForwardPass
    // Size: 0x8
    // Offset: 0x230
    ::UnityEngine::Rendering::Universal::Internal::DrawObjectsPass* m_RenderTransparentForwardPass;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::Internal::DrawObjectsPass*) == 0x8);
    // private UnityEngine.Rendering.Universal.InvokeOnRenderObjectCallbackPass m_OnRenderObjectCallbackPass
    // Size: 0x8
    // Offset: 0x238
    ::UnityEngine::Rendering::Universal::InvokeOnRenderObjectCallbackPass* m_OnRenderObjectCallbackPass;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::InvokeOnRenderObjectCallbackPass*) == 0x8);
    // private UnityEngine.Rendering.Universal.Internal.FinalBlitPass m_FinalBlitPass
    // Size: 0x8
    // Offset: 0x240
    ::UnityEngine::Rendering::Universal::Internal::FinalBlitPass* m_FinalBlitPass;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::Internal::FinalBlitPass*) == 0x8);
    // private UnityEngine.Rendering.Universal.CapturePass m_CapturePass
    // Size: 0x8
    // Offset: 0x248
    ::UnityEngine::Rendering::Universal::CapturePass* m_CapturePass;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::CapturePass*) == 0x8);
    // private UnityEngine.Rendering.Universal.XROcclusionMeshPass m_XROcclusionMeshPass
    // Size: 0x8
    // Offset: 0x250
    ::UnityEngine::Rendering::Universal::XROcclusionMeshPass* m_XROcclusionMeshPass;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::XROcclusionMeshPass*) == 0x8);
    // private UnityEngine.Rendering.Universal.Internal.CopyDepthPass m_XRCopyDepthPass
    // Size: 0x8
    // Offset: 0x258
    ::UnityEngine::Rendering::Universal::Internal::CopyDepthPass* m_XRCopyDepthPass;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::Internal::CopyDepthPass*) == 0x8);
    // private UnityEngine.Rendering.Universal.DrawScreenSpaceUIPass m_DrawOffscreenUIPass
    // Size: 0x8
    // Offset: 0x260
    ::UnityEngine::Rendering::Universal::DrawScreenSpaceUIPass* m_DrawOffscreenUIPass;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::DrawScreenSpaceUIPass*) == 0x8);
    // private UnityEngine.Rendering.Universal.DrawScreenSpaceUIPass m_DrawOverlayUIPass
    // Size: 0x8
    // Offset: 0x268
    ::UnityEngine::Rendering::Universal::DrawScreenSpaceUIPass* m_DrawOverlayUIPass;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::DrawScreenSpaceUIPass*) == 0x8);
    // UnityEngine.Rendering.Universal.Internal.RenderTargetBufferSystem m_ColorBufferSystem
    // Size: 0x8
    // Offset: 0x270
    ::UnityEngine::Rendering::Universal::Internal::RenderTargetBufferSystem* m_ColorBufferSystem;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::Internal::RenderTargetBufferSystem*) == 0x8);
    // UnityEngine.Rendering.RTHandle m_ActiveCameraColorAttachment
    // Size: 0x8
    // Offset: 0x278
    ::UnityEngine::Rendering::RTHandle* m_ActiveCameraColorAttachment;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::RTHandle*) == 0x8);
    // private UnityEngine.Rendering.RTHandle m_ColorFrontBuffer
    // Size: 0x8
    // Offset: 0x280
    ::UnityEngine::Rendering::RTHandle* m_ColorFrontBuffer;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::RTHandle*) == 0x8);
    // UnityEngine.Rendering.RTHandle m_ActiveCameraDepthAttachment
    // Size: 0x8
    // Offset: 0x288
    ::UnityEngine::Rendering::RTHandle* m_ActiveCameraDepthAttachment;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::RTHandle*) == 0x8);
    // UnityEngine.Rendering.RTHandle m_CameraDepthAttachment
    // Size: 0x8
    // Offset: 0x290
    ::UnityEngine::Rendering::RTHandle* m_CameraDepthAttachment;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::RTHandle*) == 0x8);
    // private UnityEngine.Rendering.RTHandle m_XRTargetHandleAlias
    // Size: 0x8
    // Offset: 0x298
    ::UnityEngine::Rendering::RTHandle* m_XRTargetHandleAlias;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::RTHandle*) == 0x8);
    // UnityEngine.Rendering.RTHandle m_DepthTexture
    // Size: 0x8
    // Offset: 0x2A0
    ::UnityEngine::Rendering::RTHandle* m_DepthTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::RTHandle*) == 0x8);
    // private UnityEngine.Rendering.RTHandle m_NormalsTexture
    // Size: 0x8
    // Offset: 0x2A8
    ::UnityEngine::Rendering::RTHandle* m_NormalsTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::RTHandle*) == 0x8);
    // private UnityEngine.Rendering.RTHandle m_DecalLayersTexture
    // Size: 0x8
    // Offset: 0x2B0
    ::UnityEngine::Rendering::RTHandle* m_DecalLayersTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::RTHandle*) == 0x8);
    // private UnityEngine.Rendering.RTHandle m_OpaqueColor
    // Size: 0x8
    // Offset: 0x2B8
    ::UnityEngine::Rendering::RTHandle* m_OpaqueColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::RTHandle*) == 0x8);
    // private UnityEngine.Rendering.RTHandle m_MotionVectorColor
    // Size: 0x8
    // Offset: 0x2C0
    ::UnityEngine::Rendering::RTHandle* m_MotionVectorColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::RTHandle*) == 0x8);
    // private UnityEngine.Rendering.RTHandle m_MotionVectorDepth
    // Size: 0x8
    // Offset: 0x2C8
    ::UnityEngine::Rendering::RTHandle* m_MotionVectorDepth;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::RTHandle*) == 0x8);
    // private UnityEngine.Rendering.Universal.Internal.ForwardLights m_ForwardLights
    // Size: 0x8
    // Offset: 0x2D0
    ::UnityEngine::Rendering::Universal::Internal::ForwardLights* m_ForwardLights;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::Internal::ForwardLights*) == 0x8);
    // private UnityEngine.Rendering.Universal.Internal.DeferredLights m_DeferredLights
    // Size: 0x8
    // Offset: 0x2D8
    ::UnityEngine::Rendering::Universal::Internal::DeferredLights* m_DeferredLights;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::Internal::DeferredLights*) == 0x8);
    // private UnityEngine.Rendering.Universal.RenderingMode m_RenderingMode
    // Size: 0x4
    // Offset: 0x2E0
    ::UnityEngine::Rendering::Universal::RenderingMode m_RenderingMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::RenderingMode) == 0x4);
    // private UnityEngine.Rendering.Universal.DepthPrimingMode m_DepthPrimingMode
    // Size: 0x4
    // Offset: 0x2E4
    ::UnityEngine::Rendering::Universal::DepthPrimingMode m_DepthPrimingMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::DepthPrimingMode) == 0x4);
    // private UnityEngine.Rendering.Universal.CopyDepthMode m_CopyDepthMode
    // Size: 0x4
    // Offset: 0x2E8
    ::UnityEngine::Rendering::Universal::CopyDepthMode m_CopyDepthMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::CopyDepthMode) == 0x4);
    // private System.Boolean m_DepthPrimingRecommended
    // Size: 0x1
    // Offset: 0x2EC
    bool m_DepthPrimingRecommended;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private UnityEngine.Rendering.StencilState m_DefaultStencilState
    // Size: 0xC
    // Offset: 0x2ED
    ::UnityEngine::Rendering::StencilState m_DefaultStencilState;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::StencilState) == 0xC);
    // Padding between fields: m_DefaultStencilState and: m_LightCookieManager
    char __padding43[0x7] = {};
    // private UnityEngine.Rendering.Universal.LightCookieManager m_LightCookieManager
    // Size: 0x8
    // Offset: 0x300
    ::UnityEngine::Rendering::Universal::LightCookieManager* m_LightCookieManager;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::LightCookieManager*) == 0x8);
    // private UnityEngine.Rendering.Universal.IntermediateTextureMode m_IntermediateTextureMode
    // Size: 0x4
    // Offset: 0x308
    ::UnityEngine::Rendering::Universal::IntermediateTextureMode m_IntermediateTextureMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::IntermediateTextureMode) == 0x4);
    // Padding between fields: m_IntermediateTextureMode and: m_BlitMaterial
    char __padding45[0x4] = {};
    // private UnityEngine.Material m_BlitMaterial
    // Size: 0x8
    // Offset: 0x310
    ::UnityEngine::Material* m_BlitMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private UnityEngine.Material m_BlitHDRMaterial
    // Size: 0x8
    // Offset: 0x318
    ::UnityEngine::Material* m_BlitHDRMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private UnityEngine.Material m_CopyDepthMaterial
    // Size: 0x8
    // Offset: 0x320
    ::UnityEngine::Material* m_CopyDepthMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private UnityEngine.Material m_SamplingMaterial
    // Size: 0x8
    // Offset: 0x328
    ::UnityEngine::Material* m_SamplingMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private UnityEngine.Material m_StencilDeferredMaterial
    // Size: 0x8
    // Offset: 0x330
    ::UnityEngine::Material* m_StencilDeferredMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private UnityEngine.Material m_CameraMotionVecMaterial
    // Size: 0x8
    // Offset: 0x338
    ::UnityEngine::Material* m_CameraMotionVecMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private UnityEngine.Material m_ObjectMotionVecMaterial
    // Size: 0x8
    // Offset: 0x340
    ::UnityEngine::Material* m_ObjectMotionVecMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private UnityEngine.Rendering.Universal.PostProcessPasses m_PostProcessPasses
    // Size: 0x40
    // Offset: 0x348
    ::UnityEngine::Rendering::Universal::PostProcessPasses m_PostProcessPasses;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::PostProcessPasses) == 0x40);
    // System.Boolean m_TargetIsBackbuffer
    // Size: 0x1
    // Offset: 0x388
    bool m_TargetIsBackbuffer;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_TargetIsBackbuffer and: frameResources
    char __padding54[0x7] = {};
    // UnityEngine.Rendering.Universal.UniversalRenderer/RenderGraphFrameResources frameResources
    // Size: 0x8
    // Offset: 0x390
    ::UnityEngine::Rendering::Universal::UniversalRenderer::RenderGraphFrameResources* frameResources;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::Universal::UniversalRenderer::RenderGraphFrameResources*) == 0x8);
    public:
    // static field const value: static private UnityEngine.Experimental.Rendering.GraphicsFormat k_DepthStencilFormat
    static constexpr const int k_DepthStencilFormat = 92;
    // Get static field: static private UnityEngine.Experimental.Rendering.GraphicsFormat k_DepthStencilFormat
    static ::UnityEngine::Experimental::Rendering::GraphicsFormat _get_k_DepthStencilFormat();
    // Set static field: static private UnityEngine.Experimental.Rendering.GraphicsFormat k_DepthStencilFormat
    static void _set_k_DepthStencilFormat(::UnityEngine::Experimental::Rendering::GraphicsFormat value);
    // static field const value: static private System.Int32 k_DepthBufferBits
