// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.DateTime
#include "System/DateTime.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: GorillaNetworking.Store
namespace GorillaNetworking::Store {
  // Forward declaring type: StoreUpdateEvent
  class StoreUpdateEvent;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GorillaNetworking::Store::StoreUpdateEvent);
DEFINE_IL2CPP_ARG_TYPE(::GorillaNetworking::Store::StoreUpdateEvent*, "GorillaNetworking.Store", "StoreUpdateEvent");
// Type namespace: GorillaNetworking.Store
namespace GorillaNetworking::Store {
  // Size: 0x30
  #pragma pack(push, 1)
  // Autogenerated type: GorillaNetworking.Store.StoreUpdateEvent
  // [TokenAttribute] Offset: FFFFFFFF
  class StoreUpdateEvent : public ::Il2CppObject {
    public:
    public:
    // public System.String PedestalID
    // Size: 0x8
    // Offset: 0x10
    ::StringW PedestalID;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String ItemName
    // Size: 0x8
    // Offset: 0x18
    ::StringW ItemName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.DateTime StartTimeUTC
    // Size: 0x8
    // Offset: 0x20
    ::System::DateTime StartTimeUTC;
    // Field size check
    static_assert(sizeof(::System::DateTime) == 0x8);
    // public System.DateTime EndTimeUTC
    // Size: 0x8
    // Offset: 0x28
    ::System::DateTime EndTimeUTC;
    // Field size check
    static_assert(sizeof(::System::DateTime) == 0x8);
    public:
    // Get instance field reference: public System.String PedestalID
    [[deprecated("Use field access instead!")]] ::StringW& dyn_PedestalID();
    // Get instance field reference: public System.String ItemName
    [[deprecated("Use field access instead!")]] ::StringW& dyn_ItemName();
    // Get instance field reference: public System.DateTime StartTimeUTC
    [[deprecated("Use field access instead!")]] ::System::DateTime& dyn_StartTimeUTC();
    // Get instance field reference: public System.DateTime EndTimeUTC
    [[deprecated("Use field access instead!")]] ::System::DateTime& dyn_EndTimeUTC();
    // public System.Void .ctor()
    // Offset: 0x2867124
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static StoreUpdateEvent* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::GorillaNetworking::Store::StoreUpdateEvent::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<StoreUpdateEvent*, creationType>()));
    }
    // public System.Void .ctor(System.String pedestalID, System.String itemName, System.DateTime startTimeUTC, System.DateTime endTimeUTC)
    // Offset: 0x286712C
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static StoreUpdateEvent* New_ctor(::StringW pedestalID, ::StringW itemName, ::System::DateTime startTimeUTC, ::System::DateTime endTimeUTC) {
      static auto ___internal__logger = ::Logger::get().WithContext("::GorillaNetworking::Store::StoreUpdateEvent::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<StoreUpdateEvent*, creationType>(pedestalID, itemName, startTimeUTC, endTimeUTC)));
    }
    // static public System.String SerializeAsJSon(GorillaNetworking.Store.StoreUpdateEvent storeEvent)
    // Offset: 0x2867188
    static ::StringW SerializeAsJSon(::GorillaNetworking::Store::StoreUpdateEvent* storeEvent);
    // static public System.String SerializeArrayAsJSon(GorillaNetworking.Store.StoreUpdateEvent[] storeEvents)
    // Offset: 0x2867190
    static ::StringW SerializeArrayAsJSon(::ArrayW<::GorillaNetworking::Store::StoreUpdateEvent*> storeEvents);
    // static public GorillaNetworking.Store.StoreUpdateEvent DeserializeFromJSon(System.String json)
    // Offset: 0x28671E8
    static ::GorillaNetworking::Store::StoreUpdateEvent* DeserializeFromJSon(::StringW json);
    // static public GorillaNetworking.Store.StoreUpdateEvent[] DeserializeFromJSonArray(System.String json)
    // Offset: 0x2867230
    static ::ArrayW<::GorillaNetworking::Store::StoreUpdateEvent*> DeserializeFromJSonArray(::StringW json);
    // static public System.Collections.Generic.List`1<GorillaNetworking.Store.StoreUpdateEvent> DeserializeFromJSonList(System.String json)
    // Offset: 0x2867304
    static ::System::Collections::Generic::List_1<::GorillaNetworking::Store::StoreUpdateEvent*>* DeserializeFromJSonList(::StringW json);
  }; // GorillaNetworking.Store.StoreUpdateEvent
  #pragma pack(pop)
  static check_size<sizeof(StoreUpdateEvent), 40 + sizeof(::System::DateTime)> __GorillaNetworking_Store_StoreUpdateEventSizeCheck;
  static_assert(sizeof(StoreUpdateEvent) == 0x30);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: GorillaNetworking::Store::StoreUpdateEvent::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: GorillaNetworking::Store::StoreUpdateEvent::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: GorillaNetworking::Store::StoreUpdateEvent::SerializeAsJSon
// Il2CppName: SerializeAsJSon
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::StringW (*)(::GorillaNetworking::Store::StoreUpdateEvent*)>(&GorillaNetworking::Store::StoreUpdateEvent::SerializeAsJSon)> {
  static const MethodInfo* get() {
    static auto* storeEvent = &::il2cpp_utils::GetClassFromName("GorillaNetworking.Store", "StoreUpdateEvent")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(GorillaNetworking::Store::StoreUpdateEvent*), "SerializeAsJSon", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{storeEvent});
  }
};
// Writing MetadataGetter for method: GorillaNetworking::Store::StoreUpdateEvent::SerializeArrayAsJSon
// Il2CppName: SerializeArrayAsJSon
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::StringW (*)(::ArrayW<::GorillaNetworking::Store::StoreUpdateEvent*>)>(&GorillaNetworking::Store::StoreUpdateEvent::SerializeArrayAsJSon)> {
  static const MethodInfo* get() {
    static auto* storeEvents = &il2cpp_functions::array_class_get(::il2cpp_utils::GetClassFromName("GorillaNetworking.Store", "StoreUpdateEvent"), 1)->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(GorillaNetworking::Store::StoreUpdateEvent*), "SerializeArrayAsJSon", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{storeEvents});
  }
};
// Writing MetadataGetter for method: GorillaNetworking::Store::StoreUpdateEvent::DeserializeFromJSon
// Il2CppName: DeserializeFromJSon
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::GorillaNetworking::Store::StoreUpdateEvent* (*)(::StringW)>(&GorillaNetworking::Store::StoreUpdateEvent::DeserializeFromJSon)> {
  static const MethodInfo* get() {
    static auto* json = &::il2cpp_utils::GetClassFromName("System", "String")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(GorillaNetworking::Store::StoreUpdateEvent*), "DeserializeFromJSon", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{json});
  }
};
// Writing MetadataGetter for method: GorillaNetworking::Store::StoreUpdateEvent::DeserializeFromJSonArray
// Il2CppName: DeserializeFromJSonArray
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::ArrayW<::GorillaNetworking::Store::StoreUpdateEvent*> (*)(::StringW)>(&GorillaNetworking::Store::StoreUpdateEvent::DeserializeFromJSonArray)> {
  static const MethodInfo* get() {
    static auto* json = &::il2cpp_utils::GetClassFromName("System", "String")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(GorillaNetworking::Store::StoreUpdateEvent*), "DeserializeFromJSonArray", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{json});
  }
};
// Writing MetadataGetter for method: GorillaNetworking::Store::StoreUpdateEvent::DeserializeFromJSonList
// Il2CppName: DeserializeFromJSonList
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::System::Collections::Generic::List_1<::GorillaNetworking::Store::StoreUpdateEvent*>* (*)(::StringW)>(&GorillaNetworking::Store::StoreUpdateEvent::DeserializeFromJSonList)> {
  static const MethodInfo* get() {
    static auto* json = &::il2cpp_utils::GetClassFromName("System", "String")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(GorillaNetworking::Store::StoreUpdateEvent*), "DeserializeFromJSonList", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{json});
  }
};
