// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Photon.Pun.MonoBehaviourPunCallbacks
#include "Photon/Pun/MonoBehaviourPunCallbacks.hpp"
// Including type: System.DateTime
#include "System/DateTime.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GorillaNetworking::Store
namespace GorillaNetworking::Store {
  // Forward declaring type: StoreUpdateEvent
  class StoreUpdateEvent;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: FXP
namespace FXP {
  // Forward declaring type: CosmeticItemPrefab
  class CosmeticItemPrefab;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Coroutine
  class Coroutine;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: GorillaNetworking.Store
namespace GorillaNetworking::Store {
  // Forward declaring type: StoreUpdater
  class StoreUpdater;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GorillaNetworking::Store::StoreUpdater);
DEFINE_IL2CPP_ARG_TYPE(::GorillaNetworking::Store::StoreUpdater*, "GorillaNetworking.Store", "StoreUpdater");
// Type namespace: GorillaNetworking.Store
namespace GorillaNetworking::Store {
  // Size: 0x62
  #pragma pack(push, 1)
  // Autogenerated type: GorillaNetworking.Store.StoreUpdater
  // [TokenAttribute] Offset: FFFFFFFF
  class StoreUpdater : public ::Photon::Pun::MonoBehaviourPunCallbacks {
    public:
    // Nested type: ::GorillaNetworking::Store::StoreUpdater::$$c
    class $$c;
    // Nested type: ::GorillaNetworking::Store::StoreUpdater::$HandleClearCart$d__22
    class $HandleClearCart$d__22;
    // Nested type: ::GorillaNetworking::Store::StoreUpdater::$HandlePedestalUpdate$d__21
    class $HandlePedestalUpdate$d__21;
    // Nested type: ::GorillaNetworking::Store::StoreUpdater::$InitializeTitleData$d__27
    class $InitializeTitleData$d__27;
    public:
    // private System.DateTime StoreItemsChangeTimeUTC
    // Size: 0x8
    // Offset: 0x28
    ::System::DateTime StoreItemsChangeTimeUTC;
    // Field size check
    static_assert(sizeof(::System::DateTime) == 0x8);
    // private System.Boolean bRecievedStoreChangeTimeUTC
    // Size: 0x1
    // Offset: 0x30
    bool bRecievedStoreChangeTimeUTC;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean bStoreTimeOffsetSet
    // Size: 0x1
    // Offset: 0x31
    bool bStoreTimeOffsetSet;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: bStoreTimeOffsetSet and: cosmeticItemPrefabsDictionary
    char __padding2[0x6] = {};
    // private System.Collections.Generic.Dictionary`2<System.String,FXP.CosmeticItemPrefab> cosmeticItemPrefabsDictionary
    // Size: 0x8
    // Offset: 0x38
    ::System::Collections::Generic::Dictionary_2<::StringW, ::FXP::CosmeticItemPrefab*>* cosmeticItemPrefabsDictionary;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, ::FXP::CosmeticItemPrefab*>*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.String,System.Collections.Generic.List`1<GorillaNetworking.Store.StoreUpdateEvent>> pedestalUpdateEvents
    // Size: 0x8
    // Offset: 0x40
    ::System::Collections::Generic::Dictionary_2<::StringW, ::System::Collections::Generic::List_1<::GorillaNetworking::Store::StoreUpdateEvent*>*>* pedestalUpdateEvents;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, ::System::Collections::Generic::List_1<::GorillaNetworking::Store::StoreUpdateEvent*>*>*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.String,UnityEngine.Coroutine> pedestalUpdateCoroutines
    // Size: 0x8
    // Offset: 0x48
    ::System::Collections::Generic::Dictionary_2<::StringW, ::UnityEngine::Coroutine*>* pedestalUpdateCoroutines;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, ::UnityEngine::Coroutine*>*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.String,UnityEngine.Coroutine> pedestalClearCartCoroutines
    // Size: 0x8
    // Offset: 0x50
    ::System::Collections::Generic::Dictionary_2<::StringW, ::UnityEngine::Coroutine*>* pedestalClearCartCoroutines;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, ::UnityEngine::Coroutine*>*) == 0x8);
    // private System.String tempJson
    // Size: 0x8
    // Offset: 0x58
    ::StringW tempJson;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean bLoadFromJSON
    // Size: 0x1
    // Offset: 0x60
    bool bLoadFromJSON;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean bUsePlaceHolderJSON
    // Size: 0x1
    // Offset: 0x61
    bool bUsePlaceHolderJSON;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get static field: static public GorillaNetworking.Store.StoreUpdater instance
    static ::GorillaNetworking::Store::StoreUpdater* _get_instance();
    // Set static field: static public GorillaNetworking.Store.StoreUpdater instance
    static void _set_instance(::GorillaNetworking::Store::StoreUpdater* value);
    // Get instance field reference: private System.DateTime StoreItemsChangeTimeUTC
    [[deprecated("Use field access instead!")]] ::System::DateTime& dyn_StoreItemsChangeTimeUTC();
    // Get instance field reference: private System.Boolean bRecievedStoreChangeTimeUTC
    [[deprecated("Use field access instead!")]] bool& dyn_bRecievedStoreChangeTimeUTC();
    // Get instance field reference: private System.Boolean bStoreTimeOffsetSet
    [[deprecated("Use field access instead!")]] bool& dyn_bStoreTimeOffsetSet();
