// Autogenerated from CppHeaderCreator
// Custom Codegen for GORILLA TAG by chcoal
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: GorillaNetworking.CosmeticsController
#include "GorillaNetworking/CosmeticsController.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: GorillaNetworking::Store
namespace GorillaNetworking::Store {
  // Forward declaring type: BundleStand
  class BundleStand;
  // Forward declaring type: StoreBundleData
  class StoreBundleData;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Sprite
  class Sprite;
}
// Forward declaring namespace: PlayFab
namespace PlayFab {
  // Forward declaring type: PlayFabError
  class PlayFabError;
}
// Completed forward declares
// Type namespace: GorillaNetworking.Store
namespace GorillaNetworking::Store {
  // Forward declaring type: StoreBundle
  class StoreBundle;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GorillaNetworking::Store::StoreBundle);
DEFINE_IL2CPP_ARG_TYPE(::GorillaNetworking::Store::StoreBundle*, "GorillaNetworking.Store", "StoreBundle");
// Type namespace: GorillaNetworking.Store
namespace GorillaNetworking::Store {
  // Size: 0x48
  #pragma pack(push, 1)
  // Autogenerated type: GorillaNetworking.Store.StoreBundle
  // [TokenAttribute] Offset: FFFFFFFF
  class StoreBundle : public ::Il2CppObject {
    public:
    public:
    // public System.String purchaseButtonStringFormat
    // Size: 0x8
    // Offset: 0x10
    ::StringW purchaseButtonStringFormat;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Collections.Generic.List`1<GorillaNetworking.Store.BundleStand> bundleStands
    // Size: 0x8
    // Offset: 0x18
    ::System::Collections::Generic::List_1<::GorillaNetworking::Store::BundleStand*>* bundleStands;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GorillaNetworking::Store::BundleStand*>*) == 0x8);
    // public System.Boolean isOwned
    // Size: 0x1
    // Offset: 0x20
    bool isOwned;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isOwned and: price
    char __padding2[0x7] = {};
    // public System.String price
    // Size: 0x8
    // Offset: 0x28
    ::StringW price;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String _bundleName
    // Size: 0x8
    // Offset: 0x30
    ::StringW bundleName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String purchaseButtonText
    // Size: 0x8
    // Offset: 0x38
    ::StringW purchaseButtonText;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private GorillaNetworking.Store.StoreBundleData _storeBundleDataReference
    // Size: 0x8
    // Offset: 0x40
    ::GorillaNetworking::Store::StoreBundleData* storeBundleDataReference;
    // Field size check
    static_assert(sizeof(::GorillaNetworking::Store::StoreBundleData*) == 0x8);
    public:
    // Get instance field reference: public System.String purchaseButtonStringFormat
    [[deprecated("Use field access instead!")]] ::StringW& dyn_purchaseButtonStringFormat();
    // Get instance field reference: public System.Collections.Generic.List`1<GorillaNetworking.Store.BundleStand> bundleStands
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::GorillaNetworking::Store::BundleStand*>*& dyn_bundleStands();
    // Get instance field reference: public System.Boolean isOwned
    [[deprecated("Use field access instead!")]] bool& dyn_isOwned();
    // Get instance field reference: public System.String price
    [[deprecated("Use field access instead!")]] ::StringW& dyn_price();
    // Get instance field reference: private System.String _bundleName
    [[deprecated("Use field access instead!")]] ::StringW& dyn__bundleName();
    // Get instance field reference: public System.String purchaseButtonText
    [[deprecated("Use field access instead!")]] ::StringW& dyn_purchaseButtonText();
    // Get instance field reference: private GorillaNetworking.Store.StoreBundleData _storeBundleDataReference
    [[deprecated("Use field access instead!")]] ::GorillaNetworking::Store::StoreBundleData*& dyn__storeBundleDataReference();
    // public System.String get_playfabBundleID()
    // Offset: 0x2863078
    ::StringW get_playfabBundleID();
    // public System.String get_bundleSKU()
    // Offset: 0x28631A4
    ::StringW get_bundleSKU();
    // public UnityEngine.Sprite get_bundleImage()
    // Offset: 0x2866734
    ::UnityEngine::Sprite* get_bundleImage();
    // public System.String get_bundleName()
    // Offset: 0x2866750
    ::StringW get_bundleName();
    // public System.String get_bundleDescriptionText()
    // Offset: 0x2866954
    ::StringW get_bundleDescriptionText();
    // public System.Void .ctor()
    // Offset: 0x2866970
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static StoreBundle* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::GorillaNetworking::Store::StoreBundle::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<StoreBundle*, creationType>()));
    }
    // public System.Void .ctor(GorillaNetworking.Store.StoreBundleData data)
    // Offset: 0x2863094
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static StoreBundle* New_ctor(::GorillaNetworking::Store::StoreBundleData* data) {
      static auto ___internal__logger = ::Logger::get().WithContext("::GorillaNetworking::Store::StoreBundle::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<StoreBundle*, creationType>(data)));
    }
    // public System.Void UpdateBundleData()
    // Offset: 0x2866A6C
    void UpdateBundleData();
    // public System.Void InitializebundleStands()
    // Offset: 0x2861858
    void InitializebundleStands();
    // public System.Void UpdatePriceFromTitleData()
    // Offset: 0x28631C0
    void UpdatePriceFromTitleData();
    // public System.Void FailedToUpdatePrice(PlayFab.PlayFabError error)
    // Offset: 0x2866A70
    void FailedToUpdatePrice(::PlayFab::PlayFabError* error);
    // public System.Void UpdatePurchaseButtonText()
    // Offset: 0x28637F4
    void UpdatePurchaseButtonText();
    // public System.Void ValidateBundleData()
    // Offset: 0x2861D28
    void ValidateBundleData();
    // private System.Boolean <get_bundleName>b__12_0(GorillaNetworking.CosmeticsController/CosmeticItem x)
    // Offset: 0x2866B34
    bool $get_bundleName$b__12_0(::GorillaNetworking::CosmeticsController::CosmeticItem x);
  }; // GorillaNetworking.Store.StoreBundle
  #pragma pack(pop)
  static check_size<sizeof(StoreBundle), 64 + sizeof(::GorillaNetworking::Store::StoreBundleData*)> __GorillaNetworking_Store_StoreBundleSizeCheck;
  static_assert(sizeof(StoreBundle) == 0x48);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: GorillaNetworking::Store::StoreBundle::get_playfabBundleID
// Il2CppName: get_playfabBundleID
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::StringW (GorillaNetworking::Store::StoreBundle::*)()>(&GorillaNetworking::Store::StoreBundle::get_playfabBundleID)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GorillaNetworking::Store::StoreBundle*), "get_playfabBundleID", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GorillaNetworking::Store::StoreBundle::get_bundleSKU
// Il2CppName: get_bundleSKU
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::StringW (GorillaNetworking::Store::StoreBundle::*)()>(&GorillaNetworking::Store::StoreBundle::get_bundleSKU)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GorillaNetworking::Store::StoreBundle*), "get_bundleSKU", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GorillaNetworking::Store::StoreBundle::get_bundleImage
// Il2CppName: get_bundleImage
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::Sprite* (GorillaNetworking::Store::StoreBundle::*)()>(&GorillaNetworking::Store::StoreBundle::get_bundleImage)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GorillaNetworking::Store::StoreBundle*), "get_bundleImage", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GorillaNetworking::Store::StoreBundle::get_bundleName
// Il2CppName: get_bundleName
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::StringW (GorillaNetworking::Store::StoreBundle::*)()>(&GorillaNetworking::Store::StoreBundle::get_bundleName)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GorillaNetworking::Store::StoreBundle*), "get_bundleName", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GorillaNetworking::Store::StoreBundle::get_bundleDescriptionText
// Il2CppName: get_bundleDescriptionText
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::StringW (GorillaNetworking::Store::StoreBundle::*)()>(&GorillaNetworking::Store::StoreBundle::get_bundleDescriptionText)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GorillaNetworking::Store::StoreBundle*), "get_bundleDescriptionText", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GorillaNetworking::Store::StoreBundle::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: GorillaNetworking::Store::StoreBundle::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: GorillaNetworking::Store::StoreBundle::UpdateBundleData
// Il2CppName: UpdateBundleData
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GorillaNetworking::Store::StoreBundle::*)()>(&GorillaNetworking::Store::StoreBundle::UpdateBundleData)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GorillaNetworking::Store::StoreBundle*), "UpdateBundleData", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GorillaNetworking::Store::StoreBundle::InitializebundleStands
// Il2CppName: InitializebundleStands
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GorillaNetworking::Store::StoreBundle::*)()>(&GorillaNetworking::Store::StoreBundle::InitializebundleStands)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GorillaNetworking::Store::StoreBundle*), "InitializebundleStands", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GorillaNetworking::Store::StoreBundle::UpdatePriceFromTitleData
// Il2CppName: UpdatePriceFromTitleData
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GorillaNetworking::Store::StoreBundle::*)()>(&GorillaNetworking::Store::StoreBundle::UpdatePriceFromTitleData)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GorillaNetworking::Store::StoreBundle*), "UpdatePriceFromTitleData", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GorillaNetworking::Store::StoreBundle::FailedToUpdatePrice
// Il2CppName: FailedToUpdatePrice
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GorillaNetworking::Store::StoreBundle::*)(::PlayFab::PlayFabError*)>(&GorillaNetworking::Store::StoreBundle::FailedToUpdatePrice)> {
  static const MethodInfo* get() {
    static auto* error = &::il2cpp_utils::GetClassFromName("PlayFab", "PlayFabError")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(GorillaNetworking::Store::StoreBundle*), "FailedToUpdatePrice", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{error});
  }
};
// Writing MetadataGetter for method: GorillaNetworking::Store::StoreBundle::UpdatePurchaseButtonText
// Il2CppName: UpdatePurchaseButtonText
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GorillaNetworking::Store::StoreBundle::*)()>(&GorillaNetworking::Store::StoreBundle::UpdatePurchaseButtonText)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GorillaNetworking::Store::StoreBundle*), "UpdatePurchaseButtonText", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GorillaNetworking::Store::StoreBundle::ValidateBundleData
// Il2CppName: ValidateBundleData
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (GorillaNetworking::Store::StoreBundle::*)()>(&GorillaNetworking::Store::StoreBundle::ValidateBundleData)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(GorillaNetworking::Store::StoreBundle*), "ValidateBundleData", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: GorillaNetworking::Store::StoreBundle::$get_bundleName$b__12_0
// Il2CppName: <get_bundleName>b__12_0
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (GorillaNetworking::Store::StoreBundle::*)(::GorillaNetworking::CosmeticsController::CosmeticItem)>(&GorillaNetworking::Store::StoreBundle::$get_bundleName$b__12_0)> {
  static const MethodInfo* get() {
    static auto* x = &::il2cpp_utils::GetClassFromName("GorillaNetworking", "CosmeticsController/CosmeticItem")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(GorillaNetworking::Store::StoreBundle*), "<get_bundleName>b__12_0", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{x});
  }
};
